{"doc_id": "0", "name": "2006_08_humanities_student_major_0_reddit_com", "namespace": "we1sv2.0", "metapath": "", "pub": "reddit.com", "title": "2006-08-humanities-student-major_0_reddit.com.txt", "pub_date": "2006-08-01T00:00:00Z", "Sentiment": "0.054", "Subjectivity": "0.315", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "1248", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cbw9w", "Reddit_id": "cbxz7", "Subreddit_id": "t5_6", "Commenter": "headfake", "length": "7212", "content_scrubbed": "Ideas for replacing it? Yeah, I'll bite.\n\n1. More academics and people in the business world expressing the notion that a degree is a *means* to an end, not an end itself. If you want to be a doctor, you'd best get a degree. If you want to be a musician, maybe not. Not to idolize him any more than he already is on this site, but I think Paul Graham is a great example of this -- it would be better if there were more people out there advocating for different career tracks besides entrepreneurs and programrs. Not all careers need to be taught in the classroom, and it[.] laughable to think that they should all take the same number of years to learn.\n\n2. Make it easier to opt in and out of the education system, learn at different paces, and fight the stigma of being in the educational system later in life. There should be a minimum amount of time that kids spend on education (like the minimum hours for a full schedule in college), and it shouldn't all have to be in school. If they want to take an apprenticeship, that should count, and it should be accountable, and hopefully accredited.\n\n3. More classes in school that prepare kids for what they'll have to do in real life. (I'm sorry, but the \"liberal_arts makes you well-rounded\" stuff is crap, and this is coming from a liberal_arts major. If liberal_arts is great 'cause it teaches critical thinking skills, teach critical thinking skills. If it teaches lessons on morality and the human condition, why not friggin' take ethics and throw some law stuff in there to boot?) Teach financial management. Help kids start businesses, for god[.] sake. Have them compete in play stock markets.\n\n4. FUCKING RAISE TEACHERS' SALARIES. SMART, TALENTED TEACHERS SHOULD WANT TO WORK IN ACADEMIA, NOT HAVE TO SACRIFICE THEIR FUTURES AND THEIR CHILDREN'S FUTURES ON ALTRUISM.\n\n5. Elementary school should be for teaching basic skills: reading, writing, using computers (nowadays), research, working in groups, problem-solving. \n\n6. High school should be for deciding on your career path, it should be flexible, and it should last as long as it fucking has to. If you don't know what you want to do in college, you shouldn't have to waste thousands of dollars a year on what essentially amounts to more high school. It should also prepare you for real life -- apprenticeships and financial management classes, etc, as above. I shouldn't have had to figure out taxes by getting thrown in at the deep end on my first job. Or taking interviews.\n\n7. Colleges and universities should be for acquiring specialized knowledge and finishing out any secondary career paths. There should be no generalized curricula, no across-the-board requirements. Of course there should be support here and at all levels for those who want to broaden their horizons, but there[.] no fucking way that as a Computer Science major I should have to risk my GPA on an English class I want to take, nor should it be required if it doesn't have the slightest bit of fucking relevance to my job.\n\n8. Standards at every level of elementary school and high school, better individual tracking of students, and targeted instruction where it[.] needed. Get rid of 'grades' entirely. Segment classes by skill, move kids through quicker or slower based on individual test performance, and include a reasonable mix of talents at every level. Make it clear that being better or worse at one subject or another is not a stigma. Concentration on identifying and encouraging talents and helping kids to develop the minimum of skills that they need to function in society (grammar, basic math), no matter how long it takes. Most of this stuff can be learned by almost everybody, and it[.] sad that many college students can't spell properly or form complete sentences.\n\n9. Safe psychological spaces for students. Give them places to aggregate that are largely self-policed and where adults can only intervene if there is a clear danger. For me in high school, this was debate. It could also be sports, chess club, drama. Outdoor schools. Businesses. It could just be hanging out. But somewhere that they know they're not being spied on all the time. Kids are going to sneak out to get out from under the all-watching eye of adults, it just gives adults psychological security 'cause they don't know about it; better to just give them a place to go so that they don't have to. It would be safer for them and it would remove a lot of the stigma of compulsory rebellion that leads to things like teenage drinking.\n\n10. Join kids together on a national level, through competitive associations and through the internet. In debate, we travelled nationally and there was a well-known community of kids competing from coast to coast. You knew those who were the best, and at least recognized many more. We posted on message boards, went to camps together, and argued about a whole range of topics. I still know many of these people, some of whom I've never met. Many kids go to small schools and need to be connected with the wider world.\n\n11. Dismantle completely the current standardized-test regime and the corrupt textbook and curricula development machine. These parts of the educational system are an absolute sham, and it[.] very well-documented.\n\n12. An acknowledgment that children are real people. High school students get treated like robots. It[.] horrific. Most adults don't even realize when they're talking down to kids, and it[.] infuriating. It[.] like they're talking to someone who[.] mentally handicapped or something. Adults need to get over the notion that just because they're older they have 'wisdom' and kids can't understand it. Most every adult I know is still no more mature than many of the kids I know -- they're just better at hiding it. All the adults I knew growing up get high and do stupid shit romantically and get depressed and gossip and backstab and drink too much. They've just created this Santa Claus myth with kids that 'maturity' means they've moved past all that. Bullshit. The only difference is that adults are more moderate, have less to prove, are better at avoiding consequences, and have less energy and time to do stupid shit. It[.] pride and it[.] crap.\n\n13. On that note, we need a reasonable definition of 'maturity.' Maturity is when you can do the boring shit like keeping your apartment clean and pay your bills. It means doing the maintenance stuff that keeps you from living like a college student, and recognizing that life is mostly a lot of silly stuff that adds up to a manageable and enjoyable experience. Procrastinating is easy, but it[.] a lot harder in the long_term.\n\n14. Besides grades, less arbitrary divisions in general. We had them in the past because we needed rubrics, but smart people should be able to come up with specific tests for aptitude. Voting should be based on an ability to understand civics, and that should be tied to driving. Or holding down a job should be tied to driving. The testing regime should measure kids' ability to be responsible members of society, not assume that they're responsible because they've reached a certain age.\n\nThat[.] the top of my head. I might post more here if I come up with anything. Is that a good start?"}