{"doc_id": "1", "name": "2006_08_humanities_student_major_2_reddit_com", "namespace": "we1sv2.0", "metapath": "", "pub": "reddit.com", "title": "2006-08-humanities-student-major_2_reddit.com.txt", "pub_date": "2006-08-28T00:00:00Z", "Sentiment": "0.035", "Subjectivity": "0.385", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "505", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cfd0z", "Reddit_id": "cfdg2", "Subreddit_id": "t5_6", "Commenter": "Lucretius", "length": "3182", "content_scrubbed": " What the hell do you consider your thesis work?\n\nA thesis is for a Masters Degree.  A dissertation is for a \nPhD.  I was in a program where a failing student was given a\n\"Terminal Masters,\" but there was no thesis in the middle \nprior to submitting one[.] dissertation.  As you will note \nabove, I do include the alternate total if you want to \ninclude the dissertation as \"homework\"... but frankly that[.]\narguing a semantic point.  Most of the work was done in a \nlaboratory.\n\n\n Rote memorization, for example, is essential in many \n subjects.  How else can one learn languages, math \n formulas, key terms and the like?\n\n\nFor two years I taught microbiology to nursing students.  I \ndid require them to be able to provide definitions to a \nvariety of terms.  I explained to them that the terms \nin-and-of-themselves were arbitrary... mere labels retained \nby convention.   However, their understanding of the subject\nwould be, in future years long after they had left my class,\ntested by coworkers, and employers not on what they \nunderstood... which is difficult, but rather on easily \ntestable trivia like nomenclature, math formulas, etc.  The \nfact that trivia is the measure of understanding is unfair \nand unfortunate BECAUSE it can be cheated by mindless \nactivity like rote memorization.  It was my job as a teacher\nto give my students every advantage I could, even the unfair\nones, but even then I didn't require word-for-word perfect \nrecital of definitions.  UNDERSTANDING is always a better \nway to remember something than by rote!  I find your \nquestion \"How else can one learn...?\" amazingly disturbing. \nI don't remember the meaning of Osmosis, F=MA or \nKE=(1/2)M(V^2), by rote... shudder... I remember them because\nthey MAKE SENSE.\n\n\n journaling, most often employed in writing courses, forces\n people to practice writing without strictures.\n\n\nIf in fact \"journaling\" teaches \"writing without strictures\"\nthen it is in fact worse than worthless.  Writing is about \ncommunication (between the writer and the reader... even if \nthey're the same person).  As such, writing has an \nobjectively definable goal.  It can and *should* be \noptimized like any other communication technology.  It \nshould be clear, concise, and unambiguous.  Avoiding these \n\"strictures\" is synonymous with poor writing.  I begin to \nwonder how many of the people I know, who cannot string two \nsentences together to form a coherent point, were taught by \nsuch a method.\n\n\n the majority of those in this thread whining about \n homework are tech majors...\n\n\nTranslation... people who actually get things done for a \nliving.  The term \"tech major\" is almost synonymous with \n\"interested in things that matter.\"  I'm not saying that the\nliberal_arts are totally worthless, but they get too high a \nbilling for a set of subjects that has undergone little \nobjectively measurable progress in Method or Content since \nthe time of the Greeks.  Indeed, most new art-forms are \ndriven not by creativity of artists but rather by science.  \nFor example, the development of photographic techniques \nfreed up artists from painting portraits and the like while \nsimultaneously providing a new artistic media."}