{"doc_id": "2", "name": "2006_08_humanities_student_major_3_reddit_com", "namespace": "we1sv2.0", "metapath": "", "pub": "reddit.com", "title": "2006-08-humanities-student-major_3_reddit.com.txt", "pub_date": "2006-08-28T00:00:00Z", "Sentiment": "0.076", "Subjectivity": "0.409", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "471", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cfdg2", "Reddit_id": "cfdlm", "Subreddit_id": "t5_6", "Commenter": "cleanthes", "length": "2755", "content_scrubbed": "A thesis is for a Masters Degree. A dissertation is for a PhD.\n\nKind of a pedantic point, don't you think? You said 8 years of \"grad school,\" which I took to mean a masters. \n\nIt was my job as a teacher to give my students every advantage I could, even the unfair ones, but even then I didn't require word-for-word perfect recital of definitions. UNDERSTANDING is always a better way to remember something than by rote! \n\nSure, and that[.] not what I'm arguing. My argument is that rote memorization is a necessary, but not sufficient, technique for learning discrete facts. You seemed to claim it had no place in learning, which I stridently disagree with and is demonstrably false. \n\nIf in fact \"journaling\" teaches \"writing without strictures\" then it is in fact worse than worthless.\n\nThe writing you cite here is largely _technical_ and not creative writing. You wouldn't use journaling for a class on technical writing or journalism, naturally. But for creative writing, it is an invaluable tool and one technique (out of many) for helping students to overcome the fear of the \"blank page.\" \n\nTranslation... people who actually get things done for a living.\n\nReally? I'm a lawyer and I get quite a lot done, thank you. And, like approximately 50% of those in the profession, my undergrad was in the humanities. It helped me to think abstractly, communicate effectively and with finesse. And it developed my critical thinking skills. The world needs writers, performers, teachers, artists, psychiatrists and, yes, lawyers every bit as much as programrs. Your own professional ethnocentrism is of no moment. \n\n... undergone little objectively measurable progress in Method or Content since the time of the Greeks.\n\nCan you prove this? Really? \n\nIndeed, most new art-forms are driven not by creativity of artists but rather by science. \n\nAnd many great scientific feats were driven by men (and a few women) who also found their spiritual sustenance in poetry and arts of all kinds. You would make this some kind of false dichotomy: an imagined zero sum game where one must choose between the arts and the sciences. What rubbish. \n\nBut then, I'd better get back to work. I've got, after all, to do some things that don't matter. I have a client who is a victim of hurricane Katrina. Her creditors are after her and she would like to file bankruptcy but has no money. To do that, I'll have to use my liberal_arts skills in writing, communication, and critical thinking. It[.] pro bono work, and it doesn't matter, as you say. The only things that matter are things that can be measured with a ruler or in a beaker; placed in orderly categories or looked upon with microscopes; and all problems can be solved with a scalpel, a keyboard, or a business plan."}