{"doc_id": "594", "name": "2007_10_humanities_student_major_9_reddit_com", "namespace": "we1sv2.0", "metapath": "", "pub": "reddit.com", "title": "2007-10-humanities-student-major_9_reddit.com.txt", "pub_date": "2007-10-22T00:00:00Z", "Sentiment": "0.128", "Subjectivity": "0.287", "Score": "83", "Upvotes": "83", "Downvotes": "0", "Wordcount": "411", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_5yvva", "Reddit_id": "c02aooo", "Subreddit_id": "t5_6", "Commenter": "jamke", "length": "2254", "content_scrubbed": "1. Don't listen to any of these schmucks about how you should/should not have ridiculous amounts of sex. That[.] your personal decision and yours alone.\n\n2. Visit the schools you apply to. Only so much can be conveyed about a school through a pamphlet/website/phone recruiter - and you'd better be sure as hell that perspective is a meticulously crafted one. Go and see it for yourself before you commit.\n\n3. Don't worry too much about going to a competitive school with a world-renowned reputation... even if you are worried about getting into other schools after you graduate. I went to a very small liberal_arts college for my undergrad and now I am a PhD candidate at an Ivy League university in a highly competitive biology program. Truth be told, your grades that you earn during your four years, as well as the recommendations you get from people for your graduate school applications are what truly count. \n\n4. Don't get scared about picking the \"right\" major, and don't let anyone muscle you into something you don't like. If you need the time, take the time to declare. You have one to two years before most schools will even let you. But... do devote a lot of time think about it. Don't put it off. Oh, also, follow a career pathway that you enjoy, not something that is/will be \"hot\" or \"profitable\" or \"lucrative.\" It may or may not stay that way, and I'll tell you firsthand that if you do not have a passion for what you do, it will make your life more challenging than it should be and you most likely will not have the stamina and happiness that make you feel fulfilled at the end of the day.\n\n5. Remember... your life will be built in baby steps and don't feel like you have to plan everything perfectly right now. Just be willing to accept change and to work for positive things in your life and you will do just fine.\n\n6. And don't forget to take time for yourself! College demands a lot of self-discipline in order to go to classes and complete your assignments, etc. and it is very easy to get so caught up in it that you forget to take sanity time. And it will catch up with you. So chill with friends, go hiking, or play extreme frisbee... whatever makes you happy and puts you back in touch with your core being.\n\nBest of luck to you!"}