{"doc_id": "593", "name": "2007_10_humanities_student_major_8_reddit_com", "namespace": "we1sv2.0", "metapath": "", "pub": "reddit.com", "title": "2007-10-humanities-student-major_8_reddit.com.txt", "pub_date": "2007-10-22T00:00:00Z", "Sentiment": "0.117", "Subjectivity": "0.371", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "293", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_5yvva", "Reddit_id": "c02aom4", "Subreddit_id": "t5_6", "Commenter": "sisternovena", "length": "1613", "content_scrubbed": "If I had it to do all over again:\n\n1) I wouldn't go to my small, private liberal_arts college. I don't regret having gone -- I got a genuinely good education, and that in itself is worth a lot -- but it wasn't worth the debt I had to take on to pay for it. In retrospect, I'd have been no worse off attending one of those huge state universities (where I'd have gotten a free ride and had access to better amenities), or if not that, a very recognizable name school.  Bear in mind that to the HR person of your future employer, Anonymous Boutique College looks exactly the same as Anonymous Diploma Mill University. It sounds impressive in the prospective student brochures, but if it doesn't mean anything to anyone else, it doesn't mean anything. And unless it[.] for something specialized, every BA is exactly the same.\n\n2) No debt. No credit. Seriously. This is the most important thing anyone will tell you. The credit card companies will tempt and seduce; you must lash yourself to the mast and refuse to hear. Visa and Mastercard have nothing to offer you but pain and sorrow. And for god[.] sake, choose your student lender extremely carefully -- Astrive and Fannie Mae can make your life a misery. Don't necessarily listen to your college[.] financial aid department -- some of them are bought and paid for.\n\n3) Do seriously consider putting college off for a couple of years and going to travel, or better yet, live abroad. It will make you a better human being. And you'll be much more receptive to what college has to offer you at 20 than at 18. (Better still at 25, but that[.] probably asking too much.)"}