{"doc_id": "1623", "name": "2008_10_humanities_student_major_43_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2008-10-humanities-student-major_43_AskReddit.txt", "pub_date": "2008-10-30T00:00:00Z", "Sentiment": "-0.029", "Subjectivity": "0.473", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "563", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c063ryv", "Reddit_id": "c063up5", "Subreddit_id": "t5_2qh1i", "Commenter": "Sawta", "length": "3023", "content_scrubbed": "Sorry if you've heard it a million times before.  I'm speaking as a 21 year old who has been going to a community college for several years and, although I may not be able to give the best advice in the world, I think I can help show you an alternate view on what you're going through:\n\nFirst off, **if you are on the verge of failing out of a major that you are showing little interest in, perhaps you should really sit down for a while and think over why you are doing so poorly in that major**.  You are in college to become prepared for a specific field of work.  **If you spend all of your time slacking off to avoid that field, I think it[.] a definite warning sign that you probably wont be happy with any job you get after you graduate.**\n\nAt 19, it should **not** be shocking if you do not have any idea of what you want to do with your life. I, myself have tried out the following majors: Music Recording, Humanities (Music preformance related), and (currently) Game Development.  I am **still** not completely sure if this is what I want, but I'm having fun with it, and although I don't spend every moment of my day devoted to it (you can probably tell by this post), I still manage to get the work done, and get alright grades.\n\nThe whole reason why I am mentioning that I changed my major so often is because, when I was in those music related classes, **I often would find myself playing WoW, watching TV, etc, simply so I could avoid doing the work.**  It took me a much longer time than it should have to realize that, **I was trying to blame entertainment for me failing in so many of my classes, rather than blame myself and find something that I was more interested in.**\n\nI'm certainly not trying to say that I don't believe that your addiction is real.  I'm simply trying to say that I think that the thing that started your addiction may well be the only thing that is fueling this addictive behavior.\n\nI would highly suggest that you spend the time to shut off all outside distractions, sit down and think about this honestly with yourself.  *If you get this degree, and you are around computers constantly in your dream job, will you be able to control your urges with your own will power, or do you think your preformance will suffer?  Could you be fired for doing so poorly?*\n\nI think that when people try to **completely** shut out something that was controlling their lives in a negative way, **they usually end up substituting their desire in some other way**, usually which is equally as destructive.  **I think that the best way to get your addiction under control isn't to completely remove the internet from your life, I think that the proper solution is to learn some fucking self control and turn off the computer if you aren't getting any work done.**  Study for a subject that doesn't involve the computer, and if they all do that day, then go for a jog to clear your head and come back in an hour or so and see if you are interested in getting your work done.\n\nHope some of this helps."}