{"doc_id": "1622", "name": "2008_10_humanities_student_major_33_technology", "namespace": "we1sv2.0", "metapath": "", "pub": "technology", "title": "2008-10-humanities-student-major_33_technology.txt", "pub_date": "2008-10-23T00:00:00Z", "Sentiment": "0.037", "Subjectivity": "0.323", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "633", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c05zp69", "Reddit_id": "c05zuzl", "Subreddit_id": "t5_2qh16", "Commenter": "[deleted]", "length": "3390", "content_scrubbed": "This is in regards to this particular \"IT Guy.\" Does not apply to mine, who frankly isn't the stereotypical jerkwad.\n\nOk, since I wrote this, I'll respond.\n\nPerhaps b/c I don't have the authority, access or tools to do it myself, since I'm not in IT. Even though I may know how to use an admin account, I don't have one.\n\nIn the Liberal Arts department where I was working, this was never the case, professors *AND* grad students had access to do whatever they wanted on the PCs. They didn't have access to install stuff on the student labs, but that was my job they just told me what to put on there.\n\nThere was talk about removing admin access but I never supported it because most of the professors and grad students were competent enough to patch regularly on their own. This was also pre-Blaster worm.\n\nTrust me, I didn't want to have to call you in the first place.\n\nI understand that, but it doesn't make my point of insulting yourself being just fluff any less reasonable.\n\nPlease re-read this slowly in the mirror. Now take your own advice.\n\nI did re-read it, perhaps I don't get your point.\n\nI admit I make mistakes, however, when I ask myself if I rebooted a computer, I don't say that I did when I have not. Something as simple as rebooting a computer is a very relevant piece of information to know. For some reason this piece of information was among the least answered correctly questions I would ask. I think they thought I was trying to make them look stupid so they were saving face by responding and saying they did restart it. Then, when I found out they hadn't (network uptime or custom tools come in handy) I would remember they were the users I had to ask three or four time to make sure I got the truth out of them.\n\nDon't tell me. Tell my supervisors.\n\nMy complaints about the urgent requests were more for the sake of complaining than anything else. It[.] just funny when you have 3 levels of priorities you get maybe 10-20% of the department that will always pick \"URGENT\".\n\nStop fooling yourself; it is partially about your aversion to other human beings. (But I prefer e-mail, too.)\n\nI suppose that might be the case, but still, I never wanted to be *friends* with these people. I just wanted to do my job. I was overworked (20+ hours and 16+ hours classwork 40+ hours over the summer) and that time really was critically to me being able to get as many things done as possible. At the particular time I wrote this I had been working 6 months in a department of 40 professors and 120 graduate students and over 2,000 students (we had 4 large labs) all by myself. This was in the middle of the school year as well.\n\nI could have left, but I didn't. So you'll have to excuse me if I demanded a little bit of respect for my time.\n\nYou mean you are blunt and rude.\n\nIn hindsight, yes, I probably should have just phrased it that way.\n\nIf you weren't blunt and rude, I might have more faith in your ethical standards.\n\nBelieve me, if I was working at your IT department, I'd feel exactly the same way. I'm not unethical. Period. Unfortunately, honesty and integrity are not measurable or teachable things, you either have them or you don't so there is nothing more to say than that I know I have them. \n\nI'm looking forward to the day I lose my job because I stand up for what is right, and I hold my peers (other IT people) as accountable as I expect others hold me."}