{"doc_id": "550", "name": "2010_10_humanities_student_major_48_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2010-10-humanities-student-major_48_AskReddit.txt", "pub_date": "2010-10-06T00:00:00Z", "Sentiment": "0.104", "Subjectivity": "0.337", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "600", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dnpvp", "Reddit_id": "c11k9xr", "Subreddit_id": "t5_2qh1i", "Commenter": "[deleted]", "length": "3536", "content_scrubbed": "Might be helpful to more directly identify what kind of program you're looking at.  I'm in the amorphous field of digital humanities, which is interdisciplinary simply because most universities don't have departments/programs devoted to it yet, so I can share some of my experiences.\n\nFirst, you're going to have to pick a home department.  This will be harder for an interdisciplinary focus than for someone with a traditional field of study. You will have to take classes mostly in your home department, and take a comprehensive exam in a single department (even though my dissertation committee involves 4 departments if you count joint-appointments).  So you're probably going to have to decide between the two departments you mentioned.  There are no \"literary theory\" departments: you're looking at English or Comp Lit.\n\nSecond, funding is definitely available if you get into a good university.  The one[.] you've named are incredibly competitive, but there are other well known and well funded public universities you may want to consider as well.  In the US, anyway, you're probably going to have to teach for a living while taking classes and working on your dissertation.  If you end up in a cognitive/neuroscience department, you'll work in a lab.  Either way, it[.] going to be a lot of work.  You may get offered a fellowship for your first year, but generally you should expect to work for your tuition waiver and a small (but comfortable if you're frugal or willing to take on roommates) salary.  It[.] much more common to get a fellowship at the dissertation stage.\n\nMy experience: I'm based in English even though I now do very little literary work.  When I applied for my PhD, I sent out applications to different departments at different universities based primarily on the people I wanted to work with and the sort of projects I thought they'd let me get away with.  I ended up in English because the department I chose guaranteed me a salary and a tuition waiver (and health/dental/vision) for 6 years with the possibility of extension if I have trouble finding a job.  Cost of living is cheap where I'm at, so I haven't had a problem paying the bills without the need for roommates.\n\nThey also had no problem with me doing a lot of work outside the department and have been extremely supportive at my efforts to do interdisciplinary projects.  I've done cultural studies work typical of English departments, but I've also written some software and studied some open source development histories for my graduate seminars here.  I've been lucky to have professors who encourage innovative scholarship.\n\nI teach two classes a semster, usually on research/writing.  This year I started teaching elective courses on fiction and was able to substitute one of my classes with a job doing webmastering and graphic design on campus.  I plan to join a project team developing text mining software next year after I pass my comps.\n\nAs far as ending up living in a car goes, the academic job market is very tight in most fields right now.  I'm not sure whether a European degree would help/hurt getting a job or whether their job market is better than ours.  I'm not too worried because my focus will let me apply for a variety of jobs, and the sort of work I do is one of the few subfields in demand within English departments right now.  If you're considering English as a home department, know that jobs are extremely scarce for people with a lit focus.  Rhet/Comp and Digital are the only specialties getting jobs right now."}