{"doc_id": "591", "name": "2010_10_humanities_student_major_394_physics", "namespace": "we1sv2.0", "metapath": "", "pub": "Physics", "title": "2010-10-humanities-student-major_394_Physics.txt", "pub_date": "2010-10-29T00:00:00Z", "Sentiment": "0.015", "Subjectivity": "0.459", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "381", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c13sioq", "Reddit_id": "c13th0v", "Subreddit_id": "t5_2qhi6", "Commenter": "Thren", "length": "2172", "content_scrubbed": "I don't think people give engineering and mathematical science undergraduates enough socialization credit.  The only girls that I've ever seen that had a flock of guys around them were the type in the freshman and sophomore core classes like calculus or physics that giggled about how hard the class was and tried to get the willing guys to do their work.  These were the ones that typically ended up changing their majors with such regularity that friends would often bet by which semester they would drop.  \n\nAs for the other girls, they stand by their own merit and hard_work.  In every (and I do mean every) engineering class I've taken, the chatter before class begins was usually on the material of the last homework or the topics we were studying.  Even if most of us tend to be awkward socially (goodness knows I'm definitely included), its still easy to talk to others in the class as we have shared interests and frustrations through virtue of our major.  By junior year, you get to know your core group in the major well enough to have personal respect for everyone involved.\n\nTo be truthful, I feel incredibly weird in my core humanities classes in a way I've never experienced in my male-dominated classes for my major.  Whenever I had to take a class in English or social_studies or whatnot, it was an exercise in frustration at the group dynamics.  There are just enough men in those that think the humanities are a great way to score women, and just enough women that are only attending college to find a husband, that it really cheapens the class discussions when they blather on, obviously not having done any of the reading or utilizing much critical thinking or just trying to seem smart to the other sex through arguing semantics with the professor.  When the vocal components of your class seem to be using it as an obscure dating service, it places one in a rather awkward position more aware of their own gender than otherwise.  Even though I'm usually the only girl in my engineering classes, or one of at most three girls, I've never been aware of it while attending, unlike every single core humanities I've ever had the displeasure of taking.  "}