{"doc_id": "557", "name": "2010_10_humanities_student_major_115_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2010-10-humanities-student-major_115_AskReddit.txt", "pub_date": "2010-10-11T00:00:00Z", "Sentiment": "0.127", "Subjectivity": "0.302", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "330", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dptvg", "Reddit_id": "c121etf", "Subreddit_id": "t5_2qh1i", "Commenter": "geoshua", "length": "1861", "content_scrubbed": "As someone who did that very same thing (minus the subject area - I'm a cartographer finishing my masters and currently applying for Ph. D programs) keep this in mind:\n\n1) Grad school shouldn't cost you a dime. If you don't get funded, don't go. Apply for several schools; most of them have Graduate Assistantships that will cover you tuition AND pay you a stipend, if you qualify.\n\n2) Don't try to be a bookworm hermit and then ace your classes, score well on the GRE, and have a solid application. MEET YOUR CURRENT FACULTY. Often, it will come down to *who* you know, not what you know. Express you interest to a professor you're in good with now. If you're not on personal terms with one of your profs, that should be your number one goal immediately. If they can't bat for you to get into the grad program in their department, they can sure write you one hell of a recommendation letter (you typically need 3).\n\n3) Your interests may change, and that[.] ok! I started out at a community college majoring in design and photography. Worried about career prospects, I switched to computer science when I transfered to a 4-year University. I found out my junior year I didn't like it much. So I switched to Geographic Information Systems. This was a perfect match for me because it paired my love of good design with my ability think abstractly and write my own programs. My previous interests both failed, but lead me to a field I totally love which only my past experiences could have prepared me for. **Don't have narrow options!**\n\n*I'll repeat again*: Grad school shouldn't cost you anything. Period. If you can't get accepted in a funded position, don't go. Always ask about funding opportunities when you talk to faculty of potential programs.\n\nTo be honest, if you like comp. sci and humanities, you sound like a geographer to me!\n\n(I'm 26 if that helps)"}