{"doc_id": "587", "name": "2010_10_humanities_student_major_352_socialism", "namespace": "we1sv2.0", "metapath": "", "pub": "socialism", "title": "2010-10-humanities-student-major_352_socialism.txt", "pub_date": "2010-10-27T00:00:00Z", "Sentiment": "0.091", "Subjectivity": "0.433", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "704", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dwz1d", "Reddit_id": "c13kpko", "Subreddit_id": "t5_2qjii", "Commenter": "[deleted]", "length": "4431", "content_scrubbed": "I agree largely with BetterRedThanUndead, but I suppose I should elaborate a bit on my views.\n\nI believe that the institution of the corporation should be abolished, and that cooperatives would take their place for all private industry. I do believe there is a place for economic activity outside of the state, but I don't think that private industry should be able to profit over what is necessary for survival; in an ideal world, the decentralization of utilities would eliminate the necessity of state control of them, however - for example, through individual communities being powered by solar paneling, wind farms or, a bit further down the line, fusion reactors.\n\nA common line repeated by critics of socialism is something similar to \"Socialism wants to make everyone equally mediocre\". That[.] simply not true, and in the implementation I would want to see, socialism would simply guarantee everyone a basic standard of dignity in their lives, and the opportunity to succeed. With that basic standard guaranteed, people would be more free to pursue excellence and great standards of achievement, whether in the arts, science, or whatever else they consider worthwhile. Socialism is about eliminating the barriers that prevent achievement, not suppressing it.\n\nIn a socialist system, it would be impossible to accumulate obscene levels of wealth due to two factors: firstly, the elimination of private property and capital, and secondly the democratic nature of the economy. The elimination of private property would mean that individuals could not grow wealthier off of existing money; without the ability to individually own a factory, you can't profit off of its production without contributing your own labor. Secondly, the democracy that would exist in the workplace (similar to how Mondragon[.] employees vote on a fair ratio of pay for different categories of worker) would prevent upper-level management from having salaries hundreds of times higher than their low level workers.\n\nI'm torn on to what degree I see government as necessary, because despite empathizing and agreeing with many of the anarchist views expressed by the likes of Chomsky, I can't help but have a niggling feeling that without a strong, central government, anarcho-socialist communities would be liable to be overpowered by militant states. Admittedly, I'm not an expert on anarchism (or socialism, for that matter), so those sorts of concerns have probably been addressed extensively elsewhere. So, laboring under the assumption that a state is necessary for the foreseeable future, it should be as transparent as possible, and the passing of major legislation should require votes of the population in general, not merely their representatives. Although some may consider this impractical, I think that with advancing computer networking technology, and an emphasis on smaller, aligned governments rather than monolithic states of hundreds of millions, it[.] certainly achievable. Of course, not everyone would or should be expected to become economic and legal experts, so I think it[.] reasonable for representatives to handle the majority of voting - I think that without corporate entities, the potential for corruption in politics is much lessened, albeit not eradicated.\n\nThe goal of society should neither be some abstract concept of \"progress\" as defined by those with a fetish for technological progress for its own sake, nor accumulation of material wealth, nor cultural hegemony. \n\nAlthough scientific knowledge is valuable, there is a large segment of people - especially on Reddit - that seem to think that all other human endeavors are secondary to it. Without science, humanity will eventually die off, trapped on our little blue planet; however, without culture and joy, we would have no reason to avoid such a fate. I'd rather live in a fair and egalitarian world without the microchip than one of both immense suffering and technological achievement. *Of course, I do not think that scientific and social progress are mutually exclusive - quite the opposite.*\n\nI doubt I need to explain why I disagree with the pursuit of money as a goal, but I suppose I should explain what I mean by cultural hegemony: society shouldn't seek to spread uniformity, and should instead revel in individuality.\n\ntl;dr: I think my views are pretty average for most socialists, and I'm not sure why I typed up so much reiterating the mainstream."}