{"doc_id": "555", "name": "2010_10_humanities_student_major_91_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2010-10-humanities-student-major_91_AskReddit.txt", "pub_date": "2010-10-10T00:00:00Z", "Sentiment": "0.077", "Subjectivity": "0.383", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "332", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dpdu9", "Reddit_id": "c11xch0", "Subreddit_id": "t5_2qh1i", "Commenter": "kgbdrop", "length": "1906", "content_scrubbed": "I didn't major in psych, but I am planning on going to grad school in it. I was a philosophy major who viewed (and still does, to some extent) view psych undergrad classes are fairly unrigorous. To be frank, they are easy. There are few expectations in the non-biology focused classes and the major is so popular that there are very few people in each class who take the subject matter seriously.\n\nMy phil background prepared me to demolish argumentative papers for the psych classes I took. It was sort of comical how an A- phil student (to A if I maintained interest and focus) could churn out A papers in psych without much effort. The level of argumentation is just that low. In the classes heavy on biology (e. g. evolution of biological systems, cog neuroscience, drugs) the expectations are a lot higher.\n\nIn the social psych and related courses, it isn't too difficult to earn an A. This isn't to disparage those topics, but the classes have low expectations. If you want to be marketable, much like any humanities degree, you have to push yourself over and above the class requirements. Taking honors courses, doing independent study classes, volunteer research, etc are really necessary to distinguish yourself.\nOne benefit of the low expectations is that the professors are really impressed if you show interest and cleverness, so you can get a mentor without too much effort. \n\nIf you're set on going in to counseling, then you need to keep your GPA up. Clinical psych PhD programs are difficult to get in to. You'll need to do research/volunteer. This goes for every major, but push yourself. If you're going to do well in a clinical psych PhD program, you should do fine in your undergrad classes. That means you really need to push yourself outside of or in addition to class. If you are interested in a topic, do independent research on it. Talk to the professors who specialize in the area."}