{"doc_id": "549", "name": "2010_10_humanities_student_major_45_pics", "namespace": "we1sv2.0", "metapath": "", "pub": "pics", "title": "2010-10-humanities-student-major_45_pics.txt", "pub_date": "2010-10-06T00:00:00Z", "Sentiment": "0.087", "Subjectivity": "0.332", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "277", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c11j7fw", "Reddit_id": "c11jnss", "Subreddit_id": "t5_2qh0u", "Commenter": "FUSe", "length": "1496", "content_scrubbed": "What did you guys major in?\n\nI know for liberal_arts degrees, the job fairs are generally lackluster...\n\nI got a BBA (undergrad business) and the companies that were hiring were looking for career positions.  Consultants, analysts, etc.\n\nMy friends who did CS and Computer Engineering also had a job fair that focused on programming/consulting/engineering positions.\n\nI got my first job out of a College job fair.  I met the company recruiters there and so when I put in my application on their website, I got an email back with them saying that they remembered me from the fair, etc.\n\nSo I can't knock job fairs.\n\nAlso.  I am now in a position that I am reviewing resumes and conducting one of the interviews for future employees in my group.  We have 2 open positions right now and we are getting a decent number of applications.  \n\nHalf the people who apply are not qualified and the other half are overqualified but only applying so they can prove to the unemployment office that they are \"looking for jobs\".  \n\nI had a screening call with a man who was a manager at his past job applying for our entry level position.  The guy was out of a job since early 2009 and when I told him the salary range, (50-60k) he said that wasn't high enough.\n\nThe sad truth is, I don't care how long someone has been out of a job, I am not going to tell my company to hire them  if they aren't qualified or if they are just taking this job as a temporary gap while they look for a job that they \"really want\"."}