{"doc_id": "566", "name": "2010_10_humanities_student_major_190_anthropology", "namespace": "we1sv2.0", "metapath": "", "pub": "Anthropology", "title": "2010-10-humanities-student-major_190_Anthropology.txt", "pub_date": "2010-10-17T00:00:00Z", "Sentiment": "0.149", "Subjectivity": "0.415", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "951", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c12kl0z", "Reddit_id": "c12l3mg", "Subreddit_id": "t5_2qkdk", "Commenter": "GrumpySimon", "length": "6047", "content_scrubbed": "Wow. To boil it down, you've picked up lexical data from SEA & Pacific cultures, wrote those down as inherited/evolved traits and tracked those as phylogenetic trees using statistical (bayesian?) inference to analyze the linguistic and ethnographic data?\n\nPretty much. We're using languages as a proxy for cultures (which is and has been a fairly common assumption in Anthropology), and built phylogenetic trees from this data using Bayesian phylogenetic methods, before mapping the political traits onto these trees (again, using Bayesian phylogenetic methods).\n\nIf so, that is awesome. What a great implementation of interdisciplinary tools. Really amazing stuff. I'm not sure if it[.] considered revolutionary in anthropology, but if you folks are the first to apply this system to the study of socio-political typology it should be.\n\nThanks - I like to think it[.] cool too! It is the first time an approach like this has been tried on political complexity, and it really gives us something quite _new_ to say about this long-standing topic of debate.\n\n\nWhat do you think the impact of island topography had on the results of the study? As someone who[.] got a strong practical background in AI I'm aware that evolutionary population algorithms behave differently in semi-connected island topography. What in your opinion is the difference between the semi-isolated cultures studied in this paper and non-isolated cultures elsewhere in terms of whether this analysis can be re-applied to those cultures? Is there reason to think that the aforementioned semi-isolated nature of those cultures could inhibit the conclusions of this paper from being generalized to other cultures?\n\nIn the paper we talk a bit about how the rises and falls in complexity might be linked to _niche_ size in certain regions of the Pacific. For example, in Polynesia, there are many very small islands which directly limits the size that populations can grow to, and hence the _need_ for complexity. So in this sense island topography might play a major role in constraining evolution.\n\nIn terms of isolation, it turns out that these societies are far less isolated than you might think. These people were quite capable of travelling hundreds of kilometers in tiny canoes for trade, war, and marriage. For example - when Cook was \"discovering\" the Pacific, he met a guy from Ra'iatea (now one of \"The Cook Islands\") who was able to direct them to at least 30 different islands and had large amounts of knowledge about what could be gotten from those islands:\nhttp://en. wikipedia. org/wiki/Tupaia_\\(navigator\\)\n\nOne interesting thing here is that early Austronesian societies became less hierarchical after entering the region around New Guinea. This is exactly where they came into contact with existing populations of \"Non-Austronesian\" people (e. g. Papuans) who had very low political complexity. \n\nAs for generalizing it beyond the Austronesian cultures. I do think the inference[.] we've made are reasonably general as there[.] the whole range of different society types in the area. But, as always, this should be tested in different areas of the world to check.\n\nKeeping in mind that a few of my personal friends are cultural anthropologists and my wish to avoid offending them, they don't really seem to be up on the latest and greatest statistical analysis tools. Do you think the acceptance of the methodology presented in this paper could be limited by that?\n\nDefinitely. The last few decades in Cultural Anthropology have seen a strong trend away from large-scale comparative analyses. Also, in many cases Anthropology is more a humanities than a science - and is often more focused on description of _a_ society rather than comparison. There are a number of reasons for this - ranging from postmodernism to ideas that widescale comparisons like this are kind of offensive and trivilising to the cultures concerned. I disagree strongly with this - both low-level descriptive analysis and widescale comparison are needed to understand what[.] going on with human culture.\n\n& I do know from experience that these methods are quite complicated to understand for anyone, even those with good stats knowledge. I've spent a lot of time writing papers explaining these methods to linguists ([for example](http://simon. net. nz/articles/austronesian-language-phylogenies-myths-and-misconceptions-about-bayesian-computational-methods/)), and I'm currently working on a large review paper for anthropology (i. e. what are the benefits of these methods, and how do they complement anthropology), but this will be a good six months off.\n\nCircling back to AI for a second, it seems you folks had to massage the data for it to fit into the tools used in this paper (\"pruning\" from 650 languages to 84 languages, converting lexical data to binary data, etc). Were those changes due to limitations of the tools used? If so, why not employ a more general solution? (Genetic Programs, Neural Networks, etc)\n\nThe \"pruning\" of the data to 84 languages was purely because that[.] all the societies we could easily find complexity information for. Unfortunately there[.] no large database of all human cultures (and we mined the ones that DO exist like eHRAF and the Ethnographic Atlas). Ideally we'd love to include more and more societies as this will give us much stronger estimates. A few of my colleagues will be working on this in future, but this will involve spending months in a library reading ethnographies - lots of effort for few data points. \n\nRe: the binary lexical data - this is basically just a way of representing the gain and loss of cognate sets (i. e. homologous words in different languages). It works well and is easily modelled in a phylogenetic framework. I'm currently working on developing more nuanced models of language evolution but this is rather difficult. These [guys here](http://www. cs. berkeley. edu/~bouchard/research_fall2009. html) are probably developing the state-of-the-art methods, so I'm keeping a close eye on them!\n\nHope this helps!\n\nSimon"}