{"doc_id": "545", "name": "2010_10_humanities_student_major_11_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2010-10-humanities-student-major_11_Economics.txt", "pub_date": "2010-10-02T00:00:00Z", "Sentiment": "-0.057", "Subjectivity": "0.34", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1236", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dlffx", "Reddit_id": "c1161tk", "Subreddit_id": "t5_2qh1s", "Commenter": "[deleted]", "length": "7216", "content_scrubbed": " 1 - social security \n\npopulated mostly with IOUs; started its first year of paying out more than it collects; will collapse withint 10 to 15 years.  In other words, in a few years this will not be #1 and neither will America.\n\n 2 - medicare\n\n 3 - medicate\n\nWould someone explain why the fuck we have two medical programs?  Just do national health care right (universal coverage) these become one, potentially halving the cost.\n\n 4 - interest on national debt\n\nYeah, well, this what we dumb fucks, as Americans, get for letting *our representatives*  get away with bloody murder at the behest of the lobbyist they actually represent.  End corporate subsidies in the form of 0% taxes that they all pretty much universally pay and apply the proceeds directly to the national debt.  Once debt goes above ~77%, the economy will fail (see previous reddit posts).\n\n 5 - combat operations in iraq and afghanistan\n\nEnd this shit **NOW**.  I mean really... just fucking end it.  It[.] doing absolutely nothing for us as a country and will rapidly contribute to our downfall.\n\n 6 - military personnel\n\nTake care of number 5 and I bet number 6 goes down as well.  In general, the military needs to stop being the employment program that it is. \n\n 7 - veterans benefits\n\nI'd bet money the VA[.] budget is primarily consumed by the medical aspects of an aging veteran demographic.  I know the VA is a nice place for sup-par doctors to go hang out, but just merge the medical component of this cost into the merger of #2 and #3 to get even more savings out of a single consolidation. \n\n 8 - national parks\n\nWTF?  Why the fuck are national parks so god damned expensive.  This is out of line and needs to be looked at.\n\n 9 - highways\n\nThree words:  Gas Tax Increase.  Let road users pay for the maintenance of their required infrastructure.  Paying for the highway system out of federal income tax maybe made sense when the program was just starting out, but it doesn't now.  Get this shit off of the FICA IOU gravy train (everyone knows geriatrics don't drive enough to justify what the politicians have stolen from them).\n\n 10 - health care research\n\nAgain, this could be folded into #2 and #3 and parts of #7.  Why is it even separate?  It[.] almost like we don't know what the fuck we're doing with regard to healthcare.\n\n 11 - foreign aid\n\nJust clip this shit cold turky exactly like #5.  Period.  End of Discussion.  Let the military pick up any disaster slack like they always do anyway and send the UN the bill.\n\n 12 - Education funding for low income K12 students.\n\nI'm going to take a wild fucking guess here that this is code for \"school lunches (and breakfasts and sometimes even dinner)\".  If we can't feed our poor, then we need to reduce their number.  A higher minimum wage (corporate tax) would help.  Outside of the \"welfare for poor students\" aspect, there are other programs this could be combined with #19.\n\n 13 - military retiree benefits.\n\nHere[.] a suggestion:  cap pay out to $40k/year for all government workers.  All those GS13-step-oh-my-gods can live nice on $40k given their access to VA health care.  Also, for all those double dipping motherfuckers (who collect both a military pension and a government service pension), knock their military pension down to 25% of their final base pay.  That will probably cut this expenditure in half without putting anyone in the street (except through their own stupidity).\n\n 14 - Pell grants for low income students\n\nRemind me again why they can't just get a fucking student loan like the rest of us non-entitled motherfuckers.  Oh, that[.] right... those education \"loans\" are just a mechanism for indebting students for the rest of their life.  Fuck all that shit.  Expand this program and dump Sallie Mae and stop making exceptions based on income background and make it purely about academic achievement... otherwise we're going to end up with a country of gen-tweeners (or what the fuck ever they're calling them this week) who feel completely entitled no matter what.\n\n 15 - NASA space program\n\nScale it back (unmanned, existing system maintenance only) merge it with the Air Force (no new systems) and let commercial enterprise start putting shit in orbit wholesale.\n\n 16 - IRS\n\nJesus Fucking Christ.  Talk about not getting any bang for the buck.  Merge these stupid motherfuckers with the postal service already.  They're about as effective.\n\n 17 - environmental clean up\n\nHumm... make the EPA pay for itself by letting the judicial system actually enforce existing penalties?  Maybe if we didn't shit where we eat, we wouldn't have to spend so much cleaning up the vomit.\n\n 18 - FBI\n\nAgain... no bang for the buck.  When they're not busy letting airplanes fly into sky scrapers in coordinated attacks, they're completely swamped missing the single biggest corporate white collar fraud committed in the entire history of America.  Useless motherfuckers who need to be merged with someone... I don't know, why do we have no less than 4 separate federal law enforcement entities (DEA, Treasury, ATF, FBI, DHS, park rangers, federal protective service, etc. etc. etc).\n\n 19 - head start\n\nmerge with #12 an #14.  Period.  End of discussion.\n\n 20 - Public Housing\n\nAt the rate we're going, 45% of all real estate is going to be public housing.  Take 25% of the money saved by eliminating #11 and apply it here (besides, most of America[.] poor people **are** foreign... so we might as well call it what this is:  Foreign Aid).\n\n 21 - DEA\n\nWhen they're not busy busting california (legal) weed co-ops and turning non-violent \"offenders\" into unemployable felons, they're usually tied up watching Mexico descend into complete narcostate status (good job, you fuckups, here[.] some more money for you to continue turning America into a fascist corpotracracy).  Merge with all the other fucking federial LEOs outlined in #18.\n\n 22 - Amtrak\n\nYet another bad joke involving American governance.  Look, it consistently runs a deficit, it barely passes as a public transportation system and it[.] only there to subsidize the maintenance of the rail system.  Time to call it a day and sell it off with the provision that the rail system in the US is opened up for competition (rather than the regional monopolies that currently exist).\n\n 23 - Smithsonian Museum\n\nI like the Air and Space Museum.  I even like the Museum on the mall... but 2 billions for three museums on the east coast is ridiculous.  End their subsidy and make they live within their admission budget.  Period.  Full Stop.\n\n 24 - Funding for the arts  \n\nI tell you what:  when we get real separation of church and state, you can have your funding for the arts back.  Kill it and don't look back.\n\n 25 - Salaries and benefits for congress\n\nYou know what?  Given the jobs these shitheads have done over the last couple of decades, I think it[.] time to yank the medical benefits (which includes family no matter how distantly related) and make them stick to the same pension reductions that the other federal workers will be getting in #13.\n\nYou want to know how to fix your country and its finances.  It[.] all right there in the above.  Your other option is to cease existing as a country.  Choose carefully."}