{"doc_id": "561", "name": "2010_10_humanities_student_major_165_reddit_com", "namespace": "we1sv2.0", "metapath": "", "pub": "reddit.com", "title": "2010-10-humanities-student-major_165_reddit.com.txt", "pub_date": "2010-10-15T00:00:00Z", "Sentiment": "0.08", "Subjectivity": "0.496", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "584", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c12e1hy", "Reddit_id": "c12e74b", "Subreddit_id": "t5_6", "Commenter": "buzzerbuzzer2010", "length": "3331", "content_scrubbed": "I have seen this a lot and maybe this is not the case but in my own classes as just a student and being a student mentor several times for incoming freshmen I saw it dozens of times. In high school the teachers are hardly able to express their own views for the most part and the views they are forced to teach are generally conservative and mainstream if not indoctrinating. But once they get to college, especially a liberal_arts university, this is probably the first time they have been exposed to, in their minds, such a radical perspective. Often professors on the first day go into great detail explaining their personal and or political views because it is important for the students to understand this perspective. This can be a very conservative perspective as well. This in itself is often shocking especially on the first day because often it goes against everything they know, everything their parents taught them. Often while making an argument students repeat word for word something their parents told them was true without ever questioning it. As time goes by different subjects are brought up which seek to develop critical thinking and not to persuade a person to think how the professor thinks. I have seen students get very alarmed at the thought that somehow they are being almost brainwashed into thinking a certain way sometimes reacting violently, screaming at the professor including walking out. Several times for one class in particular students went to the chancellor in the hopes that they would get the professor reprimanded for daring to expose them to a subject matter. But thats the whole point of this. Like I said its not to get someone to think like the professor, thats how high schools teach for the most part instead its to develop your own thoughts even if they are the complete opposite of what the professor is saying. This includes papers where a student might mistakingly think they are supposed to write what they think the professor wants to hear but really they are supposed to be presenting THEIR thoughts as long as they can argue effectively and clearly and backup what they believe with references or whatever it takes to establish their argument. THIS is what the professor wants and like I said I have seen this dozens if not a hundred times while going to school overhearing students complain because they got a bad grade thinking it was because they disagreed with their professor. WRONG. They just couldnt make a valid argument. Its the same way with raising your hand. This is how you develop as a person and also develop your own views. It strengthens your views. Often when students react violently its because as I said they think they are being pushed to think a certain way and I always used this time to point out that the more you disagree with someone this is your opportunity to strengthen your arguments using what the other person believes as ammo for your opinion. This is what they are trying to teach your children, to think for themselves and not to mindlessly repeat what a professor told them or what they think they were told to think. Most people get this wrong. Very few students graduate ever learning this skill but it is amazing to watch when a student finally gets it. You can see it on their face. I have seen it hundreds of times and its amazing. "}