{"doc_id": "559", "name": "2010_10_humanities_student_major_127_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2010-10-humanities-student-major_127_politics.txt", "pub_date": "2010-10-12T00:00:00Z", "Sentiment": "-0.054", "Subjectivity": "0.35", "Score": "47", "Upvotes": "47", "Downvotes": "0", "Wordcount": "295", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c125ti3", "Reddit_id": "c125xv1", "Subreddit_id": "t5_2cneq", "Commenter": "ghibmmm", "length": "1818", "content_scrubbed": "The \"No Child Left Behind Act\" represents the single largest intrusion by federal government into the schooling industry.  The results have been disastrous.  Please open a search engine, type in \"No Child Left Behind consequences,\" or even just \"NCLB consequences,\" and start reading.  I don't have all day.\n\nPublic (i. e., government-run) education is **fucked.** It[.] a disaster that mankind should never, ever repeat.  They are just facilities for indoctrination, under the loose facade of education, which the schools, as institutions (not the faculty within, mind you) actively work to prevent.  It dramatically removes elements of consumer choice, meaning that the curriculum is not under public review, which also increases costs and decreases quality of service, as in every other industry.  Discipline receives more emphasis than education, and a failure of students to adapt to this atrocious system is blamed not on the teachers, but on the student.\n\nThe result?  Our schools look and feel like prisons, the cafeteria food isn't fit for farm animals, and our children are medicated to the brim.  Acts of protest against the entire society by students become so desperate that we have situations like Columbine.  Teachers are not there only to inform the students, but also to inform the police about the activities of students and their parents.  The history that we learn is filtered through a mask of McGraw-Hill, the owners of which know the Bushes on a personal level.  **Programs instructing students in the arts are routinely cut out of the curriculum.**  This is a disgrace.\n\nOh, wait, you're talking about Paris Hilton.  Sorry to interrupt.\n\nedit: I have literally 30 Firefox windows, at 1440x900, full of replies to this post.  I am not going to reply to any more of them.  I stand by all my points."}