{"doc_id": "579", "name": "2010_10_humanities_student_major_287_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2010-10-humanities-student-major_287_Economics.txt", "pub_date": "2010-10-24T00:00:00Z", "Sentiment": "0.062", "Subjectivity": "0.476", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "270", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dvpqh", "Reddit_id": "c13azwb", "Subreddit_id": "t5_2qh1s", "Commenter": "quantumcoffeemug", "length": "1675", "content_scrubbed": "This kind of tenor to the dialog about public funding of academia is intensely depressing. Firstly, people seem to vastly underestimate the value of pure research. Academia is pretty much the only place where people investigate problems which do not have an obvious and immediate economic payoff - and that is invaluable, because without expanding basic knowledge, society stagnates.\n\nSecondly, it seems as if people are falling into the same trap when thinking about universities that they have fallen into with public schools. We seem to be obsessed with trying to quantify education, as if it were some kind of interchangeable commodity which schools produce. Education is a service, and what the individual student gets out of that service is the result of a complex interaction between the interests and learning style of the student, and the faculty, culture and procedures of the college. \n\nThere is simply no good way of quantifying what each professor contributes to that arrangement. Maybe that professor who teaches one course a term and brings in few grants is a great collaborator, and because of his presence a lot of other excellent faculty stay in the department who might be otherwise tempted to move elsewhere. No metric will ever be fine enough to account for something like that.\n\nOur increasing hostility towards the humanities, and our obsessive focus on quantifying learning have the potential to kill American academic culture. If being a university professor becomes more and more like being a high school teacher or community college prof, the kind of bright minds we currently attract to faculty positions will simply look elsewhere for employment."}