{"doc_id": "581", "name": "2010_10_humanities_student_major_296_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2010-10-humanities-student-major_296_Economics.txt", "pub_date": "2010-10-25T00:00:00Z", "Sentiment": "0.097", "Subjectivity": "0.447", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "1038", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c13bysr", "Reddit_id": "c13c9xp", "Subreddit_id": "t5_2qh1s", "Commenter": "LWRellim", "length": "5799", "content_scrubbed": "Though im glad I got a B. A. I seriously fucking doubt anyone will ever hire me in the school I did.\n\nYes im tired and I don't read over my comments... ever. I fixed it since you pointed it out but commenting to me is a free service and you basically get what you pay for.\n\nWell,  not to be a dick any more than the last guy, but all you fixed was the spelling of \"hire\". It[.] also the failure of the sentence to make much sense, or even to express a complete coherent train of thought that the reader can follow; it *almost* makes it, but the unusual phrase \"in the school I did\" at the end is somewhat of a non sequitur and leaves one hanging, uncertain if they got the point of it correct. (And of course there are the additional minor but notable spelling/typing and grammatical errors.)\n\nIf I checked over some odd 12k comments I have done over the three years (some of them pages long) I would pretty much lose my sanity and what little life I have left. I'm not saying this because I think of myself \"important\" or something stupid like that... its just a fact that some 70 percent of comments go completely noticed and about 30 percent get replies if they are noticed.\n\nThere is certainly a lot of truth to this, and I do understand (based on years of experience in and around publishing) that no one can *truly* proofread their own writing (an obvious problem inherent in public commenting).\n\nBut, and it is a *big* but... the ability to write clearly and coherently, to organize and express one[.] thoughts in a fashion that is readily understood by others *used* to be one of the hallmarks of a liberal_arts degree. Rather than being something that would cause a degree holder to \"lose their sanity\" it was expected that they had mastered the writing of text and expressing themselves in that form as a matter of habit, and that said habit also included a much higher than normal level of attention to details such as spelling, grammar, organization and clarity of thoughts.\n\nReddit is volume writing to me. While others may be clever I don't give a shit about karma and just write whatever I dam well please in many many words about many many subjects.\n\nI don't see that as really much of an excuse. If anything, volume writing should tend to reinforce one[.] habits. And it probably does -- those willing to pay attention to the details of thought, organization, spelling and grammar will tend become habitually better writers -- those who disdain all such detail will simply reinforce bad habits and their writing is likely to degrade.\n\nTake that as you will. But anyway my errors in the comment above don't disprove my point: Do you really think people hire people for the individual? No they do not. They hire people who can best falsify their resume and get away with it. Generally. The other word I would use is \"embellish\".\n\nI think places do their best at least *attempt* to hire a person who will both be capable of completing the work in a professional fashion, and will also fit in with the culture of and other people who work at the firm or organization.\n\nCertainly some people \"embellish\" their resumes, but outright falsehoods are normally rather easily caught, and the applicants eliminated from the list of candidates.  \n\nJust as common (more common in my opinion) are the candidates who have not falsified anything, but yet whose cover letters and resumes offer their own proof of the \"lie\" inherent in what they honestly state. What I mean by that is the candidate with an English Major whose resume is full of spelling errors, and whose cover letter seems to either be a dull boilerplate knockoff from a \"How to get a job\" book, or alternatively to have been by a 12 year old. The person *may* in fact have received the degree they claim (something easily verified), but as a hiring manager I normally wouldn't even bother to check as apparently the obtaining of the degree was of little or no value.\n\nIts partly my own fault thinking I can simply get hired by just being honest.\n\nI doubt it is really \"honesty\" that is your problem -- granted this is based solely on your two posts above -- but it seems your problem is more one of 'attitude' and a general [.]loppiness' and disdain for bothering with details. *If* that is what you mean by \"honesty\" and it is showing through in your resume, cover letters and your interviews then why should the person doing the hiring assume that you will perform any differently when working on their projects after being hired.\n\nFirst impressions are important. And while I agree you should not attempt to pretend to be something you are not, the degree to which you are willing to \"polish\" yourself and your portfolio when applying for work *is* indicative of the degree of effort you will be willing to put forth on the job. (And in that way it is much like clothing and personal grooming, there is a certain amount of truth as well as falsehood in the bromide that \"the clothes make the man\" -- there is nothing inherently wrong with a person wearing jeans and a stained t-shirt in their off hours -- but if a person shows up to an interview for an executive position dressed in that manner, they shouldn't be surprised at being summarily dismissed or ignored. Indeed they should be surprised if they were not.)\n\n---\n\nBTW please take the above in the spirit it is intended, as a discussion on the points you raised, with the addition of the benefit of my personal experience having culled through thousands of resumes (over 90% of which were so bad they were immediately tossed in the \"no way\" pile), and of having conducted hundreds of interviews for candidates in a variety of positions at several different firms over several decades. \n\nAs a closing thought, \"honesty\" is one thing... effort (or lack thereof) is quite another."}