{"doc_id": "553", "name": "2010_10_humanities_student_major_77_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2010-10-humanities-student-major_77_TwoXChromosomes.txt", "pub_date": "2010-10-08T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.389", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "571", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c11rqdr", "Reddit_id": "c11rxs1", "Subreddit_id": "t5_2r2jt", "Commenter": "[deleted]", "length": "3489", "content_scrubbed": "You're welcome!  Thank you for engaging in dialogue with me! \n\nIt[.] always a good idea to question/push at these hypothetical scenarios, because it may be that something we grow to accept as male privilege actually hides a different story.  Constant re-evaluation is a good thing.  That being said, let me go back through them given your input.\n\n**Bosses**: There have actually been a number of different studies that show that both men and women prefer male bosses, and that identical traits are seen quite differently when they're enacted by a male or female supervisor.  It could be that women *do* have poorer management skills, and innately come across as bad leaders.  But even if we accepted that hypothesis, what would it mean?  *Why* would women be bad bosses?  Is there something in the socialization of little girls and little boys that trains men to be better leaders?  Why?\n\n**Education**: You're absolutely right that female students have overtaken male students at every level, up to the respective number of each receiving PhDs.  This is something that[.] really troubling, especially from a gender perspective.  How does our school system favor traits that girls are socialized to have (or that they might even have as biological advantages, debatably) - the ability to sit still, quietness, organization, keeping neat folders, responding obediently to discipline, etc?  Why do programs designed to draw women into math, science, and computer programming not have their counterparts for men in languages and the arts?  It[.] a complex gender problem worth examining.  \n\nHowever, I was talking specifically about classroom debate, and it[.] my experience (yours may very well differ) that even in a very liberal university, in an evenly divided classroom, men will be called on more often than women - especially in a very large lecture hall (80+ people).  Why is that?  Why do women not want to speak up in high-pressure, highly-public situations?  Why are they so relatively unwilling to get into passionate debates?  What does is do to a dialogue to have it dominated by male voices?  Extrapolating, can we say this pattern holds true at all in the realms of political discourse and media punditry, and what effects does that have?\n\n**Actors**: Absolutely, a lot of it is due to market pressure.  Both men and women are only interested in seeing female entertainers that are sexually desirable, youthful, and attractive.  They lose their public value when they're no longer fuckable, even though men are considered funny, insightful, and powerful actors well beyond their prime.  Why is that?  What does it mean in terms of the way we understand the human value of men and women, respectively?  Conversely, we could take the hypothesis that men *are* considered more fuckable until much later in life, that socially, they are said to retain their attractiveness several decades longer than women - but again, what would that mean?  Why is attractiveness in women so much more linked to child-bearing age?\n\nAs you may have guessed by now, I'm a university instructor in the humanities, so I apologize if that got to lecture-y.  But yes, I am incredibly interested in examining these gender questions from all possible perspectives.  A brilliant female professor once made a huge impression on me by rebuking me in class: \"Male is a gender too.\"  I've tried to take it to heart ever since.  You've been very respectful, and this has been a really enjoyable discussion for me."}