{"doc_id": "564", "name": "2010_10_humanities_student_major_183_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2010-10-humanities-student-major_183_Economics.txt", "pub_date": "2010-10-16T00:00:00Z", "Sentiment": "0.019", "Subjectivity": "0.456", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "329", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c12igcc", "Reddit_id": "c12iox1", "Subreddit_id": "t5_2qh1s", "Commenter": "atheist_creationist", "length": "1927", "content_scrubbed": "Because a classical education teaches many components of reason, logic, and thinking that are just plain not taught in core degree classes.\n\nIts not my fault this culture doesn't emphasize sitting in a library every so often and reading up on this shit... or using this thing called the internet. I have a particular bone to pick with that because we have a world of information in our hands and few people use it to actually learn something. Just look at how pissed off redditors get when you tell them to research something on their own when it would take less than five minutes (even the rationalization for this anger is anti-learning at its core, its plain fucking lazy is what it is). You don't need to sit in a goddamn classroom and pay up the ass to learn the Socratic method and make your own critical ideas as to its advantages and potential pitfalls. I'm sorry, but the solution is not to keep this kind of environment where people are unwilling to learn for learning[.] sake. Even some of these full-on liberal_arts majors can hardly be considered \"worldly\" (if you've educated yourself, traveled, been involved in local politics and *actually* seen things happen instead of having your views confirmed by your like-minded classmates) just after a ten minute conversation with them. All I see is people who think they are intellectually well-rounded because they can recite Kant and Voltaire, have this notion that English follows prescriptivist rules and come out with incredibly warped views like \"humans invariably follow rational patterns\" (if they read too much Ayn Rand). I realize that  I'm making a blanket statement, but the system at its core does not foster any sort of real critical thinking or friendliness to a diversity of opinions like we pretend it does, every social study in academia has its circlejerk. And only a \"young pup\" would think that? Give me a fucking break, please, our shit is broken. "}