{"doc_id": "547", "name": "2010_10_humanities_student_major_33_wtf", "namespace": "we1sv2.0", "metapath": "", "pub": "WTF", "title": "2010-10-humanities-student-major_33_WTF.txt", "pub_date": "2010-10-05T00:00:00Z", "Sentiment": "0.024", "Subjectivity": "0.364", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "350", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c11f72d", "Reddit_id": "c11faj4", "Subreddit_id": "t5_2qh61", "Commenter": "zekthegeke", "length": "2102", "content_scrubbed": "It[.] not inherently arrogant, but it definitely depends on the parent and the support network they have.  Having worked as a public school teacher, I would say that an insane percentage of the time and effort of children and teens in school is wasted, whether by the general friction of treating them like inmates or by teachers who simply don't know their subject very well and teach to a script, always with the faint desperation that they will get caught.  Naturally, that desperation comes out in abuses of authority directed at students or other teachers, if they can get away with it.  Competence and good lesson design gets diluted by all of these other factors. \n\nShort of providing an extremely biased or sheltered education, or isolating the child from others completely, I've come to the tragic conclusion that it would be worth a shot for people that can't access a charter school with a good plan or private school.   The stigma of homeschooling is often misapplied as if every parent was running a fundamentalist indoctrination program, and I don't believe that has to be the case.  \n\nIt breaks my heart because I want to work within the system, but I don't believe it makes enough of a difference to do anything but take the edges off the tragedy.  There is no shame in opting out, or at least experimenting with other approaches.  \n\nOn a side note, I don't have a great deal of confidence in \"trained educators\" as it is commonly used.  Please assume the caveat of \"in my experience, in my opinion\" on all of these things.  An education degree will always be inferior to a liberal_arts/engineering/some other relevant field degree combined with teaching certification, because expertise in a subject is really difficult to cultivate retroactively, whereas once you get past fundamentals, teaching itself is most efficiently developed on the job.   No reform of education will be complete without rethinking how teachers are made in the first place, and hopefully rechannelling liberal_arts degrees away from MBAs and the like and into teaching through constructive use of incentives.   "}