{"doc_id": "571", "name": "2010_10_humanities_student_major_237_foodforthought", "namespace": "we1sv2.0", "metapath": "", "pub": "Foodforthought", "title": "2010-10-humanities-student-major_237_Foodforthought.txt", "pub_date": "2010-10-21T00:00:00Z", "Sentiment": "0.126", "Subjectivity": "0.386", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1224", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c12yvqb", "Reddit_id": "c12z75n", "Subreddit_id": "t5_2rete", "Commenter": "jstevewhite", "length": "7232", "content_scrubbed": "Replying to both CunningAllusionment and davidsmeaton, because thoughts on your replies are overlapping...\n\nNot wanting to experiment with your daughter[.] future is understandable, but I expect you also don't want to throw it away just because you know where it'll land.\n\nThere[.] probably a certain truth to this; but when it came time for her to go to school, I looked at several 'alternative schools' that use many of the buzzwords Sir Robinson did (\"Divergent thinking\"), but found *no* evidence that they produced a better education, and a small amount of evidence to the contrary.\n\nagreed ... the structure of our education system is based on a society that has ceased to exist.\n\nI'm sorry, davidsmeaton, but I think this is hyperbole. The school my daughter attends ( a public school that[.] above average on a national scale, but highly rated in our metro area) bears little resemblance to the school I attended as a child, and *that* school bore only a formal resemblance to those of a hundred years before. The changes aren't *radical*, but substantive all the same; perhaps the similarities are the result of effectiveness? Many alternatives have been tried, none have been sufficiently successful to supplant those similarities. \n\nbut what do we do to our children? we sit them in a room of 20-30 desks, in front of a teacher (and a chalkboard ... A CHALKBOARD!!!).\n\nIndeed. Many schools have graduated to whiteboards. We *know* that 20-30::1 ratios of students to teachers is less successful at teaching than smaller ratios, but we're talking about constrained resources (staffing), not a functional problem with the concept. Several studies have shown that children learn *better* with an adult, human educator, than they do with computer screens or videos. \n\nthe structure of a school (math department, english department, etc) is outdated. learning is integrated, the world is integrated, why do we segregate subjects.\n\nHe talked about the separation of subjects, observing that the world isn't divided up that way, but teaching *any* subject effectively requires that very thing. The more complex the subject, the more fundamental divisions in the fundamentals. Math is *clearly* a different fundamental than, say, reading; and studies linked here in /r/neurophsycology a few weeks ago showed that word problems result in a poorer understanding of maths; that people taught the bare math were better at both the math itself *and* applying it to real world problems than the ones who were taught primarily using word problems. \n\nHe asked why students are taught in age groups. I think this is inevitable for most applications. I'm not saying it can't be modified in some respect, but the bulk of children approach certain mental capacities at similar ages. Some are earlier, some are later, but they're the minority. My daughter is in fourth grade and reads at a college level for comprehension and vocabulary - but she[.] still interested in the stuff that ten year olds are interested in, and putting her with, say, other people that read at her level is ill advised. And while it can be argued that it[.] *because* of our system of stratification that children who skip grades are more anxious, I don't think the possibility that it[.] not solely that can be ignored. Should we relax the striation to some extent? Sure. Eliminating it? *really bad idea*, as nearly as I can tell. Of course, if evidence to the contrary is presented, I'll gladly change my view.\n\nwalk into any classroom and you will see bored children. they're bored and they're frustrated. why? \n\nBecause, as children, who don't have good judgement in general, and difficulty with delaying gratification in specific, they don't feel that learning is important - or at least, more important than Nintendo. It[.] true that many children can be engaged - and teachers *love* those children. Children that are more difficult to engage fall through the cracks - *not* because of \"the system\", but primarily because of the paucity of resources (qualified staffing). \n\nare you seriously telling me that drugs like ritalin are good for your child[.] brain? good for mental development? good for their health?\n\nNo, of course not. I think we're turning this generation into a huge pharmacological study on the ideology of medicating to docility. OTOH, his discussion of such is uninformed. Ritalin is a stimulant, and can produce mania in as much as 25% of children who it[.] administered to - who are then diagnosed as \"bipolar\" ( a condition that was not believed to exist in children to any measurable degree until the ADHD/Ritalin 'epidemic' ). This is not a failure of the SCHOOL system; it[.] a failure of the neuropharmacology industry and disciplines. It[.] not \"anaesthesia\", no matter how much he'd like to make it that. Academics (as much as 25%) admit to taking Ritalin to help them focus and *improve* creativity, not suppress it. \n\nand, i don't mean to offend, but if we say we don't want to risk our children[.] futures on change, then who takes the risk? our childrens' children? our great grand children?\n\nI'm all for change, but I challenge the idea that the arts are the primary model for 'the new world' - which is just the same as the old one, only with more constrained resources. You can't teach math the same way you teach art. There[.] no \"right way\" to draw an elephant; there *is* a 'right way' to factor a polynomial. \n\nThe rhetoric about divergent thinking just kills me. First, if 98% of kids present a given score, then the word \"genius\" is misapplied to them. Second, anyone in a skilled field has lots of experience with 'divergent thinking'; we see it all the time *in people who don't understand the problems*. I'm *not* saying that one shouldn't \"think outside the box\". I'm saying that the sheer number of variations produced is *not* what[.] valuable, and that children produce fewer and fewer \"divergent thinking answers\" because they understand more and more about the world. Example: When my daughter was five, she had lots of solutions... \"How can I change that light bulb?\" Her: \"You can fly up there, daddy. Or throw something and knock out the old one, then throw the new one up there so that it screws in. Or...\" Now: \"You could get a stick and wrap a ball of tape around it, stick it to the bulb and unscrew it that way. Or get a stepladder.\" First time, she produced several ideas, none of them useful (although all cute and amusing); second time, she produced exactly two, both potentially useful. This is because she[.] *learned more about the world*. \n\nSo while he[.] right that we need change, I just don't think the problems are all the ones he[.] identified. He[.] an art teacher - and while there[.] certainly nothing wrong with that, I stand by my statement that artists don't teach math (edit: in the same way as they teach art, and math teachers dont' teach art in the same way as math), and many kids still need to learn math. Current research shows some modifications of the system that might be valuable, but we won't pay for them - the primary two are: increase qualified staff to reduce the ratio of students to educators, and increase the qualifications of the staff (paying them more money, appropriately). \n\n"}