{"doc_id": "562", "name": "2010_10_humanities_student_major_179_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2010-10-humanities-student-major_179_Economics.txt", "pub_date": "2010-10-16T00:00:00Z", "Sentiment": "-0.016", "Subjectivity": "0.364", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "446", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c12gyhf", "Reddit_id": "c12hyay", "Subreddit_id": "t5_2qh1s", "Commenter": "[deleted]", "length": "2595", "content_scrubbed": " The fact that different respected macroeconomist cant agree on the problems or the solutions in the economy means its quite useless.\n\nor, rephrased\n\n The fact that [respected members of field] cant agree on the problems or the solutions in [issue addressed by field] means its quite useless.\n\nThis is such an obviously erroneous premise that I'm shocked the 6 people who upvoted you would take it seriously. This type of anti-intellectual reasoning is used by people in every class of society to discredit the fields they disagree with. Its only purpose is to serve as a kind of academic buyer[.] remorse for ignorance by letting you be okay with the majors you didn't pick.\n\nThe more a field touches on issues we think we know about on a day-to-day basis, the more we're tempted to discredit it and the more its inadequacies become highlighted. The social_sciences and humanities, for example, address a lot of things we act like we know a lot about: philosophy concerns arguments, political science concerns political arguments, psychology concerns human behavior, English concerns writing... yet an often criticism is that they're not 'hard' enough, or not empirical enough, or whatever--as if somehow operating on our gut feelings would be preferable. (It wouldn't, but it would at least let people believe they're righter.) By contrast, the hard_sciences (which these people tout as the ideal the social_sciences should aspire to) rarely attack issues people think they know things about or issues that affect us, so they're rarely attacked themselves--but when the hard_sciences do touch on issues that affect us, such as with climate science or evolution, you can bet that people will try everything they can to discredit the field. Rarely do people actually care how valid the methodology of the science is; they just care about how much it disputes things they think they know a lot about, and methodology is a front.\n\nThis debate reminds me of a quote from Leviathan:  *‎\"[The] doctrine of right and wrong is perpetually disputed, both by the pen and the sword: whereas the doctrine of lines and figures is not so, because men care not in that subject what be truth, as a thing that crosses no man[.] ambition, profit, or lust. For I doubt not, but if it had been a thing contrary to any man[.] right of dominion, or to the interest of men that have dominion, that the three angles of a triangle should be equal to two angles of a square, that doctrine [would] have been, if not disputed, yet by the burning of all books of geometry suppressed, as far as he whom it concerned was able.\"*"}