{"doc_id": "582", "name": "2010_10_humanities_student_major_304_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2010-10-humanities-student-major_304_politics.txt", "pub_date": "2010-10-25T00:00:00Z", "Sentiment": "0.084", "Subjectivity": "0.37", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "478", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dw8hj", "Reddit_id": "c13ezqs", "Subreddit_id": "t5_2cneq", "Commenter": "adrianmonk", "length": "2604", "content_scrubbed": "A lot of things aren't necessary in a profession.\n\nBut, speaking as someone who dropped out of college, worked in the computer biz for several years, then finished college, and went back to the same field:  college is not totally necessary for my job, but it is beneficial, and I'm better at my job due to having gone to (and finished) college.\n\nFor one thing, I learned some good shit there.  I took a bunch of fun classes directly related to my computer science major (stuff I would've wanted to do on my own anyway), and I learned a lot in those.  I *also* took a bunch of required classes that were absolutely *not* any fun (especially at the time) only because they were required for my degree, like a digital circuits class, a formal logic class, some math classes (like linear algebra), and a couple semesters of chemistry.  Turns out, I learned a lot in those and they were useful too.  In a way, they were even more useful because the degree plan covered most things a good, well-rounded computer science student should know.  Some of these things were strong areas for me and some were weak areas, and I probably would not have delved into the weak areas on my own.  (Similarly, I also took some humanities classes I never would have bothered with, and they broadened my view of the world.)\n\nAlso, college gave me a few side benefits that other people have mentioned.  I got to learn to manage multiple things at once (in an environment where if I screwed up, I affected only myself).  It was a lot of fun to be around people who were excited about the stuff I was interested in too.  I met people from all over.  In my case, after dropping out then going back and finishing with good grades (post-return), I got the pleasure of knowing I had slayed the dragon that haunted me.  Later, when I ran into a hard task, I had the opportunity to look at a daunting task and say, \"Is this harder than getting a degree?  No?  Then I can definitely do it.\"\n\nBasically, what I'm saying is that college is valuable.  Having been on both sides (employers rejecting my resume outright b/c I had no degree, even though I could do the job fine, vs. having a degree that made me look better than other applicants), I can say that were I hiring someone, I would give a bit of a preference to someone who has a degree.  I'm not going to be dogmatic about it and never consider someone who doesn't, but I don't blame employers who prefer someone with a degree.\n\nFinally, college has *been* a barrier for smart poor kids for like 200 years.  It[.] worse in the last, say, 25 years, but it[.] hardly a new phenomenon."}