{"doc_id": "578", "name": "2010_10_humanities_student_major_279_reddit_com", "namespace": "we1sv2.0", "metapath": "", "pub": "reddit.com", "title": "2010-10-humanities-student-major_279_reddit.com.txt", "pub_date": "2010-10-24T00:00:00Z", "Sentiment": "0.116", "Subjectivity": "0.547", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "545", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dvn39", "Reddit_id": "c13a9qt", "Subreddit_id": "t5_6", "Commenter": "Commander_Q", "length": "3477", "content_scrubbed": "There are two very serious problems with most current debates over teaching metrics and standardized testing. \n\nThe first is that the old tenure/seniority system is bad, and so is the system of non-standardized and asymmetrical expectations from one classroom or district to the next. Those approaches have never been a good way to do anything. Which makes almost any kind of alternative look good by comparison in a cursory review. In this respect, decades of policies that have often been backed by teachers' unions have dug their own hole. \n\nThe second problem is that teacher and student performance are very difficult to measure. And after decades of entrenched systems that are resistant to *any* sort of rigorous outside performance evaluation, the only way to implement fast \"reform\" is essentially through legislative fiat. Which tends to implement bad measures with lots of unintended consequences.\n\nIn a more competitive world, such as higher education or private schools, systems of measurement, review, and outside evaluation have evolved more organically. Unfortunately those systems are not very applicable to the most acute problems of giving all children a high-quality, publicly-funded education, since private-school students and collegians are self-selected groups, and not representative of the hardest challenges in public education.\n\nI think the core of the problem may be that teachers, particularly in the worst teaching environments, have traditionally been grossly underpaid in relation to what is expected of them. Talented minds in mathematics, science, business, engineering, and finance can usually find vastly more lucrative, prestigious, and less-demanding jobs than teaching grade school. \n\nWhich leads to a situation where the occupation is largely made up of humanities_major who might otherwise have a difficult time finding secure and stimulating work. Many of them are surely dedicated and very smart in their own right, but the teaching profession is heavily populated with people who have essentially just been in school long enough to get the big desk. \n\nThe author of the linked article meant to point out how applying metrics can breed unintended consequences, but may not realize how vividly he illustrated what a rigidly conservative and risk-averse world is the entire business of public education. When your career alternatives are restricted to, essentially, \"keep my job\" or \"lose my job\", there is massive pressure to not do anything different, which is a systemic problem in almost any industry with rigid seniority and entrenched unionization. \n\nAnd this pressure bears on principals, administrators, teachers, the whole kit and caboodle... if you'll never get rich by doing something innovative, but you'll never get fired for doing the same thing you did last year, you have to be almost pathological to take any kind of risk.\n\nUntil teachers can not only be fired for poor performance, but can also make salaries competitive with top engineers, business managers, scientists, etc, then it hardly matters what performance metrics we use, because simply cracking the whip or tightening the screws is just as apt to drive away the *best* teachers while firing the worst. You end up with a pool of mediocrities who can manage to stay above the \"get fired\" threshold, while removing the security and independence that does still manage to attract some very bright and capable people to a field where they might be under-paid."}