{"doc_id": "588", "name": "2010_10_humanities_student_major_359_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2010-10-humanities-student-major_359_philosophy.txt", "pub_date": "2010-10-27T00:00:00Z", "Sentiment": "0.183", "Subjectivity": "0.455", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "336", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c13l4yt", "Reddit_id": "c13lbdr", "Subreddit_id": "t5_2qh5b", "Commenter": "giantsfan134", "length": "1870", "content_scrubbed": "Don't think I'm completely ignorant here. I know that there are some classes/majors that are difficult for some people, but I've taken a few of the upper level (as in 400 level) psychology electives, and mostly the harder ones as told to me by psych majors (basically the cognitive psychology type classes), and got As in all of them.\n\nIn fact every time I had the highest or second highest grade in classes of mostly psych majors. Granted, I normally score about that well in my other classes, and the psych courses were not all so easy, but they were generally the easiest of my courses each time I took them. Some of them had a lot of work or I needed to do a lot of memorization, but none of them required the same level of critical thinking that many of the classes in my major (CS) or other science classes I have taken have required (basically math/physics courses). Some of my CS courses have been easier than some of my psychology electives, but for the most part that has not been the case.\n\nI know this isn't the case for everyone, and maybe I'm just really smart, or maybe I care more than most other people, or maybe there[.] something else, I don't really know. My point is that from within my experience, the humanities classes that I have taken have been easier than my math/science classes, and this makes it very easy to generalize. However I try to avoid that, because I know it can't be true, or at the very least I have insufficient data to warrant the damning generalization that humanities are much easier, but the practical reason is because if I write something off like that I will not be prepared when I run into a course that actually challenges me. I know that while psychology hasn't seemed to challenge my critical thinking abilities, there are other humanities (probably philosophy for instance) that are much more intense in that respect."}