{"doc_id": "554", "name": "2010_10_humanities_student_major_82_atheism", "namespace": "we1sv2.0", "metapath": "", "pub": "atheism", "title": "2010-10-humanities-student-major_82_atheism.txt", "pub_date": "2010-10-09T00:00:00Z", "Sentiment": "0.152", "Subjectivity": "0.413", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "323", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c11uaa9", "Reddit_id": "c11ufz1", "Subreddit_id": "t5_2qh2p", "Commenter": "[deleted]", "length": "1872", "content_scrubbed": " Because academic resources are limited.\n\nYes. I'm sure this professor of biblical history could be put to better use in the physics department.\n\n There are more important things our Universities should be financing.\n\nThe moment you begin to prioritise learning is the moment when you need to go back and do some yourself. Seriously. You can't make judgements like that because it implies that there[.] some sort of consensus on what[.] worthwhile and what isn't, and there is no way to quantify 'importance'. On the face of it you could argue that medicine is more important than the arts, because we need to survive as a race. But what[.] the point in surviving if we don't have anything to enjoy?\n\nYou could argue that defence budgets are more important than social welfare, because we need to protect ourselves and not get invaded. But what[.] the point if we're just protecting a lot of unhappy people who don't have any food to eat?\n\nYou can't quantify things like this. Whether you like it or not The Bible has been an important part of western civilisation for a very long time, and if anything you should laud people in the quasi-theocracy of America for wanting to get an objective, secular viewpoint on its origins.\n\nFurthermore, to an extent teaching at university is driven by student demand. If there aren't many people applying to read, say, Spanish, then the Spanish department gets less funding and goes into hibernation until people want to do it again. The guy says in his first video (during shopping week) \"if you can't find a seat come over here and sit in the aisles\". A lot of people are, at least provisionally, interested in learning what the credible secular consensus on Biblical history is. And quite rightly.\n\nI'm sure you won't be replying to this. Your resources are limited. There are more important things you should be doing on the internet."}