{"doc_id": "560", "name": "2010_10_humanities_student_major_131_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2010-10-humanities-student-major_131_politics.txt", "pub_date": "2010-10-13T00:00:00Z", "Sentiment": "0.019", "Subjectivity": "0.35", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "296", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c125xv1", "Reddit_id": "c126d6m", "Subreddit_id": "t5_2cneq", "Commenter": "[deleted]", "length": "1867", "content_scrubbed": "You are wrong on just about every count.\n\n\"Facilities for indoctrination\" No. Public schools, by virtue that they have to serve everyone, are the least susceptible to becoming places of indoctrination. Homeschooling and private schools, however, are allowed to choose their students and teachers according to ideology, and therefore, are prime avenues of indoctrination. \n\n\"The curriculum is not under public review.\" Absolutely false. Public school curricula are constantly being reviewed and are available to the public. Private school curricula, however, are not.\n\n\"No review increases costs.\" No real connection there.\n\n\"Discipline receives more emphasis than education.\" In order to learn, students must be able to control themselves, that is true. I doubt that you could find a high achieving school that didn't have effective discipline.\n\n\"look and feel like prisons\" Not by a long shot. \n\n\"Cafeteria food\" Doesn't relate to the quality of education.\n\n\"Medication\" Not the result of the school system.\n\n\"Acts of protest... Columbine\" Eric and Dylan did not protest against society. They were delusional and angry about being bullied, yes, but this cannot be blamed on the school system alone.\n\n\"Teachers are not there only to inform the students but also the police.\" Teachers do not have a direct line to police stations. What for? To report that Johnny spilled red paint on Suzie[.] new dress. Come on.\n\n\"Programs instructing students in the arts are routinely cut.\" Only cut because people who have influenced you have effectively argued that public schools shouldn't be funded and that at the same time, students should know the basics and that if they don't, schools will be punished with even fewer funds. \n\nCritically evaluate the sources of your ideology, and you'll find your ideas are the result of the kind of indoctrination that you think you abhor."}