{"doc_id": "567", "name": "2010_10_humanities_student_major_191_iama", "namespace": "we1sv2.0", "metapath": "", "pub": "IAmA", "title": "2010-10-humanities-student-major_191_IAmA.txt", "pub_date": "2010-10-17T00:00:00Z", "Sentiment": "0.053", "Subjectivity": "0.355", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "270", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c12l4qd", "Reddit_id": "c12l7ey", "Subreddit_id": "t5_2qzb6", "Commenter": "[deleted]", "length": "1485", "content_scrubbed": "1. I always loved science. In grade school and middle school I wanted to be a doctor. By the time high school rolled around, I knew enough doctors to know that I'd never in my life want to be one. I still enjoyed science (hated math, still do), and further developed my hatred for biology. I then thought about chemistry. I went to college, and was told to pick chemical engineering as my major (my friend told me where to go, what to study- not my decision). I hated it because there wasn't much chemistry, so I switched to material science. From there, I fell in love, then got into some research.\n\n2. Yes, aliens exist. No, I don't believe they've visited us yet, but there[.] no definite way of knowing whether or not they are watching us. Very unlikely in our own, stupid minds, but who knows- maybe we're the bacteria and they're the intelligent species?\n\n3. I do not wear thick black glasses, I wear contacts and will soon be getting LASIK (which is paid for by my awesome benefits, by the way). I just had an exam to test me out, and they [dilated my eyes](http://i. imgur. com/39Hq7. jpg) which I thought was so trippy that I took a picture. [This](http://i. imgur. com/wwxre. jpg) is what they usually look like.\n\n4. My dad is not a scientist. I'm the only one who went into a technical field in my whole family. My dad considers himself a \"ditch digger\" and my mom was a small business manager, more or less. The sibling was also artistic, and stayed in the arts. I'm the only one."}