{"doc_id": "563", "name": "2010_10_humanities_student_major_182_rit", "namespace": "we1sv2.0", "metapath": "", "pub": "rit", "title": "2010-10-humanities-student-major_182_rit.txt", "pub_date": "2010-10-16T00:00:00Z", "Sentiment": "0.183", "Subjectivity": "0.38", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "571", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ds771", "Reddit_id": "c12if0g", "Subreddit_id": "t5_2qh3x", "Commenter": "quietlight", "length": "3420", "content_scrubbed": "Ok so short story is that I took an elective every quarter and said *fuck the course chart* for my major. I was in a flexible major, so that wasn't that horrific, but it got me close to extending my graduation to finish required courses. Don't do what I did, but do have fun with your electives! It[.] your chance to wander and explore the world outside your major.\n\n\nHere[.] some of the ones I took for kicks (and how to find them in the course listing, from what I remember):\n\n* **Ceramics Elective: Wheelthrowing** (ArtCeramics) Specifically, section 70 for wheelthrowing. Thats the good one. Dirty business working with clay, but incredibly entertaining to mold something with your own hands. I made my own set of dishes, plates, bowls and cups in there\n* **Ultimate Frisbee** When I took it, it was run by one of the guys that invented the sport\n* **Swing Dance** I cant dance and I still had a great time. Gets you up, gets you moving, and gets your hands on lots of girls!\n* **Beginning American Sign Language 1** (Liberal ArtsForeign Lang) There[.] a secret club on campus that uses their own hand-code! To get in on the secret, start with ASL 1.\n* **Cultural Anthropology** (Liberal Arts Anthropology) Specifically take it with William Middleton... talk about a guy who[.] a great teacher and deeply loves his field! Also consider Anthropology of Cities if this course works out well for you.\n* **Glassblowing** (ArtGlass Courses) HARD work, but amazingly gratifying and fascinating. A little chemistry, a little artisan, a big-ass forge and beautiful results. \n* **Foods of the World** (Liberal ArtsFood Management) Great if you're someone who likes food but has never really explored the culinary spectrum.\n* **Contemporary Nutrition** (CASTNutrition Sciences) Don't knock it, nutrition is a great topic to understand. Once you see how it works generally, its a resource you will take with you for the rest of your life. Great to take especially if you have little experience with understanding nutrition.\n* **Principles of Packaging** (CASTPackaging Science) I'm a dork and found this class interesting... it[.] a history-and-design overview of the world of packaging. Something I never thought about until I took this course.\n* **Contemporary Middle_East** (Liberal ArtsHistory) I took this class with Martha Morgan and thought it was a mind-opening introduction to middle eastern culture, tradition, and politics. Dunno about who[.] teaching it now, but worth taking.\n* **Creative Writing Workshops** (Liberal ArtsWriting) Poetry, Fiction, Non-fiction. If you like to write, great place to start. \n* **The Evolving English Language** (Liberal ArtsWriting) A study of Etymology, the history and origin of words and their meanings. Nerdy class, but interesting. \n* **Fine Arts: Film Arts** (Liberal ArtsFine Arts) Mark Dupre is a great teacher for an intro film course that will give you a deeper look into how movies are constructed. There is a lot of work going on in the background that average viewers never see! Every week is a lecture and a film screening.\n* **Music** (Liberal ArtsFine Arts) We have orchestras and bands and choral groups. If you play an instrument (piano for me) and want to have some fun, go for it! Also there are a few good music history electives (note: they require some studying to pass!).\n\n\nI graduated in 09, so some of these classes may not exist anymore. Your milage may vary. \n\n"}