{"doc_id": "585", "name": "2010_10_humanities_student_major_339_books", "namespace": "we1sv2.0", "metapath": "", "pub": "books", "title": "2010-10-humanities-student-major_339_books.txt", "pub_date": "2010-10-26T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.392", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "481", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c13j5fh", "Reddit_id": "c13k0eg", "Subreddit_id": "t5_2qh4i", "Commenter": "0xab", "length": "2777", "content_scrubbed": "Your rosy view of the current state of the job market for tenure track positions is unfortunate.\n\n If you work hard, pick a non-obscure school, and PRACTICE what you learn by getting adjunct positions or internships, you'll be set.\n\nYou should look up the statistics for your field, see how many phds there are vs new tenure track positions every year.\n\n DO NOT let stupid scare tactics like this movie get to you.\n\nAbsolutely. Look at the statistics in any field. See what percentage of PhDs manage to get tenure track positions, and then what percentage actually get tenure in the end. Then compute your opportunity cost, given that you'll be working like mad for years, while you could be moving up the corporate ladder. That by the end, if you happen to not get a tenure track position you'll get to start near the bottom and those that didn't go to grad school will be your bosses. Then think to yourself how wonderful it'll be to make peanuts compared to those people while you spend 50% of your time trying to find grants.\n\n So, fellow humanities candidates and those undergraduates, DON'T DESPAIR.\n\nHumanities students! DESPAIR. PANIC! Get out. Don't get qualifications that take a decade to get and leave you with abysmal job prospects.\n\nLet me give you a quick example, 3 years old: http://www. historians. org/perspectives/issues/2007/0701/0701new2. cfm\nIn 2007 more PhDs were minted in history than there were jobs. Not tenure track positions, but jobs.\n\nFrom the article:\n\n This beneficial gap was reflected in the employment statistics of the new cohort of history PhDs. Among the new degree recipients in 2005, 56. 7 percent reported \"definite employment\" when they received their degrees. Ten years ago, just 46. 9 percent of the new PhDs reported a job in hand.\nThe proportion still \"seeking employment\" also fell to 30. 1 percent. The remaining 14 percent who are unaccounted for were either entering some kind of postdoctoral study, were still negotiating a contract, or lacked any definite plans for employment.\n\nThat is what should be called a career catastrophe, 30% of new PhDs didn't even find a job when they graduated. And this was a good year for history!\n\n DO NOT let stupid scare tactics like this movie get to you.\n\nThe movie is spot on, for basically all PhDs, not only humanities ones.\n\nBut some of us choose this because we enjoy it (although I'm an AI PhD student). But we have to be realistic, I know the stats in my field. I know that by doing a PhD I'm losing about 600k. I know that my job prospects would be better if I hadn't done a PhD. That I'd be further ahead in my career. But I'm working on one because it[.] fun.\n\nIt[.] fine to convince people that they should go to grad school, but you should be honest with them anything else is wrong."}