{"doc_id": "572", "name": "2010_10_humanities_student_major_239_ukpolitics", "namespace": "we1sv2.0", "metapath": "", "pub": "ukpolitics", "title": "2010-10-humanities-student-major_239_ukpolitics.txt", "pub_date": "2010-10-21T00:00:00Z", "Sentiment": "0.098", "Subjectivity": "0.332", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "1156", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_duegl", "Reddit_id": "c12zofh", "Subreddit_id": "t5_2qhcv", "Commenter": "[deleted]", "length": "7401", "content_scrubbed": "Response from a progressive Lib Dem:\n\nHere[.] a list of some of the policies that were in the Lib Dem manifesto and the coalition agreement. So as a progressive Lib Dem, I'm perfectly happy because:\n\nWe will introduce a Freedom Bill.\n\nWe will scrap the ID card scheme, the National Identity register and the ContactPoint database, and halt the next generation of biometric passports.\n\nWe will outlaw the finger-printing of children at school without parental permission.\n\nWe will extend the scope of the Freedom of Information Act to provide greater transparency.\n\nWe will protect historic freedoms through the defence of trial by jury.\n\nWe will restore rights to non-violent protest.\n\nWe will end the storage of internet and email records without good reason.\n\nWe will introduce a new mechanism to prevent the proliferation of unnecessary new criminal offences.\n\nWe will promote better recording of hate crimes against disabled, homosexual and transgender people, which are frequently not centrally recorded.\n\nWe will bring forward detailed proposals for robust action to tackle unacceptable bonuses in the financial services sector; in developing these proposals, we will ensure they are effective in reducing risk.\n\nWe will seek to ensure a level playing field between small and large retailers by enabling councils to take competition issues into account when drawing up their local plans to shape the direction and type of new retail development.\n\nWe will review the range of factors that can be considered by regulators when takeovers are proposed.\n\nWe will abolish the unelected Infrastructure Planning Commission and replace it with an efficient and democratically accountable system that provides a fast-track process for major infrastructure projects.\n\nWe will maintain the Green Belt, Sites of Special Scientific Interest\n(SSSIs) and other environmental protections, and create a new designation – similar to SSSIs – to protect green areas of particular importance to local communities.\n\nWe will explore a range of measures to bring empty homes into use.\n\nWe will require continuous improvements to the energy efficiency of new housing.\n\nWe will introduce stronger consumer protections, including measures to end unfair bank and financial transaction charges.\n\nWe will increase households' control over their energy costs by ensuring that energy bills provide information on how to move to the cheapest tariff offered by their supplier, and how each household[.] energy usage compares to similar households.\n\nWe will seek to spread information on which policing techniques and sentences are most effective at cutting crime across the Criminal Justice System.\n\nWe will make hospitals share non-confidential information with the police so they know where gun and knife crime is happening and can target stop-and-search in gun and knife crime hot spots.\n\nWe will review the operation of the Extradition Act – and the US/UK extradition treaty – to make sure it is even-handed.\n\nWe will maintain the independence of the BBC, and give the National Audit Office full access to the BBC[.] accounts to ensure transparency.\n\nWe will maintain free entry to national museums and galleries, and give national museums greater freedoms.\n\nWe will examine the case for moving to a 'gross profits tax' system for the National Lottery, and reform the National Lottery so that more money goes into sport, the arts and heritage.\n\nWe will look at whether there is scope to refurbish Armed Forces' \naccommodation from efficiencies within the Ministry of Defence.\n\nWe will support defence jobs through exports that are used for legitimate purposes, not internal repression, and will work for a full international ban on cluster munitions.\n\nWe will push for the EU to demonstrate leadership in tackling international climate change, including by supporting an increase in the EU emission reduction target to 30% by 2020.\n\nWe will refuse permission for additional runways at Gatwick and Stansted.\n\nWe will replace Air Passenger Duty with a per-flight duty.\n\nWe will work towards an ambitious global climate deal that will limit emissions and explore the creation of new international sources of funding for the purpose of climate change adaptation and mitigation.\n\nWe will work towards full compliance with European Air Quality standards.\n\nWe will maintain the goal of ending child poverty in the UK by 2020.\n\nWe will reform the administration of tax credits to reduce fraud and overpayments.\n\nWe will regulate lobbying through introducing a statutory register of lobbyists and ensuring greater transparency.\n\nWe will end the detention of children for immigration purposes.\n\nWe will explore new ways to improve the current asylum system to speed up the processing of applications.\n\nWe will support efforts to establish an International Arms Trade Treaty to limit the sales of arms to dangerous regimes.\n\nWe will explore alternative forms of secure, treatment-based accommodation for mentally ill and drugs offenders.\n\nWe will urgently review Control Orders, as part of a wider review of counter-terrorist legislation, measures and programs. We will seek to find a practical way to allow the use of intercept evidence in court.\n\nWe will prioritise dementia research within the health research and development budget.\n\nWe will establish five-year fixed-term Parliaments. We will put a binding motion before the House of Commons stating that the next general election will be held on the first Thursday of May 2015.\n\nWe will bring forward a Referendum Bill on electoral reform, which includes provision for the introduction of the Alternative Vote in the event of a positive result in the referendum, as well as for the creation of fewer and more equal sized constituencies. We will whip both Parliamentary parties in both Houses to support a simple majority referendum on the Alternative Vote, without prejudice to the positions parties will take during such a referendum.\nWe will fund a significant premium for disadvantaged pupils from outside the schools budget by reductions in spending elsewhere.\n\nWe will help schools tackle bullying in schools, especially homophobic bullying.\n\nWe will ensure that all new Academies follow an inclusive admissions policy. We will work with faith groups to enable more faith schools and facilitate inclusive admissions policies in as many of these schools as possible.\n\nWe will increase the personal allowance for income tax to help lower and middle income earners. We will further increase the personal allowance to £10,000, making real terms steps each year towards meeting this as a longer-term policy objective. We will prioritise this over other tax cuts, including cuts to Inheritance Tax.\n\nWe will reform the taxation of air travel by switching from a per-passenger to a per-plane duty, and will ensure that a proportion of any increased revenues over time will be used to help fund increases in the personal allowance.\n\nWe will seek ways of taxing non-business capital gains at rates similar or close to those applied to income, with generous exemptions for entrepreneurial business activities.\n\nWe will make every effort to tackle tax avoidance, including detailed development of Liberal Democrat proposals.\n\nWe will review the taxation of non-domiciled individuals.\n\nWe will ensure that public funding mechanisms for university research safeguard its academic integrity."}