{"doc_id": "548", "name": "2010_10_humanities_student_major_44_reddit_com", "namespace": "we1sv2.0", "metapath": "", "pub": "reddit.com", "title": "2010-10-humanities-student-major_44_reddit.com.txt", "pub_date": "2010-10-05T00:00:00Z", "Sentiment": "-0.007", "Subjectivity": "0.331", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "370", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dnb0l", "Reddit_id": "c11hqu8", "Subreddit_id": "t5_6", "Commenter": "bigkr88", "length": "2075", "content_scrubbed": "I'm a 5th year senior at a public university, which happens to be my third college i've been at.  My first, a private university, ended up being a disaster for me after I found myself deep in depression.  Ended up in a community college for a bit, then went to a public university, which resulted in me losing about a year worth of credits.  \n\nNow, I'm an econ major in the arts and sciences school; the business school wouldn't take me because i didn't have a qualifying gpa; lets ignore the fact that i didn't have a gpa period, and that it was because of the business school that the college wouldn't take any of my 300-level courses from the community college.  \n\nI've just bombed 2 midterm tests, I can't withdraw without leaving a mark on my transcript, I have had a different advisor every semester I've been in college which results in me getting conflicting advice, and now I'm scared shitless that if I don't graduate by the summer, I won't have the money to graduate at all.  My parents are well off, but the recession hurt us as much as it did for anyone, and they've been putting my brother and I through school.  I wanted to try to earn my own way through college, but attempting to do so resulted in the aforementioned depression and subsequent mental breakdown.  I'm a completely average middle class caucasian male who has no interest in being a teacher, and my parents make too much money for FAFSA, so my choices are the soon-to-be-destructive student loans or nothing.\n\nAnd even if I do pull out of this newest tailspin, and I can feel the depression and the mental breakdown coming again already, even if I do graduate, i'm worthless in the job market.  I'll be a jerk with a bachelors degree in economics that has no relevant work experience, and I can't take the high-end math courses that people keep advising me to take for grad school because this and next semester are booked with 18 hours a piece of 400-level econ courses that I have to have to graduate.\n\nTL;DR: completely uninteresting econ student realizes he is utterly and completely fucked."}