{"doc_id": "558", "name": "2010_10_humanities_student_major_118_self", "namespace": "we1sv2.0", "metapath": "", "pub": "self", "title": "2010-10-humanities-student-major_118_self.txt", "pub_date": "2010-10-11T00:00:00Z", "Sentiment": "0.035", "Subjectivity": "0.255", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "635", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dpuu6", "Reddit_id": "c121ky7", "Subreddit_id": "t5_2qh96", "Commenter": "[deleted]", "length": "3405", "content_scrubbed": "I took 7 years to get out of my undergrad, partially because of what you're describing. I changed majors several times, and went to 3 schools, not counting one-off courses at 2 others, and a year abroad. I felt lost. I didn't know what I was doing.\n\nI zipped through my master[.]--complete with thesis--in a year and a half.\n\nHere[.] what I found: My problem as an undergrad was that I kept expecting this to *mean* something. This is college, right? The glorious end of one[.] education? The pinnacle of achievement for all one[.] years of hard labor, starting from the time one was 5 years old? But all I'm doing is sitting in a room with halfwit frat boys accusing the teacher of having a \"gay agenda.\" I kept moving, hoping that it would be different with a different major or school, but it never was.\n\nAre you in the liberal_arts? If so, that might be your problem. Those classes *are* meaningless. --And that[.] from a guy with a BA in literature (there was more in there that was better, but it[.] a long story as to why that[.] what is on my diploma). That[.] also from a guy who teaches the same kind of classes to university students now. It[.] fluff. Devoid of value (luckily I teach it as a means to learn English language, which is meaningful).\n\nWhether you're studying bullshit or something real, though, here[.] what you need to do: Finish. Just get it done and over with. It[.] not going to suddenly become really rewarding or anything. Don't bother waiting for that.\n\nMy master[.] has been much more useful and was more interesting, but it still wasn't what I'd call \"rewarding.\"\n\nNext: You are working too much.\n\nI know what you're going to say: \"My rent! My food! I'll be homeless!\" Sorry, but you just need to make a choice. Do you want to finish school, or do you want to have income? If the job is more important to you, quit school now. You can't do it.\n\nSo many times I see students trying to do what you're doing. It never works. In fact, it pisses me off a bit as a teacher because it[.] clear that this person thinks my classes are so easy that they can just do them in their spare time. \n\nSchool is a full-time job. Work no more than 20 hours a week. I actually quit my jobs to finish my undergrad for my last semester. I had to work through my MA (but the work was related), and couldn't get out of it for my last semester, and that delayed my thesis by a couple months--a couple months of sitting in my apartment reading and writing. You can't do what you're doing. You're trying to do your homework when you have time. You need to be working when you have time. In my case, that meant taking out a bigger loan at the end and just living on it.\n\nI paid off all my schooling a couple years out of school (people who take forever are paying the interest and a tiny piece of the principal every month--just go balls to the wall and hand them most of your paycheck until it[.] gone--it'll be fast, because you'll be mostly putting it on the principal).\n\nAre you sleeping? I bet you're not. \n\nLook, you're not 18 anymore. It[.] remarkable how much you change, physically, from the time you started college to when you're getting out. Your schedule is too much, man, too much, too much. Without a clear, well-rested brain, everything takes longer and longer, and looks harder and harder. *Sleep.* I guarantee it[.] not as bad as it looks.\n\nYou can do this, but not the way you're going at it now."}