{"doc_id": "574", "name": "2010_10_humanities_student_major_251_reddit_com", "namespace": "we1sv2.0", "metapath": "", "pub": "reddit.com", "title": "2010-10-humanities-student-major_251_reddit.com.txt", "pub_date": "2010-10-22T00:00:00Z", "Sentiment": "0.162", "Subjectivity": "0.372", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "363", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c132m3c", "Reddit_id": "c132pi7", "Subreddit_id": "t5_6", "Commenter": "[deleted]", "length": "2015", "content_scrubbed": "It is a bit of a chicken and the egg problem.  Having a large pool of talented workers spurs industry, as it lowers cost.  This means, by necessity, that those workers don't earn great wages.\n\nI don't think it[.] incumbent upon employers to create jobs for college grads.  Rather, I think it[.] incumbent upon prospective students to ensure that they have a goal in mind when attending university.  Part of the solution to this is a realization on the part of parents that going to college for college[.] sake is not always a good choice.  Another part of it is a refactoring of our education system away from a feeder system for colleges, where the \"failures\" go on to do manual labor, and towards a system that encourages students to pursue ambitious, though realistic goals.\n\nI know plenty of people whose degrees I question the value of.  I know plenty more who are getting a liberal_arts degree, with no thought as to what they will do after graduation.  That sucks, and it[.] a product of the mentality I described above.  That[.] not to say that a Liberal Arts degree can't be great, simply that there are only a few types of people who should be getting such a degree.\n\nBasically I look at it like this:\n\n1) You were the popular kid who wasn't great at school  - Business  \n2) You were the jock who wasn't good enough to be drafted - Vocational  \n3) You were the ambitious kid who was good at school - Law/Medicine  \n4) You were the nerd who was really good at what you did - Engineering/CS  \n5) You were the nerd who was nerdy, but not brilliant - Something else.  \n6) You were the creative type who didn't see the point of school - Fine Arts  \n7) You were the History/Literature nerd - Liberal Arts  \n\nThe fact that more than half of college students are doing liberal_arts is shameful.  It[.] reflective of a system that exists solely to extract money from students.  There simply isn't a demand in the market for sociology or art history majors.  We should stop pretending that these are viable career paths."}