{"doc_id": "592", "name": "2010_10_humanities_student_major_409_economy", "namespace": "we1sv2.0", "metapath": "", "pub": "economy", "title": "2010-10-humanities-student-major_409_economy.txt", "pub_date": "2010-10-31T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.424", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "287", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dywhs", "Reddit_id": "c13zcuf", "Subreddit_id": "t5_2qhpn", "Commenter": "yesmanapple", "length": "1732", "content_scrubbed": "The statistics in this article were rather useless. It really all depends on what those 17 million people studied.\n\n\nI think we can all agree that, financial concerns aside, getting a degree and educating yourself can really enrich your life (with business being a possible exception to that). That being said, how much room is there for business and humanities_major? Just because our society pumps out thousands of people with these degrees doesn't mean that we even need, or have positions, for them.\n\n\nIf college is primarily about producing competent workers and academics, I think the American university system is backwards. We artificially push tens of thousands of students through a system with huge loans, although most of them won't become academics, and the economy cannot accommodate the rest. Learning is a noble pursuit, but people should not cling to the idea that a college education entitles them to a cushy job.\n\n\nIf you realize this, and are getting a degree because companies won't look at your otherwise, I empathize for you. If you believe that America needs your business degree, I'd suggest you open your eyes to reality.\n\n\nThis article does touch upon a serious issue, though. I hate to sound bigoted here, but as a math/science major, I think society is wasting its scientists. We have a lot to offer to academia, industry and society, and America needs to create jobs for its scientists before it complains to its high schoolers about poor math scores. Science and technology are what propel society forward. Unlike the humanities, where a collection of gifted writers and thinkers produce most of the works we enjoy, thousands of scientists need to work on a problem to see considerable improvement. \n"}