{"doc_id": "551", "name": "2010_10_humanities_student_major_52_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2010-10-humanities-student-major_52_AskReddit.txt", "pub_date": "2010-10-06T00:00:00Z", "Sentiment": "0.141", "Subjectivity": "0.356", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "309", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c11kmvn", "Reddit_id": "c11kt5s", "Subreddit_id": "t5_2qh1i", "Commenter": "ballpein", "length": "1807", "content_scrubbed": "you didn't say you ask people about their fields, you said you ask them what they're planning to do after graduation, not out of curiosity, but because it \"boggles (your) mind how many people seem to be getting degrees in industrial basket weaving history or some such and have no plan for what to do in the real world.\"  Which I find a little smug, not to mention narrow-minded.  Maybe you mispoke, and that[.] fine, but don't please don't get pissy at me for taking what you wrote at face value.\n\nYou are partly right to argue that the idea of going into debt to study any field is relatively modern, and it is also fairly specific to the US.  Affordable post secondary eduction and broad access to scholarships is still the norm elsewhere.  Therefore the idea that education is a commodity, and only of value in terms of monetary return on investment, is also a new one.\n\nThe first modern American research university was Johns Hopkins, which is based closely on the Humboldtian model.  Humboldt[.] idea for the university put a big focus on research, required all students to have a strong foundation in the humanities (philosophy, history, literature, the arts).  This stems of course from the Aristotelian idea that education is vital to good citizenry (an idea that has always been at the heart of the concept of the university).  From here comes the tradition that doctors and lawyers take a degree in the humanities prior to specializing.   The modern university, then, was designed to make students into good citizens before making them into doctors and lawyers.  Of course today, you can get through many degrees with only a few credits of study in the humanities, and this too is novel, a practice which brings universities closer and closer to becoming trade schools.\n\nedit: spelling and grammar."}