{"doc_id": "584", "name": "2010_10_humanities_student_major_310_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2010-10-humanities-student-major_310_politics.txt", "pub_date": "2010-10-25T00:00:00Z", "Sentiment": "0.148", "Subjectivity": "0.361", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "366", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c13f5u8", "Reddit_id": "c13fi18", "Subreddit_id": "t5_2cneq", "Commenter": "ACSlater", "length": "2095", "content_scrubbed": "DON'T EVER GO THERE. Your friend is lucky and an exception.\n\nI went there for 3 semesters around early 2000s. It sounded great on paper, take classes on managing networks (administration, protocols, programming, security). Awesome, everything I like and no bullshit humanities classes. They tell you they have people that find you jobs for $30-40k+ after an associates for two years. Ok cool, sign me up...\n\nOk, the classes are bullshit. Anyone who shows up gets an A basically. ITT is for-profit and publicly traded. They make sure students don't get disillusioned and quit because they have bad grades, otherwise they lose money. The teachers are basically hit or miss and even the good ones rarely give a fuck about what you learn. Computers were constantly \"not working\" and you'd end up having to share a computer in lab with someone else. Which brings me to classes. The textbooks suck, you can find better books in non-broken English on Amazon and do MIT open courseware for free. Otherwise if you ever learned a programming language, and know anything about computers at all, the first two semesters are a total joke. The teachers are often business majors teaching IT courses, of which they know little about and only follow the curriculum of the text book for grading and information. \n\nMost of the students don't give a fuck about anything because they buy into the fact that they're passing their classes and are guaranteed a good paying job when they're finished. Most people that go there are looking for a shortcut, not an education, which only gives their student body[.] worth a worse reputation than it would have already had.\n\ntl;dr: ITT sucks. I could go on and on but no one will probably ever read this so I will cut my time and stop.\n\nEDIT: I forgot to mention the \"recruiter.\" You know the person/people that tell you they find you a job? Ok well the recruiter admitted to me that she just goes on websites like monster and then emails links to the students for what she thinks they're good for. Also there were a lot of rumors she was sleeping with some of the students. "}