{"doc_id": "544", "name": "2010_10_humanities_student_major_5_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2010-10-humanities-student-major_5_AskReddit.txt", "pub_date": "2010-10-01T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.252", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "1817", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dlqe1", "Reddit_id": "c114x4j", "Subreddit_id": "t5_2qh1i", "Commenter": "indecision88", "length": "9558", "content_scrubbed": "Spending 12 weeks with the most beautiful girl I've ever seen in psychology tutorial and never having the balls to ask her out. It[.] been more than a year since I've seen her.\n\nI once told a female friend and she told me to look for her. Yeah, fat chance with a university of 50,000 students.\n\n____________________________________________________________________________________________\n\nEDIT: Wow, I didn't expect lots of support and advice from Reddit. Thanks guys. It[.] best that I give the full story.\n\n\nI started university in July 2009. I was in Bachelor of Arts and my degree was pretty flexible as I could choose whatever courses I wanted to do in the first year. I knew I wanted to major in English Literature but I also wanted to do another major too. So the choice was either International Relations or Psychology.\n\nSo for the first semester in my first year, I took up two English junior courses (a prerequisite to do senior English courses) and one junior Psych course and one junior IR course. So far so good.\n\nFirst week of uni started and everything went well (minus the hectic rush to change class schedule, get course readers, textbooks, finding lecture halls etc.) Second week rolled in and tutorials begin. My psych tutorial was my very first tutorial. I was very, very nervous partly because I had a three year gap between high school and university (had to do mandatory service) and partly because I'm sort of an introvert. But university was a new start, and I was in a foreign country so that means no one knew me at all. So I put on my game face and went to my tutorial.\n\nSince it was our first tutorial for the semester, the tutor made us to a round of introductions i. e. telling the class our names, what degree we were in and where we came from etc. I think I must have been so focused on acting nonchalant that I wasn't actually paying attention to anything that my classmates said.\n\nFast forward to the next few weeks. I think it was around Week 3 or 4 when I actually started to notice her. We only have tutorials once a week and our tutorials only last for an hour. Even then, during tutorials we rarely talk because the whole class would usually be discussing about the concepts taught in the previous lectures and the tutor never divide the class into small groups (as if that would help). So that was one reason why it took me so long to notice her (and also because I'm one blind fucker).\n\nAnyway, I digress. I remembered the first time I took notice of her. She came into tutorial slightly late and it just so happened that where I was sitting was facing the door directly. When I saw her walking in, cliche as it sounds, it was definitely love at first sight. I fell hard and fast. The whole time during tutorial I was thinking \"fuck, 3 weeks in tutorial and I never realized there was such a beautiful girl in my tute.\"\n\nHer eyes. God, her eyes. My friends always asked me what attracted me to girls and I always mention a girl[.] eyes. This girl[.] eyes, although it was incredibly blue, it was not just the colour that attracted me. It was the intensity in it, the clarity, I don't know, there was just some sort of magnetism. The way she walked and carried herself was incredibly graceful. I once mentioned this to a friend and told him that she might be a dancer. Know what he said? \"Maybe she had some spinal injury and have a metal rod in her spine.\" It may sound far fetch but there[.] some truth in it, not once did I see her slouch. Not once.\n\nSo begin my infatuation with her.\n\nAnd the next 9 weeks of indecisiveness.\n\nI spent many weeks debating whether I should ask her out on a date or for some coffee (even if I seldom drink it). But I was an insecure fuck. The last time I asked her girl out was in middle school and that was because I was forced by circumstances (half the school found out that I like her). I can spend six days building up the courage, thinking \"you can do it!\", go to the tutorial with brimming confidence, and see her and just lose it.\n\nI don't know if it is my overactive imagination, but I did think she was slightly interested in me. Once, I was sitting across her (our class have a conference table) and was just staring at her without realizing it. She caught me and smiled back. I did return her smile (I'm not that socially inept) but didn't follow up after tutorial. Another time, I was sitting on the floor outside class with the rest of my classmates. We were waiting for our tutor. I think I was tired so I took a quick nap. A few minutes later, I felt somebody standing beside me. I opened my eyes and saw a pair of feet a few inches from me. Cue elevator eyes and it was her standing beside me. Again I did nothing. Didn't try to strike up a conversation with her. Nothing. Zilch.\n\nWeek 12 came. I was getting kind of desperate. Very desperate in fact. It was the last week of lectures and tutorials. After that was our STUVAC (or study vacations), then came the final exams, then the holidays. I knew it was my last chance to ask her out even though it was extremely late. I told a friend over MSN what I was going to do. I spend so much time overanalyzing the situation that he told me to STFU and just give him updates once the event was over.\n\nSo I went for the last week of tutorial. We did the usual discussion about the previous lectures, had some talk about the exams and at the end of the tutorial, our tutor gave back our essays and said that if anybody wanted to discuss the essays with her, we could do it after the tutorial. This was my break.\n\nThe girl stayed behind, so did I. I flipped through my essay, acting as if I had something to ask the tutor. But then things started to get awkward. There were only four people in the class. The tutor, me, the girl and her friend.\n\nThe girl and her friend were sitting opposite me and both were discussing about their essays. I was actually waiting for the girl to leave the tutorial so I could ask her. But with me sitting there and staring at my essay for the past 5 minutes, it was getting more and more awkward. In the end, I just packed my stuff up, said goodbye to the tutor (I think she had a knowing smile on her face) and walked out of the door, never to see the girl again.\n\nOh, I did saw her at the exam hall though. She was sitting opposite me (again!) and I nearly failed because I spent most of the time looking at her. But an hour before the exam ended, she finished early and left. And that was the last time I saw her.\n\nI spent the next few months regretting my stupid, stupid mistake. I told my brother the whole story and he said I was a fucking idiot but at the same time, he told me to just learn from that mistake and move on. I didn't listen. I told him that I wanted to give it another shot next semester (even though my chances of meeting her were slim). When my brother and I flew to Vietnam to holiday, we meet up with a friend. I told the friend about my situation and she gave me the advice of searching for her, regardless of the fact that my university is a huge one.\n\nSo that[.] what I did. During the next semester, I spent the first two months looking for the girl, but I never found her. I did bump into a few of my classmates from the Psychology tute but since we rarely socialize or speak to each other outside class, I didn't ask them about the girl.\n\nI took up another junior Psychology course. I was kinda hoping that I bumped into the girl during lectures, never mind the fact that there were over 1000 students in first year Psychology. I never met the girl again. To make matter worse, my new Psychology tutorial was located in the exact same room. Sometimes I would stare at the chair where she used to sit, only to get a dirty look from the guy or girl sitting there (sorry, wasn't trying to ogle at you).\n\nI never did find her again.\n\nI think there was a few reasons why I never find her. First, I enrolled into university halfway through the academic year. So while I was still in first year, she would have moved onto second year. Which means different classes. Another reason is she might be an exchange student. I mean, even though my university is so big, I still bump into my classmates from that Psychology tute every now and then. Yet, I have not seen her since. Third, I belong to the Arts Faculty and she could be in another faculty. Yes, there are some course where it crosses faculty but then, chances of meeting her are slim.\n\nAnyway, halfway through the new semester, I woke up and realized I was beating myself up over a stupid mistake. Yes, I did regret it and yes it was a mistake. But I realized I needed to move on, stop being such a wuss and just go out there and enjoy the world.\n\nSo that[.] what I'm doing now, enjoying the world. I was never socially inept, just more of an introvert. But I'm having fun with my life now (a bit too much fun, my academic life is taking a bit of a hit) and if I meet her again, well, kudos to me. If not, then this is just one of life[.] experiences. I do feel some twinge of regret every now and then but I'm over it now.\n\nEpilogue: People asked me to search for her on Facebook using her name. The thing is that I suffer from hearing disability (lost 50% of my hearing in both ears) and she is quite soft-spoken, so I never got to hear her name properly. I did try to figure out her name when I was signing in on the attendance sheet but I couldn't get the_right name. As for Facebook, I once did a search through my university network, went through 20 pages before I gave up.\n\ntl;dr: read the first four sentences."}