{"doc_id": "576", "name": "2010_10_humanities_student_major_271_reddit_com", "namespace": "we1sv2.0", "metapath": "", "pub": "reddit.com", "title": "2010-10-humanities-student-major_271_reddit.com.txt", "pub_date": "2010-10-24T00:00:00Z", "Sentiment": "0.103", "Subjectivity": "0.416", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "522", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c138zcq", "Reddit_id": "c1392ch", "Subreddit_id": "t5_6", "Commenter": "Bradnon", "length": "3079", "content_scrubbed": "Don't be so defensive; I'm far more friendly with math and science myself so if I posted something that deserved that sort of response, I would be ashamed of myself.\n\nThat being said, we seem to agree on equations being tools and problem solving skills being the application of those tools. Both are necessary. However, I made no statement as to the relative value of either, and you're responding as if I called established formulas worthless. They're definitely not; it is our responsibility to stand on the shoulders of giants. \n\nAlso: that the arts can't be quantified in the short term, although I don't see where I didn't say that so I don't see why you're trying to convince me of it[.] validity. However, in the same paragraph you kowtow to every educational administrator above the classroom level: Progress needs to be quantifiable, and an unquantifiable subject is therefor not worth teaching. To those administrators' credit, their hand is forced by federal legislation.\n\nIn an attempt to understand that ideology, my best guess at the present is a flaw in the idea you brought up that problem solving skills can be taught by practicing the standard fare of problem solving in math and science classes. The problem is that in that problem solving practice, the standard routine is to be given a set of algebraic equivalences, or a diagram from which they are easily derived, and manipulating enough algebra to arrive at a verifiable answer. This is very easy to systematically test at the end of the semester, but teaches very shallow problem solving techniques.\n\nThe second sort is where you start with nothing. Literally the creation of something new. This is really hard to do in math and science courses because, at the high school level, everything they're learning was discovered 2-3 centuries ago and they're just forming a foundation for college study. The simplest solution to solving the problem of providing students an easy place to practice their creativity is in an art class. As you say, it[.] very difficult to prove this notion on a year to year basis because the effect is only seen by the time college rolls around and the complex projects they're eventually assigned require the mind to analyze the problem and determine what is required to solve the problem instead of following the same axioms and formulas as they have in the past to arrive at a numerical answer. \n\nI still don't feel this is the best explanation of my position, but it[.] the best I've got at 4 AM. I need to go to sleep and return to this interesting discussion later. \n\nBut, before I do that, in case you haven't seen it: [This TED talk by Dan Meyer](http://www. ted. com/talks/dan_meyer_math_curriculum_makeover. html) is an interesting proposition on how to improve math education itself by increasing the focus on problem solving instead of specific formulas. Again, those need to be taught but far more practice needs to be given to actual problem solving. To be fair, this doesn't apply so much to a thesis of knowledge or anything, but to the status of education in the US. "}