{"doc_id": "565", "name": "2010_10_humanities_student_major_188_ireland", "namespace": "we1sv2.0", "metapath": "", "pub": "ireland", "title": "2010-10-humanities-student-major_188_ireland.txt", "pub_date": "2010-10-17T00:00:00Z", "Sentiment": "0.16", "Subjectivity": "0.263", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "368", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c12jjif", "Reddit_id": "c12kibp", "Subreddit_id": "t5_2qhb9", "Commenter": "cmereahwancha", "length": "2081", "content_scrubbed": " For French, German and the rest it[.] the same argument. If you've no interest in going to France or Germany or working in those languages then they're not that relevant to you.\n\nYes, this was the view of plenty people in my class at school. Others knew they were destined for arts and humanities courses and put the science subjects on the back burner. In the interest of providing a well rounded education they government really needs to better incentivise taking a wide range of courses.\n\n As for dissecting the English curriculum, literature should still be studied as it[.] an important facet of an important subject.\n\nI agree. I'm not in favour of abolishing that at all. I'm just saying the argument that \"I won't use this in college/work/etc\" is as much an argument against literature as it is against learning Irish. Most people won't use their knowledge of either but the subjects still have merit anyway.\n\n I agree that a broad education is valuable to society but making Irish optional does not lessen that. It allows students to focus on a spectrum of their own interests rather than on a spectrum of yours.\n\nThe government has a duty to act in the best interests of the country even if that involves making unpopular decisions. Protecting our culture and heritage is arguably an important part of that.\n\n Making Irish optional in schools also does not lessen the value of the language.\n\nI think the number of speakers of Irish would decline if it was made optional. Let[.] face it school is where the majority of people pick up the cupla focail. I would be surprised if the number of people taking Irish in my class at school, had it been optional, would have been above even 25%. If the number of people learning Irish drops then it stands to reason the number of people capable of speaking would drop over time too. At some point that number would become critically low and measures would have to be taken to prevent its extinction (or not depending on the mood of the country). So I think if it was made optional it would eventually have to be made compulsory again."}