{"doc_id": "570", "name": "2010_10_humanities_student_major_228_redditoroftheday", "namespace": "we1sv2.0", "metapath": "", "pub": "redditoroftheday", "title": "2010-10-humanities-student-major_228_redditoroftheday.txt", "pub_date": "2010-10-20T00:00:00Z", "Sentiment": "0.242", "Subjectivity": "0.392", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "322", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c12x47s", "Reddit_id": "c12x9um", "Subreddit_id": "t5_2rftz", "Commenter": "[deleted]", "length": "1912", "content_scrubbed": "the doctor said there[.] really not anything effective that can be done about it as of yet. i told him i viewed it as vestigial evolutionary programming for some humans to have had a nocturnal sleep cycle to keep guard from sabre-tooth tigers and the like at night. i\n\nExactly! I sort of assumed this on my own, but it[.] exactly true, and I think it coheres with a few other traits - fondness or acceptance of long periods alone, longing for the peacefulness of the night time, fascination with stars and astronomy, vigilance and diligence. At least those all appear related in my own character certainly.\n\nAnd it is genetic - they have the genes decoded for early rises and night owls, they know which combination of genes controls for general sleep preference.\n\nregarding the first discourse, do you think rousseau really believed it or just wrote it to be contrarian and stand out so he'd win the prize?\n\nIf you follow the tradition begun in the 20th century by [Ernst Cassirer](http://en. wikipedia. org/wiki/Ernst_Cassirer) with his books, *The Question of Jean-Jacques Rousseau* and *Rousseau, Kant and Goethe* he argues that Rousseau[.] writings, while paradoxical, are consistent and contiguous. If you pay careful attention to the *Discourse on the Arts and Sciences*, you can see in embryonic form, every single major theme he pursues throughout the rest of his life. Basically, although it is highly rhetorical, it[.] a compressed compendium for almost all his later thought. So in that sense, I do believe he was being sincere - and had good reason for it! :)\n\nthe crown suits you well, a real philosopher-king! thanks for expanding my philosophical horizons with all your outstanding contributions to reddit.\n\nThanks so much, that[.] a very wonderful thing to say - I try my best to help like-minded people find fine things to keep their brains occupied when I can! very glad to know that people enjoy it."}