{"doc_id": "580", "name": "2010_10_humanities_student_major_289_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2010-10-humanities-student-major_289_Economics.txt", "pub_date": "2010-10-24T00:00:00Z", "Sentiment": "0.111", "Subjectivity": "0.437", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "838", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c13azwb", "Reddit_id": "c13b9ug", "Subreddit_id": "t5_2qh1s", "Commenter": "[deleted]", "length": "4870", "content_scrubbed": " This kind of tenor to the dialog about public funding of academia is intensely depressing. Firstly, people seem to vastly underestimate the value of pure research. Academia is pretty much the only place where people investigate problems which do not have an obvious and immediate economic payoff - and that is invaluable, because without expanding basic knowledge, society stagnates.\n\nBut all capital that goes towards research is capital that doesn't go elsewhere.... as such we need to weigh the research against these opportunity costs. In other words, it[.] not enough to simply say that research can lead to good things... it[.] all a function of, \"compared to what?\" You are not the only person on the planet who sees the payoff from research I can assure you. Those who finance research are well aware that it MAY not turn into something profitable but they do continue to finance it because they see it being profitable even though it may only prove to be something useful a small percentage of the time. That risk of it not always working out is factored into their decision when they agree to finance something. I think the whole reason why many aren't a fan of publicly funded research is that this money is being taken through taxation and many of these individuals might instead rather have that money not be taken from them because they'd like to spend it somewhere else. It[.] also quite self-serving for those who work in the research industries or related industries to try and tax as much money from the people as possible to put towards research. Many people think that just because you're in research doesn't mean you don't have to earn the funds by pleasing someone voluntarily, just as a baker must earn your money to sell his bread, he can't ask the government to tax a bit from everyone and then pay for bread production that way. Long story short, I don't think you should be at all depressed that many might not want research funded through coercive transactions instead of voluntary ones.\n\n Secondly, it seems as if people are falling into the same trap when thinking about universities that they have fallen into with public schools. We seem to be obsessed with trying to quantify education, as if it were some kind of interchangeable commodity which schools produce. Education is a service, and what the individual student gets out of that service is the result of a complex interaction between the interests and learning style of the student, and the faculty, culture and procedures of the college.\n\nMany aren't saying that it[.] not complex. I completely agree it[.] incredibly complex and can't be quantified such that there is an \"obvious right path\". Most businesses work this way. There[.] no way to know for sure whether an idea will work out or not, or whether you'll end up being able to earn enough wealth to replace all the wealth that was consumed by embarking down that particular path. This is where the profit and loss pricing mechanism can come into play. It allows one to get some very real feedback on just whether or not they're using up our limited resources in ways that the general public finds as \"worth it\".\n\n There is simply no good way of quantifying what each professor contributes to that arrangement. Maybe that professor who teaches one course a term and brings in few grants is a great collaborator, and because of his presence a lot of other excellent faculty stay in the department who might be otherwise tempted to move elsewhere. No metric will ever be fine enough to account for something like that.\n\nCompletely agree, but that doesn't really solve our problem of having to decide what resources go where and should we put more or less to that particular end. Ultimately we will have to make those decisions and I agree that they're often having to be made based on information that ultimately can only be processed by a human being trying to determine if it[.] \"worth it\". Again, this is where the profit and loss mechanism really shines.\n\n Our increasing hostility towards the humanities, and our obsessive focus on quantifying learning have the potential to kill American academic culture. If being a university professor becomes more and more like being a high school teacher or community college prof, the kind of bright minds we currently attract to faculty positions will simply look elsewhere for employment.\n\nI don't know why you think people are hostile towards the humanities in particular, but ultimately I think the level of hostility that will go towards education in general is going to be a function of how much of it is being financed through coercion. The fact that it[.] education isn't really even the meat of the issue. If people had large parts of each of their pay check being taken away to finance bread production then I would expect for lots of hostility to grow towards bakers as well."}