{"doc_id": "573", "name": "2010_10_humanities_student_major_240_foodforthought", "namespace": "we1sv2.0", "metapath": "", "pub": "Foodforthought", "title": "2010-10-humanities-student-major_240_Foodforthought.txt", "pub_date": "2010-10-21T00:00:00Z", "Sentiment": "0.269", "Subjectivity": "0.495", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "525", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c12zmqa", "Reddit_id": "c12zr49", "Subreddit_id": "t5_2rete", "Commenter": "jstevewhite", "length": "2943", "content_scrubbed": "Huh. My daughter is far more engaged in creative tasks by our public school than I was in the 60s and 70s. *MUCH* more so, not just a little bit. \n\nPerhaps you're referring to high schools, though, rather than grade school. You may have a point. I fully support restoring 'the arts' to our secondary curriculum, but this isn't a major change; it[.] fundamentally restoring a type of study, and doesn't address any of Sir Robinson[.] complaints *at all*. When I was in high school, one had several options for art classes (I was the rare art-and-math geek; took sculpture, drawing, photography, along with Chemistry, physics, and calculus... LOL) that ranged from photography to sculpture. I don't know what it[.] like now, but I suspect NCLB has done those courses in.\n\nWe need people of all kinds in our society, and if we systematically teach children that we only value certain people, we'll end up with a great deal of unhappy, less productive people as a result.\n\nI'm all about encouraging children[.] artistic vision. But, not to put too fine a point on it, there will be slots for a lot more 'drones' than 'butterflies', as it were. I'm not making a normative statement, I'm making an observation about possibilities. It[.] valuable to encourage children to *both* develop their artistic talents and urges *and* learn math and computers and history and the like. Knowing something about art can certainly enrich the life of a computer programr, and knowing something about history and math can certainly enrich the life of an artist. People are general purpose entities. \n\nI absolutely agree that I want my children to be successful, but I want them to be successful on their terms. The best way I can see to do that is to cater to their strengths, and to let them grow into the people they were meant to be rather than the people we want them to be.\n\nI agree wholeheartedly with the sentiment - I just want my child to be happy and successful on their terms. But we don't *really* mean it. If you want to find out, ask yourself it you would be happy with your child[.] choice if he or she *decided* to be a drug addict and prostitute, and said *that* was what made him/her happy... Or a con man/woman, or bank robber, or gun runner... Or if your child displays a great talent and desire for violence... you probably get my point.\n\nWe all have visions for our children; scenarios we consider \"successful outcomes\" and scenarios we consider \"unsuccessful outcomes\". Any parent that doesn't *prepare* their child for a 'fall back' path is doing their child a disservice. I tell my daughter - who still changes what she wants to be on a regular basis (she[.] nine) - if you want to be an actress, *fine*; just learn math, too, in case that doesn't work out. She may not *want* to learn math (she[.] actually very good at it, but hates it anyway), but I'll do my best to make certain she does, even while I encourage her to draw, sing, and dance."}