{"doc_id": "569", "name": "2010_10_humanities_student_major_199_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2010-10-humanities-student-major_199_AskReddit.txt", "pub_date": "2010-10-18T00:00:00Z", "Sentiment": "0.001", "Subjectivity": "0.301", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "293", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dsvqt", "Reddit_id": "c12nj54", "Subreddit_id": "t5_2qh1i", "Commenter": "cockypig", "length": "1750", "content_scrubbed": "In some ways, every hour every day. By their nature, academics are never not working - they're quite literally paid to think and share their products with the world - but this is not \"in-this-room, in-that-chair work\" in the way you traditionally think of it. It does not require sitting in that small office somewhere in the humanities building. (This excludes people working in the hard_sciences where work takes place in special labs and facilities.) Academic work is very much a personal effort - and time spent in the library, at home, or at some other relevant site in the community or elsewhere is just as much work as is being present in the office. Don't make the most common mistake in the world concerning perceptions of academics. With the exception of community colleges and a select number of small liberal_arts colleges, teaching (typically the only part of a professor[.] workload students realize exists) is no more than 25-30% of a professor[.] assigned duties.\n\nIt[.] just like going to visit your physician - you don't just show up. If you need to meet with your professor, go during schedules office hours or make an appointment yourself.\n\nA good analogy: how many hours does your local TV news station anchor work? He reports the news. His news casts are on maybe 90 minutes per day. So does he run around telling his friends, \"hey, I only work 90 minutes a day?\" Same thing goes with people who think professors just teach. False. You just don't see 90% of their job.\n\n[If you're interested more in negative perceptions of the professoriate, check out this article.](http://chronicle. com/article/Why-Do-They-Hate-Us-/124608/)\n\nTL;DR - The typical academic[.] job is a lot more complex than most people realize. Make an appointment."}