{"doc_id": "552", "name": "2010_10_humanities_student_major_53_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2010-10-humanities-student-major_53_AskReddit.txt", "pub_date": "2010-10-06T00:00:00Z", "Sentiment": "0.049", "Subjectivity": "0.34", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "261", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c11kr6o", "Reddit_id": "c11kx0x", "Subreddit_id": "t5_2qh1i", "Commenter": "ballpein", "length": "1753", "content_scrubbed": "we're getting off track now, but it[.] interesting this comes around to philosophy, since that seems to be amongst the most maligned degrees in terms of of application and employability.  This is mostly a completely false notion.  Philosophy teaches one to think critically and creatively, and it turns out that this skill is applicable in most fields and sought after by most employers.   Interestingly, it seems that [philosophy grads make the best law students, and are amongst the most employed university grads:](http://www. thereitis. org/?p=637):\n\nThe University of Virginia[.] Office of Career Planning and Placement reports in \"A Comparative Study by Major of Law School Admission Test Performance,\" that the average LSAT (Law School Admissions Test) score for a philosophy major at that school was approximately 15 points higher than the average for any other major. In addition, the American Medical Association conducted a study in which they found philosophy majors had the third highest acceptance rate into American medical schools. York University investigated philosophy major[.] performance on the GRE (Graduate Record Examination) and also found philosophy majors performed an average of 5% better than the average. In the verbal portion of the exam, philosophy majors scored higher than all other fields, including English. The quantitative portion of the GRE is historically where humanities_major do poorly, however philosophy majors still performed higher than social science majors with the exception of economics.\n\nAs the American Philosophical Association reports, only 2. 3% of philosophy majors were unemployed, based on National Research Council data for 1995. That[.] less than half the national unemployment rate at the time. \n\n"}