{"doc_id": "575", "name": "2010_10_humanities_student_major_263_compsci", "namespace": "we1sv2.0", "metapath": "", "pub": "compsci", "title": "2010-10-humanities-student-major_263_compsci.txt", "pub_date": "2010-10-22T00:00:00Z", "Sentiment": "0.014", "Subjectivity": "0.3", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "305", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c133ioc", "Reddit_id": "c135if1", "Subreddit_id": "t5_2qhmr", "Commenter": "doliorules", "length": "1900", "content_scrubbed": "Seriously.\n\nIt[.] not really surprising that an expert in one subdiscipline of mathematics might have trouble upon first encountering another. Does knowing about differential equations automatically make abstract algebra a breeze? No. Will you be using lots of differential equations in abstract algebra? No. Is abstract algebra math? Yes. (It also arguably has more connection to computer science than differential equations tends to.) It[.] also not surprising that a person who had been practicing in one area for years would consider that area easier than someone who had just started in it.\n\nAlso, if understanding recursion requires knowing about stack frames, it[.] a wonder that Goedel and Church, among others, were able to do it before computers with stack frames were invented.\n\nEdit: To be a bit less harsh, I don't think it[.] entirely the author[.] fault. The general education requirements in US (at least) universities share the blame. From what I've seen, we expect even humanities_major to learn some chemistry, physics and the like, and to that end, we also have general math requirements that are exclusively calculus-related. But that[.] just a corner of the whole math tent, and it isn't the corner that[.] especially related to things like computer science (although it has it[.] uses even there). \n\nIf you have the impression that calculus is all there is to post high school mathematics, then computer science doesn't look like math. And one can even get that impression as a computer scientist, because, as the article mentions, you take the same calculus courses, and then a supplementary discrete math course that no one else takes. But computer science has connections to other branches of math, like algebra and category theory, topology, and of course, mathematical logic (proof theory, model theory, ...). You just won't see those topics unless, _maybe_, you're a math major."}