{"doc_id": "590", "name": "2010_10_humanities_student_major_377_travel", "namespace": "we1sv2.0", "metapath": "", "pub": "travel", "title": "2010-10-humanities-student-major_377_travel.txt", "pub_date": "2010-10-28T00:00:00Z", "Sentiment": "0.084", "Subjectivity": "0.332", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "509", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_dxfav", "Reddit_id": "c13owif", "Subreddit_id": "t5_2qh41", "Commenter": "hangoneveryword", "length": "2754", "content_scrubbed": "Spent a semester there myself a couple years ago. First off, in what part of London will you be living? What are your interests/what are you studying? Where are you coming from? (America? I don't want to assume.) Female/male? Do you know anybody there already?\n\nI don't think anything I say will be terribly life-changing for you, but here goes:\n\n* Learn buses. Love buses. Live buses. The Tube is actually fairly limited if you're trying to get around within London (or maybe it just seemed that way to me, since I was coming from NYC, where you're never far from a subway stop). Plus, the Tube shuts down around midnight. Buses are the way to go - literally.\n* London[.] massive - again, public transportation isn't always readily accessible. Comfy, sturdy walking shoes are a must.\n* If you're at all into the arts, London has one of the best theater scenes in the world (again, this is coming from someone who lives in NYC). There[.] a lot of innovative and interesting stuff going on in the theater there. The West End musicals are fine, but go to the National Theatre.\n* Yes, it[.] expensive. Cook - it'll save you a lot of money that you can spend on other, more interesting things.\n* That said - Fryer[.] Delight, on Theobald[.] Road. If I had to choose my last meal, their fish & chips would be it.\n* When you've settled in, just take an afternoon and wander around your neighborhood. It'll help you get your bearings and maybe you'll discover a hidden gem - a cafe, park, whatever. I lived off Farringdon Rd, and for me it was Exmouth Market, a lovely little pedestrian market with a farmers market and a nice cafe where I used to study when I needed a change of scenery.\n* If you're planning on getting a phone there instead of using your regular phone, go to Carphone Warehouse and get a cheapo pay-as-you-go phone.\n* There[.] tons of great stuff just a bit outside the city - Hampstead Heath, Camden Market, and Greenwich are all Tube/DLR accessible, and Oxford and Cambridge are a short train ride away and make great day trips. Don't be afraid to venture outside your comfort zone.\n* Nail down your banking details before you get there - find out if your home bank has an affiliate bank in the UK to minimize fees. I had HSBC at the time so I was able to use their ATMs in the UK without fees. \n* If you want to travel and need help booking your trip, I can't recommend STA highly enough - they helped me and four friends book an eight day trip through Italy (hostels, trains, & planes) for free. (This particular branch was in the student union of the University of London, I don't know if they're all free.)\n\nI had a fantastic time when I was there, and I'm happy to answer any particular questions you might have - feel free to PM me!"}