{"doc_id": "556", "name": "2010_10_humanities_student_major_102_programming", "namespace": "we1sv2.0", "metapath": "", "pub": "programming", "title": "2010-10-humanities-student-major_102_programming.txt", "pub_date": "2010-10-11T00:00:00Z", "Sentiment": "0.053", "Subjectivity": "0.26", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "457", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c11yj63", "Reddit_id": "c11za6p", "Subreddit_id": "t5_2fwo", "Commenter": "FilthyRedditor", "length": "2526", "content_scrubbed": "I referenced the \"true programrs use ed\" joke on a youtube video, and this guy who clearly doesn't even know what ed is comes along, gets pissed at me and says this:\n\nWhat do you mean by true programrs? These are just languages. Everybody nowadays knows how to program. I've seen medicine students writing code. Knowing how to program (say in C or C++) by itself gives you nothing. It[.] just a way to express other knowledge such as Maths or Physics and it really doesn't matter what editor you use. I've seen people program in Windows and do it much better than some guys who consider themselfs \"hackers\" i. e. what I call computer-monkeys.\n\n\nI mean outside the myriad of data structures, computer science algorithms, design patterns, and low level hacks I use (which I doubt most of which your medicine students have even heard of), I also have to use heavy math/physics knowledge in my specific area of digital signals processing, as well as computer graphics/vision. And if it were the other way around, ie some math whiz with a \"LEARN C IN 20 DAYS\" book took my place, I doubt there would be a usable, or even working program at all.\n\nYeah sure you could spend a month with your Programming for Dummies, google some code, and turn in your copy+pasted piece of shit, but it'd be no different that trying to publish a fantasy novel written by a math student. Hell, it[.] even worse:  I remember the last time an incompetent programr (or an arrogant physicist who assumed he could program as well as any other) wrote the code for a guided interceptor missile, it missed its target and people died due to a common floating point error. \n\nAnd the \"It[.] just a way to express other knowledge\" is bullshit. It[.] like going up to a film director and saying \"film is just a way to express the words of a writer, any writer can do it\". I could be just as much of an ass and say that math and physics are just mere tools for those of us who apply the knowledge to the real world (ie engineers and programrs), but I don't.  And despite all the times I've made fun of liberal_arts majors, I think there[.] merit to having expertise in any and everything. Any domain of knowledge, no matter how trivial, will always evolve into a field whose scope and complexity cannot be easily used by outsiders. Unless of course, you want to forget that scope and single out the bum on the street holding the sign that says \"knows HTML, will code for food\". which of course can also be replaced by \"knows calculus, will integrate for food\".\n\n"}