{"doc_id": "898", "name": "2011_11_humanities_student_major_1225_occupywallstreet", "namespace": "we1sv2.0", "metapath": "", "pub": "occupywallstreet", "title": "2011-11-humanities-student-major_1225_occupywallstreet.txt", "pub_date": "2011-11-27T00:00:00Z", "Sentiment": "-0.051", "Subjectivity": "0.329", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "250", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c334n1e", "Reddit_id": "c3350z1", "Subreddit_id": "t5_2sn7r", "Commenter": "[deleted]", "length": "1445", "content_scrubbed": "Questions: Do you think that advertising has a pervasive impact on the way Americans think and behave? Why are you even here if you haven't developed at least some resistance to it? \n\nI've got shit that has seeped into my brain because of commercials. Who doesn't? But that doesn't mean I have to like it. Call me a snob if you want, but the fact is I got some fairly good instruction on critical thinking thanks mainly to a few really good teachers who thought that was important. \n\nAnd we all know our education system is in trouble. It[.] geared toward turning people into workers. One of the common strawmen anti-OWS people keep throwing out is, \"Stupid protester got a degree in LIbrary Science or Philosophy and bitches he can't find a job.\" \n\nThe message is that education should be purely vocational. All those liberal_arts courses that teach critical thinking are worthless in this society. Which is bullshit. A healthy society should want people with those skills, and have room for careers that support those skills.\n\nCall it brainwashing or call it something else, but you know we are all groomed to be consumers from the first Cap'n Crunch commercial we see as children. Little kids are growing up thinking Geico is a TV show. \n\nI'm not better than those people, but I'm also not fighting with people at Walmart over Chinese-made consumer products. The corporations that run this planet are training us. How else do you interpret it?"}