{"doc_id": "855", "name": "2011_11_humanities_student_major_711_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2011-11-humanities-student-major_711_AskReddit.txt", "pub_date": "2011-11-12T00:00:00Z", "Sentiment": "0.084", "Subjectivity": "0.336", "Score": "155", "Upvotes": "155", "Downvotes": "0", "Wordcount": "861", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2zc71x", "Reddit_id": "c2zcnwd", "Subreddit_id": "t5_2qh1i", "Commenter": "sven_forkbeard_1013", "length": "4904", "content_scrubbed": "The night of Joe Paterno[.] firing, most of us were still trying to wrap our minds around what was going on. Most people were mad that Joe Pa was fired while Spanier resigned and Curley is still employed, and that the Board of Trustees themselves are hardly innocent in this. I realllllly did not agree with the riots, and a lot of the people *at* the riot were not students. But seeing someone you respect dethroned is terrible, even if it[.] for a good reason. I view the people trying to save JoePa even though he did something regrettable in the same light as JoePa trying to save Sandusky even though he did something heinous-- we are struggling to comprehend the magnitude of this case, and that is *really fucking difficult to do, especially short-term.*\n\nI am from State College, so this whole week has affected me and other townies so much more than even other PSU students. I grew up with these idols not only as respected figures, but as neighbors. I've known the Curley kids since kindergarten. I did leadership training at the Second Mile. I grew up on the Penn State campus--and replying PENN STATE! to WE ARE has been instinctive forever. Sandusky went to my friends' church and we all have Wheatie boxes of JoePa around our houses. Devastation barely covers it: to find out that people you deeply respect, who cultivated the Grand Experiment, built the library where I work, and funded a liberal_arts fellowship program that offsets my tuition, were essentially a mirage of contradictions is fundamentally destabilizing. It[.] a breach of trust that shatters (and this is not hyperbole) your identity. And we are building that identity again from the ground up, without people we thought were its basic building blocks. And that[.] why it is **not** supporting child abuse to say, hesitantly at first, WE ARE PENN STATE. Because there[.] no changing the fact that we are. But we can take this opportunity to look inside, better ourselves, and change the world in spite of Sandusky. We are more than a football program, more than the administration. We are the students and alumni. We are half a million mostly lovely people. And try to understand how we feel-- take your outrage, multiply it by three, add a loss of identity and security, add intense sorrow for the victims (you forget that the victims are also our neighbors and friends) and multiply that whole shebang by the volume of hate speech directed towards the Penn State community. Not only are you bleeding and crying, you're being kicked in the stomach because you were standing nearby when a fight broke out.\n\nIn a funny way, I'm drawing parallels to two other situations. One is the *Laramie Project.* The other is postwar Germany. From what I've read and from the Germans I've talked to (all history professors) Germans feel very strange taking pride in being German in any arena except for football/soccer. Because the rest of the world thinks that saying, loud and proud, I am GERMAN! means being proud of the Nazis. This is how we feel at Penn State. I am proud of Penn State because we are a wildly successful academic university, not because of the football, and DEFINITELY not because I in *any way* excuse child abuse. I was the boys' ages when they were being violated, and I knew those men at the time. How on earth could I be complacent? How could anyone, even if they aren't from here?  \n\nPenn State will never be the same after this, but it will be for the better. We will grow. We will open conversations about abuse so we can do our utmost to prevent it from happening again. We will continue to be academically excellent. We will still and forever be Penn State, even if Sandusky has dragged our name through the mud. But we, the majority of the students, refuse to be tarred and feathered by the media because of the gross mistakes of a few men and the administrative coverup. We are more than Jerry Sandusky, Joe Paterno, Graham Spanier, Tim Curley, Mike McQueary, and Gary Schultz, not to mention the many others who probably knew. You forget you're talking to the university whose student-run philanthropy raises $10 million a year to fight children[.] cancer... we are NOT apathetic. I hope you saw the candlelight vigil. Everyone on campus has been crying all week. We are Penn State... and we are sorry. But try to look at it through our eyes--through the eyes of 18-22 year olds, no way of knowing the truth before a week ago, looking up to these community leaders, and now fearing for job security, safety when traveling, losing internships, and the value of our degrees. We care the most about the kids, but no one is pretending it[.] not going to have an enormous effect on us, too. \n\nI'm sorry for writing so much. Hopefully you understand a little bit better now... this is traumatic for us all, and quite literally the longest, most painful, and probably in the long run most formative week of my life. "}