{"doc_id": "850", "name": "2011_11_humanities_student_major_596_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2011-11-humanities-student-major_596_college.txt", "pub_date": "2011-11-09T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.4", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "861", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_lw6d6", "Reddit_id": "c2yl0gf", "Subreddit_id": "t5_2qh3z", "Commenter": "kolobian", "length": "5087", "content_scrubbed": "I graduated with a degree in history (and double minor in political science and philosophy) with the aspiration of going to law school. I interned at a law firm, applied to law school, got accepted, but ultimately chose not to pursue a law degree because the legal market for baby attorneys right now is *horrible*, and I don't want the lifestyle of an attorney. Ultimately I chose to pursue a similar but less expensive, and less time consuming path: paralegal.  I'm not saying don't go to law school or find a new path, but I am recommending you *really* think twice before going to law school.\n\nLaw School is one of the worst choices right now. The legal market is seriously horrible right now-- [there[.] no jobs out there.](http://online. wsj. com/article/SB10001424052748704866204575224350917718446. html)  I know quite a few people who graduated law school 2 years ago and can't find a full time job as an attorney. It[.] a major problem all across the country. Some students are even [suing their schools](http://online. wsj. com/article/SB10001424053111904823804576500694179259396. html) because they feel that they were lied to about the job market and entry level salaries.  Even the American Bar Association is now [discouraging students from applying to law school](http://www. outsidethebeltway. com/aba-telling-college-students-dont-go-to-law-school/)\n\nThe legal market has been severely hit and law firms feel it. Older attorneys aren't retiring (there[.] a couple at my building who are over 80 and still working!), law firms are cutting jobs (sometimes in favor of hiring more paralegals, as we can do a lot of the same stuff for much cheaper), they are paying less  (but you're still expected to work just as much or more) etc. Moreover, tuition continues to rise at an alarming rates-- students are having to take out about 70-100k in [student debt](http://www. outsidethebeltway. com/aba-telling-college-students-dont-go-to-law-school/)  (assuming they didn't have any in undergraduate). The law graduates I know who haven't found work in the legal field are  now having to start paying on their student loans, but without an attorney job, are returning to low wage jobs at starbucks, pizza places, etc.  \n\nMoreover, outside the market for attorneys being horrible, the job is stressful and burdensome of time. All the attorneys I work with or know, including the ones I speak with from other suites in the building, tend to work at least 60 hours a week. Baby lawyers often work 80--and I'm not exaggerating. It[.] more common at the large firms, but even the medium sized ones seem to be putting extra pressure on the attorneys. This might be why attorneys have one of the highest rates of [depression](http://www. abc. net. au/worldtoday/content/2007/s1904332. htm)  \n\nThis isn't to say being an attorney can't be a rewarding job that you love. Many are wealthy and happy. Just make sure when you are considering this path that you are also looking at the negatives, and definitely be considering the reality that it might take a long time for you to find an attorney job and that you'll have a ton of debt. Law School can't be a \"well I got a liberal_arts degree, what should I do? Oh I guess I'll go to Law School\". It used to be that, but not anymore-- you must KNOW that you for sure, unquestionably, that you WANT to be an attorney, that you are aware of the negatives, that you are okay with the debt, lack of jobs, but willing to go anyway, etc. \n\nThat said, if you do decide you want to go to law school, here[.] some tips:\n\n1) While there[.] a lot you have to submit to law schools, the most important is your LSAT. You need a good GPA, of course, but the LSAT is the MAIN determining factor. If you just had an \"okay\" GPA but a great LSAT score, you're have a greater chance of getting into law school then a student who has a 4. 0 and an okay or low LSAT score.**So if you want to go to law school, you must start preparing for the LSAT right now**. Don't wait until after you graduated. Don't just think you can cram for in the summer and take it the following fall. \n\n2) Take a logic course. This not only will help you immensely on the LSAT, but it'll help in law school too because it helps you understand how to better construct and deconstruct arguments.  \n\n3) The other major key determining factor in law school admissions is your admissions essay, so you'll want to spend a great deal of time working on this. They tend to have 1000[.] of applicants and only 200 spots open, so after they weed out people with too low of scores they'll primarily look at the admissions essay to determine whether they'll accept you. \n\n4) You'll need 2-3 solid recommendations from professors, so start building rapport with your professors right now (if you haven't already). \n\n5) If you can, intern at a law office for awhile. It'll give you an idea what it[.] like to at a law office, and it'll look nice on a resume (and even help on the personal statement)\n\nAgain: I'm not trying to be a downer, I'm just being honest about the state of the legal field. Either way, good luck :-)"}