{"doc_id": "901", "name": "2011_11_humanities_student_major_1262_mlplounge", "namespace": "we1sv2.0", "metapath": "", "pub": "MLPLounge", "title": "2011-11-humanities-student-major_1262_MLPLounge.txt", "pub_date": "2011-11-28T00:00:00Z", "Sentiment": "0.03", "Subjectivity": "0.292", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "313", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mrusr", "Reddit_id": "c33fcfq", "Subreddit_id": "t5_2t403", "Commenter": "[deleted]", "length": "1671", "content_scrubbed": "Why not? I'm bored.\n\n* This morning, I was bleary eyed and drowsy even after two cups of coffee. Why the hell did drink anti-histamine tablets this morning of all times?? Anyway, it[.] been a chill day.\n\n* Janelle Monae[.] \"Tightrope\".\n\n* See above\n\n* Nah there[.] nothi---AHH SPIDER GET IT OFF GET IT OFF\n\n* IT'S ON YOUR CHEST NOW FUUUUU\n\n* I had generic cheerios, which I believe they just call honey o[.] at Aldi[.]\n\n* Years ago, I used to play Wolfenstein: Enemy Territory. And I was decent enough in the game to get 99% accuracy in shooting. I wonder what those guys I shot down would think had they known the \"asshole\" who just killed them was a 12 year old girl?\n\n* Omnivore for sure. I like my meat and vegetables equally. Also, red is my favorite color.\n\n* I'm good at grasping complex problems and finding efficient solutions to them. (so not paraphrased from a personality test or anything. herp derp derp).\n\n* Mental illness\n\n* Dude, I could write a book about this.\n\n* Volume 2 of _Why not to call strangers \"Dad\" and follow them around the store_\n\n* Red belt in tae kwon do, and back in my hay days, I was apparently a natural at horseback riding. Is that bad ass enough? I'm not the most interesting woman in the world.\n\n* Definitely not Ponyville after seeing how horrendous their safety standards are. Canterlot for sure.\n\n* I've always wanted to build a robot pet and bring it to my dorm to freak out the girls on my floor. I'd just take it out of my pocket randomly at lunch and let it roam around the dining hall so the engineering majors can ogle at it and be jealous that a science and former humanities major beat their asses at programming and design. "}