{"doc_id": "861", "name": "2011_11_humanities_student_major_795_getmotivated", "namespace": "we1sv2.0", "metapath": "", "pub": "GetMotivated", "title": "2011-11-humanities-student-major_795_GetMotivated.txt", "pub_date": "2011-11-14T00:00:00Z", "Sentiment": "0.091", "Subjectivity": "0.306", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "1008", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mcmu4", "Reddit_id": "c2zvreh", "Subreddit_id": "t5_2rmfx", "Commenter": "tinyevilmaster", "length": "5668", "content_scrubbed": "I graduated HS in 2006. I had no clue about anything. College education meant nothing to me. How did everyone know which college to go to? Fortunately, I had good grades, and was instantly admitted to a random liberal_arts university at the last second in 2006. I subconsciously decided I wanted to become an electrical engineer.\n\n Two years passed and it was now 2008, I finished all my general courses. Lots of mistakes were made. I didn't know why I was taking unnecessary classes, and I didn't know about the ability to drop out of failing classes. My GPA became <3. 0. Why did I even fail classes in the first place? Well, five years later, 2011, I finally figured it out, but let me finish my story first. \n\nI finished two years of college education, and wanted to become an EE. I decided to transfer to a public research institute. It was easy-as-pie. Unfortunately, more shit happened after I got there. I wasn't ready to become an engineer. I knew shit about math. Regarding the ethnic courses I had to take, I had moral issues: why was I being made to memorize boring ass random shit about recycling chemicals, when I didn't understand the basics of a circuit? Basically, even though I was easily passing that ethnics course, I still dropped out. I didn't feel good about memorizing stuff that I didn't care about. My first semester as an EE ends, and I'm a wreck. Let[.] just say I didn't enjoy anything, so I skipped a lot of classes (there was also a problem with my eyes, but that[.] a different story). I felt like shit and wanted to stop learning.\n\nBoom! I get dismissed. It[.] now 2009. I have a chance to get back, re-take some of my failed classes, etc. Guess what? I did jack shit and failed again! Honestly, I deserved it. I didn't feel like I was worth a salt. Then, I got another chance IF I take a semester at a community college. Now this is where it starts to become more positive for me. I'm just going to summarize: I ended up enjoying my CC classes (they were EET + Calc III). I didn't do perfectly amazing, but FUCK I GOT A PERFECT SCORE + ALL EXTRA CREDIT right on my test. I didn't even do much studying. All I had to do was participate in-class. Amazing! \n\nThat semester at CC ended, and now I'm back at the big-boys' institute. I did amazing at CC, so what could go wrong? Nope. I still didn't give a damn and ended up failing. Let me just add that I was still missing a certain passion (that and the problem with my eyes which I'm about to fix). Alright, it[.] 2010 now. I'm a big failure at this college education thing. I got dismissed from the big-boys' institute, I can't ever come back. GPA <2. 0. I feel like shit an\n\nTime for plan B. COURAGE WOLF GIVES NO FUCK ABOUT LOW GPA. I decide I'm going back to CC. Got credits transferred. Got my eyes' problem fixed. My GPA is back to 3. 0 now. I became more interested and tried to participate in-class 24/7. I did well, but not as well I liked. But still B+ and A is fucking better than F[.]. Not only that, all my courses provide lots of time for hands-on, unlike colleges that mostly teach lectures. Anyways, I'm grateful for the hands-on, because I made a shit load more mistakes, and I managed to actually learn from this time (because obviously the hands-on experiment won't work correctly if you don't do it correctly).\n\nAlright, that semester passed (sorry if my timeline is a little off). THIS semester. I have PERFECT grades. All A[.] on my tests. I barely need to study for my upcoming midterm, because I've been actually participating and teaching (more like explaining problems) classmates material. I'm actually loving explaining how you do calculations and how everything is derived -- no settling for memorization. Basically, I feel like I actually learned something, and it[.] fun. It does not feel in any way like a chore. \n\nTHERE'S MORE: \nHow has this affected my life?\nCurrently, I'm spending my free time improving my math (re-reading everything that I had to memorize, and I'm actually understanding the meaning behind all those theorems); improving my electronics' understanding (The Art of Electronics by P. Horowitz); eating better; exercising better;  and exploring more (The Demon-Haunted World by C. Sagan). I will have an AAS degree with a 3. 0 GPA, have the ability to do work experience, and have the option of getting a 4-or-5 year degree. Did I mention I have no debt, and all my current classes are free?\n\nNow why did I fail all of those classes that resulted in my dismal GPA? What changed me from being someone who skips classes and memorizes everything to someone who is not afraid of tests anymore and can feel confident about teaching material?\n\nAnswer: Explore. Whatever you're having trouble with, it[.] not because of you. It took me many mistakes before I found something good. What do you like? If it[.] science or mathematics, then you need to find someone to show you why they love their job (sadly, I don't think there are many professors that do that). The reason shouldn't be memorizing formulas or following instructions.  Go read \"The Demon-Haunted World\" by Carl Sagan.\n\nSchool isn't supposed to be about GPA. Getting A[.]; having that 4. 0 GPA won't fill you. You're still growing. I don't think a good suggestion would be to \"study harder.\" You're in college. You should be exploring all your possibilities (I know everyone says this, but you need to do this). This does not necessarily mean to change your major. For me, it was as simple as changing my learning environment (actual caring teacher, hands-on learning approach).\n\nIf anything, LOOK AT THAT TINYEVILMASTER GUY! HE'S BEEN IN SCHOOL FOR 5 YEARS AND DOESN'T HAVE A DEGREE YET!"}