{"doc_id": "822", "name": "2011_11_humanities_student_major_175_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2011-11-humanities-student-major_175_politics.txt", "pub_date": "2011-11-03T00:00:00Z", "Sentiment": "0.132", "Subjectivity": "0.33", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "363", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2woheq", "Reddit_id": "c2woj7t", "Subreddit_id": "t5_2cneq", "Commenter": "kingvitaman", "length": "2232", "content_scrubbed": "[Doctor Shortages don't exist](http://www. healthbeatblog. org/2007/11/does-the-us-hav. html)\n\nAs to your second point I don't necessarily disagree. In most of Europe (Where I am) your major is chosen at around age 15, and college is a focus based system where you don't have to take a humanities class in order to get an engineering degree (these were done in high schools which actually have standards). The larger point I'm making is that the jobs which are hot right now (mainly engineering) are also being rapidly outsourced to countries which are aggressively pushing these areas of study (China graduated a million engineers last year, a recent job search for 260 high tech positions garnered 26,000 applicants, of which [10,000 were Phds](http://money. cnn. com/2010/07/29/news/international/china_engineering_grads. fortune/index. htm) ). What I'm saying is that the engineering jobs which are being touted currently as the pathway to success may be as outdated, and competitive as making a living as a University philosophy professor in years to come. That[.] because the larger issue at play is that the US doesn't protect or respect American jobs overall. So in a decade a chemical engineer may be making your latte since all those jobs will have gone to India and China. Much in the same way that we turned the city which birthed the modern automobile industry into a post apocalyptic wasteland. \n\nAs to how should people who choose to study Art_History, and how they should be rewarded. I'd say that they are already being rewarded as we see that by just graduating from college with any degree greatly increases your chances of making more money. Is this fair? Maybe not. But if a company has a choice between someone with a BA in communications, and someone without (both have no job experience) then they'll pick the one with the degree. Much talk happened when the PayPal founder said that college was becoming meaningless (he himself a Stanford grad, with a BA in philosophy). When asked how many people work at PayPal who don't hold a college degree he was stumped, and couldn't answer. That[.] because college degrees are a tool which all employers use on applicants with little to no work history as to what they know. "}