{"doc_id": "845", "name": "2011_11_humanities_student_major_513_philosophyofscience", "namespace": "we1sv2.0", "metapath": "", "pub": "PhilosophyofScience", "title": "2011-11-humanities-student-major_513_PhilosophyofScience.txt", "pub_date": "2011-11-07T00:00:00Z", "Sentiment": "0.126", "Subjectivity": "0.396", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "945", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2xygz1", "Reddit_id": "c2xyj7j", "Subreddit_id": "t5_2r7mh", "Commenter": "ObsBlk", "length": "5869", "content_scrubbed": "A caricature of his opinions is this: a science, say astronomy, is dominated for a long period by a \"paradigm\" such as Ptolemy[.] theory that the sun and planets revolve around a stationary earth. Most work is on \"normal science,\" the solving of standard problems in terms of the reigning paradigm. But anomalies-results the paradigm cannot explain-accumulate and eventually make the paradigm unsustainable. The science enters a revolutionary phase as a new paradigm such as Copernicus[.] heliocentrism comes to seem more plausible. Defenders of the old order, who cannot accommodate the change and usually cannot even understand the concepts in which it is expressed, gradually die out and the new paradigm is left in control of the field. Then the process repeats. According to the summary in Francis Fukuyama[.] End of History,\n\nThe cumulative and progressive nature of modern science has been challenged by Thomas Kuhn, who has pointed to the discontinuous and revolutionary nature of change in the sciences. In his most radical assertions, he has denied the possibility of \"scientific\" knowledge of nature at all, since all \"paradigms\" by which scientists understand nature ultimately fail.\n\nAs with many caricatures, one finds that the original consists of the caricature with the addition of a number of qualifications; the qualifications render the original inconsistent, and the author[.] subsequent denials that he had said anything so radical increase further the number of inconsistencies. One observes also that the caricature has a historical career considerably more vigorous than the original, whose qualifications would have lessened its appeal. Besides its simplicity, the caricature makes the story of science into one of the simple emotive plot-lines that literary folk find so engaging. It is the story of the Morte d'Arthur, of the peaceable order and its aging king, their virtue undermined by internal corruption, falling to the challenge of the vigorous and bloodthirsty young challenger. The plot made Frazer[.] Golden Bough a literary hit decades before, with its stories of tribal chiefs displacing one another with extreme prejudice, and even persuaded the humanities world to take an interest in the doings of Red Deer, among whom the transfer of harems between dominant males is conducted on similar principles. Kuhn[.] success is also an instance of the enduring appeal of theomachy, a mode of explanation which worked so brilliantly for Marx and Freud, and, long before, for Homer. What was previously thought to be a continuous and uninteresting succession of random events is discovered to be a conflict of a finite number of hidden gods (classes, complexes, paradigms, as the case may be), who manipulate the flux of appearances to their own advantage, but whose machinations may be uncovered by the elect to whom the key has been revealed.\n\nFurther reasons for Kuhn[.] success are not hard to find. He gave permission to anyone who wished to comment on science to ignore completely the large number of sciences which undeniably are progressive accumulations of established results-sciences like ophthalmology, oceanography, operations research, and ornithology, to keep to just one letter of the alphabet. That certainly saved a lot of effort. Kuhn[.] theory also had a special appeal to social_scientists. Political scientists, sociologists, and anthropologists recognized Kuhn[.] picture of disciplines putting the accumulation of evidence to the background while bringing to the fore fights about theory; they were delighted to hear that what had previously been thought an embarrassment was the way it was done in the most respectable sciences. Kuhn even offered something to massage the egos of natural scientists themselves. It might seem at first glance that his claim that most scientists are drones was insulting, but there was a good reason why it was met with the same equanimity one notices in fundamentalist religious circles at the news that only 144,000 are saved. The damned may be a majority, but of course they are other people; every scientist had 30 the opportunity to cast himself as a revolutionary hero of a new paradigm, shamefully ill-used by the establishment. Kuhn[.] rhetoric incorporated a few further successful ploys, in that \"paradigm\" was undoubtedly a cute technical term, as technical terms go, and the phrase \"normal science\" had just the_right hint of superciliousness towards the worker bees who are credulously doing the hard_work of science. Kuhn[.] work was the perfect Sixties product, and, since he managed to publish it in 1962, his success was inevitable-indeed, as the philosophers say, overdetermined.\n\nAt a more logical level, Kuhn[.] success depended on certain ambiguities. Even in the caricature above, it is clear how some were essential to Kuhn[.] plan. What does \"unsustainable\" mean when said of a scientific theory? In particular, is it a matter of logic or of psychology? If it means that there are a number of observed results that would be unlikely if the theory were true, then one is back in the realm of logic, of the bad old philosophy of science that studied the relation of evidence to hypothesis. Naturally, Kuhn is not keen to emphasize that direction. But if \"unsustainable\" is a purely psychological matter, a kind of collective disgust by a salon des refuses of younger scientists who simply think their elders are too smug, then it is impossible to see why it should have any standing as science. If the old theory is not broke-if its predictions are true, for example, and its explanations coherent-why fix it? Whatever there is to be said for a pure appetite for novelties in the art world, there is no scope for it in science. There, the difficulty of attaining the truth means no one is inclined to pointless exercises in throwing away pearls attained at great expense. "}