{"doc_id": "865", "name": "2011_11_humanities_student_major_829_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2011-11-humanities-student-major_829_RPI.txt", "pub_date": "2011-11-15T00:00:00Z", "Sentiment": "0.231", "Subjectivity": "0.436", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "269", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mdnv9", "Reddit_id": "c3030ai", "Subreddit_id": "t5_2rg3u", "Commenter": "ihearthumanities", "length": "1494", "content_scrubbed": "Before expanding departments I think more attention needs to be paid to what we already have. Sure, it[.] great that things like EMPAC and ECAV are being built, expanding the reach of RPI, etc. But there are a lot of internal problems that already exist - buildings like Amos Eaton pretty much rotting from the roof to the walls, E and North are in terrible shape, all not being worked on because in order to renovate anything RPI would have to bring the buildings up to code and make them accessible. Things that that I would love to see fixed and paid attention to.\n\nIn the same vein, I was in the EMAC program as a student and the professors in the department are amazing, but aren't supported enough (at all) by the school. Most of them are working by contract semester to semester, and these are the professors that are the backbone of the program. That means that any chance their contracts may not be renewed is basically always a chance that the program would fall apart. \n\nMore companies at career fairs that represent a larger portion of the students/majors offered at RPI would be great, too. (Sciences and Humanities are pretty much always underrepresented at career fairs, and in my opinion are the hardest areas to get jobs in/find career paths in, since they're so broad and can be applied to so many areas.)\n\nSorry for the long answer. These are fundamental issues I noticed over and over again while I was at RPI and really would like to see taken care of to improve the school!"}