{"doc_id": "903", "name": "2011_11_humanities_student_major_1270_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2011-11-humanities-student-major_1270_politics.txt", "pub_date": "2011-11-28T00:00:00Z", "Sentiment": "0.146", "Subjectivity": "0.4", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "412", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c33et84", "Reddit_id": "c33g1o0", "Subreddit_id": "t5_2cneq", "Commenter": "tireytha", "length": "2424", "content_scrubbed": "People[.] brains don't all work the same way. Some people make great engineers. They have detail/number oriented/hard logic oriented minds and something like engineering brings out the best them. In a similar way, not everyone has the ability to become a great surgeon, which it seems to me would require a particular personality to excel. \n\nTo take a person with a naturally imaginative and loose, creative brain and tell them to become an engineer would result in a very poor engineer.  Someone with the personality traits that makes a great novelist could also make a terrible doctor.\n\nTelling people to \"just train for a job that pays well\" is not productive. Forcing a creative type to be an accountant is as useful as forcing a programr into ballet.\n\n\n\nImagine if we eliminated all what are perceived as \"loser\" studies  and more strongly discouraged people from interest in them and similarly \"flaky\" jobs.  We accept the decay and eventual loss of music, books, movies, and good looking cars buildings and clothes.  Computer created tones on your IPod only. No need to pay musicians. Cut out the useless creative types and have straight profit. We also cut out the useless historians, anthropologists and psychologists. There is no information we can get from these disciplines that we can't get from the wealthy and powerful people at the top.\n\nThe wealthy might keep some of these rare \"designers\" around to make *their* places and cars look nice, or to write a good book for them but the little people don't need \n\"nice things\", plus now that *only* wealthy people have nice things, they have increased in value. Note: The \"designers\" still have no value.\n\n\n\nFor those who think that the liberal_arts is the equivalent to dressing up My Little Ponies, get a grip. Do liberal_arts students have naive and unrealistic ideas of the world - it depends on the individual student. Does this make the liberal_arts and the arts in general a total waste of time and nobody ever should ever do it?  \n\nFrom the article:\n \"everything is so market driven economics, that the human aspect goes untouched unless it is included in some way to make more money.\n\" \n\nand:\n\n\" The last thing the current ruling class wants is a group of people trained to think critically, i. e., question the structure and conventions propagated by the ruling classes. . . . what the ruling class wants are technicians. \n\" \n\nedit: inadvertent lolspeak"}