{"doc_id": "859", "name": "2011_11_humanities_student_major_766_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2011-11-humanities-student-major_766_TwoXChromosomes.txt", "pub_date": "2011-11-14T00:00:00Z", "Sentiment": "0.095", "Subjectivity": "0.566", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "571", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mc8uq", "Reddit_id": "c2zrnre", "Subreddit_id": "t5_2r2jt", "Commenter": "[deleted]", "length": "3104", "content_scrubbed": "I hate the idea that if you like things that \"most women\" like, you're a thoughtless little strumpet or something. That \"most women\" label is so frustrating because it shames you for liking feminine things. \n\nI love: \nclothing and shopping for clothing, particularly, retro, vintage clothing. I love cooking and baking, girly little aprons, talking on the phone, being gushy about how much I love my young man, I love talking to my friends about their relationships and I do like to gossip (not spreading lies and terrible shit about people, but I love the kind of trivial, everyday talk that falls under the \"gossip\" subheading). I love cute little animals and I really wish I knew how to sew. I would wear dresses every day if it was also always cool enough to wear thick, practical tights. I love Victorian novels and indulge in those whiny young adult novels that I am both too old for and that I am too \"educated\" to enjoy. I absolutely adore (ADORRRRRE!!!!) shoujo manga where nothing happens except some people go on a date or [two girls were friends and lived in an apartment](http://en. wikipedia. org/wiki/Nana_(manga)). I had a major_in_the_humanities. I own a ridiculous number of beauty products. \n\nI'm bad at math, I don't like sports, and sometimes when I am unable to express the way that I feel it makes me cry. \n\nI love: \ncomics and \"graphic novels\" and I'm pretty easily frustrated with people who think only graphic novels are comics for smart people (when it[.] really just the term for a longer body of work). I love science fiction, especially Star Trek and Doctor Who. I loved video games as a younger girl and until I realized how incredibly bad at math I am, I wanted to be an astronomer. I drink beer and I like my coffee fairly bitter. I pay for myself on dates, when I do go out, and my favorite exercise is weight lifting (though I'm not great at it). I am self-sufficient and independent and if I think I am getting \"special favors\" out of being a girl I am really indignant about it (unless that favor is not belching or farting in front of me, I am totally cool with it when guys hold back on that). A good portion of my friends are super nerdy dudes. I have a secret desire to be the breadwinner and make enough money to support my boyfriend if we get married, so that he can be a stay at home dad like he[.] always wanted to. And I think it[.] fucking sexy and amazing that he is so excited to someday, in the far off future, be a dad (since I have the maternal instinct of a dried walnut).\n\nI am not good at walking in heels, or flirting. I've never wanted to be a princess and instead wanted to be a Warrior King as a young girl. \n\nI love some really fucking girly, feminine things, and I love some things that are not stereotypically feminine. Like most other girls, I don't fall neatly within gender categories. When you say \"I'm not like most girls,\" you're also implying \"I'm not like most girls because I am better than them, because they like dumb girl things and I like cool man things.\" It[.] important to respect all the different ways that you or I can be a girl!"}