{"doc_id": "885", "name": "2011_11_humanities_student_major_1117_iama", "namespace": "we1sv2.0", "metapath": "", "pub": "IAmA", "title": "2011-11-humanities-student-major_1117_IAmA.txt", "pub_date": "2011-11-23T00:00:00Z", "Sentiment": "0.021", "Subjectivity": "0.348", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "545", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c31zm41", "Reddit_id": "c3282pk", "Subreddit_id": "t5_2qzb6", "Commenter": "[deleted]", "length": "2994", "content_scrubbed": "Sorry for the delay.  I'd prefer not to give out specifics because I'm sure smart people in my industry could figure me out based on the undergrad/graduate school combination.  I can give a little hint: the MSc programs in finance are found in England.\n\nAt the bulge bracket firms, HYPS and the respective top 5 MBA programs contribute a lot of people.  At independent shops like where I work the distribution is more geared toward pure quantitative ability combined with creative qualities.  Approximately 1/3 of everyone here has a PhD, and most of the PhDs are foreigners from northern Europe, Russia, or Japan.  \n\nHowever, we have plenty of guys from state schools and small liberal_arts colleges too.  The common thread is usually mathematics, physics, chemistry, computer science or engineering backgrounds.  An MBA isn't worth shit at a quant firm.  \n\nFrom my experience, what college you go to has zero correlation with your ability to trade.  In fact, I might say that going to a top school might negatively impact your ability to trade for several reasons.  I've seen this and many of my colleagues agree:\n\nThe average HYPS kid probably graduated in the top 10% of high school.  He/she was a lauded athlete in some sport, has never gotten below an A-, and continued this track record in college, graduating with honors and so on.  Life for many of them has been a series of victories with pats on the back at each step in the road.  \n\nThese kids have never tasted failure.  When you \"go live\" on a trading floor, you will lose money eventually.  A great trader can be right 65-75% of the time, and he never lets his losses discourage him. People who have never failed have a difficult time accepting this fact: it[.] OK to be wrong, because everyone is wrong at some point.\n\nA lot of the brightest hires at my firm freeze up during a rough patch.  You have to take action when things aren't going your way.  Get out, or try something else, just don't stand still.  Letting your losses run leads to a blow up.  \n\nI think one of the major reasons I was hired years ago comes from a story of how I dabbled in oil futures during college.  I had made a very nice sum of money over a series of winning trades, and saved up to pay for graduate school.  I took a less than optimal (read arrogant) trade and ended up losing $75,000.  How many 20 year olds have lost that kind of money?  Very few; I was in shock for a few days.  My waiting cost me another $20,000.  But I had to pay for grad school, so I cut my position sizes to the bare bones, and was determined to build it back up.  Once I had enough to pay for tuition, I got out and closed the account.\n\nI learned the very hard way that everyone loses money at some point and trusting your system will pay off.  You also need confidence beyond measure.  If you can't bite the bullet and get moving when things are bad, then this is not the_right place for you.  If you come across as arrogant, the market will take everything from you.  \n"}