{"doc_id": "870", "name": "2011_11_humanities_student_major_880_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2011-11-humanities-student-major_880_RPI.txt", "pub_date": "2011-11-16T00:00:00Z", "Sentiment": "0.233", "Subjectivity": "0.389", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "285", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mecjg", "Reddit_id": "c30b1l8", "Subreddit_id": "t5_2rg3u", "Commenter": "freakish777", "length": "1619", "content_scrubbed": "EDIT - Looked them up in the course catalogue, they're all still available:\n\nPhysical Modeling (PHYS 1500): You put a lot of data points into excel spreadsheets, that[.] basically the entire class (ok, you learn how to put equations into Excel also...).  This is good for filling your Science requirement if you're required to take X number of Science courses outside your major.\n\nIntroduction to Logic (PHIL 2140):  If you're a School of Science or Engineering student, you probably have an analytic mind, and this course should be a breeze.\n\nIntro to Discrete Structures (MATH 2800):  This might not be super easy, but uhm, I took it with Dave Schmidt (take every math class you can with him if he[.] still there).  This is good for filling your X number of Math courses in the school of science.\n\nUtopian Literature (LITR 2450):  I think this one fills up pretty fast.  You read some books about utopias/dystopias.  Aside from one or two of the books, everything is an enjoyable read, making the class fun (which is important).  One caveat, there is a participation grade, so you need to show up to class.  June Deery (professor when I took it) is still listed as Lit staff at RPI, she[.] a good professor.  Good for your X number of humanities courses requirement.\n\nManagerial Economics (ECON 2010):  This was hands down the easiest class I took at RPI.  By a mile.  Granted I placed into it my first semester after taking APs, and the \"normal\" professor was on sabbatical (I don't think the fill in professor is still there).  Going into the final (which was worth 20% of the grade) I only needed a 52% to get an A.\n\n"}