{"doc_id": "827", "name": "2011_11_humanities_student_major_275_libertarian", "namespace": "we1sv2.0", "metapath": "", "pub": "Libertarian", "title": "2011-11-humanities-student-major_275_Libertarian.txt", "pub_date": "2011-11-04T00:00:00Z", "Sentiment": "0.01", "Subjectivity": "0.078", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "450", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_m0i15", "Reddit_id": "c2x2ctm", "Subreddit_id": "t5_2qh63", "Commenter": "cjet79", "length": "3255", "content_scrubbed": "Sahin, Bican.  Toleration; The Liberal Virtue.  Lexington Books, 2010.\n\nSchmidtz, David and Jason Brennan.  A Brief History of Liberty.  Wiley-Blackwell, 2010.\nSchmidtz, David and E. Willott eds.  Environmental Ethics: What Really Matters, What Really Works.  2nd ed.  Oxford, 2011.  \n\nSchweikart, Larry.  Seven Events That Made America America; and Proved that the Founding Fathers Were Right All Along.  Sentinel, 2010.\n\nShafer-Landau, Russell and Joel Feinberg.  Reason and Responsibility; Readings in Some Basic Problems of Philosophy.  14th ed.  Wadsworth Publishing, 2010. \n\nSheppard, Steve.  The Wolters Kluwer Bouvier Law Dictionary.  Aspen Publishers; Student edition, 2011. \n\nShimko, Keith.  The Iraq Wars and America[.] Military Revolution.  Cambridge University Press, 2010.\n\nShultziner, Doron.  Struggling for Recognition; the Psychological Impetus for Democratic Progress.  Continuum, 2010.\n\nSmith, Bradley, Michael Dimino, Jr., and Michael Solimine.  Voting Rights and Election Law.  LexisNexis Press, 2010.\n\nSorens, Jason.  Secessionism: Identity, Interest, and Strategy.  McGill Queens University Press, 2011.\n\nStanfield, James.  The Broken University; What Is Seen And What Is Not Seen in the UK Higher Education Sector.  Adam Smith Institute, 2010.\n\nStemploska, Zofia and Carl Knight, eds.  Responsibility and Distributive Justice.  Oxford University Press, 2011.\n\nSturgis, Amy, ed.  The Magic Ring by Baron de la Motte Fouque.  Valancourt Books, 2010. \n\nSuprenant, Chris, ed.  Kant and Education; Interpretations and Commentary.  Routledge, 2011.\n\nTaylor, Robert S.  Reconstructing Rawls; The Kantian Foundations of Justice as Fairness.  Penn State University Press, 2011.\n\nTebble, A. J.  F. A. Hayek. (Major Conservative & Libertarian Thinkers)  Continuum Press, 2010.\n\nThompson, C. Bradley and Yaron Brook.  Neoconservatism; An Obituary for an Idea.  Paradigm Publishers, 2010.\n\nToth, Michael C.  Founding Federalist; The Life of Oliver Ellsworth.  ISI Books, July 2011.\n\nWansink, Brian.  Mindless Eating: Why We Eat More Than We Think.  Bantam Books, 2010.\n\nWellman, Christopher and Phillip Cole. Debating the Ethics of Immigration: There a Right to Exclude?  Oxford University Press, 2011. \n\nWert, Justin.  Habeas Corpus in America; The Politics of Individual Rights.  University Press of Kansas, 2011.\n\nWherry, Frederick and Nina Bandelj, eds. The Cultural Wealth of Nations.  Stanford University Press, 2011.\n\nWherry, Frederick.  The Philadelphia Barrio: The Arts, Branding, and Neighborhood Transformation.  University_of_Chicago Press, 2011.\n\nWoods, Thomas E. Jr.  Back on the Road to Serfdom; The Resurgence of Statism.  ISI Books, 2011.\n\nWoods, Thomas E. Jr.  Nullification; How to Resist Federal Tyranny in the 21st Century.  Regnery Press, 2010.\n\nWoods, Thomas E. Jr.  Rollback: Repealing Big Government before the Coming Fiscal Collapse. Regnery, 2011.\n\nYirush, Craig.  Settlers, Liberty, and Empire; The Roots of Early American Political Theory, 1675-1775.  Cambridge University Press, 2011.\n\nZheng Yangwen, Hong Liu, and Michael Szonyi, eds.  The Cold_War in Asia.  Brill, 2010.\n\nZheng, Yangwen  and Charles J-H MacDonald, eds.   Personal Names in Asia; History, Culture and Identity. University of Hawaii Press, 2010."}