{"doc_id": "816", "name": "2011_11_humanities_student_major_48_pics", "namespace": "we1sv2.0", "metapath": "", "pub": "pics", "title": "2011-11-humanities-student-major_48_pics.txt", "pub_date": "2011-11-02T00:00:00Z", "Sentiment": "0.064", "Subjectivity": "0.241", "Score": "362", "Upvotes": "362", "Downvotes": "0", "Wordcount": "269", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2wefuk", "Reddit_id": "c2wevyz", "Subreddit_id": "t5_2qh0u", "Commenter": "Actually_By_M_Night", "length": "1574", "content_scrubbed": "The next morning, the boy-turned-man woke up with a new sense of vigor. He decided to switch majors from humanities to pre-law, and to sign up for the campus gym. He felt great and wanted to keep the feeling going.\n\nThrowing back the covers, he started out of bed and realized he seemed stuck. He looked down to see the lower half of his body drained of life. Gray and wrinkled and immobile, he stared in utter shock, as memories of the previous night started flooding his mind. \n\nIt started off great, the two girls showed him things he'd only dreamed about. Then a flash of an otherworldly light, and the girls weren't human any more. They looked somehow insect-like. Shattered, multiple eyes blinking in rapid succession, as they let out a hissing sound that he realized was laughter. They began puncturing his skin and he could see small, white globules being inserted into his body.\n\nStill staring in disbelief, the sickness spread up his body until it reached his head. Withering and shrinking, he remembered his father[.] warning before going to college about cooeds. \n\nTwelve weeks later, the boy[.] body had become an indistinguishable, slimy cocoon. shadowy shapes could be seen swimming around the bulk of his carcass. Neighbors had been complaining of a strange smell, and when the RA broke in with campus security, they were afraid they would find an overdosed corpse. Instead they found an egg sack of Earth[.] new inhabitants. The creatures that burst from the fleshy womb would wipe out the human population within 18 months, but that[.] a story for another day."}