{"doc_id": "911", "name": "2011_11_humanities_student_major_1403_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2011-11-humanities-student-major_1403_RPI.txt", "pub_date": "2011-11-30T00:00:00Z", "Sentiment": "0.069", "Subjectivity": "0.329", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "294", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_muqsg", "Reddit_id": "c340zgo", "Subreddit_id": "t5_2rg3u", "Commenter": "CrackedCoco", "length": "1762", "content_scrubbed": "I like to think of Jackson[.] breakneck pace as groundbreaking. Crazy, but groundbreaking. If RPI hopes to be more than just a cookie cutting engineering school she had to make some radical changes. \n\nLook at where we were before shirley.\nWithout an art facility, new sport complex and aging science centers. \n\nNow we have a experimental arts center, sports center, and new science facilities. \nHowever some or none of these resources are made tangible to your everyday student. \nShirley has done a great job of raising money and building new facilities but her vision has left out lots of other responsibilities. \nThis responsibility gap includes improving community relations in response to our rapid expansion, the actual use of these new facilities, the proper stocking of equipment for these places, bringing students up to speed with our new facilities available to them. This is leaving alot of people in poor spirits.\nLots of work still needs to be done to make these changes real to the student body but it doesn't seem like Jackson[.] immediate responsibility to fill this gap. Rather she needs real support and new ideas at her breakneck pace. \nI think she realized that after our drop in the rankings. Hence the turnover in administration.\n\nThis responsibility gap has created so many opportunities for students like ourselves to fill it and gain experience. I think instead of always putting her down we should try to improve on the facilities that she provides. All the top schools have a great balance between the arts, sports and academics. \n\nWe should not have that removal clause in there. She is one of the best things to happen to this humdrum, one horse, city of Troy and this cookie cutter school of seemingly apathetic overworked engineers.\n"}