{"doc_id": "829", "name": "2011_11_humanities_student_major_321_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2011-11-humanities-student-major_321_politics.txt", "pub_date": "2011-11-05T00:00:00Z", "Sentiment": "0.078", "Subjectivity": "0.388", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "462", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2xafve", "Reddit_id": "c2xas34", "Subreddit_id": "t5_2cneq", "Commenter": "arcturusk1", "length": "2583", "content_scrubbed": "I can't possibly understand your viewpoint.  You call it laziness and I call it common sense.  Let me explain.  Exactly like what you said, Joe Blow here is out of work.  Joe Blow is a mid-20s, college educated guy.  He[.] on unemployment. He probably worked before he was on UE, so he[.] paid into the system somewhat.  He really does want to work.\n\nJoe[.] UE is not enough to pay the bills.  His money flow is negative, that is, each month, he is losing money.  If he has any savings at all, he[.] slowly draining those savings and there is a finite time in which those savings will dry up.  If Joe takes one of these \"low paying jobs\", his money flow *is still negative*.  He still can't pay the bills!\n\nNow ask yourself this:  Why would Joe bust his ass working a job that *does not let him get by* when he could get UE benefits *while searching for a job and networking*?  Essentially, having the low paying job *hurts* Joe[.] chance at finding more gainful employment.\n\nI don't deride Joe for riding UE benefits while looking for work.  In fact I applaud him for his effective use of time.  If he[.] not looking for work, fine, then he deserves all the criticism thrown his way.  And his laziness will ultimately backfire because UE benefits *eventually run out*.  But for those using the time off to improve themselves and look for work, I have no problem with them making full use of their UE.\n\nMyself and my friends have been in this situation and the free time afforded to us with UE benefits allowed us to network, attend job fairs, meetings, meetups, job interviews, etc.  So fuck you for criticizing people for maximizing the tools and support available.  Your backpedaling and face-saving last sentence is bullshit.\n\n**And we're not just fucking english_major.**  This idea that everyone who[.] in college debt is some loser fucking liberal_arts major needs to stop immediately.  Some of us *did* pick our degree based on future opportunities.  Some of us are Engineering majors who busted our asses in college to get a good GPA, network, and find opportunities.  When the economy took a shit around 07-08, who the hell do you think a company is going to hire?  A bright college engineering grad or a seasoned 15-20 year engineer out of work desperate to get a job to support his family and who[.] willing to work for a pittance?  Would you honestly hire the grad, knowing that you have to train him and get him some real-world experience when you could take a guy that can hit the ground running?  What the fuck is fair about that?  Then you wonder why people are pissed off?"}