{"doc_id": "877", "name": "2011_11_humanities_student_major_996_fffffffuuuuuuuuuuuu", "namespace": "we1sv2.0", "metapath": "", "pub": "fffffffuuuuuuuuuuuu", "title": "2011-11-humanities-student-major_996_fffffffuuuuuuuuuuuu.txt", "pub_date": "2011-11-19T00:00:00Z", "Sentiment": "0.004", "Subjectivity": "0.309", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "336", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c315l51", "Reddit_id": "c317bpv", "Subreddit_id": "t5_2qqlo", "Commenter": "spanktruck", "length": "1933", "content_scrubbed": "In my experience as a TA (in liberal_arts, admittedly, but if someone can finish 400 multiple-choice questions for psych in 20 minutes, all power to you you Odin you), anyone who finished a 1. 5 hour midterm in 20 minutes is going to do poorly unless they're an academic ubermensch who never gets hand cramps. Furthermore, everyone who hands in their papers that early seems to know it, and frequently I get comments  from them about how they just wanted to be done. \n\nMy university even has a policy that, for 3-hour exams, you cannot leave the room or hand in your paper until the 1-hour mark, because it[.] unnecessarily disruptive to other students to have people who didn't study at all streaming out of the exam as soon as they've written 10 sentences.\n\nHell, a 1. 5-hour midterm could take 10 minutes to go over to check things, and that[.] if you're doing a very light check. \n\nThe unstated assumptions here: \n\nStudent doesn't study, or studies but proceeds to write exam without any care or completeness, hoping to just get it down and move on. \n\nThis is proven by student nearly failing. \n\nStudent comes in, plays dumb as to why they did poorly (answer: they half-assed it at best), and instead of spending 1 hour *writing the exam* to get better points, the student spends 1 hour *begging for points*, proving that they don't care about the material or about learning, just about how they can squeeze the prof for points. Here[.] a thought: spend that hour WRITING THE EXAM. \n\nedit: for context, I once TAed for what is universally acknowledged to be the easiest course in the university. The exam was 60 multiple-choice questions, worth 60% of your grade, and lasted for 1 hour. Students who handed in their exams before 15 minutes did poorly. For SIXTY MULTIPLE-CHOICE QUESTIONS in a one-hour exam. 15 minutes was the turning point at which exams came in that were decent-to-good. Only about 6 people stayed past 45 minutes. "}