{"doc_id": "851", "name": "2011_11_humanities_student_major_652_comics", "namespace": "we1sv2.0", "metapath": "", "pub": "comics", "title": "2011-11-humanities-student-major_652_comics.txt", "pub_date": "2011-11-10T00:00:00Z", "Sentiment": "0.089", "Subjectivity": "0.279", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "498", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2yqpc7", "Reddit_id": "c2yukyy", "Subreddit_id": "t5_2qh0s", "Commenter": "Odusei", "length": "2968", "content_scrubbed": "Not really. I mean, *The Wizard of OZ* was first published in 1900, and no one considered it to be in any way political for over 60 years. Not a single contemporary of L. Frank Baum ever claimed that there was a connection between what he wrote and the political events of the times. That alone should set off all sorts of red flags and bullshit detectors. If the people actually living through that time period can't see themselves reflected in a story, there is probably no reflection intended.\n\nI don't get many opportunities to make use of my educational background in conversations on reddit, but as a writer with a Liberal Arts degree, I have to point out that the allegorical interpretation is a good example of strained symbolism. The theorist has made his conclusion before testing it, and then just hunts through the book desperately seeking out whatever he can find to \"prove himself right,\" ignoring anything else inexplicable or contradictory.\n\nHere[.] a great quote on the subject by Patrick Michael Hearn, in his introduction to *The Annotated Wizard of Oz*:  \n\nOne of the most persistent [critical studies of *The Wizard of Oz*] is Henry M. Littlefield[.] \"The Wizard of Oz: Parable on Populism\" (*American Quarterly*, Spring 1965). It theorizes that Baum was thinking allegorically about his own time when he wrote the first of the Oz stories. While some valid points are raised, it too often strains for symbols that the text does not support. For example, Littlefield argued that the Silver Shoes reflect the political preoccupation with silver in 1896, and that the Yellow Brick Road is really a reference to William Jennings Bryan[.] famous \"Cross of Gold\" speech. But are the streets of Oz really paved with gold? Because Bryan accepted the Democratic Party[.] nomination in Omaha, Baum just had to have the Wizard come from that city. But Baum was not so prosaic a writer as this article insists. Littlefield has admitted that his theory evolved from a classroom assignment to teach American history to high school students, and *they* came up with many of the metaphors. Today the reputation of this theory far outweighs its critical value. It has been paraphrased, plagiarized, and argued over by academics with an intensity that would make even Professor Woggle-Bug blush. It is significant that no review nor any other contemporary discussion of the book noted any parallels between the story and the Populist movement. The Boston *Beacon* observed on September 29, 1900, that \"under the sweet simplicity of the tale for children is a satiric allegory on modern history for big people. The Scarecrow wears a Russian blouse, the fierce Tin Woodman bears a striking resemblance to Emperor Wilhelm of Germany, the Cowardly Lion with its scarlet beard and tail tip at once suggest Great Britain, and the Flying Monkeys wear a military cap in Spanish colors.\" These remarks may have been made partly in jest, but there is not one word about Populism."}