{"doc_id": "882", "name": "2011_11_humanities_student_major_1059_occupywallstreet", "namespace": "we1sv2.0", "metapath": "", "pub": "occupywallstreet", "title": "2011-11-humanities-student-major_1059_occupywallstreet.txt", "pub_date": "2011-11-21T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.413", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "567", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c31nq62", "Reddit_id": "c31nx9k", "Subreddit_id": "t5_2sn7r", "Commenter": "boston1994", "length": "4374", "content_scrubbed": "Here[.] the \"private information\" they provided: http://pastebin. com/RvgR7gEg\n\nPolice Executive Research Forum\n1120 Connecticut Avenue, NW \nWashington , DC , 20036\nPhone: (202)466-7820 \nFax: (202)466-7826 \n\nAvailable on every page of http://www. policeforum. org\n\nSherwin B \"Chuck\" Wexler - Age 61\nHome#: (301) 229-9182\n5907 Devonshire Dr\nBethesda, MD 20816-3417\n\nFound at http://www. whitepages. com/name/Sherwin-B-Wexler/Bethesda-MD/4sysbqj by entering his name into the search page on the site.\n\nExecutive Director at PERF\n\nAvailable at http://www. policeforum. org/about-us/staff-detail. dot?id=7870\n\nEmail: cwexler@policeforum. org\n\nAvailale at http://www. policeforum. org/about-us/staff-detail. dot?id=7870\n\nMap:\nhttp://maps. google. com/maps?rlz=1C1CHFX_enUS456US456&q=5907+Devonshire+Dr+Bethesda,+MD+20816-3417&um=1&ie=UTF-8&hq=&hnear=0x89b7ca36e00579b7:0xf3ec5086f75ea577,5907+Devonshire+Dr,+Bethesda,+MD+20816&gl=us&ei=0m7ITo_4FqTz0gHo65wF&sa=X&oi=geocode_result&ct=title&resnum=1&ved=0CCEQ8gEwAA\n\nThis is just a map of the address above.  By the way, it[.] not exactly a mansion.\n\nAssociates:\nJan Hirshberg\nLeah Smethurst Crowling\nMichael J Wexler\n\nListed on http://www. whitepages. com/name/Sherwin-B-Wexler/Bethesda-MD/4sysbqj\n\n\"Chuck Wexler, executive director of PERF since 1993, leads a staff engaged in policing research, management studies and consulting for police agencies, publication of books and other documents, executive education and selection, and policy development. PERF is a leading think tank for major cities facing difficult issues in policing. In the past year, for example, PERF has led discussions among police chiefs from across the nation on issues like the impact of the economic crisis on policing, the need for guidelines for the use of Electronic Control Weapons, local enforcement of immigration laws, gun crimes and gang-related violence, and many other topics. PERF identifies and explores the issues that are of greatest concern in policing, tapping into the wisdom and experience of leading police executives. In addition to leading PERF[.] research, consulting, and policy development initiatives, Wexler has been directly involved in projects to improve the delivery of police services. For example, when the city of Minneapolis faced unprecedented increases in violent crime, Wexler helped develop and implement a comprehensive anti-crime strategy that is now a model for public-private cooperation. In Chicago, Wexler is currently working to reduce juvenile homicides in some of the city[.] most troubled areas. He has been involved in crime-reduction and policing projects in Kansas City; los_angeles; Northern Ireland; Kingston, Jamaica; London; and the Middle_East. He oversaw PERF[.] analysis of the investigation into the Washington sniper incidents, serving as co-author of PERF[.] report, Managing Multijurisdictional Cases: Lessons Learned from the Sniper Investigation. He also co-authored Good to Great Policing: Application of Business Management Principles in the Public Sector. A native of Boston, Wexler held a number of key positions in the Boston Police Department. As operations assistant to the Police Commissioner, he played a central role in the agency[.] management of racial violence in the wake of court-ordered desegregation of the Boston school system. He was also instrumental in the development and management of the Community Disorders Unit, which earned a national reputation for successfully prosecuting and preventing racially motivated crime. Wexler graduated from Boston University with a liberal_arts degree. He earned a master[.] degree in criminology from Florida State University and a Ph. D. in urban studies and planning from the Massachusetts Institute of Technology (MIT). He has been an instructor at Bowdoin College and MIT. In February 2006 Wexler was awarded an OBE (Order of the British Empire) for his extensive work with British and American police agencies.\"\n\nAvailable at http://www. policeforum. org/about-us/staff-detail. dot?id=7870\n\nThis took me less than 5 minutes.  None of it was even remotely difficult to obtain, and is all freely and legally available to anyone that knows the names Sherwin B Wexler and/or PERF.  Private information about Wexler would be more difficult to collect, but the idiots posing as hackers didn't manage to do that."}