{"doc_id": "886", "name": "2011_11_humanities_student_major_1118_nosleep", "namespace": "we1sv2.0", "metapath": "", "pub": "nosleep", "title": "2011-11-humanities-student-major_1118_nosleep.txt", "pub_date": "2011-11-23T00:00:00Z", "Sentiment": "0.051", "Subjectivity": "0.391", "Score": "24", "Upvotes": "24", "Downvotes": "0", "Wordcount": "1624", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mn2x5", "Reddit_id": "c328dsj", "Subreddit_id": "t5_2rm4d", "Commenter": "LucienReeve", "length": "9067", "content_scrubbed": "PART 2\n\nDoctor Henry Culkin was a lecturer in English Literature at Mercer[.] College, on the border of Rook Hill. He was the type that used to be called a \"literary lion\" – a large, somewhat rumpled looking alpha male with long wavy hair, who always seemed to be smoking a cigarette or drinking a pint of real ale. He was witty and clever, a former Oxford alpha-plus, and had made a name for himself in the 80s with a prize-winning trilogy of novels. It was not impossible that some day he might even win the Booker, or so the gossip went – if he would ever finish his latest novel, which was a gigantic and helplessly ramifying magic realist text about a couple of ancestors of his who had fallen victim to the Holocaust.\n \nStudents liked Dr. Culkin because he smoke and drank and said \"fuck\" a lot. More than once he had run into trouble with the disciplinary committee for sleeping with them. By 1998, though, those days were past – in fact, a former student of his, an artist named Martina Belic, was the closest thing he had ever had to a steady girlfriend and he appears to have been quite sincerely in love with her. He was the sort of man who takes any interference with his pleasures as a moral affront - but for all that, he was good hearted. \n \nOn the 18 November, Dr. Culkin attended a welcome lunch for the latest member of the Mercer College faculty of Anthropology. This new colleague was a pale blond young man with a handsome face and a polite but completely assured manner. He had rented a large old house a little down the hill from St. Martin[.] Gardens. \n\n(The house still stands: you can see it in the_left of this picture, here: [http://imgur. com/qoS1r](http://imgur. com/qoS1r)\n\nHis name was Doctor Julian Blackwood. His smile as he shook Dr. Culkin[.] hand did not quite reach his eyes. \n \nThey talked politely about nothing very much. After the meal, Dr Culkin was almost home before he realised that he disliked Dr Blackwood more than anybody he had ever met. \n \nPerhaps it was Dr. Blackwood[.] impeccable but somehow distant charm that offended him; perhaps it was the younger man[.] erudition, which rivaled his own. I would like to think that it was not just that Dr. Blackwood was young, handsome and amusing and clearly knew it. \n \nOne detail that stayed with Dr. Culkin was exceedingly minor and yet he could not get it out of his head. On the little finger of his left hand, Dr. Blackwood wore a ring. It was not quite large enough to be a signet ring, but it had a sign or symbol on it. That night, Dr. Culkin went through his books of symbolism and art history and emblematology and what he found disturbed him. \n \nThe emblem looked a little Freemasonic, like the traditional square and compasses. But Dr. Culkin, who had an excellent visual memory, recalled quite distinctly that the compasses on Dr Blackwood[.] ring had been snapped and the square cracked or broken. \n \nThe only reference he could find to such a symbol was in a brief comment in Jacques Belicort[.] *Signs and Wonders: A Dictionary of Symbolism*, which spoke of group of masons in Chennai - or as it was then called, Madras - in the late eighteenth century. They belonged to what Belicort called a \"highly irregular\" lodge. Masons gather in lodges; and when one lodge wishes to disapprove of another, it calls it \"irregular\". Dr. Culkin had never heard of a lodge being called \"highly irregular\" before - but then, Belicort is full of wild and improbable material and seldom to be trusted as an authority. \n \nThe next day, Dr. Culkin took a moment in the library to look more deeply into the history of Madras. In Henry Davidson Love[.] *Vestiges of Old Madras*, he found a passage that spoke of a lodge of Masons being established in the 1720s, by European officers, in the \"Black Town\", among the natives. But in the 1800s, a new lodge had been set up in the city and the old done away with - the new Masons pronounced the old ones \"highly irregular\" and claimed that they had been infected with ideas from the local princes and their priests. \n\nWhereas traditional Masons believed in charity, piety and a supreme being, the Madras Lodge had evolved a very different doctrine - they held that there was no morality that was not invented by men; that men were simply complex and dangerous animals; and that there was no god, but only an infinitely large and empty universe inhabited by a great many devils. As a sign of their rejection of the conventional Masonic morality, their deepest initiates would receive a ring, marked with a broken square and compasses. To obtain this, they had to \"pass beneath the arch and go beyond the veil\", whatever that might mean.\n \nNow, the likeliest thing by far, thought Dr. Culkin as he set down the book, was that Dr. Julian Blackwood had no idea of the ring[.] history or significance - or if he did, he only wore it because it amused him as a curio. But Dr. Culkin could not deny that his palms were sweating and he was possessed by an unshakeable feeling that he had stumbled on something of importance. \n \nThe next few weeks passed with the usual college business of lectures, marking essays, conducting tutorials and long pub lunches. Dr. Culkin appeared on The Late Review, where he argued with Tom Paulin and Germaine Greer about the films of Alan Pakula (who had died recently). \n \nAt the insistence of a colleague, he reluctantly attended one of Dr. Julian Blackwood[.] lectures and was not at all surprised to find that it was very good. Dr. Blackwood did not seem as nervous as young academics often are: he spoke smoothly and pleasantly and had his audience in the palm of his hand. Dr. Culkin[.] colleague leaned over to him about half-way through and said, \"He[.] very good, isn't it he?\" and Dr Culkin could only grunt, noncomittally. He did not want to seem churlish, and besides what could he say? That when Dr. Blackwood spoke about humanity, he sometimes sounded as if he was talking about another species altogether? And furthermore, a species that he disliked?\n\nTwo events took what might just have remained envy and a vague unease and crystalised them into an obsession. The first occurred the day after a boy named Phillip Milner went missing. He was the son of a friend and so Dr Culkin spent some time putting up posters around campus. \n\nHe was just in the process of tacking one such photocopied sheet onto the notice board in the entrance hall of the Humanities department - where it would sit alongside more than a dozen similar \"missing\" posters - when the door swung open and an icy blast of wind snatched the paper from his hand. It went whirling through the air and skimming across the floor and came to a stop underneath a neat black patent leather shoe, belonging to Dr. Julian Blackwood - who picked it up and offered it to Dr Culkin, saying, with a smile, \"They'll never find him, you know.\"\n\n\"What[.] that to you?\"\n\nJulian[.] smile grew broader and he tapped the side of his nose conspiratorially, then turned and walked off down the corridor. As he walked, he sang: \"Of his bones are coral made! Those are pearls that were his eyes! Nothing of him that doth fade - but doth suffer a sea change...\"\n\nFor an instant, blind rage overcame Dr. Culkin and he ran after Julian, meaning to shake some sense out of him - but Julian turned a corner and somehow, when Dr. Culkin turned it after him, the younger man was nowhere to be found.  \n \nThe next week, Dr Culkin chanced to be working late in his office at the Mercer College campus. As he was leaving, a lit window on the upper floor caught his eye. The blind was down, but the angle of a desk lamp meant that two figures inside the room were projected onto it, like shadow puppets. \n \nA trick of the light – clearly caused by one of the two standing much closer to the window than the other – made it look as if the nearer figure was very tall – at least nine or ten feet, even stooping as it was.\n \nAs Dr Culkin stood and watched – his breath puffing out in clouds in the freezing autumn air – the taller figure stiffened, then slowly swung its head around to face directly at him.\n \n\"It knows I'm here,\" was his first thought. \"It knows when you're looking at it.\"\n \nHe felt almost paralysed with fear. It was only by a supreme effort of will that he made his legs unlock and start him stumbling home. Later, nursing a whisky, he cursed his cowardice; what could he possibly have been afraid of? The next day, a quick check confirmed what he already suspected: the figures had been meeting in Dr. Julian Blackwood[.] office. \n \nWhat had begun as curiosity and vague dislike now assumed the character of an obsession. It was clear to Dr. Culkin that there was something terribly wrong with Dr. Blackwood. He probably had something to do with the disappearances. Dr. Culkin determined to find out more about his mysterious colleague and, when he learned that Dr. Blackwood had done both his undergraduate and post-graduate work at Gabriel College, Cambridge, the very next day he boarded a train to East Anglia, intent on doing some detective work. \n"}