{"doc_id": "910", "name": "2011_11_humanities_student_major_1317_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2011-11-humanities-student-major_1317_AskHistorians.txt", "pub_date": "2011-11-29T00:00:00Z", "Sentiment": "0.063", "Subjectivity": "0.212", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "271", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mt5i9", "Reddit_id": "c33n9ih", "Subreddit_id": "t5_2ssp3", "Commenter": "[deleted]", "length": "1934", "content_scrubbed": "Disclaimer: I'm a history student, but probably not much more knowledgeable about this subject than a layman. Anyway, I'm not sure whether this answers your question exactly, but hopefully you'll find it interesting. \n\nWhat differentiates academic study during the enlightenment from the middle ages, is the abandonment of universities in favor of a decentralized community of scholars, often called [the republic of letters.](http://en. wikipedia. org/wiki/Republic_of_Letters) The \"natural philosophers\" found in Stephenson[.] book lived during the heyday of this intellectual community. \n\nMy understanding is that the republic of letters emerged because people became dissatisfied with how things worked at the universities. During the middle ages (from the 12th century or so), universities starting popping up all over Europe. These universities organized subjects into *trivium* and *quadrivium*, terms taken from Roman times. Trivium consisted of grammar, logic and rhetoric, whilst quadrivium consisted of arithmetic, astronomy, geometry and music. These subjects were studied by all students, similarly to how all American university students study liberal_arts today. After the introductory studies, students would go on to study either medicine, law or theology. Universities largely became institutions for educating civil servants and the clergy. \n\nIn addition, a academic tradition developed at the medieval universities, which is known as scholasticism, with representatives like Thomas Aquinas. They basically studied authors like Aristotle, and tried to fit the texts into an orthodox christian perspective. \n\nAs you see, there wasn't much room for actual scientific thought, and this explains why enlightenment scholars established themselves outside of the established universities. In regards to information about the republic of letters, I suggest reading the Wikipedia article I linked, as it seems pretty good. \n\n\n"}