{"doc_id": "860", "name": "2011_11_humanities_student_major_772_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2011-11-humanities-student-major_772_funny.txt", "pub_date": "2011-11-14T00:00:00Z", "Sentiment": "0.085", "Subjectivity": "0.4", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "285", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mcdjv", "Reddit_id": "c2zsn27", "Subreddit_id": "t5_2qh33", "Commenter": "[deleted]", "length": "1623", "content_scrubbed": "In 4 years of undergraduate classes, there were only two semesters I had a class before noon, and three semesters that I had a class on Friday.\n\nHaving come to understand early that undergraduate liberal_arts degrees were bullshit, I selected classes exclusively on the basis that:\n\n* Nothing before noon, nothing after 6pm\n* Had to count toward major or core requirements.\n* Nothing on Friday\n* Should be large lecture hall ideally; therefore no attendance would be taken\n\nWorked magnificently.  15 years after graduating, I can say with confidence that I have no regrets.\n\nI also came to understand that if I could schedule classes back-to-back, I was more likely to attend them.  If I had an hour or two between them, the chances I'd skip them increased.\n\nTherefore I only skipped about 60% of my classes, rather than 85 or 90%.\n\nNow I work in a field outside of my major, working alongside and making the same money as people who worked their ass off in their major.\n\nHad I taken college seriously, I probably would have wound up wasting all of the time reading shit I didn't care about, rather than setting aside lots of free time to read shit I did care about, and didn't have to do stupid papers and assignments for.  No self-important professors.  Just kicking back in my apartment or the park and doing what I wanted to do.  While people were jumping through hoops for grades, I was reading the same material for fun, and without all the chaff.  And I still got the undergraduate degree, which is pretty much nothing more than a token into management level positions (graduate degrees are different).\n\nIt paid off!"}