{"doc_id": "868", "name": "2011_11_humanities_student_major_864_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2011-11-humanities-student-major_864_politics.txt", "pub_date": "2011-11-16T00:00:00Z", "Sentiment": "0.19", "Subjectivity": "0.391", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "267", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_megky", "Reddit_id": "c309gq0", "Subreddit_id": "t5_2cneq", "Commenter": "CthulhusCallerID", "length": "1508", "content_scrubbed": "Well, let[.] not be silly, underwater basket-weaving has always been the punchline/strawman example people used for as long as I can remember. Liberal arts and philosophy both have useful skills that stem from them. A logician for example is valuable to cognitive science research, and logic is a wonderful primer for people working with contracts. Both liberal_arts and philosophy undergrad degrees may not be terribly useful right out of school, but both are great for going on to pursue your masters or law school or your phd... also both are useful if you want to be a teacher- something that is important for society even if it[.] not well compensated financially.\n\nThat[.] not to say that these people don't want or need jobs in the short term, it[.] also not to say that because they didn't make the optimal decision (in your view) for their lives that you should feel no sympathy for them. They might still be having trouble in a good economy, but in a bad economy it[.] brutal, but its up to you to decide if its the economy or their degree that makes the bigger difference. \n\nIn my experience, however, it[.] the school. Many of my Ivy League friends have degrees in History, many of them were recruited right out of school by think tanks and, in one case, an investment bank. My film major friends all work in film/tv (not as the directors they wanted to be, but as editors, AC[.], sound recordists, low level producers), but that[.] because they went to NYU which has a great program and alumni network. "}