{"doc_id": "896", "name": "2011_11_humanities_student_major_1219_asksocialscience", "namespace": "we1sv2.0", "metapath": "", "pub": "AskSocialScience", "title": "2011-11-humanities-student-major_1219_AskSocialScience.txt", "pub_date": "2011-11-26T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.33", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "600", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mq6ee", "Reddit_id": "c332k2z", "Subreddit_id": "t5_2sml9", "Commenter": "[deleted]", "length": "3543", "content_scrubbed": "My major suggestion is that you go out and sit down with an economist who specializes in the economics of your state, a sociologist, a political scientist, a judge, a business owner.. etc.  They'll give you suggestions targeted to your state, they're smarter than me and they'll be very willing to talk to you. A lot of the suggestions I might have would be politically unpalatable for somebody.\n\n* Change your state financial aid so that the schools have to pay back some part of the loan when they give a student a loan for a risky major (humanities, law, fine arts) and the student can't pay it back.  Right now, universities are making bank feeding kids into law school despite the oversupply of lawyers in most markets.  \n\n*  Look closely at the unions in your state, are they necessary?  Sometimes a union is a necessary evil, but it imposes a serious cost on employers, job-seekers and consumers.  \n\n* While we're at it amend your state[.] Nurse Practice Act to give nurses more freedom to act.  Doctors are better than nurses at making rarer diagnoses, for everything else it[.] a lot more cost-efficient to have a nurse do it. \n\n* Amend your criminal laws so that marijuana use is just a ticket, and legalize medical use.  Gain revenue from taxing the dispensaries, and reduce enforcement costs.\n\n* Privatize the DMV.  The usual problem with privatization is that it creates an incentive problem, but NJ did this and it was a great positive effect. \n\n* Bust up the teacher[.] union.  Excellent teaching has two components, knowledge of the subject and presentation/management skill in the classroom.  The education major at my college was sordid, it was chock full of under-performers after an easy paycheck.  Call it the \"Right to Teach\" act, republican[.] will love that.  \n\nAbout the teachers: Pay should be performance based and knowledge based instead of 'time-served' based.  For knowledge, pay the teacher based on the amount and level of credits they have in the subject.  Say 45 credits in math is a minimum, then you get a raise for each additional college class you take, based on whether it[.] 100-200,200-400 or graduate level. Performance is harder to measure, it should be a bonus based partly on test scores but mostly on in class reviews.  Teachers who perform very well should mentor other teachers.\n\n* Put the squeeze on contractors.  Since moneys tight right now, it[.] a good time to really review the rules on handing out contracts.  Require the companies to insure themselves against going over budget, (assuming the state just goes ahead and pays if they go over).  Look at paying prison contractors a fixed fee based on the states population rather than a per-prisoner fee.\n\n* Cap political campaign spending.  You may be able to sell this to republicans by pointing out that it squeezes out business advertisement.  \n\n* If you don't have an estate tax, make one for estates over x million.  Estate taxes are one of the taxes with the least skewed incentives.  You can do an even trade with the republicans on this for any business unfriendly taxes.\n\nEDIT: **Important part** Like I said, your in a great position to take an hour or 30 minutes to talk to field experts.  Call professors in public policy, economics, accounting and law at your local university, they should want to talk to you because your in a position to actually influence policy.  Sit down with a school principal, community college dean, judge, hospital executive and ask their opinions -- they'll probably be very informative and enlightening."}