{"doc_id": "866", "name": "2011_11_humanities_student_major_833_mcgill", "namespace": "we1sv2.0", "metapath": "", "pub": "mcgill", "title": "2011-11-humanities-student-major_833_mcgill.txt", "pub_date": "2011-11-15T00:00:00Z", "Sentiment": "0.031", "Subjectivity": "0.256", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "381", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_m9vpy", "Reddit_id": "c303l4c", "Subreddit_id": "t5_2rhkw", "Commenter": "Publiuus", "length": "2170", "content_scrubbed": "On 10 November, we took over the office of Her Majesty Blum...\nOutfitted in their dystopian armor, agents of the state violently attacked students...\n\nCool story, bro. This kind of lame rhetoric is keeping a lot of students from ever joining your cause. This and the whole \"authoritarian\" business... I know people who would laugh for days at what you think is authoritarian of the administration, because they've actually suffered from true authoritarianism.\n\nEvents in our world this year, as always, have revealed the necessity for direct action. \n\nNo. Your cause is not the rest of the world. It is not the Arab Spring, it is not 1960s USA, and it is not current day Wall Street.\n\nOh yeah by the way, the world owes you nothing.\n\nAt McGill, the administration has used the law to silence MUNACA \n\nFar as I can hear, they're still doing their thing.\n\nThis statement is filled with falsities and fascistic ideas, anyone can easily make logical claims against each and every sentence in it. You do not understand what this university is for. \n\nYour actions caused several innocent students to be sprayed, hit, and pushed by riot police. You, and the criminal elements you brought to McGill, are responsible for whoever got hurt that day. No one else. The world doesn't owe you anything. If you do not like the way the school is run, please go somewhere else. Or go to work, you're old enough to start your own life. You are a radical minority, even within the Arts faculty. Every Arts student I have spoken to thought the events of last Thursday were a joke. \n\nDeal with the consequences of your actions. What did you expect would happen when you forced your way into the office of the head of a university? Yes, complaints about tuition fees are legitimate, and so is protesting. But the action taken by the Fifth Floor Intruders crossed the line and the worst thing about it is that they seem to believe the response (calling the police) ought not to have followed to them breaking and entering.\n\nThe riot police came because the crowd YOU gathered to OUR campus attacked the police. That[.] what happens. \n\nWe all can occupy. We all can resist. We all must act.\n\nlol\n"}