{"doc_id": "869", "name": "2011_11_humanities_student_major_879_truereddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueReddit", "title": "2011-11-humanities-student-major_879_TrueReddit.txt", "pub_date": "2011-11-16T00:00:00Z", "Sentiment": "-0.146", "Subjectivity": "0.243", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "300", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_medqw", "Reddit_id": "c30b0nz", "Subreddit_id": "t5_2qyt6", "Commenter": "[deleted]", "length": "1598", "content_scrubbed": "Every time I read articles like this, I wonder what[.] going on with all these other humanities programs.  I am a TA at an R1 research school in History, working on my PhD.  My school expects the averages of the sections I'm in charge of to be a B-.  That average is comparable to the 2. 7 GPA that he cites for math programs in the article.   I will fully admit that my grades are subjective, but I consistently grade with less that 10% in the A range, and usually hit a little low of the B- average (about a 79%).  The other TAs in my program do this as well - there are usually multiple TAs in a class and we compare averages and rough statistics.\n\nI'll admit to a reluctance to fail people, and it is easier to give-in to that urge when grading is subjective, but it[.] not like it doesn't happen.  I failed 8% of the class on the midterm last quarter.  Most of those who failed the midterm dropped, and only about 2 or 3 students actually failed the class.   Anyway, that reluctance to fail people usually shows up as giving a lot of C-s in my classes. Someone who shows up, gets some actual facts in their paper, and looks like they put in some effort, will probably get a C-.  \n\nI agree you can BS your way through under the idea that \"Cs get degrees,\" and outright failing might be harder in the humanities. However, based on the grade statistics in my program,  I don't see GPA inflation on the order of what he[.] talking about and I'm really confused that other programs don't have established grading norms for the humanities.  I would be reprimanded if I was giving out a B+ (3. 3) average."}