{"doc_id": "812", "name": "2011_11_humanities_student_major_2_libertarian", "namespace": "we1sv2.0", "metapath": "", "pub": "Libertarian", "title": "2011-11-humanities-student-major_2_Libertarian.txt", "pub_date": "2011-10-31T00:00:00Z", "Sentiment": "0.103", "Subjectivity": "0.309", "Score": "34", "Upvotes": "34", "Downvotes": "0", "Wordcount": "486", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_lvmfr", "Reddit_id": "c2vzza2", "Subreddit_id": "t5_2qh63", "Commenter": "LWRellim", "length": "3114", "content_scrubbed": "Note on the kid pictured (and his college).\n-----\n\nGrinnell College is a [ridiculously expensive private liberal_arts college](http://en. wikipedia. org/wiki/Grinnell_College) (in the [middle of Iowa, mind you](http://en. wikipedia. org/wiki/Grinnell,_Iowa) -- we're talking Radar O'Reilly territory -- {nothing wrong with Iowa, it[.] just that we're not talking Ivy League, Cal-Tech or MIT here, this is Podunk U}):\n\nThe 2011-12 comprehensive fee is $49,144 (**tuition & fees, $39,810;** room and board, $9,334). When determining eligibility for assistance, annual allowances are made for the following expenses: Books & Supplies $900 Personal Expenses $1,100 Travel Expenses $200-1,800 depending upon home state/country.  [Source](http://www. grinnell. edu/admission/apply/tuition).\n\n**So $16,000 paid for only about of 1/3 of this ~~sucker[.]~~ student[.] *annual* cost.**\n\nAnd that alone ($50k a year for a no-name liberal_arts college) tells me this kid is NOT a math genius (so it should NOT be surprising that he fails to understand the impact of subsidized loans on the cost of tuition).\n\n---\n\nEDIT: Just for S&G I googled the kid[.] name and found a bit more [on the kid himself](http://www. grinnell. edu/admission/voices/students/frerick).  First of all he[.] a Professor[.] Assistant (whatever) and ... wait for it... Political Science major (big surprise there).\n\nHow did he pick his college? What kind of cost-benefit and ROI did he do? Well... let[.] let him talk for himself:\n\n**Why did you choose Grinnell?** Honestly, *I got this feeling* during my visit that Grinnell was the_right college. I remember turning to my mom at the end of the tour and saying \"This is it.\" I went home that night and started on my early decision application. The financial aid was the cherry on top. \n\nSo... see, he \"got this feeling\" (a woody from a passing coed? or nausea from the cafeteria? maybe just gas from a carbonated drink? Or... most likely he was impressed by the fancy new buildings and facilities). And that was enough to say: \"screw the $$ let[.] go HERE\".\n\nOh, and financial aid?  Its a \"cherry on top\".\n\nAlso (get this) he spent a year OFF campus (do you still have to pay tuition and room & board then?  Apparently, because [the year is part of an \"Off Campus Study Program\"](http://www. grinnell. edu/offices/ocs)!  Woohoo!  $50k for a \"University of Phoenix\" program where you can, in his words be: \"crashing on the couch of some alum\" -- so apparently it[.] almost like a [Gap Yah](http://www. youtube. com/watch?v=eKFjWR7X5dU)), to wit:\n\n**What is your favorite Grinnell memory?** One of my favorite Grinnell memories did not actually occur at Grinnell. Rather, during my year off campus I was constantly traveling and exploring new places and in almost every instance I was doing it with a Grinnellian. Whether I was crashing on the couch of some alum I knew or meeting up with another Grinnellian in some foreign city, there was always a Grinnell connection. Knowing that leaving the \"physical Grinnell\" didn't mean that I actually left Grinnell is one of my favorite memories from this past year."}