{"doc_id": "908", "name": "2011_11_humanities_student_major_1296_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2011-11-humanities-student-major_1296_canada.txt", "pub_date": "2011-11-28T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.269", "Score": "18", "Upvotes": "18", "Downvotes": "0", "Wordcount": "427", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_msjv6", "Reddit_id": "c33ji97", "Subreddit_id": "t5_2qh68", "Commenter": "Xivero", "length": "2707", "content_scrubbed": "Actually, when it comes to politics, we're in a really enviable position. We have a widespread consensus on where we want the country to go. This may not be obvious to you, because reddit is the home of the small but very vocal minority who really, really disagree with that consensus, as well as a slightly larger minority who agree with it but don't realize it because they're too busy being mad at the Conservatives for relatively minor things. But if you took a bunch of random quotes from the Liberal and Conservative platforms, you'd be hard pressed to tell which was which in the majority of cases. Even the NDP wasn't that far from the rest under Layton. \n\nIn fact, just for fun, here are some quotations pulled from the various party platforms, only slightly edited to remove party name references. Care to take a guess as to which party said what, without checking online?\n\n\"[We will] support research partnerships between college and university\nresearchers and students, through Canada[.] research granting\ncouncils\"\n\n\"The global financial crisis has shown that we need a national securities regulator.\"\n\n\"For so many Canadian children, involvement in the arts is a big part of growing up. One child thrives at art camp; another finds her calling on the stage; another learns about the language and heritage of his family background.\"\n\n\"Thanks to a prudent business culture, a tough regulatory system, and good policy decisions . . . the financial sector has remained solid while other countries have been spending billions on bank bailouts.\"\n\n\"will review all federal program spending, and implement smart, sustainable savings. We will seek the best analysis and ideas from the professional public service, and provide direction based on a positive\nand realistic vision of modern government. We will cut wasteful spending.\"\n\n\"A forward-looking government must foster an innovation-friendly environment. While reigning in unnecessary regulation, the federal government can do more to target public investments, and provide the_right incentives for entrepreneurs and investors to take risks on new ideas, technologies, business models and other productivity improvements.\"\n\n\"We will keep our communities safe from crime by investing in a balanced, effective approach based on prevention, policing, and prosecution.\"\n\n\"We will maintain Canada[.] commitment to balance the federal budget within the next four years, as per the Department of Finance projections.\"\n\n\"We will negotiate a new ten-year health accord with the provinces and territories in 2014. The accord will guarantee a continued strong federal contribution -- including the 6 percent escalator -- to Canada[.] public health care system \""}