{"doc_id": "875", "name": "2011_11_humanities_student_major_986_lostgeneration", "namespace": "we1sv2.0", "metapath": "", "pub": "lostgeneration", "title": "2011-11-humanities-student-major_986_lostgeneration.txt", "pub_date": "2011-11-19T00:00:00Z", "Sentiment": "0.017", "Subjectivity": "0.374", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "560", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mi6hj", "Reddit_id": "c314aqy", "Subreddit_id": "t5_2r40j", "Commenter": "Soongone", "length": "3260", "content_scrubbed": "I hate Charles Murray with a passion. How the fuck you write a book that[.] used as an example of how easily statistics are manipulated to the point of lying (Losing Ground) and then go on to write a book about how blacks are genetically inferior so that[.] why they're not able to achieve on the same level (The Bell Curve)... and still be invited to debate something like this is beyond me.\n\nIt[.] obvious that Murray supports the proposition - the academy are the people who exposed the man for the charlatan that he is. \n\nAcademics takes rigorous study and work - and a lot of undergraduate programs have lost that not because there[.] a lack of effort, it[.] a lack of proper administration. States no longer invest in their universities, which means most departments are atrociously understaffed not only in faculty, but in support staff as well. That lack of staffing results in classes being reduced to the lowest common denominator down so that students not only get multiple-choice tests, they're getting tests that have been used again and again from year to year. It[.] not because faculty have a joy for seeing their disciplines watered down - it[.] because they don't have the time to balance research expectations, 3-4 classes they have to teach a week, plus grading massive numbers of papers or essay exams. The answer has largely been to pass it off to graduate students (who are fucked because universities, again, aren't hiring enough to give them jobs despite more than amply supply of students to fill classrooms) and now even those graduate students are overburdened.\n\nCollege teaches people how to think critically. How to assess information, find flaws in it, and come to rational conclusions based on scientific principles. It raises the bar of intelligence and raises the overall quality of the society it is a part of.\n\nThere[.] not a single reason every single student shouldn't be capable of going as far in the academy as they have the desire to go. There are more than enough people in the world, and more than enough wealth to support them. The problem is that administrations would rather pad the salaries of high-ranking officials at the universities or engage in investment into athletics rather than invest in education. And don't give me crap about how some athletics programs manage to fund the rest of the school[.] athletes. For some universities that may be true, but for it to be true they must be winning and causing others to lose - and those losers do not get money the way the winners do. It creates the ouroboros of athleticism where everyone is trying to compete for a pie when there are better policy structures in existence to fund the athletic system and the educational system.\n\nThere is no diminishing marginal utility. Education pays off - period. The more educated the populace is the better of it will be - period. It[.] not just about math and science either - knowledge of the humanities and social_sciences is beneficial too. Humanities gives people a sense of their culture and the ability to build that culture more. Social science lets people understand the society they live in, and gives them the ability to cut through bullshit when politicians try to sell it to them.\n\nDiminishing marginal utility my ass."}