{"doc_id": "833", "name": "2011_11_humanities_student_major_349_science", "namespace": "we1sv2.0", "metapath": "", "pub": "science", "title": "2011-11-humanities-student-major_349_science.txt", "pub_date": "2011-11-05T00:00:00Z", "Sentiment": "0.16", "Subjectivity": "0.414", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "449", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2xc8wj", "Reddit_id": "c2xcfyq", "Subreddit_id": "t5_mouw", "Commenter": "DoWhile", "length": "2703", "content_scrubbed": "If professors hate teaching and are able to fund their research entirely through grants, then why be associated with a University at all?\n\nIt[.] much easier to get grants when you are associated with a university.  In return for the \"clout\" you get for being associated with a university, the university gets a cut of your grant money as well as IP rights to your research.  If you are just on your own it will be quite difficult for you to get grants.  Many people who do research also need to work in teams, and sometimes these teams only exist inside universities.  There *are* research labs not associated with any university (think NASA/JPL, or companies like Microsoft) and many fantastic researchers work there as well.\n\nBeing a professor at a good university also means you have access to top grad students, which is something that is hard to come by outside a university (at best, you can get some research interns at your company).  Also, tenure.\n\nOn the flip side, some professors love teaching and do very well at teaching, but maybe can't get grants or get fewer grants.  Perhaps this is more true outside of the STEM fields (I can't speak for Literature/History/Communications/Women[.] Studies professors), and these professors do use up some of the tuition, donations, and cuts of money the university got from the grants of other professors.  There is quite a \"distribution of wealth\", so to speak in universities.  I would guess that a typical good-to-great STEM research professor can pull in more money for the school (via cuts of grant money) than they cost.  But there are some who are \"slacking\" and that needs to be covered by university funds.\n\nAgain, I'm not saying the big bad greedy administrators are taking all the money, because these people, as much as they make, are quite limited: there is only one dean per school, one president for the entire university, etc.  Universities *do* have a lot of infrastructure they have to maintain.  They have campus services, campus police/fire, their own power generators, gyms, student unions, etc. that all need to be maintained.  Large universities house a population of 30k+ and is equivalent to that of running a small city.\n\nFinally, I should point out that there are \"teaching\" universities, which aren't doing world class research but rather focus on teaching the subjects well and really trying to educate the students.  These are sometimes lambasted for being too \"liberal_artsy\" because they don't produce cutting-edge research, but they *do* have excellent teachers.  Unfortunately, how \"prestigious\" a school is isn't based on how well it teaches, but rather how many Nobel Prize winners you have/how big your endowment is."}