{"doc_id": "832", "name": "2011_11_humanities_student_major_334_science", "namespace": "we1sv2.0", "metapath": "", "pub": "science", "title": "2011-11-humanities-student-major_334_science.txt", "pub_date": "2011-11-05T00:00:00Z", "Sentiment": "0.133", "Subjectivity": "0.358", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "259", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2xb17d", "Reddit_id": "c2xbj57", "Subreddit_id": "t5_mouw", "Commenter": "Eurynom0s", "length": "1480", "content_scrubbed": "I'm an applied physics MS student right now. I know how to surround myself with help. I lived in my professors' offices in undergrad (at a liberal_arts college). But when the TA can't speak English, the other students in the class barely speak English and seemingly want nothing to do with anyone who isn't Chinese, and the professor seems to wish they didn't have to teach because it[.] wasting their valuable research time, what the fuck am I supposed to do?\n\nRight now I'm taking a solid state physics class and I called one of my undergrad professors asking him for a recommendation on other books to use because I remember he taught a solid state course a couple of years ago... he wound up sending me lecture notes, homeworks (with solutions), and the exam from the class (with solutions). His class doesn't line up 100% with the class I'm in now, but it does for the most part, and it[.] way more fucking helpful than the actual class notes from the class I'm in.\n\nThe thing is though, I'm very lucky to have had good relationships with my professors, and to have had awesome professors. Getting on grad school by having your undergrad professors send you lecture notes is not really a good long_term strategy, for starters because there[.] no guarantee they'll have relevant lecture notes to the classes you're taking. Plus it[.] further reinforcing my view that my undergrad gave me a way better quality of education than I'm getting in my master[.] program (at Columbia, BTW)."}