{"doc_id": "907", "name": "2011_11_humanities_student_major_1293_neuro", "namespace": "we1sv2.0", "metapath": "", "pub": "neuro", "title": "2011-11-humanities-student-major_1293_neuro.txt", "pub_date": "2011-11-28T00:00:00Z", "Sentiment": "0.175", "Subjectivity": "0.317", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "554", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_msbj0", "Reddit_id": "c33j0vh", "Subreddit_id": "t5_2qu9b", "Commenter": "DaisyCarbine", "length": "3315", "content_scrubbed": "Regarding research experience:  If you are at a non-research-intensive institution (like a smaller college or a teaching university), look into summer programs at large research universities.  If there is a particular university that you are interested in for graduate school, by all means see if they have a summer program and apply to it.  (And don't be discouraged from applying to their grad program if you don't get accepted into their summer program!)  When I was an undergrad, I went to a liberal_arts college.  I did two summer research programs and a winter research program, all at different universities -- several years into my grad school career, a professor told me that the thing that had given me an edge over several similar applicants was the amount of lab experience I'd had.  Try to get into a lab that uses rodent or primate models, depending on what sort of research interests you.  Not all neuroscientists do animal research on rodents or on primates, but many do, and grad school would not be the time to discover that you're squeamish about handling rodents.  Human neuroimaging experience would be valuable if you want to do that, but doesn't necessarily translate well into a lab that does electrophysiological recordings, live-cell imaging, or molecular biology, for example.\n\nMake sure you're a good writer.  You're going to be writing for a living: not just papers, but grant proposals, progress reports, and that whole dissertation thing, too.  And start learning to use EndNote TODAY if you aren't already using it.\n\nReally, the best specific tactics vary depending on which specific niche of neuroscience you want to fall into.  If you want to do fMRI imaging, you'll need more statistical training than if you want to be a cell biologist (but it will never hurt you to know more math).  If you want to do computational neuroscience, you will need to know Way More Math And Computer Science Than Me.  If you want to do something that requires \"good hands\" (electrophysiology, some branches of developmental neuroscience, anything that requires difficult surgeries or dissections), find out whether you actually HAVE good hands by doing undergraduate research in a lab that uses similar techniques: I've seen several people crash and burn because they insisted on trying to do stuff that they just lacked the motor skills for (like the woman who spent over a year in an electrophysiology lab and could never learn to patch onto a cell).\n\nCurrently, I'm doing a post-doc.  I'd classify myself as a molecular and cellular neurobiologist, but I make occasional forays into systems neuroscience and behavioral analysis.  What I wish I'd done differently in undergrad: I should have taken more math and computer science courses and skipped a few of the upper-level neuroscience and cell biology courses I took.  Now I need to play catch-up in order to learn enough to be able to use some of the computational modeling approaches that would be helpful to my research.  (But, conversely, take heart: as long as you're always hungry to learn and discover new and awesome shit, you'll be able to learn whatever you need to know on your own time.)\n\ntl;dr: Do research.  Drink beer.  What you should do depends on where you want to be in five years, but it probably involves learning more math."}