{"doc_id": "871", "name": "2011_11_humanities_student_major_887_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2011-11-humanities-student-major_887_politics.txt", "pub_date": "2011-11-16T00:00:00Z", "Sentiment": "0.032", "Subjectivity": "0.224", "Score": "70", "Upvotes": "70", "Downvotes": "0", "Wordcount": "429", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mep8k", "Reddit_id": "c30cgq0", "Subreddit_id": "t5_2cneq", "Commenter": "GPechorin", "length": "2508", "content_scrubbed": "Keep your panties on.  If anything, the journalist should be shamed for such egregious propaganda and attempting to create an image of impropriety.\n\nA poster in r/law, tilio, summed it up well:\n\n*this is silly. statistically speaking, it[.] almost impossible for a top tier judge to hang out with top tier lawyers who don't work at law firms where at least one lawyer at the firm has a case before said judges. 2 dozens law firms sponsored the event. pull up your statistics books kiddos (or do liberal_arts majors not take statistics anymore?).\nthe two firms picked out by name were bancroft and jones day. these are biglaw... we're talking about thousands of attorneys. biglaw probably represents far more than half the parties that make it to the supreme court. in fact, it[.] almost a statistical impossibility to find an attorney who works at a top tier law firm where said firm DOESN'T have a case before scotus. congratulations, the journalist has figured out that water is wet.\nalso, the authors are both making wild accusations of breach of the judicial canons, when there[.] absolutely no evidence the justices were featured on the program, guests of honor, or speakers.\nso indifference? sure. but if indifference was illegal, most of us would have our licenses revoked. but breach of ethics? haha. whiny journalists.*\n\nThe Federalist Society is a well respected (even if you really dislike it) organization that was founded by law school students and has a chapter on just about every campus in the US.  It[.] an organization that both justices have adressed with some regularity for years.  Large firms fund these sorts of things - it[.] what they do.  If you were to apply this logic, no justice would ever be able to attend any legal event.  Hell, these firms give large amounts of money to law schools, too.  I once saw Kennedy give a lecture in a room at my law school that was named after a firm - as the firm donated a big chunk of change - that almost certainly had pending litigation before SCOTUS.  Hell, the law school had litigation before SCOTUS at times proximate to SCOTUS justices visting.  The \"elite\" legal circles are small.\n\nTwo dozen firms funded this event.  Two dozen.  And it was a dinner event.  This wasn't some golf junket where they had some luxurious vacation.  Would you prefer that no sitting justice can ever attend an ACLU sponsored event?  There are things to dislike about Scalia and Thomas.  This, however, is manufactured outrage intended to inflame the unthinking."}