{"doc_id": "826", "name": "2011_11_humanities_student_major_269_engineering", "namespace": "we1sv2.0", "metapath": "", "pub": "engineering", "title": "2011-11-humanities-student-major_269_engineering.txt", "pub_date": "2011-11-04T00:00:00Z", "Sentiment": "0.115", "Subjectivity": "0.463", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "388", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2wv9ea", "Reddit_id": "c2x0q3b", "Subreddit_id": "t5_2qhpi", "Commenter": "ChaosMotor", "length": "2310", "content_scrubbed": "Sure. \n\nThe University (administration) has done everything they can to fuck me over and chase me away, but I've persisted through the idiotic bureaucratic raging storms they create. \n\nThe University (faculty/staff-educational) has been a dream, working around my schedules, resolving my screw-ups, the only niggling problem is they like to schedule massive clumps of courses at the same time, so that three things I need are schedule concurrently (as an example), which means I have taken five years to complete a degree I should have been able to finish in three. \n\nBut, in the meantime, I've received two undergraduate research experiences (NSF-REU) that have paid handsomely and been an absolutely amazingly invaluable experience (including a ten week all-expenses-paid trip to BFE for cross-disciplinary research, and four week-long trips to VERY NICE places for conferences), and been selected for an Entrepreneurship program that is helping me get my business off the ground. \n\nAs a \"non-traditional\" undergrad at 30 with a Liberal Arts degree, I'm a bit older than half my classmates, and the other half are ex-military, married, with children. But I've also got more experience in and out of the field, and my BLA (emphasis English / Communications, some work in Sociology/Anthropology and Philosophy) means that I know how to write and speak better than most of my classmates, so I generally get picked to lead any projects we do, and be the main presenter.\n\nSince I now have 240 credit hours for three degrees (BLA, EE, CompE), and I'm only 30 away from a fourth degree in Physics, and eight credits from a fifth degree in Math, and eight credits from a Minor in Entrepreneurship (already have a cert in it), all of which I can finish any time in the next seven years, I'm well set up to really build my CV into a powerhouse. However, since I'm raising funds to get my company running, and every potential investor I speak to is VERY positive about our products and business plan, I probably don't need any more padding or degrees. \n\nI currently owe around $40,000 for everything, since my first attempt was almost entirely funded by scholarships, but if my company is funded I'll be making $75k right out of the gate, I'm not worried about my debt load. \n\nWhat specifically would you like to know? "}