{"doc_id": "876", "name": "2011_11_humanities_student_major_993_latin", "namespace": "we1sv2.0", "metapath": "", "pub": "latin", "title": "2011-11-humanities-student-major_993_latin.txt", "pub_date": "2011-11-19T00:00:00Z", "Sentiment": "0.066", "Subjectivity": "0.397", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "399", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mc2pl", "Reddit_id": "c316o0q", "Subreddit_id": "t5_2qloa", "Commenter": "Valerius", "length": "2256", "content_scrubbed": "You may be framing the question in too narrow a way. A college degree is for many a type of job training which often necessarily channels into a certain type of job. You study medicine to be a doctor, journalism to work in media, classics to do classics things, whatever. However, it[.] often the case that people wind up working jobs not even tangentially related to their degree or previous work experience. This works because of the transferable skills they developed in their previous work and education.  \n\nYou may find you love classics and want to go on to do classics for the rest of your life, either getting a PhD or teaching Latin, and that[.] great. But you should always keep in mind that studying classics doesn't necessarily limit your career possibilities. An education in Classics, as well as an education in any of the Humanities, teaches you many particular things about the subject matter, but ultimately those things are just another medium used to learn how to think and think analytically, which is really what all education should do. That[.] the essential skill that will ultimately help open doors for you.  \n\nWork experience is always a plus. So don't neglect getting internships while in college, particularly internships abroad if you can hack it. They'll earn you strong references and give you a better sense of what you may or may not want to do after college. Even if the internships give you a sense of what you don't want to do, you've still learned skills from them which you can transfer to other things. \n\nMyself, I graduated a couple years ago with a Classics degree and with hard_work and what I consider a good deal of luck have landed myself a solid job as systems analyst in a marketing department. When I first started college, I had no thought that I'd ever have such a job. After graduating, I ended up taking some chance temp jobs and after proving I had the general skills, I was given the opportunity to learn all the various particulars. \n\nSo keep your options open and think of your degree not as a sign of the subjects you've studied, but of the skills you've learned and can use for a variety of roles. If that looks grim and you really like the Classics, you can always double major.\n\n**TL;DR** - Odysseus"}