{"doc_id": "852", "name": "2011_11_humanities_student_major_668_psychology", "namespace": "we1sv2.0", "metapath": "", "pub": "psychology", "title": "2011-11-humanities-student-major_668_psychology.txt", "pub_date": "2011-11-11T00:00:00Z", "Sentiment": "0.077", "Subjectivity": "0.294", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "317", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2yxf30", "Reddit_id": "c2yy5pi", "Subreddit_id": "t5_2qhcz", "Commenter": "Behavioral", "length": "2039", "content_scrubbed": "** Of people in the labor force.\n\n[Discouraged workers](http://en. wikipedia. org/wiki/Discouraged_worker) don't make up the labor force. I'd like to see the overall size of the labor force (as a proportion of the Civilian Non-Institutional Population of 1. 8 million graduates) that[.] included in the statistic. Some majors have more graduates leaving the labor force than others.\n\nPsychology graduates with only a Bachelor[.] degree tend to be collapsed with humanities_major to be part of the growing number of [underemployed workers](http://en. wikipedia. org/wiki/Underemployment) in the labor force. Examples of this are graduates taking jobs that don't require a Psychology (or sometimes even a college degree, for that matter) to obtain. Graduates taking these positions are counted as employed in labor statistics, but economists point out the inefficiency in this market based on the high turnover rate (workers demanding higher pay/benefits due to more skills) with rigid employers (who don't need to pay you more since jobs can be filled by many available workers).\n\nOne of the reasons you see counter-intuitive patterns in employment data among recent graduates (i. e., engineers and hard_science majors having equal or higher levels of unemployment than psychology/communications majors, for example) is because of job holdout due to expectations on job-type. It[.] a logical fallacy for me to use this as an example, but what[.] more typical: a psychology graduate or a CS graduate serving you coffee at Starbucks?\n\nAnd lastly, I'm a PhD student -- I applied to one Psych program (and got in), but ultimately chose to get my PhD in Marketing doing essentially the same research. I got my underdgraduate degree in joint math/econ and psychology (double major), so doing research in a business school made a lot of sense since I wanted to be in a department where I could do both experimental decision-making research along with analytic game theory modeling instead of having to divide my time between two departments in grad school."}