{"doc_id": "849", "name": "2011_11_humanities_student_major_550_wtf", "namespace": "we1sv2.0", "metapath": "", "pub": "WTF", "title": "2011-11-humanities-student-major_550_WTF.txt", "pub_date": "2011-11-08T00:00:00Z", "Sentiment": "0.021", "Subjectivity": "0.25", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "334", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2y5sa9", "Reddit_id": "c2y5x03", "Subreddit_id": "t5_2qh61", "Commenter": "[deleted]", "length": "1969", "content_scrubbed": "I *chose* not to transfer because I didn't have the money, so I *chose* to stop attending. Once I was there and had paid tuition, though, I wasn't getting that time or money back. All of my friends who went to American schools said pretty much the same, which is that the education was lackluster at best, except those that went to $40k liberal_arts colleges who enjoyed their education and are all significantly better educated and more well rounded than anyone else I know.\n\nColleges awarding degrees that don't deserve them, or awarding them without teaching the basic skills the degree ought to represent *does* mean it[.] broken and that they've failed their mission. Their mission was to educate those dolts, and yet they not only failed to do that, but then signed a piece of paper saying they had educated those dolts.\n\nNot only does this practice make any degree I'd get suspect and worth significantly less, but it undermines the entire process as education is no longer the primary goal of educational institutions. Instead graduation is the primary goal, which leads to a higher graduation rate which leads to more students applying and more being accepted, which leads to higher class sizes and poorer education and also to higher tuition as colleges become more \"competitive\".\n\nAs someone with a significantly above average SAT score who went to community college for bullshit credits and had a decent GPA, I thought I'd have my pick of colleges, too. But you know which ones accepted me? The ones that had some evidence that I, or my family, had money. That[.] fucking it. That was the most consistent aspect of my acceptance to college. Not the essay, or location, or even being a legacy student. Nope. The ones that accepted me all had evidence that I could pay. When educational institutions put a higher priority on profits than education, they are no longer educational institutions, they are businesses that happen to offer some educational services."}