{"doc_id": "857", "name": "2011_11_humanities_student_major_743_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2011-11-humanities-student-major_743_explainlikeimfive.txt", "pub_date": "2011-11-13T00:00:00Z", "Sentiment": "0.084", "Subjectivity": "0.424", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "349", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mazx5", "Reddit_id": "c2zhq1z", "Subreddit_id": "t5_2sokd", "Commenter": "DoubleSidedTape", "length": "2166", "content_scrubbed": "0-4ish: pre-school, this is optional but is correlated with higher socioeconomic status and attending is shown to be a good predictor of future success.\n\n5-11: kingergarten (grade 0) and grades 1-6, this is called elementary or primary school.\n\n12-13: middle school, or junior high school.  grades 7-8\n\n14-17: high school or senior high school, grades 9-12, with years referred to as freshman, sophomore, junior, and senior.  These schools are separated differently depending on the school districts.  My schooling has grades 0-6 in one school and 7-12 in another school.  This is compulsory until the age of 16.\n\n18+ is university, which typically starts with about 4 years of an undergraduate program, and usually culminates with a bachelor of science or a bachelor of arts, but there are also other programs, such as 5 year engineering programs which end with a masters, or other vocational programs like nursing, etc.  Some people decided to go to community college first, which are typically local to each county, and have 2-year programs that reward an associates degree, which can later be applied to the first two years of a 4-year program at a university.  Community colleges also have vocational programs like the trades (carpentry, electrician, mechanic), and may have other programs like nursing.\n\nAfter you have a 4-year degree, you can choose to pursue higher (postgraduate) education.  Most masters and doctorate programs are examples of postgraduate education.\n\nIn the sciences, most candidates pursuing PhDs are fully funded by their university, and some receive a Masters degree along the way.  PhD programs typically take about six years and must include original research.\n\nIn engineering or the liberal_arts, you can go for a masters or PhD but these programs are less likely to be funded.  A masters usually takes 2-3 years.\n\nThere are also the professions, such as medicine, dentistry, and law, which have their own separate schools and processes, but are still likely to be part of the major universities.  These programs are all very expensive, and can be extremely competitive to get into.  A typical MD will graduate with $250,000 in debt."}