{"doc_id": "881", "name": "2011_11_humanities_student_major_1057_needadvice", "namespace": "we1sv2.0", "metapath": "", "pub": "needadvice", "title": "2011-11-humanities-student-major_1057_needadvice.txt", "pub_date": "2011-11-21T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.318", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "794", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mk4bi", "Reddit_id": "c31nvrl", "Subreddit_id": "t5_2r367", "Commenter": "bluequail", "length": "4059", "content_scrubbed": "Even on Reddit I am disappointed because almost all of the people here are college age and older.\n\nThat is because it is a site for adults mostly.  Unfortunately, I have no idea where to direct you to, where you would find more kids your age.\n\nI do not do my schoolwork.  I avoid it like the plague.  I like to consider myself as somewhat above average intelligence.\n\nIf you were the smartest person in the world, if you are too lazy to do your schoolwork, you aren't going to succeed anywhere.  At your age, your schoolwork is your \"job\", and you just have to suck it up and do your work.  Just like when (and if) you graduate college some day, you'll get a job, and there will be aspects of your job that you don't like, and you are going to have to do those anyhow.\n\nPublic school produces Jacks of all trades.\n\nActually, public schools produce whatever the kids want to be.  One of my sons has a very focused goal, and his teachers work with him to help him attain that very focused goal.  For someone that is drifting around with no clear concept of where they want to go in life, the teachers can't help them go in any direction, because it is up to the student to decide where they want to go and what their goal is.  You are fortunate that you have the luxury of not having to make up your mind right this very second - there was a young lady in India that was talking about having to decide by the 11th grade what they want to do for the rest of their life, and at that point, all of their training is towards that goal, and that goal only.  They don't have the option of changing their minds 2 years later, and switching from say the arts to science.  What they pick at grade 11 is what they will be doing until the day they retire.  :)\n\nI hate the concept of homework, as well, but I could deal with it if all of it was for things I wanted to learn, or thought were useful.\n\nWhether you want to learn it or if it is useful or not, these are the hoops that you have to jump through to get done with school.  It is something that everyone has done before you, and you will have to do it as well.  So for the time being, you just need to do your work whether it is fun or you like it or not.\n\nI can kind of understand where you are coming from on everything.  Right now, you have spent about 2/3rds of your life in school and you are bored or it just plain sucks.  You are also looking at spending about that much more time in school. But to be able to go anywhere in life, you need your education, regardless of where it comes from.  If you don't get a diploma, or at least a GED (and I really don't suggest a GED if you have the option of getting a diploma), you can't even go to a community college.  You can't join the military if you choose to do so.  You will be very limited in your choices of work, if you can't at least prove you have the bare minimum skills that are expected of people that enter the workforce.  Without an education, about all you will probably find yourself doing is working as a waitress (and many people treat their waitstaff very poorly), you can be a housewife, or you may get lucky and work retail.  Or maybe not, many of those jobs require a HS diploma or equivalent.\n\nAlso, now is the time to find things that interest you.  What do you think you want to be when you grow up?  What kind of things interest you?  Do you want to be a biologist or a vet?  Then you need to be sharp in biology and math.  Now is the time to start looking at what you think you want to be when you are done with your education, and start working in that direction.\n\nEdit - \n\nI would love more than anything to be like that. It would be much easier if I just ignored public school altogether instead of letting them force knowledge I don't need or want into my head, taking up space.\n\nThe same shit happens in college.  You have to take certain core courses that you probably won't need in your chosen career, but if you want the diploma, you will take the classes.  I have a whole theory on why, but I won't waste your time with it here."}