{"doc_id": "863", "name": "2011_11_humanities_student_major_808_gloveslap", "namespace": "we1sv2.0", "metapath": "", "pub": "gloveslap", "title": "2011-11-humanities-student-major_808_gloveslap.txt", "pub_date": "2011-11-15T00:00:00Z", "Sentiment": "0.062", "Subjectivity": "0.206", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "274", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2zz0x1", "Reddit_id": "c2zz884", "Subreddit_id": "t5_2t3hi", "Commenter": "derKapitalist", "length": "1580", "content_scrubbed": "It is to you and me, but it isn't to others, which is why isn't not like arguing against teaching gravity. Evolution, if true, throws a big wrench in the worldview of some.\n\nLet me ask you this, though: does it even matter? Does that give you or anyone else the_right to mandate that children a) show up to public school, and b) learn that material? \n\nBesides, lots of things are scientific facts, yet few of them are taught in public schools, and nobody gets riled up about it. Not just super high minded or especially niche topics, either. \n\nI'm sure more than a few sets of chemistry lab materials have been done away with in the name of budget cuts, for example, which meant fewer students were able to learn the basics of chemistry (a far more applicable science than evolution, by the way) and scientific lab work. If chemistry lab materials were on the chopping block at your local school district, and evolution was on the chopping block the next district over, which do you think would receive a more vocal public outcry? Or hell, funding for the arts vs. evolution? The answer is evolution every time, and it[.] for non-academic reasons.\n\nIf arguing against teaching evolution is like arguing against teaching gravity, then arguing for teaching evolution should be like arguing for teaching physics with calculus methods, rather than pre-calc. Yet nobody back at my high school tried to make that case (other than myself and a few other students). It[.] amazing how little parents care about public schools' academic standards, except when they want to wage a culture war."}