{"doc_id": "825", "name": "2011_11_humanities_student_major_266_propagandaposters", "namespace": "we1sv2.0", "metapath": "", "pub": "PropagandaPosters", "title": "2011-11-humanities-student-major_266_PropagandaPosters.txt", "pub_date": "2011-11-04T00:00:00Z", "Sentiment": "-0.003", "Subjectivity": "0.341", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "230", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_lzkwm", "Reddit_id": "c2x0nk0", "Subreddit_id": "t5_2rm3n", "Commenter": "alllie", "length": "1535", "content_scrubbed": "They made even the statue of liberty ugly and denigrated working class people as idiots who didn't know anything. And made freedom only about the freedom of the rich to make money. I wonder what millionaire paid for that. It was produced by Harding College, a private liberal_arts Christian university associated with the Churches of Christ.\n\nThe Harding American Studies Institute (ASI) is designed to supplement students' academic training and promote \"a complete understanding of the institutions, values, and ideas of liberty and democracy.\" In doing so, the ASI exhibits a generally conservative political stance, focused on going \"back to the fundamental values that made this country great.\"\n\nPrior to the formal foundation of the ASI, Harding was also involved in the production of a series of animated cartoons extolling the virtues of free-market capitalism. This, too, forms a precursor to the political conservatism that has characterized the ASI. This series, including 1948[.] \"Make Mine Freedom\" (which, ironically, portrays activities not permitted by Harding[.] code of conduct at the time) http://en. wikipedia. org/wiki/Harding_University\n\nSo it showed freedom it did not think people should have. \n\nLook at who they think are respectable lecturers, the most evil men in our country: http://en. wikipedia. org/wiki/Harding_University#Lecture_series\n\nEvil promoting evil. \n\nIt[.] not good art, not even as good as Disney or Warner Brother[.] Looney Tunes.  \n\nBut still interesting to watch and trace out who made it and why. "}