{"doc_id": "889", "name": "2011_11_humanities_student_major_1129_uofmn", "namespace": "we1sv2.0", "metapath": "", "pub": "uofmn", "title": "2011-11-humanities-student-major_1129_uofmn.txt", "pub_date": "2011-11-23T00:00:00Z", "Sentiment": "0.123", "Subjectivity": "0.437", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "325", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mmzne", "Reddit_id": "c32cdzr", "Subreddit_id": "t5_2s492", "Commenter": "[deleted]", "length": "1841", "content_scrubbed": "You mentioned Chemistry, so it[.] important to point out that the U of M[.] Chemical Engineering (a different degree, I realize) program is pretty consistently ranked #1 in the country. A lot of the other sciences are ranked quite well, also.  I can't much speak to the liberal_arts, unfortunately.\n\nI graduated with a B. S. in Geology and a B. S. in Geophysics in 2009.  I'm currently attending grad school at Iowa State, and I'm honestly a bit shocked/disappointed at how little math, science and general knowledge of basic tools (Excel, for example) graduating seniors at ISU have. Basically, I'm saying the U of M did me well in that regard.\n\nAlso, as a gay guy who came out several times at the U after coming out once in high school (it[.] rarely a one-time deal, unfortunately), I never had anyone raise a single issue, ever. If anyone had some remarks, they knew they weren't welcome and would be quickly condemned nearly universally. To that end, my final coming out (friend group changed dramatically as all my friends graduated and I made new ones) was at a bar with undergrads, grad students, staff and a few faculty members from my department, and everyone was super incredibly nice and welcoming. It was a small department, so gossip spread, but it actually led to a few people confiding in me and eventually coming out. It was an awesome experience, honestly.\n\nSimilarly, the GLBT student services at the U of M were great.  I tried getting a feel for them at ISU and was incredibly disappointed in how unwelcoming and off-putting some of the people were. An anecdote, for sure, but I do believe it[.] representative.\n\nAnd this is all to say nothing of how accepting and gay friendly Minneapolis is as a whole, but that'd be a whole other long post.\n\nLet me know if you have any more questions, I'd be more than happy to answer any."}