{"doc_id": "847", "name": "2011_11_humanities_student_major_519_astronomy", "namespace": "we1sv2.0", "metapath": "", "pub": "Astronomy", "title": "2011-11-humanities-student-major_519_Astronomy.txt", "pub_date": "2011-11-07T00:00:00Z", "Sentiment": "0.281", "Subjectivity": "0.522", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "357", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2xyyfp", "Reddit_id": "c2xz7t1", "Subreddit_id": "t5_2qhor", "Commenter": "WillFight4Beer", "length": "2055", "content_scrubbed": "I mean it[.] almost cliche to say so, but obviously the Ivys and Stanford and schools in that caliber tend to be the absolute top for pretty much everything.  You're probably already aware of that.  Prestige isn't irrelevant, but it[.] less important than society would have us believe.\n\nTo be honest, there[.] only so many ways you can teach Newton[.] laws and Schrodinger[.] equation and special relativity.  This isn't a humanities field where you'll be getting a vastly different teaching experience from school to school.  The laws of physics are the same no matter which university you go to.  If hands on attention is important than a small, teaching focused school will be nice.  If you like being a small fish in a big pond (like me) then the big state schools offer tremendous value.\n\nI actually was a very good HS student, and got into a couple big Ivy-caliber schools.  I ended up just going to my local state school, and I don't regret it for one second.  My family could afford the state school so I'm graduating without debt, I've had some great teachers and done some awesome research.  The biggest thing is that no matter where you go, make sure to stand out from the herd.  \n\nIf finances are an issue, then getting some of the introductory classes out of the way at community college is great.  Just make sure to get great grades so that you can transfer to a good 4-year.  \n\nAlso, many schools will not have dedicated astronomy departments/not offer an astronomy major.  This is not an impediment to grad school, as grad students come from pure physics backgrounds all the time (reinforcing, again, the fact that during undergrad it[.] physics that[.] important).  However, if you know you are going to want to take a lot of upper-division astronomy courses for your own interest/sanity (which is totally fine), then having a dedicated astronomy department can be a factor.  Not a bad idea to check course catalogs.\n\nAre you in a big state with a good public university?  If so, I'd look into it first, assuming a big school isn't a problem.  "}