{"doc_id": "887", "name": "2011_11_humanities_student_major_1119_nosleep", "namespace": "we1sv2.0", "metapath": "", "pub": "nosleep", "title": "2011-11-humanities-student-major_1119_nosleep.txt", "pub_date": "2011-11-23T00:00:00Z", "Sentiment": "0.017", "Subjectivity": "0.302", "Score": "16", "Upvotes": "16", "Downvotes": "0", "Wordcount": "1541", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c328dsj", "Reddit_id": "c328e3x", "Subreddit_id": "t5_2rm4d", "Commenter": "LucienReeve", "length": "8560", "content_scrubbed": "PART 3\n\nIn Cambridge, he questioned a friend of his who was a fellow at Gabriel College about Dr. Blackwood[.] time there. It seemed that Julian Blackwood had passed his three years as a student in a very respectable manner: he had achieved a double starred first in classics and been a background member of the ultra-conservative Pitt Club. There were really only two things that anyone could remember about him. The first was that his best friend, a young historian named Peter Brown, had been sent down in Julian[.] third year for dealing drugs. Julian had professed shock and dismay at the discovery. \n \nThe other thing was, that Julian had wooed and won the heart of a visiting American graduate student - a Fulbright scholar named Madeleine Plainview, who was the heir to an enormous oil and natural gas fortune. They had married not long after he graduated. \n \n\"You mean to tell me,\" said Dr. Culkin, \"That the blonde beast is actually rich as Croesus?\" \n \n\"Exactly so,\" said his friend, who did not care for Dr Blackwood either. \"Or his wife is, at any rate. And I'm sure she could get him a position as a 'consultant' to any major corporation or large bank you cared to name. But for some reason, he wants to spend his time lurking around Rook Hill. I suppose it could be because he was born and brought up there - Rook Hill calls to its own.\"\n \nIt turned out that Julian Blackwood had been to a public school in Rook Hill named Wyckham College - a second-tier former boarding school with enormous red-brick Victorian buildings. The Bursar at Wyckham proved un-cooperative, but he did remember Julian - it seemed that everybody did. He had been their golden boy: prefect, prize-winner, genius. Teachers said that he learned so quickly, it was almost as if he had been born with the whole of human knowledge buried in his brain and only needed the lightest hint to be reminded of it. \n \nWhen Dr Culkin returned to work, he found Mercer[.] College in uproar at another disappearance. A 20 year old student named James Rygate had vanished. His friends had half carried him back from the pub on the evening of the 20 November and left him in his campus room. The next day, he didn't answer his door. One of his friends broke into the room by using a bread-knife to force the lock. His window was open and there were signs of a struggle, but nothing else for the police to go on. \n \nDr Culkin immediately went looking for Dr. Blackwood, but nobody had seen him. Dr. Blackwood had cancelled one of his regular lectures and was not to be found in his office (which, to Dr. Culkin[.] disappointment, contained no evidence of foul play or black magic, just a lot of academic paperwork). According to the college administration, Dr. Blackwood had had to take leave for urgent personal reasons. \n \nTwo days later, as Dr. Culkin was polishing off a glass of wine in a cafe on Woodland Road, he saw Dr. Blackwood walk past. He immediately leaped up, fished out a ten pound note, threw it down on the table and telling the shocked waiter to keep the change, set out in pursuit. \n \nA six foot four man of more than average weight is not, perhaps, physically suited to the arts of espionage. Fortunately, it was a chill and misty day and Dr. Blackwood did not look back - he seemed completely oblivious to his pursuer. Together, they went up the hill towards the looming towers of St. Martin[.] Gardens. \n \nAt the edge of the estate was a grassy, open area that sloped up steeply. Families would gather there on bonfire night, not just to set off their own fireworks but because it was so high up that they could see fireworks displays going off all over London. The winters in the late 1990s were rainy rather than frosty and the dirt path that wound up through the grass was muddy. Scrawny trees dripped icy water onto Dr. Culkin[.] head.  \n \nDr. Blackwood strode up the winding path, through a black iron gate and under a concrete archway, into the estate. Dr. Culkin followed after. \n \nThe walls of the archway had been decorated heavily with graffiti. Alongside the scribbled names and big colorful letters, a recurring motif was that of a closed eye. \n \nSt. Martins Gardens was almost like a medieval castle, with large walls around a central square. In the square was a basketball court and a children[.] playground. The far side of the estate rose up into a huge spike, called the North Tower. \n \nDr. Blackwood walked around the edge of the central courtyard, toward the entrance to the public stairwell that ran up the inside of the North Tower. \n \nDr. Culkin, lurking in the archway, saw his quarry disappear through the gate that the led into the stairwell. He decided to take a risk. As quickly as he could, he walked across the courtyard, past the rusting chain-link fence of the basketball court and the swings of the children[.] playground. Balconies and windows rose up on all sides - there was nobody in sight, but he felt a hundred eyes staring down at him. \n \nHe reached the gate and tugged at it - it had a code lock, but someone had left it open. He stepped through and listened hard, for the stairs ran down as well as up. From down below, he heard the sound of footsteps, descending. \n \nQuickly and quietly, he padded down the stairs. He was sweating and there was a stitch in his side. The stairs zig-zagged back and forth in short flights of thirty or so steps broken up by tiny landings. He passed one landing, then another and another. It felt like he had gone down at least thirty feet. Where was he? \n \nThe stairs were lit by fluorescent strips. The walls were pitted concrete, streaked and stained by water damage, plastered with posters advertising long-forgotten gigs.  \n \nThere was a door at the next landing, but from below Dr Culkin could still hear the sound of footsteps. He tested the handle of the door and, finding it open, took a quick look through: a car park. Perfectly ordinary. He closed the door as quietly as he could and continued his descent. \n \nTwo more landings down and, to his dismay, the fluorescent lights stopped working. The last functional one was at a landing and it only half-worked, flickering on and off and buzzing like a wasp in a jam jar. When it was on, Dr. Culkin could see that the concrete steps continued down to another landing. \n \nDown he went. From that landing, the stairs still descended, this time into complete darkness. \n \nNow Dr. Culkin seriously considered going back. \n \nHowever, he was a curious man and a brave one, and moreover he had a tiny Maglite torch attached to his keyring. He turned the torch on and pointed it down, into the black. In the narrow circle of light, at the bottom of the steps, he could see yet another landing. \n \nHe went down. It was cold and damp and there was a faint smell in the air like rotten eggs. His whole awareness had contracted to the tiny area lit by the torch. His heart was pounding. He half expected that at any moment some monstrous creature would thrust itself suddenly into the light, arms spread wide - the shadow in Dr. Blackwood[.] office -\n \nHe reached the next landing. It was like all the others (though like the one a few flights up, it had a door, which was metal and painted a dull red).\n \nDr. Culkin walked past it and was about to go down the next flight of stairs, when he realized that he could no longer hear Dr. Blackwood[.] footsteps. He turned and looked back at the red door. It looked old, scuffed and pitted. A little like the door to a warehouse – no, a meat locker. Dr. Blackwood must have gone through there.\n \nThere was a handle. Dr. Culkin stepped forward to grab it - and his foot struck something hollow, kicked it in fact, so that it flew forward, bounced off the wall beside the door and went ratting down the stairs behind him. It was a bit like kicking a football, only heavier, meatier... Instinctively, he turned and pointed the torch downwards after it - \n \nTwo minutes later, he rushed out into the light, puffing, red-faced, barreled past some startled youths who were hanging out by the gate of the estate and did not stop to call the police on his primitive mobile phone until he was a hundred yards down the hill. \n \nHe told the officers what it was that he had seen: a half decayed human head. That alone made him feel like his blood was shot through with ice. But where the head had landed, within the circle of light cast by the torch, at the bottom of the next flight of stairs, he had seen three other bodies, in various states of decay and seemingly half sunk into the concrete, as if it were quicksand. \n"}