{"doc_id": "838", "name": "2011_11_humanities_student_major_433_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2011-11-humanities-student-major_433_funny.txt", "pub_date": "2011-11-06T00:00:00Z", "Sentiment": "0.134", "Subjectivity": "0.386", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "767", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2xlmq4", "Reddit_id": "c2xm14i", "Subreddit_id": "t5_2qh33", "Commenter": "[deleted]", "length": "4490", "content_scrubbed": "Okay, a lot of what you're talking about is just general good practice for getting yourself started in any career, as in, don't just go to class but also look for opportunities in your field that might help you later on.\n\nAs far as \"hedging your bets\" with a double major in something like \"marketing\", well, I wouldn't bother.  Marketing and business degrees are a dime a dozen.  A lot of people with those majors aren't attending school to get an education but rather to get a degree in the name of resume building.  For all of the extra work it[.] going to entail I doubt it[.] going to have a significant impact on your employment prospects after school.\n\nWhich brings us to the next question which is \"What is college for?\"  A lot of what you're saying approaches school from the perspective of enhancing employment and financial prospects, but that[.] not really what a college education is for, IMO.  There[.] this idea that because there[.] a correlation between earning a college degree and higher lifetime wages that the *reason* to attend school is so that you can earn higher lifetime wages, but the liberal_arts isn't about beefing up your future paycheck.  \n\nThat[.] where you get a certain clash of values and people dismissing certain studies as \"bullshit.\"  The idea seems to be that if you can't draw a straight line from skills/facts/whatever learned in a class to something you could obviously be paid for it[.] just a waste of time.  This is contrary to the traditional notion and purpose of education.\n\nIt used to be that majors/minors weren't that important when it came to finding work after school.  College degrees were taken as evidence of *education*, that is possessing a broad range of knowledge and the capacity to think critically and adapt to new information and situations.  It was assumed that specific or specialty skills would be learned on the job.  More and more college is thought of as merely a high priced vocational school, and I'd agree that, in that capacity, it[.] a waste.  A liberal_arts education is *terrible* vocational education, but the opposite is also true.  We should just keep these distinctions in mind when we talk about college generally because failing to do so tends to confuse the issue.\n\nI think this is where the real conversation and debate needs to be happening.  *What is the purpose of a university education?*  I'd argue that in an era of huge social challenges and non-existent job security a person and society in general will benefit a lot more from a traditional liberal_arts education than a specialized degree designed to get their foot in the door of a field that may or may not have room for them or even exist in 10 years.  This is the sort of thinking you need to understand when you consider undergrads who major in anthropology, philosophy and similar fields of study.  These are perfectly legitimate degrees to pursue *if* the student approaches it for what it is.  One needs to understand *why* they are studying such subjects (to gain a broad perspective, learn how to think independently, and bring new information together to form new ideas).\n\nI think the simplistic and widely accepted characterization of the natural progression \"school-degree-career\" is the real problem in this regard.  A lot of students just don't grasp how to take advantage of their education or what they should be trying to take away from their studies.  They're just thinking \"this is one of the steps to a better life\" when the *real* way to a better life is learning how to make the most of your own abilities, think outside the box, and take initiative.  The glut of marketing and business majors on college campuses spending their parents money on booze and avoiding intellectual challenges at every opportunity (not to say they are *all* that way!) are a testament to our failure at making kids understand *why* college is important and focusing to much attention on the unqualified assumption that they *should* go to college.\n\n**TL;DR: There[.] no such thing a bullshit major, only bullshit college students.  Beyond macroeconomic trends and excepting certain highly specialized fields your future is dictated a hell of a lot more by your behavior than the \"kind\" of degree you have.  Understand that a degree was never meant to be a ticket to Easy Street nor a $32,000 job training program but instead a symbol of your initiative and capacity to engage with and develop new ideas, and you'll do fine regardless of your major.**"}