{"doc_id": "846", "name": "2011_11_humanities_student_major_515_philosophyofscience", "namespace": "we1sv2.0", "metapath": "", "pub": "PhilosophyofScience", "title": "2011-11-humanities-student-major_515_PhilosophyofScience.txt", "pub_date": "2011-11-07T00:00:00Z", "Sentiment": "0.078", "Subjectivity": "0.417", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "927", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2xyj7j", "Reddit_id": "c2xyjgj", "Subreddit_id": "t5_2r7mh", "Commenter": "ObsBlk", "length": "5678", "content_scrubbed": "In his new book Thomas Kuhn: A Philosophical History for Our Times,1 Steve Fuller agrees with the above analysis in only one respect. He too thinks the effect of Kuhn[.] book was a bad one. But Fuller is a professor of sociology at the University of Warwick, and he has the attitudes that a sociologist would predict for a Midlands professor of sociology. His complaint is that Kuhn was not nearly revolutionary enough, especially in politics. In saying Kuhn[.] book was the perfect Sixties product, one qualification is possibly needed. Was it sufficiently leftist? Certainly, the suggestion of the blood of old paradigms staining the water had a reddish tinge. But Kuhn gave no attention to the complaints the_left wished made about the complicity of science in the military-industrial complex. It was disappointing that after all Kuhn[.] work in replacing the logic and philosophy of science with its history and sociology he failed to so much as mention the social effects the_left wished targeted.\n\nThe villain of the piece, according to Fuller, was James Bryant Conant, president of Harvard from 1933 to 1953. His \"General Education in Science\" program at Harvard, in which Kuhn taught, explicitly aimed to give future policy makers a broad understanding of science. In the era of the atomic bomb, Sputnik and the moon race, of penicillin, DNA, and the pill, it was clear that science had much greater social implications than had been thought only a decade or two before. Conant was one of the \"action-intellectuals\" who defined America[.] early Cold_War vision, especially in the areas of science and educational policy. Central to it was the National Science Foundation, which provided large sums for basic research, of the kind that had turned out unexpectedly to be at the basis of the making of the atomic bomb (and in contrast to the kind of science directly aimed at ideologically specified technological ends, like Lysenko[.] biology and Nazi eugenics).\n\nConant[.] preface to Kuhn[.] first book, The Copernican Revolution (1957), linked the decline of Western Europe to its outdated humanities curricula. Yet, he thought, simply teaching humanists a little straight science had not proved effective either. Science tends to lack a storyline or anything that engages the emotions or encourages the taking of sides. \"No one admires or condemns the metals or the behavior of their salts,\" as he justly said. His solution was history. Carefully chosen episodes in the history of science, in early modern times before it had become too complicated, would allow the student to engage with the excitement of discovery, the \"interplay of hypothesis and experiment, and the conflict of personalities and ideas. This was the plan Kuhn implemented in his own teaching, and refined in his books. As it happened, it was not an institutionally successful plan at the time. It was not exported to universities other than Harvard, and when Conant became U_S Ambassador to West Germany, Kuhn was left undefended and in 1955 refused tenure, on the grounds that he was not an expert on anything in particular. General education for humanists at Harvard retreated to the plan of introducing them to a little real science. But the simplified-history-as-moral-lesson scheme certainly had its revenge with the success of Kuhn[.] book.\n\nIn one way, then, Fuller[.] book bears comparison with Frances Stonor Saunders[.] The Cultural Cold_War,2 which described the CIA spending large sums of money to promote such all-American cultural products as Abstract Expressionism. Certainly, Kuhn[.] vision of science was as disconnected from reality as Pollock and as free from bother-some detail as Rothko, and as likely as either to contribute to civilized values. But Fuller[.] spin on the story makes it resemble more closely the thesis of Martin A. Lee and Bruce Shlain[.] Acid Dreams (1985) and Jay Stevens[.] Storming Heaven (1987), according to which the drug culture of the Sixties was a CIA plan that went wrong, and the drugs that at first encouraged the rebellions of those times, in the end undermined them by replacing politics with pleasure. Fuller[.] accusation is that Kuhn was a patio fauvist, a purveyor of gift-wrapped frissons to the intellectual bourgeoisie, chocolate revolutions that exist in the children[.]-fiction world of theories and paradigms, without import in the real world. Prescinding for the moment from the question of whether the defusing of revolutionary zeal is a good thing, the thesis itself is interesting, as is the more general thesis that postmodern and other \"high theory\" forms of leftism act mainly to keep revolutionaries off the streets by channeling their mental energies into endless efforts to understand the incomprehensible. Fuller does not present evidence that any particular theorist was diverted by Kuhn from the path of true socialism which he would have pursued otherwise, but he is right to point to the apolitical, or perhaps better the faux political, nature of Kuhn[.] message, both in the original and its caricature. The research community that pursues a paradigm is a political entity, in the sense that it acts to preserve itself and outmaneuver its rivals, but its talk of \"revolution\" is very harmless; the revolution is in the past, against the previous paradigm, and no present entities have anything to fear from it. Like the violence in a horror film, it[.] all virtual and it[.] over when you come out into the light. At least, that is the correct perspective from the outside society, though denizens of the academy who have to compete for grants and students with the powerful lobbies of rampant paradigms may take a less sanguine view."}