{"doc_id": "902", "name": "2011_11_humanities_student_major_1269_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2011-11-humanities-student-major_1269_politics.txt", "pub_date": "2011-11-28T00:00:00Z", "Sentiment": "0.035", "Subjectivity": "0.376", "Score": "73", "Upvotes": "73", "Downvotes": "0", "Wordcount": "555", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c33fmi6", "Reddit_id": "c33g0qy", "Subreddit_id": "t5_2cneq", "Commenter": "isleepinahammock", "length": "3270", "content_scrubbed": "There[.] nothing wrong with attending college for the intellectual merits alone. The enrichment of oneself, the development of critical thinking skills, the life experience, these are valuable in many non-financial ways.\n\nHowever, I think students need to look seriously about why they're attending. \n\nHere[.] the thing. We have a word in the English language for something that takes up time and money, but is not for financial gain. That word is \"hobby.\" If you're in college studying something that offers no significant improvement in job prospects, you're education is not an investment. It[.] a hobby and needs to be treated as such.\n\nSo what does this mean? Compare these two statements:\n\n\"I went thirty thousand dollars in unbankruptable debt to get a bachelor[.] degree in anthropology.\"\n\n\"I went thirty thousand dollars in bankruptable debt to build an awesome model train set.\"\n\nPeople would think nothing of the first one. People would think you were mad with the second one. Why is this? Both offer little financial return. Both can offer certain social experiences (assuming your involved in some sort of model train club). Both can broaden your horizons. \n\nFor some reason, people consider the first one acceptable even though it[.] no different than the second. Both are expensive hobbies.\n\nSo how should one approach college? First, only go into debt if it[.] actually an investment. Want to study engineering, a hard_science, or something with a solid chance of offering you a significant increase in pay right after graduation? Sure. Take out some student loans for that. Study as many hours as you can a semester. Get through school quick and, make some big bucks, and live cheap until you pay off those loans.\n\nWhat if you want to study English literature, philosophy, or other humanities? Well there[.] nothing wrong with that. There[.] nothing ignoble about studying these. In fact, it[.] a great thing. We need people studying Shakespeare and Plato. This is an entirely honorable thing. \n\nHowever, you just need to realize that this isn't a money making venture. Traditionally, the sons of society[.] wealthy went and studied these subjects. Their parents paid for them to go study the classics. If your parents are rich and are willing to pay for it, sure, go ahead and let them. It[.] their money; they can spend it how they wish.\n\nWhat if you're paying for it though? Well, realize that it is just a hobby and treat it as such. When you look at it this way, suddenly there isn't anything wrong with taking 8-10 years to complete your bachelors. Go start working at a trade like plumbing or electrician. Or hell, just work your way up in retail. Get your degree one or two classes at a time. Pay cash for your tuition as you go. \n\nThe only reason to go into debt for college is to finish it quickly. If there[.] no financial gain to be made finishing college quickly, then there[.] nothing wrong with being a part-time student. \n\nUnfortunately, people insist on having the \"college experience\" instead. For four years they take a humanities major as a full-time student, live in dorms for the \"experience,\" party heavily, and just bill it all to the student loans. Then they graduate with a massive debt that they can't pay off and they can't even bankrupt."}