{"doc_id": "836", "name": "2011_11_humanities_student_major_390_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2011-11-humanities-student-major_390_AskReddit.txt", "pub_date": "2011-11-05T00:00:00Z", "Sentiment": "0.119", "Subjectivity": "0.301", "Score": "26", "Upvotes": "26", "Downvotes": "0", "Wordcount": "322", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_m1yzk", "Reddit_id": "c2xg8r2", "Subreddit_id": "t5_2qh1i", "Commenter": "arun_bassoon", "length": "1806", "content_scrubbed": "Let me tell you a story of my father. (My mother[.] pretty awesome too, but I don't have the whole story in a tellable format.)\n\nHe grew up in eastern India, in the middle of nowhere in the jungle, and has all sorts of awesome stories about the exotic flora and fauna of Bengal. He got into IIT for college , which had a 1% acceptance rate, for engineering, and graduated with a major in EE.\n\nThen, he decided to go to the USA for grad school. At this point, he had no experience with American culture (India was considerably less Westernized back then) and spoke English well, but not fluently. (He[.] told me a story about seeing peach cobbler on the menu at a restaurant and thinking cobbler meant shoemaker; he was very confused).\n\nAt some point, in order to adjust to Western culture, he basically goes on a self-education program. He reads poetry, from e. e. cummings to Tennyson to Lewis Carroll. He reads famous literature, Shakespeare and Faulkner and Fitzgerald. And he begins listening to classical music and modern rock (in particular, he likes Crosby, Stills, and Nash).\n\nHe does all of this with no formal training in the humanities whatsoever. Still amazes me. And then he acquires a PhD in computer science and becomes a professor and does research.\n\nIn addition to this, he likes the outdoors. Hiking, backpacking, and rock climbing are all acceptable ways to spend a weekend. Despite his age, he[.] still incredibly active.\n\nAnd, of course, he[.] a great parent.\n\nHe speaks 5 languages, three fluently. He can easily rack up 300 points in a game of Scrabble. He makes puns at every occasion. He blasts Bach out of his car stereo. He does the New_York Times Sunday crossword puzzle in pen each week. His Erdos Number is 4.\n\nIf I amounted to a tenth of that, I would be happy. He[.] just amazing."}