{"doc_id": "824", "name": "2011_11_humanities_student_major_217_newzealand", "namespace": "we1sv2.0", "metapath": "", "pub": "newzealand", "title": "2011-11-humanities-student-major_217_newzealand.txt", "pub_date": "2011-11-03T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.181", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "741", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2wrr9u", "Reddit_id": "c2ws35t", "Subreddit_id": "t5_2qhma", "Commenter": "phi_is_all", "length": "5424", "content_scrubbed": "Don't know how my \"CV\" is going to look over a reddit comment. I did some spacing editing. we'll see when I press enter. I hope this is helpful. I've left off my current employer because I just started working here a few months back. It falls in line with the progression of the relevant IT/A/V experience.\n\nSummary of Qualifications:\n\n13 years extensive Computer Support experience in fast paced team oriented environments\n\n5 years experience in university and government information technology fields\n\nHighly-motivated team oriented young professional with effective problem solving and good communication skills, who has constantly been learning through new experience and travel\n\nIndependent International Travel–Mexico, England, Scotland, Wales, Germany, Belgium, France, Austria, and Czech Republic.\n\n1. 5 years of experience in public relations and governmental grant writing\n\nBachelor of Science degree (Political Science) with a minor in Business\n\n7 ITS awards from the University of North Carolina at Chapel Hill\n\n\nEmployment History:\n\nIndependent Work\n07/06 – 07/07 (one month contract)\nCompucom/Apex Systems – Multi state (Florida, Georgia, North Carolina) Marathon/Kangaroo overnight software upgrades. POS and fuel pump upgrades.\n\nMediterranean Deli – Current IT consultant. Installed 8 remotely viewable, DVR, security camera system, Audio System including three microphones. Computer network and infrastructure, PC[.] and Printer installation, troubleshooting and maintenance.\n\nThe Station / Southern Rail - Multiple Stereo systems Setup and cabling. 16 camera remotely viewable, DVR security camera system\n\nSigns Now – Current IT consultant.  Network installation for internal gigabit capabilities. PC Implementation, Repair (hardware and software), virus removal, printer installs.\n\nPantana Bob[.] – Audio/Video consultant.  Implementation, requisitions and future implementations.\n\nMansion (a music venue I helped build from scratch) 462 07/07- 12/10\nIT Director/Systems Administrator\nInstall/maintain and expand all network software and hardware, including wired and wireless PC[.] printers, security, cameras.\nWebsite Administration: Coding updates, revisions, photos, links – Email Administrator, Audio/Video: Mackie tt 24Digital mixing board, wiring and cabling of HD monitors and projectors Detailed Spreadsheets of inventory and budgets\n\n \nThe University of North Carolina at Chapel Hill, NC 07/02 – 07/07\nITS: Systems Tech.\nDesktop Systems: PC installation & support, software and hardware troubleshooting including the installation of all Operating Systems, rebuilding and upgrading of internal ITS machines i. e. hard drives, processors, system boards, memory, monitors, network printer configuration and various PC card installation and configuration, (NIC, modem, SCSI, video) UNC DHCP network configuration (including wireless & static IP addresses). Hands-on assistance with IBM & Sun Systems server assembly, troubleshooting & installation, EIA/TIA CAT5 & CAT6 network cable routing, also including patch panel management. Installation of infrastructure (server racks, power distribution, networking, patch panels, cable management, control center set up, LCD display installation) at both new data centers at UNC. UNC Help Desk and Remedy use, installation and troubleshooting of multiple software applications and installation including, but not limited to Symantec Norton Anti-Virus, Microsoft Office 2000-2003, Photoshop, audio/video troubleshooting, digital video editing. Research and development of highly detailed UNC campus wide database for cellular phone testing & customer support.\n\nTemp Services & Duke Temporary Services Chapel Hill & Durham, NC 12/02 – 07/03\n\nUNC School of Law  –  Faculty Assistant: Professor assistant, law school room reservations, dissertation revisions\nDuke University –  Lab tech: Specimen Identification, computer operations, and data entry\nSony Ericsson  – Computer Operator: digital cellular prototype testing, computer operations, data entry\nBCBS NC – Computer Operator: digital imaging, PC troubleshooting (data storage, scanning), data entry\nUNC Hospitals, Dept. of Psychiatry Chapel Hill, NC 06/02 – 12/02\nPC Computer Support - Carlos Bedford (919) 966-1826\n\nHardware & software Microsoft Office & Windows (95-XP) Installation and Support, Video Conferencing\nNetwork Support Banyan & Vines (Ethernet & Token Rings), Outlook, Various Virus protection\nTechnical support (300 plus users), Digital Imaging, Management (Photoshop) and Printing (42\")\n\nEducation:\n\nThe University of North Carolina Chapel Hill, NC 08/03-*\nMasters research: School of Information Library Science\n\nUniversity of Nottingham, Nottingham England 9/01 – 12-01\nMasters research: International Relations,\nMember of several societies and clubs, including Wine, Beer, Basketball, Rugby, Muslim, and Politics\n\nBarton College, Wilson, NC 08/98 – 05/01\nBachelor of Political Science\n\nTwo Semesters in Europe : the second trip  I helped plan and organize  with the dean of Social Work.\nAwarded the departments only internship working for Upper Coastal Plain Council of Government  Rocky Mount, NC\n\nThe Collegiate – Staff Writer (Film Reviews) – Apple Computer systems\n    High School football & wrestling coach \n\nPurdue University, West Lafayette, IN 08/97 – 05/98\nMajor: Liberal Arts,\n    Purdue student government campaign staff member"}