{"doc_id": "819", "name": "2011_11_humanities_student_major_103_engineeringstudents", "namespace": "we1sv2.0", "metapath": "", "pub": "EngineeringStudents", "title": "2011-11-humanities-student-major_103_EngineeringStudents.txt", "pub_date": "2011-11-02T00:00:00Z", "Sentiment": "0.14", "Subjectivity": "0.429", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "345", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2wkeek", "Reddit_id": "c2wl3il", "Subreddit_id": "t5_2sh0b", "Commenter": "sdn", "length": "2046", "content_scrubbed": "It[.] worth it going to college if you're going into a field which requires a degree/certification and is also well paying (or at least guarantees some employment stability). I'm talking about things like accounting, engineering, K-12 STEM teachers (maybe..), doctor, armed forces officer, and... Um... that[.] about it off the top of my head.\n\nThere are lots of non-4year degree jobs out there that require some sort of certification (machinist, plumber/electrician/etc), but you're not going to be as flexible in being able to switch fields or guarantee yourself employment.\n\nThen there are lots of fields out there which have very few job openings and lots of very (or even over-) qualified applicants. I'm talking about things like librarians, lawyers, etc.\n\nThere are of course lots of jobs in management &c which have very vague degree requirements -- ie: some sort of business & management degree. In lots of cases no degree is actually required to do the job, but having a degree is a sign to someone in HR that you're at least somewhat competent at filling out paperwork.\n\nThere are the arts. If you're good at what you do, you'll find a job illustrating/writing music/sound & video engineering/etc. But then again, employers look at your portfolio and not so much your degree.\n\nProgramming kind of belongs here. If you got the aptitude, you can teach yourself programming and then showcase to your employers some sort of app/game/website that you've done even if you don't have a degree.\n\nFinally, you've got the humanities. I'm not sure how many non-academic jobs there are for most humanities. I'm kind of ignorant as to what you can do once you have a humanities degree other than be a more educated person.\n\nUnfortunately in the US there[.] a mindset that everyone should go to college. 85% of people have finished highschool and something like 50% of all people have gone to college. I imagine a good chunk of those people went college because it[.] the \"thing\" to do so they just get a degree in whatever and that[.] that. "}