{"doc_id": "844", "name": "2011_11_humanities_student_major_512_philosophyofscience", "namespace": "we1sv2.0", "metapath": "", "pub": "PhilosophyofScience", "title": "2011-11-humanities-student-major_512_PhilosophyofScience.txt", "pub_date": "2011-11-07T00:00:00Z", "Sentiment": "0.059", "Subjectivity": "0.347", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "503", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_m3tw4", "Reddit_id": "c2xygz1", "Subreddit_id": "t5_2r7mh", "Commenter": "ObsBlk", "length": "2956", "content_scrubbed": "Since it[.] now behind a paywall, do you think you could write a quick summary of the arguments of the article?\n\nEdit: \"Found\" a copy of it.\n\nFor an insight into trends and fads in the humanities world, it is hard to improve on the Arts and Humanities Citation Index. It lists all citations in the major humanities journals-that is, an army of trained slaves keys in every footnote of every article and the computer rearranges them according to the work cited. The compilers of the index examined the records for the years 1976-1983, and issued a report on the most cited works of the twentieth century. The most cited author was Lenin, which speaks volumes on the state of the humanities in the West towards the end of the Cold_War. But the most cited single works were, in reverse order: in third place, Northrop Frye[.] Anatomy of Criticism; second, Joyce[.] Ulysses; and, well in the lead, Thomas Kuhn[.] 1962 book, The Structure of Scientific Revolutions.\n\nInterest in Kuhn[.] book has not waned. The Index is now online, and records one-hundred citations to the book for 1999- plus another four-hundred in the Social Sciences Citation Index. To call the tone of most of these citations reverential would be something of an understatement. It is reported that Structure is Al Gore[.] favorite book, and William Safire[.] New Political Dictionary has an article on \"paradigm shift,\" a phrase popularized by Kuhn, which reports both Bush (senior) and Clinton being much impressed with its usefulness.\n\nThe basic content of Kuhn[.] book can be inferred simply by asking: what would the humanities crowd want said about science? Once the question is asked, the answer is obvious. Kuhn[.] thesis is that scientific theories are no better than ones in the humanities. The idea that science is all theoretical talk and negotiation, which never really establishes anything, is one that caused trouble long ago for Galileo, who wrote:\n\nIf what we are discussing were a point of law or of the humanities, in which neither true nor false exists, one might trust in subtlety of mind and readiness of tongue and in the greater experience of the writers, and expect him who excelled in those things to make his reasoning more plausible, and one might judge it to be the best. But in natural sciences whose conclusions are true and necessary and have nothing to do with human will, one must take care not to place oneself in the defense of error; for here a thousand Demostheneses and a thousand Aristotles would be left in the lurch by every mediocre wit who happened to hit upon the truth for himself.\n\nKuhn[.] \"achievement\" was to put the view of Galileo[.] scholastic opponents back on the agenda. Up to his time, philosophy of science had concentrated on such questions as how evidence confirms theories and what the difference is between science and pseudo-science, that is, questions about the logic of science. Kuhn declared logic outmoded and replaced it with history."}