{"doc_id": "906", "name": "2011_11_humanities_student_major_1279_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2011-11-humanities-student-major_1279_politics.txt", "pub_date": "2011-11-28T00:00:00Z", "Sentiment": "-0.054", "Subjectivity": "0.444", "Score": "25", "Upvotes": "25", "Downvotes": "0", "Wordcount": "332", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c33fw84", "Reddit_id": "c33hgd9", "Subreddit_id": "t5_2cneq", "Commenter": "a_major_award", "length": "1918", "content_scrubbed": "I'm sorry but every time I read garbage like this, I understand why the world laughs at the U_S and why the_right is mocking the Occupy Movement. 'Student loans' are not necessary in a vast majority of cases. Students take them out to attend ridiculously expensive private schools that are using the exact same materials as the affordable public ones; they are convinced that some kind of private education will get them ahead and take out literally hundreds of thousands of dollars to attend some liberal_arts college in upstate New_York pursuing a Philosophy degree they will never use then spend the rest of their lives complaining about it.  \n  \n**WAKE UP**  \n  \nI was accepted to several very well ranked national private universities but I **turned them down** for a state university that I could afford. This is just another example of Americans living beyond their means for something they the simply have to have. The schools themselves are a ripoff and the idiots who attend and glorify them only allows them to continue. So while my friends who went off to the Ivy Leagues spend the rest of their lives digging themselves out, I will be enjoying my life debt-free. No education is worth a lifetime of debt. You have options! No university is forcing you to take it on and no state school will ever require an 'unconscionable amount of debt'. The people who truly need help WILL get it. Middle-class, whining children who can't get their Art degree from a swanky little unranked private school for $48K a year receives my ire, not my sympathy. I swear, they lose all credibility when they whine about stuff like this and it only makes me mock them. Occupy, stop associating with this crap. I want to take you seriously but it[.] getting harder every day.  \n  \n  \nEDIT: The guy in the article is a freaking anthropology major, taking on 80K of debt. Does NO ONE ELSE find this completely ridiculous?!"}