{"doc_id": "893", "name": "2011_11_humanities_student_major_1180_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2011-11-humanities-student-major_1180_politics.txt", "pub_date": "2011-11-25T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.292", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "749", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c32qp5f", "Reddit_id": "c32rhc8", "Subreddit_id": "t5_2cneq", "Commenter": "markth_wi", "length": "4607", "content_scrubbed": "There is an opposing viewpoint and then there is rational discourse.\n\nI used to work and go to a school that was once fairly rightly considered liberal - with degrees in ecology and environmental science and liberal_arts. \n\nBut the school received large grants from notable aerospace / defense contracting firms who took an exceptionally dim view of these pursuits. \n\nAs an engineering student I benefited directly from these classes, but I also was well aware that the new donors, conducted a very determined intellectual purge of anyone without a Ph. D or whom had a political/ideological leaning that was not VERY close to and favorable of the grant and it[.] funders. The steering committees and executive board were purged in the space of less than 90 days of any dissent from the new corporate line.\n\nThe school to this day still has an ecology program and an environmental science program, but to say they are vestigial is an understatement. \n\nThe ecology program has gone from a truly comprehensive program to having 3-4 core classes centered around logging and industrial land management.  \n\nSimilarly the environmental science class was denuded of a variety of pollution control classes, or environmental chemistry and this has been replaced by a geology and additional land management / agricultural focus classes, i. e.; dual use farming methods, runoff management etc. \n\nThey still tout themselves as being progressive and liberal_arts , but the actual arts programs were long ago reduced and literally moved to the outlying buildings of the campus. The performing arts building (new when I was a student) is now idle , and used for occasional plays and more often sporting events. \n\nThe programs now largely focus on business degrees, economics and very heavily on the bureaucratic intricacies of ACM, FAA & international regulatory processes. \n\nThey still promote themselves almost exclusively as a liberal_arts degree school - oh and if you want your XYZ certifications you go here too.\n\nWhat I mean to say is that it[.] how some people in our culture define it as \"liberal\" does not make it so. \n\nSo consider again some point of US foreign policy where there definitely exists an agenda. \n\nThere is no \"balanced\" perspective on whether there are virtues to invading Iran - simply put the U_S has absolutely no compelling reason for military action against Iran any more than we do against - India or Turkey.\n\nBut there are those among us, particularly, in the neoconservative political camp who take the case - despite a long list of good and rational facts and opinions to the contrary that we should - of course be bombing Tehran today. \n\nThat long list of reasons and views, need not be examined in any detail now should it, there is simply - to invade Iran or NOT to invade Iran, as our buddies in the neoconservative think tanks quietly admit, it[.] not important to ask what are the consequences , just to doggedly pursue what WE (read their bosses) want. \n\nSo for my view, one does not need to treat the one crackpot idea - however well monied and financed they may be - with the same deference as a host of otherwise differing facts or factors to consider it balanced.\n\nWhat I believe is that one of the major factors that has greatly diminished our horizons as a nation, is our citizenry[.] inability to think critically and properly discern ideological or intellectually faulty garbage from intelligent or well reasoned or scientifically informed insight.\n\nHere[.] an example of on of the more notable examples of what I'm talking about\n\nRichard Perle - one of the great thinkers and grand statesmen of the neoconservative movement, engaged in a [counterfactual argument](http://www. youtube. com/watch?v=MfjG1hE0Qfg) with an actual scientist over nuclear testing, 30 years later, we know now that the USSR was and remains TODAY in good treaty standing - despite Mr. Perle[.] assertions.\n\nHere[.] Mr. Perle again - 25 years later commenting on the then current Bush administrations efforts in [Iraq](http://www. youtube. com/watch?v=SuJ9eanBDOM).\n\nSo if I choose to disregard Mr. Perle[.] assertions that [Iran](http://www. pittsburghlive. com/x/pittsburghtrib/opinion/s_768065. html) is a threat - I am necessarily unbalanced, or in doing so, given his track record, are we ignoring someone who may not have the most value to add to a discussion, or the best interests of our nation - at heart.\n\nGiven his history we can say a few things about Mr. Perle[.] ability to discern reality from his wish-fulfillment ideation... his ability to properly advocate for sound policy AND reality."}