{"doc_id": "897", "name": "2011_11_humanities_student_major_1221_rva", "namespace": "we1sv2.0", "metapath": "", "pub": "rva", "title": "2011-11-humanities-student-major_1221_rva.txt", "pub_date": "2011-11-27T00:00:00Z", "Sentiment": "0.327", "Subjectivity": "0.491", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "233", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mqrl9", "Reddit_id": "c333rg6", "Subreddit_id": "t5_2qpvj", "Commenter": "[deleted]", "length": "1874", "content_scrubbed": "Apartments: for your first Richmond apartment, I'd go with either the Fan or the Museum District neighborhoods.  Those both put you pretty close to VCU, the central business district, nightlife, shopping, grocers, the arts scene, etc.  Plus they're full of people, and you need to meet people for the next part.\n\nJobs: as with anyplace, networking is the best route.  So, what kind of jobs are you looking for?\n\nFood/drink: personally, I really like Bamboo when I'm looking to go out with one other person for a drink or dinner.  The food is really good.  The atmosphere is nice.  It isn't so loud that you can't have a conversation.  They only have three beers on tap, but they're good beers (usually Virginia beers).  It[.] a nice change of pace from the places with longer beer menus than food menus.  The mix of people is good, too (i. e., not crowded with students).  Plus it[.] in the Fan[.] main food/bar district, so you'll get to check out what else the neighborhood has to offer.  It[.] on W. Main St at Mulberry.\n\nAlso, for apartments... try [http://www. padmapper. com/](http://www. padmapper. com/?lat=37. 55497134781895&lng=-77. 4731183052063&minRent=0&maxRent=6000&searchTerms=&maxPricePerBedroom=6000&minBR=0&maxBR=10&minBA=1&maxAge=7&imagesOnly=false&phoneReq=false&cats=false&dogs=false&noFee=false&showSubs=true&showNonSubs=true&showRooms=true&userId=-1&cl=true&apts=true&rnt=true&ood=true&zoom=16&favsOnly=false&onlyHQ=true&showHidden=false&workplaceLat=0&workplaceLong=0&maxTime=0).   For the most part, keep your search between Belvidere on your East, Broad on your North, N Thompson on your west, and Cary St on your south.  Once you get to know the city, you'll want to check out the different neighborhoods, but the Fan is a good starting place."}