{"doc_id": "817", "name": "2011_11_humanities_student_major_58_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2011-11-humanities-student-major_58_Economics.txt", "pub_date": "2011-11-02T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.371", "Score": "20", "Upvotes": "20", "Downvotes": "0", "Wordcount": "621", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2wfqps", "Reddit_id": "c2wgbiu", "Subreddit_id": "t5_2qh1s", "Commenter": "[deleted]", "length": "3444", "content_scrubbed": "The problem isn't so much that society is full of shit, it[.] that parents are idiotic. Society has all sort of utopian illusions it has to believe to keep it going but that doesn't mean that individually you have to believe that bullshit. \n\nA college degree actually used to be the ticket to a good job and for the most part it still is. If you have a degree that is actually worth something then you have very low unemployment rates. There is still a need for technical jobs in a science or business based field. In fact, they can't find enough people to do those jobs and have to import labor. The problem is that we always live the present as if it were the past rather than adjusting to current conditions.\n\nIt[.] like buy and hold. Sure it worked when boomers were at their peak of earnings and investing it into the stock market from 1980-2000. Put money in, forget about it, retire relatively rich. But this is not reality today b/c massive amounts of money is coming out, not going in, to the stock market as boomers cash in. These demographics effects also cascade into the broader economy.  Our GDP should shrink now that our biggest generation is retiring. GenX is tiny. We don't need nearly as many jobs and even less unskilled jobs b/c of automation. We're going to see a glut of unskilled labor for the foreseeable future. Expect another boom to start in 2020 when Xers starting hitting their peak and China starts going down. It will be small in comparison but it will be significant. Until then try and survive. I wish I had better news but the economy is driven by demographic factors.\n\nI feel sort of bad for GenY b/c they got lied to. They were told they were special snowflakes. GenX got it drilled into their heads that they would be the first generation NOT to do better than their elders. We were called slackers. Ironically, we actually have low unemployment. We were latchkey kids that were told we sucked but that made us independent. GenY was told they were special cargo with baby on board signs in minivan windows. All generations get lied to b/c their parents are looking at the past, not the present. It[.] a shame. When an economy is peaking you can afford lots of psychologists and liberal_arts majors. You can focus on cultural enrichment but those really are luxuries and indulgences. When the shit hits the fan as it always does sooner or later you had better be prepared. I think GenY people can still thrive but you've got to put all the BS you got told in the trashcan. The great depression is looked at as a nightmare and it was b/c we had a lower standard of living and literal starvation but those people that jumped out of buildings were the ultimate in myopia. After the two big crashes we had an incredible bull market for a decade. People got rich during the 30[.] but most got worse. Those that could adapt and find opportunities not based on the past won out. The past is gone, we should immediately stop bemoaning it and get on with it. The future is today. There were massive protests during the 30[.] too but those people who participated didn't thrive like the people that were tuning that out and instead looking for opportunities. Those protesters, just like OWS, were protesting the death of the past and horrified that it wasn't continuing indefinitely into the future and they were wasting their time. Society has desperate needs - fill those needs and prosper.\n\nSorry, I was rambling a bit."}