{"doc_id": "912", "name": "2011_11_humanities_student_major_1405_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2011-11-humanities-student-major_1405_RPI.txt", "pub_date": "2011-11-30T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.264", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "322", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ms67w", "Reddit_id": "c341oui", "Subreddit_id": "t5_2rg3u", "Commenter": "collud2", "length": "1923", "content_scrubbed": "Excellent for you!  I very nearly did this myself (still undecided if not doing so was a good choice, but irrelevant here).\n\nThings to do - \n\n*Travel; learn the region around your hometown, become a park assistant somewhere,  go live with family across the country for a month, spend a weekend in Canada (or any other country)\n\n*Work; save up some money doing banal jobs,  find something that[.] always interested you and walk up to the highest-ranking official on the floor and ask what it takes to get an internship there for a month or semester\n\n*Volunteer; do some public service, help out Irene cleanup (yes, some places still need it), get political, go door-to-door for something, work with kids in school, after-school programs\n\n*Get creative; try your hand at building a shed, or a telescope (radio if you're EE-inclined...), try digital drawing or music making\n\n*Stay in school;  really - spend a term at a local or community college and collect as many credits as you're allowed of transfer towards the HASS, MATH, and general requirements.  You might save as much as a term here at RPI when you get back, and it[.] _ahelluvalot_ cheaper.  Conversely, try classes in random, unrelated things that you wouldn't dare take while concentrating on your major.\n\nReally, I'd just try to experience things that life offers that you wouldn't in just a school-college-job flowchart.  Find things that expose you to people besides those in your same life situation; gaining perspective and understanding of what makes \"people\" will serve you well through your whole life.  Do you want to engineer, to become famous?  To make improvements to people[.] lives?  Or maybe you're into science -research? Being the next Bill Nye?  Or maybe you're looking at something in the arts?  Make a list, pin it on a dartboard, just try something!\n\n    edit: wow, verbose.  \nTL;DR?  Just read it.  Or don't.  I'm not summarizing it for you =P"}