{"doc_id": "873", "name": "2011_11_humanities_student_major_907_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2011-11-humanities-student-major_907_canada.txt", "pub_date": "2011-11-17T00:00:00Z", "Sentiment": "0.083", "Subjectivity": "0.275", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "233", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c30h87t", "Reddit_id": "c30i85n", "Subreddit_id": "t5_2qh68", "Commenter": "imgram", "length": "1949", "content_scrubbed": "Reifler suggests it[.] because conservatives are more rigid than liberals. Maybe so. If I had to guess, though, I'd say it[.] because right-wing talkers have spent so many years deriding \"so-called experts\" that they now have negative credibility with many conservatives. \n\nFrom a cursory reading of the article, it[.] an American study. It doesn't mean the findings are relevant in other countries and political environments. If a left-wing talkers spend a lot of time deriding \"so-called experts\", then the_left_wing base would be just as rigid. For instance, the Canadian left[.] backfire effect to anything the Fraser-Institute, Jack Mintz, or Tom Flanagan is probably just as strong.\n\n We showed that the natural sciences and business disciplines are more right-leaning, while social_sciences, humanities, arts, and education are more left-leaning in terms of party affiliation and political orientation. It is perhaps not surprising that the role of social critic is more likely found in the social_sciences, humanities, education, and arts and less so in business, engineering, and natural sciences.\n\n[Source](https://docs. google. com/viewer?a=v&q=cache:f835rfdXcnIJ:ejournals. library. ualberta. ca/index. php/CJS/article/download/1036/3661+university+degrees+and+political+alignment&hl=en&gl=ca&pid=bl&srcid=ADGEESjQoTmlUmnWnd9teTIYzNhEpYQQNSbZxqs6VixtR0mMUACMXk16xiQqD91x2pzRLw6uya9IdZq52-pvL-_CqcvHnxvUc1MaxqzPe3lse9HRvcr3jbNRQ1v0mL0OH0eqGsRG2Z80&sig=AHIEtbS3DOkOYttL7NSYLV8SZSyuCratQA)\n\nYour description of a liberal population can also describe a university graduate. Universities churn out more graduates in liberal leaning faculties than right_leaning facilities, such as STEM majors and business. I wonder if your verified, statistical truths account for this. You can attribute being knowledgeable about intellectually engaging topics to political affiliations, I'm going to attribute it to being university educated."}