{"doc_id": "864", "name": "2011_11_humanities_student_major_811_singapore", "namespace": "we1sv2.0", "metapath": "", "pub": "singapore", "title": "2011-11-humanities-student-major_811_singapore.txt", "pub_date": "2011-11-15T00:00:00Z", "Sentiment": "0.133", "Subjectivity": "0.346", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "602", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2zx4xm", "Reddit_id": "c3007iv", "Subreddit_id": "t5_2qh8c", "Commenter": "malaydude", "length": "3426", "content_scrubbed": "After reading some of these comments, I am really thankful that my parents aren't anal about grades and gave me and my siblings the freedom to choose what to study. Here[.] my own experience (WARNING: Wall of text!)\n\nI've always hated the idea of 'mindless studying' and since Sec 1 I've set my mind to put more emphasis on *learning* instead of *studying*. Since then, I placed less importance on grades and class placing and instead tried to find the fun and real-world applications from the subjects that were on offer. As a result, I never became a 'top-student', nor did I have a desire to be one but my grades have always been above average which I believe was a by product of seeking new knowledge for knowledge[.] sake. I became pretty much self-motivated and even went beyond textbooks to find out more about certain things that intrigued me.\n\nI graduated from secondary school with good enough grades for most JCs but opted to pursue my interests in Information Technology in a polytechnic instead. Again, it was never about grades and I believe that it was the **collaborative** nature of my particular class that made the whole experience great. We helped each other out with genuine intentions and as a result most of us, even those who weren't that interested in pursuing an IT career, managed to graduate with a good diploma.\n\nDuring my NS, I applied to study in a local university and decided to choose something that wasn't related to my diploma. Was offered Computer Eng by NTU and Architecture by NUS, so I took a leap of faith and went with Architecture on the basis that it sounds very interesting despite not knowing much about it and not having any experience at all with drawing. And here I am, 4th year into the course. My main qualm with the local uni education is its **extremely competitive** nature. While the structure of the curriculum was similar to how a polytechnic is run, the people that filled it were a whole different type altogether. My peers keep worrying about their CAP scores, whether to choose a module so that they could score a higher CAP instead of choosing something that they might actually learn something interesting and benefit from. Everyone seemed hell-bent grades and everyone looks at me like I'm a madman when I say I don't bother much about my grades.\n\nI feel that the society as a whole is to blame. Most of us are urged to participate in the rat-race; success is measured by materialistic yardsticks and those who fall out are deemed 'failures' that deserved little sympathy from everyone else. \"Don't have a degree? Can't get a good-paying job? Too bad, your fault for not studying hard enough.\" This is the attitude that drove most from my age-group into being drones with little personality and character. The person on your right just seems exactly the same like the person on your left; little wonder we haven't unearthed more talents in other 'less-glamourous' fields like sports and the arts.\n\nI hope we as a society will beat this stigma. The SotA and Singapore Sports School were probably a decade overdue, but better late than never. As for myself, I hope that I could convince people around me to start discovering the fun and excitement in learning and doing new things. Don't be afraid of failure, it[.] not the end of the world. Respect all people and all types of jobs and careers. Success is what you define it to be. And above all, strive to be happy!"}