{"doc_id": "823", "name": "2011_11_humanities_student_major_215_anarcho_capitalism", "namespace": "we1sv2.0", "metapath": "", "pub": "Anarcho_Capitalism", "title": "2011-11-humanities-student-major_215_Anarcho_Capitalism.txt", "pub_date": "2011-11-03T00:00:00Z", "Sentiment": "0.085", "Subjectivity": "0.277", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "241", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_lz60n", "Reddit_id": "c2wrw25", "Subreddit_id": "t5_2qorf", "Commenter": "[deleted]", "length": "1499", "content_scrubbed": "Wut?\n\nBecause firms don't take into account social benefits in their cost-benefit analysis when making a decision\n\nAlright lets assume they all don't\n\ninfrastructure projects or schools which may be beneficial to society as a whole, not just the individual firm, would not get done in a free market unless the government intervened.\n\nThe problem is that government intervention isn't good for society as a whole, only those that the government chooses to favor with the tax dollars of others.\n\nTake for example education. Should the government have a role in subsidizing the education of engineers or mathematicians if it will bring a beneficial outcome to society as a whole?\n\nThe problem is that the government has absolutely no way of knowing how many mathematicians and engineers the market is going to demand. We can train everyone as an engineer for 100k+ each, but if there is no demand for engineers in the market their education is useless, this is similar to what is happening right now. http://www. mymoneyblog. com/supply-and-demand-technical-vs-humanities-college-majors. html\n\nThere is also the case for infrastructure projects like building roads. It may not be beneficial to a private firm to construct a road but if it produces a net social benefit then there is clearly a role for government to provide it.\n\nThought experiment: Try to think of an infrastructure project that would benefit society that a company could not profit from.\n\nSo, is this a fault of the free market?\n\nNope.\n\n"}