{"doc_id": "894", "name": "2011_11_humanities_student_major_1186_iama", "namespace": "we1sv2.0", "metapath": "", "pub": "IAmA", "title": "2011-11-humanities-student-major_1186_IAmA.txt", "pub_date": "2011-11-26T00:00:00Z", "Sentiment": "-0.002", "Subjectivity": "0.287", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "745", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c32uug5", "Reddit_id": "c32uymz", "Subreddit_id": "t5_2qzb6", "Commenter": "cfmonkey45", "length": "4428", "content_scrubbed": "Dunno. I was in a small church (generally above 150 people on a good sunday). Youth group oscillated between me and three other guys (one a non-practicing Christian who I am still very good friends with), and two other guys (one was one of the assistant pastor[.] sons) who basically skipped town to go live his cousins, smoke weed, and get wasted basically. It generally depends on the person. I live right by a major Christian Liberal Arts college and I know a few people from there. A lot of people, though, tend to get married young, though in my Church, there were a few people that had out of wedlock children which was quite awkward, though in some instances acceptable. One family adopted a foster kid whose mother was in prison for serious drug abuse. The adopted parents seemed quite nice and amicable, the father got me my first job.\n\nMy reasons for leaving were manifold. The aforementioned Christian College was monopolized by Young Earth Creationist/Calvinist/Dispensationalist weirdos who were affiliated with a large, nearby Megachurch. It was common knowledge that people from that Church were either hypocrites or batshit insane. In my time, I actually had a lot of really crazy (as in legit) reasons for believing. I had witnessed a few, as I would call, \"domestic\" miracles. One of my friends survived two near-death accidents (like broke his neck and survived a motorcycle wreck) and other things. My dad, who converted later in life, starting speaking in tongues, and my denomination believed that people could interpret things. One time, my dad noted that one of the guys speaking in tongues was speaking in his native language (he[.] an immigrant) and literally translated for the guy. Another time, I had a dream that seemed to predict a certain situation involving a girl in the youth group, though, this was not by any stretch of the imagination inconceivable. I won't go into details. Anyways, my youth group started to get rather dry and I decided to hang out with some of those people. At the same time, I had sort of generally had this extreme optimism that things would just randomly work out in my favor (sort of \"magical thinking\"), and also was rather actively involved in biblical study (reading like 3 of Bart Ehrman[.] books, along with several others and debating online in forums). I was \"that religious scholar guy.\"\n\nMy reasons for leaving, initially were manifold. *Evangelic* Christianity comes in many different flavors, something many people are quick to forget. I brushed in with the aforementioned YECers, who were simultaneously Calvinists. Even back then, I knew that one essentially had to be a douchebag to be a *true* Calvinist (believe in Predestination, and that anyone who isn't saved is damned to hell because God physically denied them the capacity to become religious for essentially arbitrary reasons (Unconditional Election means that God has no reason as to why he does this)). In essence, I got a firsthand lesson in how wishy-washy Christian *friends* can be.\n\nThis combined with a precocious interest in philosophy, history, and science sort of sealed that fate. Simultaneous to this, there existed family and medical drama. Apparently, my family had told me that they had decided against doing a treatment for a severe learning disability they had for monetary reasons, and I was recently diagnosed with Clinical Depression and was rejected by one of the Christian girls I was into for various reasons. In the end, I had a nervous breakdown and I basically just asked them to validate me as a person, and sort of just be there for me as a friend. One of the guys basically told me that my basic problem was that I wasn't believing hard enough in scripture and literal truth, that I was essentially being told lies by the system of psychology (which affirms basic human values and dignity) was a lie and didn't emphasize sin[.] role in people[.] problems (this is an exclusively Calvinistic philosophy, btw), and essentially looking outside specific doctrinal believes would endanger my salvation (which I ironically called bullshit on him, because Calvinism is deterministic, in that, if I did become a heretic, then I was predestined and I wasn't really \"saved\" after all). Suffice to say, I told him in the politest way, pretty please, with sugar on top, to go *fuck himself*.\n\nThe ironic bit, though, is that I actually am still religious, just not an evangelical."}