{"doc_id": "880", "name": "2011_11_humanities_student_major_1047_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2011-11-humanities-student-major_1047_funny.txt", "pub_date": "2011-11-21T00:00:00Z", "Sentiment": "0.032", "Subjectivity": "0.428", "Score": "100", "Upvotes": "100", "Downvotes": "0", "Wordcount": "510", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c31kros", "Reddit_id": "c31lbt7", "Subreddit_id": "t5_2qh33", "Commenter": "unwarrantedadvice", "length": "2882", "content_scrubbed": "I'm not sure where you went to school or who your teachers were, but it sounds like they did you a disservice. \n\nA large part of teaching History is the study of **critical thinking**. The ability to look at a time period, person, movement, etc and analyze it, think critically about it, then synthesize that into coherent thoughts (writing)- is what being a historian really is, and that is exactly what you should be learning in History class. \n\nShe mentions Music as one of the subjects that you say is outdated, and yet- you list **the arts** as something that should be taught? \n\nI took several **computer science** classes in High School. Also in college, even though my major was History (which I currently have a job in). \n\nSports, group projects, etc- teach **team work**- it would make little sense to have a class strict devoted to team work, it is something that SHOULD be taught in every class. \n\nMy school also offered a Personal Finance class that I took that was extremely helpful. \n\nThe thing is- schools often offer these classes as electives because they are not required by state guidelines. If you choose not to take them, you miss out on that opportunity. Should they be pushed more? Perhaps. But there is only so much the schools can do- the student (parents) need to meet them halfway. If you take a computer science class and don't do any of the work and learn nothing from it, then it didn't do any one any good.\n\nThe issue I take with the sentiment this girl appears to have and what you are saying (in that these subjects are outdated)- is that it sounds as though you expect school/teachers to inject you with job-getting powers and that isn't how it works. \n\nK-12 was primarily designed to provide well-rounded citizens. Not employees or consumers. That is why you have to take Government or Civics (usually when you are a senior). Because you are going to be voting and you should understand the process. Also, it is important for you to understand the context of the country and world you live in- this is the point of History. You need to learn to communicate effectively- this is the point of English/Spelling. You also need to understand other cultures- this is additionally the point of History and foreign languages (not to get you a job as a translator). \n\nIf you primary goal, coming out of High School, is to get a job- then I highly recommend students consider vocational school. There is an unfair negative stigma attached to voc. schools- this is wrong. If a student is motivated and wants to get skill sets in High School that can lead to a vocation, then this is something that should be encouraged. There is a skill gap in this country. We have too many graphic designers and not enough plumbers. \n\nIf you spent 12 years learning ONLY those subjects- firstly I think you'd be well informed, but also I would say you did something wrong."}