{"doc_id": "841", "name": "2011_11_humanities_student_major_456_trees", "namespace": "we1sv2.0", "metapath": "", "pub": "trees", "title": "2011-11-humanities-student-major_456_trees.txt", "pub_date": "2011-11-06T00:00:00Z", "Sentiment": "0.171", "Subjectivity": "0.323", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "298", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2xn35i", "Reddit_id": "c2xnsc0", "Subreddit_id": "t5_2r9vp", "Commenter": "bardfaust", "length": "1841", "content_scrubbed": "it would be way too hard to convince everyone to like eachother\n\nIt[.], really, not too much to ask to not be a dick.  \"Everybody liking everybody\", I think, is a great place to start with the improvement of society everywhere.  I am of the opinion that the root of the majority of problems lie within the psyche of the humans.  Electing new officials to lead a faltering regime changes nothing but the players.  Humanity needs to step back and view itself from a universal perspective to alleviate the petty drama, games and politics, and really get to the basis of what existence is all about. \n\nHumanity has attempted to divorce itself from the natural flow of evolution of both the organism and it[.] consciousness by attaining material possessions and striving for comfort, both of which decay the soul.  More emphasis should be put into education, the sciences and philosophies, and the maturation of our species.  These things, in concert with \"Everybody liking everybody\", is probably our best hope for global peace and unity.\n\nIdealistic?  Sure, perhaps.  History shows what you can do with indoctrination, propaganda and early education/raising, though it has usually been used for ill purposes (read: Hitler youth, all religions, the brainwashing of the younger generations to embrace \"pop-culture\" and consumerism, etc.).  What if we made a point to breed unanimously (more or less) favorable traits such as unquestioning tolerance of your fellow humans, keeping an open mind, empathy, etc. etc.?\n\nThis brings us back to one of my original points, that the root of humanities problems lie within the psyche of the people.  Much bias, prejudice and preconception is unconsciously assimilated in one[.] early environment, when one is much more easily moldable, and vulnerable to persuasion.  The young are where the change must begin."}