{"doc_id": "904", "name": "2011_11_humanities_student_major_1274_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2011-11-humanities-student-major_1274_politics.txt", "pub_date": "2011-11-28T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.404", "Score": "21", "Upvotes": "21", "Downvotes": "0", "Wordcount": "394", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ms2n6", "Reddit_id": "c33gltu", "Subreddit_id": "t5_2cneq", "Commenter": "[deleted]", "length": "2409", "content_scrubbed": "There is just so, so much wrong with higher ed in this country. I adjunct at two public universities, and the future of higher ed looks bleaker than ever. A few points:\n\n1. PUBLIC higher education is supposed to do two things: make higher education available to middle/working class and (gasp) poor americans, AND have students be exposed to broad liberal_arts in order to further cultivate an intelligent citizenry. The point of using taxpayer money is to make it affordable/accessible (subsidizing some cost), and also for paying for the liberal_arts element which may not translate directly into job skills--but it important for society. Truth is, most public schools are now run just like private institutions, focusing their resources on beautifying campuses and giving students almost luxury accommodations, fitness centers, sports stadiums and meal plans---aka heightening the school[.] brand appeal. \n\n2. Think privatized universities are the way to go? Just take a look at the unbelievable theft that is going on from online degrees. In fact, many private schools actually make most of their profit from online courses and degrees, while having a physical campus only to make themselves and their degree seem legitimate. Yes some elite private schools and expensive liberal_arts colleges are great, but they are phenomenally expensive. \n\nWe have a few options--I'm personally a big fan of a huge expansion of community colleges, to make them better quality and more accessible for everyone, both young students and older workers needing career changes. However community college instructors are often barely better than adjunct slave labor, and to bring in quality teaching you need full time, stable positions. I would love to teach at a CC if there was higher pay and more full time positions. We should pass a national law like in California which stipulates that CC[.] (or junior colleges as they call them) should have 2/3 full time positions, this would have a huge impact, and California has some excellent junior colleges. \n\nPlain and simple, we need to increase the amount of our resources we put towards education, at all levels. This is an old, tired statement yes, but look at the countries with the best educational systems, and you'll see that they sped far more per capita on students. \n\nOh yeah, tax the rich, cut the defense budget, and tax financial transactions to pay for it. Done. "}