{"doc_id": "890", "name": "2011_11_humanities_student_major_1130_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2011-11-humanities-student-major_1130_AskReddit.txt", "pub_date": "2011-11-23T00:00:00Z", "Sentiment": "0.031", "Subjectivity": "0.316", "Score": "40", "Upvotes": "40", "Downvotes": "0", "Wordcount": "869", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c32bs6a", "Reddit_id": "c32clor", "Subreddit_id": "t5_2qh1i", "Commenter": "[deleted]", "length": "5286", "content_scrubbed": "Start prosecuting white collar crimes with legitimate sentences.\n\nThey are prosecuting white collar crime. White collar crimes are by definition harder to prosecute because they're hidden behind paper trails and layers of circumstantial evidence. Those who are stupid enough not to cover their tracks have been persecuted\n\nEnd or severely limit corporate personhood, especially as it relates to a corporation[.] ability to cite the 5th Amendment and contribute to campaigns.\n\nThis is easier said than done. Corporate personhood is essential to allowing corporations to engage in contracts and thus do business and engage in legal activities. Imagine if you couldn't even sue a corporation because they're not a legal entity. As to their 5th amendment rights, all legal entities in a courtroom have the exact same rights because all are equal under the law, corporations included. As for ending campaign contributions, that might be easier to accomplish because it[.] a restriction on a freedom that doesn't conflict with a legal right\n\nCut the defense budget. Maintain a reasonable military force capable of defending against actual threats in the world, but stop using fear of a non-existent enemy to funnel money into defense contracts.\n\nI agree, cutting the defense budget is a good idea. However, a lot of the budget goes towards supporting overseas bases which I'm sure we'd love to close down but the host countries ask us to stay because it provides regional stability and economic stimulus.\n\nEnd the Electoral College. Count the votes and let the votes speak for themselves. Stop obfuscating elections with this archaic, unecessary system.\n\nAgreed\n\nNo more unsecure, software-driven voting machines. They do not save money and they open the door for widespread systematic corruption.\n\nI've heard that they actually have a rather good paper trail, most of the people crying out against them are pundits looking to stir up controversy. An election judge did an AMA a while back and said that it would actually be easier to tamper with paper ballots than with the machine\n\nLegalize marijuana. Create millions of jobs farming, harvesting, packaging, marketing and distributing the product. Generate billions in tax revenue. Stop prosecuting innocent Americans for non-crimes to funnel money into the prison and law enforcement industries.\n\nI support decriminalizing Cannabis simply because it[.] a waste of court time to prosecute it otherwise, however legalizing it will not be the magic \"budget crisis solver\" that everyone makes it out to be. Decriminalizing it will stop the cash from flowing out of the country and into the hands of the drug cartels but I'm not so sure that establishing a legal industry over it is the best idea given that it will largely just pull tax revenue from other sources.\n\nStop gerrymandering. Do not allow either party to redistrict voters into convenient pockets of support in order to secure local elections and disenfranchise minority populations. Total the votes in a district, and let the votes speak.\n\nAgreed\n\nStop pepper spraying, beating and incarcerating protesters.\n\nSomeone[.] gotta teach those liberal_arts majors a lesson\n\nClose tax loopholes and tear down tax shelters. Corporations pay taxes on ALL of their revenue.\n\nCorporations do pay taxes on revenue that they earn in the USA. They are taxed on revenue which they earn in other countries in the countries that they earn it. However I agree that we need to close the loopholes that allow them to move revenue earned in the USA into other tax havens.\n\nEnd the Bush-era tax cuts.\n\nSure\n\nLegalize prostitution. Tax and regulate the ability for consenting adults to exchange money for sex. Accept that it is hypocritical to allow pornography to be produced in which both parties are paid for sex, but somehow destructive and immoral if only one of those parties receives money and it[.] not on film...\n\nI agree, sort of. This is an idea which sounds good on paper but may be bad in practice. An overwhelming majority of sex workers aren't in the industry because they want to be, they're in the industry because they quite literally have no other choice. Rather than legalizing an industry in which most of its members would rather not be in, why not work on ensuring that they don't get there in the first place.\n\nEnd usury. No APRs over 10%.\n\nPutting caps on interest/mortgage rates will simply prevent people who have bad credit from getting a home period. The mortgage crisis wasn't caused by high interest loans, it was caused by over inflated property values falling below the value of the mortgage which caused people to stop paying.\n\nTie CEO pay to a multiple of average employee pay (including bonuses, stock options and \"severance packages\" i. e., golden parachutes). A raise for the CEO must come with a commensurate raise for employees.\n\nAbsolutely not. A CEOs (or any executive for that matter, I'm not sure why reddit only likes to pick on CEOs) compensation package is a contract between the executive and the shareholders, negotiated and recommended by the board. It would be ridiculously unconstitutional to void a contract or force contract terms simply because they are unfair to a group that is not party to the contract. Something about the_right to liberty if I recall"}