{"doc_id": "900", "name": "2011_11_humanities_student_major_1259_askphilosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "askphilosophy", "title": "2011-11-humanities-student-major_1259_askphilosophy.txt", "pub_date": "2011-11-28T00:00:00Z", "Sentiment": "0.12", "Subjectivity": "0.436", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "529", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ms53r", "Reddit_id": "c33eyhx", "Subreddit_id": "t5_2sc5r", "Commenter": "[deleted]", "length": "3245", "content_scrubbed": "I think Bentham[.] quote was \"Prejudice apart, the game of push-pin is of equal value with the arts and sciences of music and poetry.\"\n\n\nThis would appear to entail a conception of utilitarianism in which one seeks to maximize lower sensual pleasures, making it a \"doctrine worthy only of swine\" in Mill[.] words. Consider the following thought experiment: would you rather spend 100 (or 1000) years as a oyster in a state of moderate contentment or 50 years as a human, equipped with reason and able to experience the highest order pleasures of life? Presumably the latter option is preferable. This would appear to justify Mill[.] view that intellectual pleasures--poetry, \"the manner of existence that employs . . . higher faculties.\"  \n\n\nThe manner in which Mill differentiates these pleasures is problematic: he uses the 'informed preference test,' whereby someone that has experienced both higher and lower pleasures would purportedly prefer the higher pleasures. Here he employs circular logic; a pleasure is higher if desired by a competent judge, and a judge competent if they have experienced and prefer higher pleasures. Surely these higher pleasures are not exactly freely available to the majority of the population. This objection of elitism is perhaps sufficient to choose Bentham over Mill, but it is not the biggest of challenges to Mill[.] conception. \n\n\nAs a hedonist, Mill believes that only pleasure is good, and good in its own right. In the words of critic Roger Crisp, Mill is presented with a dilemma here: \"either quality collapses into quantity and Mill has made no advance on Bentham, or Mill can no longer count himself a (full) hedonist.\" \n\n\nMore simply, either Mill must agree that at a certain point, lower pleasures must equal higher pleasures, or admit a particular quality to higher pleasures that differentiates them--which would no longer render him a hedonist (as hedonism implies that only pleasure is desirable and nothing else). \n\n\nMill makes it very clear that higher pleasures are infinitely more desirable than lower ones: \n\n\n\"If one of the two [pleasures] is, by those who are competently acquainted with both, placed so far above the other that they prefer it...and *would not resign it for any quantity of the other pleasure which their nature is capable of*, we are justified in ascribing to the preferred enjoyment a superiority in quality...\"  \n\n\nSo what is this mystery quality that Mill ascribes to higher pleasures? The fact that they \"enable self-realization, or that they are, say, noble\" (Crisp)? Mill says no. He sticks to his hedonist roots, indicating that only pleasure is desirable and nothing else, and dismisses the use of any 'augmentors of pleasure,' so to speak. As such, Mill finds himself burdened with the rather implausible position that higher pleasures are infinitely more valuable than lower ones simply because their nature makes the enjoyment of them more valuable. \n\nTo me, this is unrealistic. If I had a choice between an evening of reading poetry and a thousand steak dinners, I would choose the latter option in a heartbeat. I believe that there are plenty of properties of our lives that are valuable to us, and that we actively pursue, regardless of their enjoyableness. "}