{"doc_id": "909", "name": "2011_11_humanities_student_major_1311_education", "namespace": "we1sv2.0", "metapath": "", "pub": "education", "title": "2011-11-humanities-student-major_1311_education.txt", "pub_date": "2011-11-28T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.353", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "336", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_msno4", "Reddit_id": "c33lu7n", "Subreddit_id": "t5_2qhlm", "Commenter": "mnky9800n", "length": "1976", "content_scrubbed": "Are you actually a teacher who can implement this or are you just doing this for fun?  Also, this is incredibly broad.  You will never cover any one thing particularly well.  Why not offer electives in many of these 5 week modules so that you could allow the students to study something they think they would enjoy rather than what you think they need to know.  I mean, 5 weeks on the history, philosophy and theory of politics?  What does that even mean?  Do you spend a week on democracy, a week on republics, a week on communism, a week on monarchies, a week on constitutional governments, oh well I just ran out of weeks.  Now we get to talk about the American Political system.  You will spend 5 weeks trying to explain why the US has an electoral college and never actually get to the US constitution.  Not to mention you actually have to know something about each one of these topics.  Can you really have an intelligent conversation on game theory and explain why Sergei Eisenstein contributed one of the most important concepts to film making?  Then move into developmental psychology that is anything more than a showcase of Freud?  I feel like I couldn't ask an Art teacher to teach the first year let alone ask any teacher to teach all four so why would singular you be qualified to develop a curriculum that stretches across the entire liberal_arts spectrum?  I mean, you want to prepare people to be global, thoughtful citizens but there is no preparation in your curriculum for science or appreciation of science.  American politics has taken pot shots at science funding for the past few decades.  Appreciating the contributions that science makes to society (over historical political systems, gender studies, even economics) is probably one of the most important values we can instill in our children.\n\nTL;DR: Basically, I read a lot of buzz words and I don't give a shit about buzz words.\n\nedit: a better [tl;dr](http://dilbert. com/strips/comic/1991-11-03/)"}