{"doc_id": "878", "name": "2011_11_humanities_student_major_1005_iwantout", "namespace": "we1sv2.0", "metapath": "", "pub": "IWantOut", "title": "2011-11-humanities-student-major_1005_IWantOut.txt", "pub_date": "2011-11-20T00:00:00Z", "Sentiment": "0.093", "Subjectivity": "0.407", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "516", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mirqt", "Reddit_id": "c31aqmn", "Subreddit_id": "t5_2r5hw", "Commenter": "orientalnegro", "length": "3141", "content_scrubbed": "Hello! My first post on Reddit, hope you'll find it useful (coming from a recent product of the British higher education system):\n\n* Undergraduate degrees are free in Scotland but masters and phd[.] are not. Obtaining postgraduate funding is mostly dependent on your subject. Physics and engineering are generally sought after whereas someone doing an archaeology phd will find financing very difficult - government funding for arts and humanities is being squeezed but you should be fine. I don't know how it'll work as foreigner coming over to settle for a number of years. A visa should be easy to get hold of but if you're classed as an international student, fees are *considerably* higher. It[.] still four years away,  but you should email some universities to clarify the position on fees and funding, making it clear you want to expatriate. \n\n* At this moment, the job market is dire but economic conditions should improve in four years (if they haven't I'll be selling the Big Issue). Your degree choices are great and widely applicable to a variety of areas - numerate and analytical degrees are usually safe choices for employment prospects. NB: saw your edit, teaching requires a PGCE (Post-Graduate General Certificate of Education) going from what all my mates are doing, but it seems like it[.] concurrent with a teaching post.\n\n* The healthcare system (NHS) works. It[.] not the fastest, the most efficient and inevitably there will be lapses in management making the headlines, causing uproar, but you get the treatment you need mostly free of charge. I can't say how easy it is getting therapy, medication and psychiatric care though. There[.] always the private route if the NHS proves to be too convoluted and/or slow.\n\n* No idea about paying student loans from across the Atlantic, sorry :(\n\n* From what I have gleaned, yes, after five years of residence you can apply for permanent residence ('Indefinite Leave to Remain' in government parlance) and would broaden your employment prospects. However, there[.] a caveat I found in this link (http://www. globalvisas. com/uk_immigration/indefinite_leave_to_remain. html) that those five years exclude student visas.\n\n* Transportation depends entirely on location. Cities in the UK are very well connected but further into the countryside generally means a dependence on cars to get around. 6'6 and 131kg is blooming massive but I don't see any problems with public or private transport. Hatchbacks (VW Golfs, Fiat Puntos, Renault Clios, Ford Fiestas etc) are extremely popular cars here and your height might be a barrier though there are umpteen others to try out.\n\n* We have our fair share of portly people too ;) The UK is top in Europe when it comes to weight problems. Don't worry about appearances. As a lifelong urban dweller, big cities in the UK are so diverse you need not worry, unless setting foot in a rough area hehe.\n\nHardly exhaustive in answering your questions but I hope it helps nevertheless. \n\nBy the way, why Scotland? The weather[.] gloomy enough in England lol. And $200,000 (£126,000) p. a is a *considerable* wage by any Brit[.] standards even before taxes."}