{"doc_id": "831", "name": "2011_11_humanities_student_major_333_science", "namespace": "we1sv2.0", "metapath": "", "pub": "science", "title": "2011-11-humanities-student-major_333_science.txt", "pub_date": "2011-11-05T00:00:00Z", "Sentiment": "0.051", "Subjectivity": "0.287", "Score": "32", "Upvotes": "32", "Downvotes": "0", "Wordcount": "376", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2xakqn", "Reddit_id": "c2xbhx2", "Subreddit_id": "t5_mouw", "Commenter": "Eurynom0s", "length": "2068", "content_scrubbed": "I started college to do political studies. I wound up getting a degree in physics and am now getting my M. S. in applied physics.\n\nIf I could do college over again I'm not sure if I'd enter immediately for physics. Sure, it would have made life easier in some regards, but I'm convinced that my relatively heavy exposure to humanities has given me an edge in things like writing, compared to my science/engineering peers (and I'm not even counting the barely-speak-English Chinese students). Plus, if I might continue to toot my own horn, I think my heavy exposure to humanities (relative to other physics/science students) just gives me a bit different way of looking at things.\n\nThe real problem for me stemmed from high school though. A lot of my science and math teachers sucked (and mind you this was at a fucking fancy expensive private school). Any desire I had to do science or math was probably quashed early on by that.\n\nI actually got into physics because spring of my freshman year I said to myself, let[.] do a few distribution requirements to see what else is out there first; at the worst I've now freed myself up to do more political studies and history classes during the next three years. One class I took was biostatistics, as I figured a stats class would be a useful math class if I went back to political studies. I almost didn't take the class because it was at 8:30 in the morning.\n\nThank god I didn't let my reluctance to get up early win out; turns out the head of the physics department, who originally taught it before having it taken over by a bio professor, was teaching the class again. The bio guy was on sabbatical so that *one semester* the physics department head covered the class again.\n\nI found I was having a blast doing the stats, realized that maybe math and science didn't suck like they did in high school, and it didn't hurt that this professor (who became my advisor) is fucking awesome and is the sort of guy you take a class with just because it[.] him.\n\nTo this day I still sometimes marvel at how I got into doing physics."}