{"doc_id": "853", "name": "2011_11_humanities_student_major_675_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2011-11-humanities-student-major_675_Economics.txt", "pub_date": "2011-11-11T00:00:00Z", "Sentiment": "0.025", "Subjectivity": "0.29", "Score": "36", "Upvotes": "36", "Downvotes": "0", "Wordcount": "395", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2yzg9g", "Reddit_id": "c2z07jt", "Subreddit_id": "t5_2qh1s", "Commenter": "x888x", "length": "2494", "content_scrubbed": "From [here](http://news. investors. com/Article/588637/201110191813/College-Has-Been-Oversold. htm)\n\nOver the past 25 years the total number of students in college has increased by about 50%. But the number of students graduating with degrees in science, technology, engineering and math (the so-called STEM fields) has been flat.\n\nMoreover, many of today[.] STEM graduates are foreign-born and taking their knowledge and skills back to their native countries. Consider computer technology. In 2009 the U_S graduated 37,994 students with bachelor[.] degrees in computer and information science. This is not bad, but **we graduated more students with computer science degrees 25 years ago.**\n\n**The story is the same in other technology fields. The U_S graduated 5,036 chemical engineers in 2009, no more than we did 25 years ago. In mathematics and statistics there were 15,496 graduates in 2009, slightly more than the 15,009 graduates of 1985**.\n\nFew fields have changed as much in recent years as microbiology, but in 2009 we graduated just 2,480 students with bachelor[.] degrees in microbiology — about the same number as 25 years ago. Who will solve the problem of antibiotic resistance?\n\n**If students aren't studying science, technology, engineering and math, what are they studying? In 2009 the U_S graduated 89,140 students in the visual and performing arts, more than in computer science, math and chemical engineering combined and more than double the number of visual and performing arts graduates in 1985**.\n\nThe story is the same in psychology, which graduates about 95,000 students a year, more than double the number of 25 years ago and far in excess of the number of available jobs.\n\nPerhaps most oddly, despite the decline in the number of news media jobs, especially in the print media, the number of students in communication and journalism also has nearly doubled since 1985.\n\nThere is nothing wrong with the arts, psychology and journalism, but graduates in these fields have lower wages and are less likely to find work in their fields than graduates in science and math.\n\nAs a result, more than half of all humanities graduates end up in jobs that don't require college degrees. Baggage porters and bellhops don't need college degrees, but in 2008 17. 4% of them had at least a bachelor[.] degree and 45% had some college education. Mail carriers don't need a college education, but in 2008 14% had at least a bachelor[.] degree and 61% had some college education.\n\n"}