{"doc_id": "835", "name": "2011_11_humanities_student_major_386_science", "namespace": "we1sv2.0", "metapath": "", "pub": "science", "title": "2011-11-humanities-student-major_386_science.txt", "pub_date": "2011-11-05T00:00:00Z", "Sentiment": "-0.03", "Subjectivity": "0.545", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "380", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2xavje", "Reddit_id": "c2xfawt", "Subreddit_id": "t5_mouw", "Commenter": "HumanoidCarbonUnit", "length": "2032", "content_scrubbed": "I agree with you so much on the education for education sake sentiment. I hate it when people complain about how they have to take social science, arts and humanities, and writing classes. Writing is the one I hate to hear about the most because people always say that is A) hard or B) useless, generally these are people who need to take MORE writing classes because they can't write for beans.\n\nI have loved all but one of my social science and arts and humanities classes. The only A&H class I haven't liked has been because the professor is crazy, other than that the material itself is interesting. If only she wasn't the one presenting it. These classes have given me an understand of things like the UN, how things like genocide can happen, differences in democracy, different political systems of the word, ways that you approach problems and \"fixing\" them, and even how language creates the way you look at the world.\n\nI didn't do well when I tried to be a CS major but I did learn a bit about working your way through a tough problem. Plus I'm not a complete moron when it comes to programing something. I've even helped my boyfriend work through problems in his code because I can think at a simpler level. \n\nI'm a zoology major so physics and chem and even math do play into what I do though not always directly. I enjoy seeing how these subjects relate to what I want to do. I was really excited to see how calc (and econ though that was less exciting) played into determining how long an animal will stay at a feeding patch. Plus I feel like I can give people who are more into physics or chem an ear to chat at. Sometimes I can even muster a good question.\n\nI hate the job farm thoughts people have about college. I understand why they are there but it makes me sad. Like I said I switched from CS to Zoology and people sometimes treated me like I was stupid. There was no care that I was absolutely in love with my major and learning so much people focused on the fact I had switched to a less employable major. "}