{"doc_id": "848", "name": "2011_11_humanities_student_major_536_worldnews", "namespace": "we1sv2.0", "metapath": "", "pub": "worldnews", "title": "2011-11-humanities-student-major_536_worldnews.txt", "pub_date": "2011-11-08T00:00:00Z", "Sentiment": "0.07", "Subjectivity": "0.399", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "481", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2y43gv", "Reddit_id": "c2y4ak5", "Subreddit_id": "t5_2qh13", "Commenter": "Rosti_LFC", "length": "2746", "content_scrubbed": "In all honesty, I don't have the figures and therefore I'd struggle to really give a definitive answer.\n\nA graduate tax is one option I think is fine, or just keep the system the way it was currently operating until the Tories changed it. Were really that many people complaining about it? Are the taxes going to necessarily get spent on anything else?\n\nIf everyone pays the tax, and non-graduates are upset about paying for other people to go through University (ignoring people whose income is so low they get tax breaks, because they don't really count anyway), then I would like to see the number of soft degrees cut down, or at least see the funding for those sorts of degrees reduced.\n\nI come from a somewhat biased standpoint of being in my final year of an Engineering degree, but I feel that there are definitely at least a minority of degrees that really don't justify taxpayer money. Obviously sciences, medicine, law, and various others have some level of merit (personally I'd be less inclined towards law, but it'd probably be grouped in there), but I feel that plenty of the softer degrees really don't present true worth. I totally agree with people studying humanities and subjects such as 'Media studies' (no offence intended to anyone studying that - I just find it easier to put a name to one - there are definitely worse courses out there in terms of proving value) because it is a course they find interesting, but I also think that courses where the only real justification for studying them is an enjoyment of the subject should be under somewhat greater pressure to explain why exactly they should deserve the funding they get.\n\nI guess the point I'm trying to make is that I'd probably lean towards pushing it back in the direction of the days where a smaller percentage of people went to University, without resorting just piling financial pressure onto people who want to do it. I'm sure people will think twice about paying £9k a year to do a soft subject, but so will people wanting to do science or medicine (who are more than capable of excelling in that subject) who happen to come from a poorer financial background and don't want to risk the debt.\n\nOn top of moving away from a meritocratic university system that everyone can afford, there[.] also a huge deficit placed on Universities as well. The funding cut is a lot larger than the allowed increase in tuition fees, and Universities are being forced to cover the difference. \nThe markets have already shifted to the point where most production and services are based in the far East, and the Western economies are largely based around information and research. It seems totally stupid to pull money out of research just because the country is short on cash."}