{"doc_id": "839", "name": "2011_11_humanities_student_major_435_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2011-11-humanities-student-major_435_AskReddit.txt", "pub_date": "2011-11-06T00:00:00Z", "Sentiment": "0.178", "Subjectivity": "0.548", "Score": "41", "Upvotes": "41", "Downvotes": "0", "Wordcount": "278", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_m2nd1", "Reddit_id": "c2xmcyj", "Subreddit_id": "t5_2qh1i", "Commenter": "kwood09", "length": "1610", "content_scrubbed": "To make themselves feel better about themselves. \n\nOf course there[.] some truth to it; if you get a degree in English, it[.] a simple fact that you're not as likely to get a good-paying job as someone with an engineering degree. That much is indisputable. \n\nBut because we're on a site populated mostly by people in the engineering/computer science/natural sciences camp, that[.] the only side of the story you get. The other side of the story is that, for all of the english_major working at Starbucks, there are just as many CS neckbeards with absolutely no social skills who may have a good job but nothing to spend the money on. \n\nI think both types of degrees are very important. The problem with liberal_arts degrees, though, is that they're often a bad investment. I'm lucky (scratch that, I worked my ass off in high school) that I don't have student loans because I got a really nice scholarship. I decided that I wanted to major in Political Science and German because that[.] what I'm interested in. I know that I'm probably not going to have the greatest job opportunities when I get out, but I'm okay with that, and I knew that going in. I think the reason Reddit hates liberal_arts/humanities degrees can be summed up in three points: people take out $100,000 in loans for a degree that won't afford them high-paying jobs and then complain about it; some people, especially math- and science-oriented people, don't necessarily see art and humanities disciplines as being inherently valuable; and finally, people are just dicks, and sometimes people like to shit on whatever is different from them. "}