{"doc_id": "874", "name": "2011_11_humanities_student_major_931_music", "namespace": "we1sv2.0", "metapath": "", "pub": "Music", "title": "2011-11-humanities-student-major_931_Music.txt", "pub_date": "2011-11-17T00:00:00Z", "Sentiment": "0.114", "Subjectivity": "0.284", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "341", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mfwuf", "Reddit_id": "c30m1jx", "Subreddit_id": "t5_2qh1u", "Commenter": "SocialSoundSystem", "length": "1945", "content_scrubbed": "Online marketing and technology is where the music industry is a wild west these days. Lots of interns come to us via Musicians Institute and have no clue about real business or online marketing. The best way to get into the music industry is to JUST DO IT (haha). Learn about online marketing and/or intern at labels/with bands who \"get it.\" DIY is the new \"deal.\" \n\nTechnology and social media is not just for bands... Every person on tour from the TM to merch to security to guitar tech... Every single person should be active on social media. It not only helps the people you are working for but also helps build your personal brand. Who would you rather hire: Joe Dirt tour support guy or Joe 2. 0 support guy who has a smart phone, blog, etc. and can show you his history of work online?\n\nPlus... By learning online media/marketing and how technology works for bands you will be able to apply this skill set WAY beyond music towards any/all projects you may have.\n\nUnless you're going to college for math/science... I wouldn't take out the student loans. As someone who went to UCSB with a Political Science: International Relations degree, I now work in the music industry as a social media geek, community manager, online biz dev, etc. I have a shit-ton of student loans and Citibank don't give a fuuuuk... They just want their money. Hind sight is 20/20 but you don't pay attention to the devil in the details when you're ignorant & 18-24. Higher education merely lines bank pockets with your debt backed by the US government and they trade your loans like baseball cards. Either way the banks profit as they print out your liberal_arts degrees on toilet paper. To all my younger family and friends, unless you're going to college for math/science or you're fortunate enough to have someone pay your way, it[.] not worth it. Start your own business and live within your means. Oh yeah, and ride a bike :)\n\nhttp://socialsoundsystem. com"}