{"doc_id": "899", "name": "2011_11_humanities_student_major_1243_eu3", "namespace": "we1sv2.0", "metapath": "", "pub": "eu3", "title": "2011-11-humanities-student-major_1243_eu3.txt", "pub_date": "2011-11-27T00:00:00Z", "Sentiment": "0.118", "Subjectivity": "0.389", "Score": "17", "Upvotes": "17", "Downvotes": "0", "Wordcount": "1517", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_kkmet", "Reddit_id": "c33aacl", "Subreddit_id": "t5_2soil", "Commenter": "GeeJo", "length": "8838", "content_scrubbed": "These tips are based on Divine Wind - not necessarily relevant to earlier editions:\n\n* If you get Peasant rebels, let them take a province and submit to their demands for a free (mostly) shift towards Free Subjects. Yay for cheaper tech!\n* Owning a Centre of Trade in a non-core province absolutely trashes your compete chance. Unless you're going for a Mercantilist policy, at least *consider* destroying them if you can.\n* If you're playing one of the Japanese Daimyos, spend your first few moves claiming the throne of one or two of the others. Inheriting land is much easier infamy-wise than trying to conquer it. \n* Another tip for Daimyos - hire a spymaster and you'll get the option to hire ninjas, which can be useful in successfully claiming others' land (and can trigger an event for free prestige).\n* This might be obvious to most, but it took me embarrassingly long to discover: hovering over a territory in the \"Terrain\" mapmode gives you the percentages for the types of terrain there. Use mountains/hills for defence, prioritise attacking enemies in plains/desert. \n* Cultural mapmode allows you to find easy targets for \"Fund Patriots\". If your primary culture is the same as the target province, and the owner[.] isn't, patriot rebels will turn the province over to you and join your side (for free troops and a general) after a year or two of holding it. Useful for when crusaders and colonisers have their backs turned to another war.\n* Expansion isn't always good. Conquering North Africa early might be fun and easy, but all those poor, non-core, other-culture, other-religion provinces will destroy your research rate and suck up resources combatting rebels for years. That[.] not to say you shouldn't ever do it, just think about it first.\n* Don't use your 8/8/8 monarch as a general. He will die, and you will be sad.\n* You don't need to go hell-for-leather towards a unification goal. Forming Netherlands or Russia are the best examples of this. Take your time, consider other directions you can expand in rather than accruing unnecessary infamy/war exhaustion/cost that a monomaniacal focus might bring.\n* If you're at full stability when you get one of the \"good adviser\" events that offer 2 free stability, check your ideas/government. Now would be a good time to switch, before accepting the offer.\n* If you have nothing to build (or no cash to build it), use your magistrates to create paintings. Cultural tradition is useful for getting decent advisors.\n* Vassals are awesome. Even if they're fairly tiny, during a war they'll keep your realm clear of rebels while your doomstacks are abroad.\n* If you're a OPM/small nation and never declare war without a relevant casus belli, do consider doing it if you're in a long stretch of inactivity. Stability is cheap and adding an extra province or two can be worth the (admittedly huge) infamy, even if you're the type to normally play it safe. On the other hand, once you're a blob avoid stability drops like the plague. It might only take you to 0 or 1 now, but it only takes a bad event or two and you're at negative stability with a long recovery time.\n* Concentrate on one or two branches of research (typically government and land). If you're playing with no inflation, or inflation from gold, mint whenever those two are too far ahead and, once they're back to reasonable costs, run at a deficit to convert your cash back at a 1:1 ratio.\n* Likewise, if you're planning on westernising and aren't playing with inflation, sink all your investment into minting after getting your first idea and forts, as you'll be able to convert your stockpile into research more efficiently once you're in a higher tech group\n* If you're making slider changes to westernise, Patron of the Arts is awesome as it can trigger a random event shifting you two places to innovative (happens fairly rarely, but you can boost it with a good artist). Also, avoid taking any decisions that increase your stability costs until after you've modernised your military, or you'll regret it.\n* Once you're actually taking the westernisation decisions, Church Attendance Duty becomes quite attractive - you need to regain 16 stability for two westernisations and a military modernisation, and that[.] at a 50% markup. Anything to take that down is *nice*.\n* If you're a colonial power or bordering a powerful military nation, keep armies of 1,000 at each of the potential points of incursion and SCORCH THE LAND when they approach. Leave them to siege the border fort and watch their doomstacks shrivel before counter-attacking. This is hugely useful when playing a Native American nation, and pretty much the only way you'll fend off the initial encounters without losing a bunch of land.\n* Another tactic for playing native americans/subsaharans is to use spies - incite natives at colonies and burn them whenever possible. You only want one nation bordering you to westernise (preferably one of the less military-minded like Denmark or The Hansa).\n* Sphere of Influence is pretty darn useful inside the HRE (or as Ming). As well as boosting your magistrates by a little bit, every time you expand your influence you increase your diplomatic skill by 3, making it easier to get royal marriages, alliances, military access or nominations for the Imperial Crown. Further, it gives you a free Casus Belli whenever anyone interferes with your target. This is especially useful if you target the guys around The Palatinate - they seem particularly aggressive and once you vassalise them they act as a free vote for office.\n* If you get stuck with a long regency council, fill the time by annexing some vassals or making an ally of a warring nation - swooping in for a territory or two (just make sure the infamy will be mostly gone by the time your monarch reaches their majority). \n* Providing you can manage war exhaustion, alternate infamy-generating wars (with a reduction such as holy war, imperialism, colonial conquest etc) with non-infamy-generating wars (fabricated claims, claimed thrones, reconquests). Keep an eye on the legitimacy of your rivals, as fabricating claims is one of the easiest ways to quickly expand.\n* If you're likely to need more magistrates than cash, save your first four of the game to Expand the Bureaucracy in your capital. The earlier you do that, the faster it pays you back.\n* If you're planning on trying for a World Conquest, slightly prioritise island colonies over continental ones. You can't use the Colonialism casus belli to retake the islands as it[.] impossible to border them, while you only need a single continental province to eventually expand and fill the whole area.\n* You don't need to be in the Holy Roman Empire to become the Emperor. Any male christian monarch will do if you've got the_right vassals or Bohemia and Austria have thoroughly embarrassed themselves. One of the funnest games I can recall involved force-converting the entire empire to Orthodoxy as Muscovy.\n\n**Warning: Munchkinnery ahead!: These tips get increasingly munchkinny.**\n\n* This is mostly for the Asiatic religious group. Once you've gotten all of the religious decisions you like, declare war on a nation of another religion of the same group and accept force conversion to get access to more! You can build up quite a tolerance to heathens and heretics doing this, and in combination with Unam Sanctum, can use the Cleansing of Heresy casus belli to conquer essentially all of asia at an infamy discount.\n* Leave one province of a horde nation uncolonised while expanding your borders around it. This gives you free colonists and, if you're the HRE, free Imperial Authority when they attack you every five years.\n* If you find Great Britain/Tachibana[.] navy to be too much of a pain to overcome, ally with them. During a shared war, shift your troops into their territory and leave them there after peacing out. Declare war at your leisure without worrying about the crossings.\n* Towards the end stages of a world conquest, once your only barrier is the Badboy cap, you can release nations whose territory you have entirely cored for a massive infamy drop. Then, ten years later, devassalise them and attack with Reconquest to get them all back. Rinse and repeat as needed.\n* Final munchkin tactics of the bunch: If you get an event you really, really, don't want, and you're a big fat cheater, wait til the new year and load the autosave. It'll be gone when you get back. Likewise, if you get a rebel-causing event, wait til you have an army in place to click it. If you're above the badboy cap, keep those events up as long as you can - only one of that type will trigger at a time and it'll wait for the previous one to finish resolving first. But seriously, if you're doing all of this maybe you should just memorise the console commands and save some time."}