{"doc_id": "837", "name": "2011_11_humanities_student_major_423_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2011-11-humanities-student-major_423_funny.txt", "pub_date": "2011-11-06T00:00:00Z", "Sentiment": "0.019", "Subjectivity": "0.37", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "819", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c2xjz5k", "Reddit_id": "c2xl3gm", "Subreddit_id": "t5_2qh33", "Commenter": "durandalreborn", "length": "4546", "content_scrubbed": "This is from my experience, it might not apply to everyone.\n\nIt probably has to do with the *perceived* difference in work required to obtain a degree in art vs. engineering, and the need/desire to vent pent-up resentment/vindicate the decision to choose an engineering major. \n\nI majored in engineering, and needed roughly 110 units in my major to graduate, with a maximum of 20 units/quarter with three quarters in a year. That was excluding the standard requirements in the humanities (ethics, communication, etc). Each one of my major-related classes after sophomore year was only 3 units, because graduate students often took the same classes, and they could only take 10 or so units a quarter. However, in no way was the amount of work proportional to the unit count. Most of these classes should have been 5+ (where each unit represents 3 hours spent outside of class per week - that[.] the way the university put it anyway).\n\nAn English major was roughly 60 units (with a few extra if you focused in a particular area). These classes were 4-5 units each, and, from my perspective, weren't much work at all. I've been told by some of my friends that some of those classes were really worth the whole 5 units, and I'm fine with that. I never delved deep enough into the upper level writing classes to know for sure. However, just by the number of classes required, I was doing more work for worse grades.\n\nHere[.] the thing though. I was fine with that. I chose that path. English isn't engineering. What really got me was the people who would complain to me about the amount of \"work\" they had, as if they were doing more work than I was. Is it stupid to get upset about? Yes. But when you've been up for two nights in a row, and someone starts bitching about having to read 200 pages of some novel before the next morning, it makes you want to strangle them. Especially when you ask them the next day if they finished the reading and they say they didn't, but they managed to BS their way through class. It[.] not like I could just pretend to do a problem set and get away with it.\n\nOver time, it just builds into this irrational resentment towards people who \"took the easy way out.\" You see people running off to parties you wish you could be at and just assume they're studying something \"easy.\" Then you think to yourself: maybe it[.] just me. Maybe I'm just not good enough and that[.] why I seem to have so much more work. That[.] not true either, though, because there are so many other people with you in that lab on a Saturday.\n\nI'll always remember this one Saturday night when we were all working on some EE project, and someone had the football game playing on their laptop. We won that night, and the student body present at the game rushed the field. One of my classmates made this off-hand remark about how, in her four years there, she never got to rush the field with everyone else because she was always stuck in some building working on some project. Surely there where other people who missed out on that opportunity for other reasons, but that[.] not what[.] going through your head at that moment.\n\nIt[.] the little things in college that really make the experience for some people, and the notion that you've \"picked the_right major,\" and \"it'll all pay off in the end,\" is what keeps some people going despite \"missing out\" on some of the things you wish you had time for. \n\nI see this trend of \"humanities bashing\" posts as less of an attempt to demean an \"entire sector of post-secondary education,\" and more of a way for people to reassure themselves that they made the_right decision and/or their work will all pay off in the end. Is it right? Of course not, but compare it to all the engineering-bashing stereotypes out there and it[.] not that different. Engineers spend their nights studying instead of partying. They're socially inept, sexually inexperienced, etc.\n\nIt just so happens that right now, in this economic climate, the engineers \"won out.\" To all of those people who told me I was boring, that I was wasting my college years studying instead of partying, this is the \"proof\" that I made the \"right\" choice. It[.] wrong to elevate my own self-worth by observing the suffering of others, but damn it feels good sometimes. For that, I am guilty. I don't condone hitting people when they're down, but I can understand the sentiment behind some of these posts.\n\nSorry that ended up being so long, but I've been struggling with the question of \"why I feel the way I do when I see these posts\" for some time now."}