{"doc_id": "891", "name": "2011_11_humanities_student_major_1136_law", "namespace": "we1sv2.0", "metapath": "", "pub": "law", "title": "2011-11-humanities-student-major_1136_law.txt", "pub_date": "2011-11-24T00:00:00Z", "Sentiment": "0.249", "Subjectivity": "0.291", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "306", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c321igw", "Reddit_id": "c32e9k6", "Subreddit_id": "t5_2qh9k", "Commenter": "BolshevikMuppet", "length": "1627", "content_scrubbed": "I wouldn't say \"don't\".  I would instead say \"consider why you want to go into the law\".\n\nI think the biggest problem with law right now is that it[.] been seen for years as \"I have a BA in something social-sciency, and I don't know what else I should do, and it'll be good money\".\n\nIf you are looking to go to law school, the question isn't \"do I find the law interesting?\" (most people who got a liberal_arts degree find it interesting).  And it can't be because you don't know what else to do, or you think it'll be good money (I promise, it won't).\n\nIt has to be because you love the *practice* of law.  Not the \"spend a lot of time discussing the philosophy of the constitution\", but the day-to-day slog of discovery, drafting motions, the minutia that makes up the majority of a lawyer[.] day.\n\nMy best advice: go shadow an attorney (I'd bet you can find at least one willing to let you tag along for a week).  Ask yourself if you enjoy what he does on a day-to-day basis.  Ask yourself if long nights, and not a lot of pay, is worth being part of the ongoing legal fights.\n\nIf it is, go to law school.  If it isn't, don't.  But you have to treat it the same way you would treat going to medical school: something you do to help people, something you do because you really love the actual practice of it.  But in the same way you don't go to med school just because you find medicine \"fascinating\", or because it[.] good money, **do not go to law school for those reasons**.\n\nThe money sucks, and you'll spend a lot more time writing \"this action arises, inter alia\" than anything approaching *Mr. Smith Goes to Washington*."}