{"doc_id": "814", "name": "2011_11_humanities_student_major_24_relationships", "namespace": "we1sv2.0", "metapath": "", "pub": "relationships", "title": "2011-11-humanities-student-major_24_relationships.txt", "pub_date": "2011-11-01T00:00:00Z", "Sentiment": "0.171", "Subjectivity": "0.456", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "342", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_lw33d", "Reddit_id": "c2w5yca", "Subreddit_id": "t5_2qjvn", "Commenter": "wifeofaprofessor", "length": "1880", "content_scrubbed": "It[.] just that he is kind of everything I've wanted in a guy\n\nIt may be reasonable to say you're attracted to him. But such a statement is ridiculous to make about someone you do not know outside of his work environment. I think you need to take a step back and try to put some of your feelings in the proper context.\n\nhe[.] really passionate about music as well, and is incredibly knowledgeable about literature and the arts\n\nI think that it is somewhat natural for college students to become in awe of someone who is SO incredibly knowledgeable about and experienced in their field. Especially when it[.] the field that said student is passionate about. Don't mistake awe for romantic feelings.\n\nthe way he treats his students... it[.] like he[.] one of us, and us on the same level as him, which is definitely unusual in a top 10 school. He[.] just beyond amazing.\n\nThere are lots of professors who take more of a mentorship role than a pedagogical one and treat their students with respect. That does NOT mean that he sees you as any less of a student, and it doesn't [necessarily] imply a lack of boundaries.\n\nI'm not sure if I'm reading into things too much or not, but I do get the sense that he maybe/might/possibly feel the same way?\n\nWhy?\n\nThis particular class is structured in a way that is seminar-style, not lecture, and so we're all pretty much on the same level. That is to say, he treats us like colleagues and not college kids.\n\nJust because he treats you with respect it does NOT mean that he sees you the same as he does his peers.\n\n***\n\nIf you want to go through with this... just ask him out for coffee. There[.] a very good chance that you are student-zoned (like being friend-zoned) and you will have to take the responsibility for recontextualizing your relationship. You'd have to ask him out like you would anyone else in order for him to see you differently. "}