{"doc_id": "905", "name": "2011_11_humanities_student_major_1276_comics", "namespace": "we1sv2.0", "metapath": "", "pub": "comics", "title": "2011-11-humanities-student-major_1276_comics.txt", "pub_date": "2011-11-28T00:00:00Z", "Sentiment": "0.007", "Subjectivity": "0.416", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "305", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c33et4o", "Reddit_id": "c33gtvw", "Subreddit_id": "t5_2qh0s", "Commenter": "Various_names", "length": "1795", "content_scrubbed": "There is a beauty in simplicity. Analogies are a great way to make a point. The problem is though, that the issues with our environment are not simple. They do not fit cleanly into an \"island\" analogy. To me, the type of thinking the comic fosters is somewhat dangerous. It proposes an all or nothing future, where humans need to drastically change their lifestyle or face annihilation. I disagree with this mentality, and feel it forces people to either take a very cynical view of humanity or reject the reality of humanities impact on the environment outright.\n\nWe may live on an island of sorts, but our resources aren't necessarily limited in the same way. Advanced communications that foster the spread of knowledge and renewable energy are two bright spots in the future of humanity right now. \n\nMalthusians bug me, because overpopulation isn't the real problem I see in the future. We'll find ways to grow more food, even if it means poisoning our rivers and seas with the runoff from fertilizer. We'll kill and eat all the wild animals then we'll cover the country from coast to coast to coast with soybeans and corn. We'll change the course of rivers to water our crops and golf courses, and will switch to desalinated seawater when they run dry. We'll bulldoze forests and marshes to make room for new housing complexes. \n\n\nAnd this is all terrible. But its not the seeds of a nightmare apocalypse scenario. Its something that it in my eyes is much scarier. It[.] a future where things just get gradually shittier and shittier. It[.] why we need to focus on protecting biodiversity, renewable energy, increasing efficiency in resource consumption, and reducing pollution. What[.] at stake isn't anything so extreme as our survival as our species, but rather the quality of our lives. \n\n\n"}