{"doc_id": "834", "name": "2011_11_humanities_student_major_379_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2011-11-humanities-student-major_379_philosophy.txt", "pub_date": "2011-11-05T00:00:00Z", "Sentiment": "0.065", "Subjectivity": "0.383", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "420", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_m1wht", "Reddit_id": "c2xevdv", "Subreddit_id": "t5_2qh5b", "Commenter": "cobaltage", "length": "2738", "content_scrubbed": "I would hazard to suggest that Continental philosophy is more significant in the humanities than specifically within philosophy, here in the U_S  E. g.: intellectual history, critical theory, sociology, semiotics, etc.  There is some interest within cognitive psychology in certain, select thinkers, like Husserl.  But in those cases where there is an experimental and a theoretical aspect of a field, the interest in philosophy is primarily from the theoretical side -- i. e., very academic.\n\nThere has been a bit of recent interest in understanding the divide between analytic and Continental philosophy.  But from what I gather -- and maybe someone could correct me on this -- there is very, very little familiarity with Continental thinkers within current Anglo-American academic philosophy.  This has been very striking to me personally, in the course of reading papers and books by U_S philosophers who demonstrate no knowledge of similar matters in the Continental tradition.  \n\nIf that[.] true, your director may be suggesting two things: first, that there is just no need to discuss Heidegger in his view, because most U_S philosophers won't view it as an important aspect of your thesis, in part because they have little working knowledge of Heidegger; and second, that if you do focus on Heidegger, you will isolate yourself from the mainstream of U_S philosophy, when you could be devoting your resources to thinkers who are considered to be more important.  That would be two possible interpretations, at least.\n\nIn an attempt to be somewhat balanced, I'll point out that philosophical camps all over are very insular.  Some philosophers are of central importance to the work of many subsequent philosophers and have an overriding influence on the content of philosophy.  Think of it this way: if you trace back the work of well-recognized philosophers from thesis advisor to thesis advisor, you'll probably find that numerous \"generations\" of theses are devoted to thinkers like Heidegger, Russell, Carnap, Merleau-Ponty, Husserl, Whitehead, etc.  Specifically, I've noticed, for instance, that British philosophers disproportionately refer to Russell, and they rarely mention the degree to which Wittgenstein disagreed with Russell.  (That is, unless they are Wittgenstein scholars.)  The last major philosopher who is discussed equally by both analytic and Continental traditions is probably Kant, and the interpretation of his work was, in many ways, a specific matter of contention when the current philosophical divide developed.\n\nI imagine that it would probably be just as difficult to discuss Anglo-American philosophers if you were studying in Europe as it is to discuss Continental philosophers here in the U_S  "}