{"doc_id": "854", "name": "2011_11_humanities_student_major_678_conservative", "namespace": "we1sv2.0", "metapath": "", "pub": "Conservative", "title": "2011-11-humanities-student-major_678_Conservative.txt", "pub_date": "2011-11-11T00:00:00Z", "Sentiment": "0.033", "Subjectivity": "0.31", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "958", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_m8un8", "Reddit_id": "c2z16iq", "Subreddit_id": "t5_2qh6p", "Commenter": "HerroCorumbia", "length": "5755", "content_scrubbed": "What we have here are the biggest, baddest public temper tantrums we've seen since 1960s spoiled-brat college kids reverted to the terrible twos and marched, rioted, burned, and bombed their way across America.\n\nMade me WTF right away. The 1960s were a time of protest for gender/sexual equality, civil rights, and anti-Vietnam war (a war in which we, for all intents and purposes, shouldn't have fought).\n\nHow in any way are any of these topics \"childish\"?\n\n#5: Cooties can kill me and disagreeable words will crush my spirit\n\nI really tried reading through this dribble, I really did. If the author could, for a single paragraph, or even a sentence, write an unbiased, factual statement, it would make reading it so much easier.\n\nThis big, booby-brat pack offer nothing of substance and cannot explain why they are there in any more adult terms than hurling childish taunts at the cootie-carriers.\n\nThis author apparently thinks that the message for the occupy movement has only been given in childish language, when many occupiers have given reasons as to \"why they're there\".\n\n#4: Sharing germs, having sex with strangers and imbibing mind-altering drugs won't hurt me one bit.\n\nOkay, what?\n\nEvery kid, by the age of 12, should know down to his last brain cell that sharing microscopic germs, having sex with strangers and imbibing mind-altering drugs all carry extreme health risk.\n\nWell let[.] see. Sharing germs, yes, that can carry health risks. The occupations haven't been clean and that is a valid criticism, but with a movement with no leadership, there[.] little responsibility. It[.] a social psychology phenomenon, anonymous people in crowds don't feel responsible for their actions.\n\nAs for sex with strangers - well, first, that[.] assuming they're \"strangers\". They could just be new friends, which is something totally different. They could be using protection, probably not. Wanton sex might be a good criticism if it had ANYTHING to do with the political message of the movement, but this is just being a conservative dick.\n\nImbibing substances. What substances are we referring to? Marijuana, LSD, psychedelic mushrooms and ecstacy are all relatively harmless - what this author seemed to miss in their \"science class\".\n\nAnd the funny thing is, NONE of these carry \"EXTREME\" health risks. Again, the author is blowing things out of proportion for a heavily biased, overly critical, obnoxiously pretentious effect.\n\n#3: Free love makes the world go 'round.  Tra, la, la and Kumbayah.\n\nAgain, what? Maybe if this person could actually write worth a damn and didn't fill pages with false analogies and weak criticism of literally NOTHING, I'd get the message.\n\nAt OWS, we see adult children without the understanding that hard_work and wise choices are the only avenues of individual prosperity.\n\nOddly enough, you also need help from other people to achieve prosperity. Nobody in this country ever becomes successful completely on their own. \n\nFurthermore, there are many people in this country who, in fact, didn't have to work hard for their prosperity. Take Paris Hilton, for example.\n\n#2: The world does too owe me a living!\n\nOkay, that[.] not necessarily a message of OWS, but according to the author it is.\n\nToday, evil political charlatans pose as benevolent providers of the common good. Robbing from the productive class to give to the indolent class, all in the name of the common good, is the moral equivalent a plantation owner who claimed to really love his slaves.\n\nFirst off, this language is unbearable. Evil political charlatans? Really? That[.] what you call people who try to make up for centuries of racial injustice by providing a safety net? That[.] what you call those who try to make sure everyone in this country gets an equal starting point? That[.] what you call a person who tries to make sure everyone in this country is healthy and can at least feed themself?\n\nCalling the poor \"indolent\" truly shows how ignorant this author is. They've apparently never been poor, know little to nothing about social psychology, know little to nothing about how impoverished areas create downward spirals for the kids in them, and know nothing about how much of a disparity there is in potential between a kid born in a wealthy neighborhood vs. the ghetto, of no fault to the children.\n\n\"Indolent class\". To assume that everyone who is poor deserves to be poor because they're lazy is the ultimate sign of ignorance for how the world ACTUALLY works, not just for how it works for a few people. Upward mobility is EXTREMELY hard AND uncommon starting from the bottom.\n\n5. They went off to college with the apparent belief that they could borrow tens of thousands of dollars to pay for it, but that they would never really have to pay it back.\n\nNo, we were TOLD to go off to college. We were TOLD to shoot for Ivy League schools - damn the costs, our resumes would look so spiffy we'd land high-paying jobs anyway. This is what the Boomers, this bitch of an author[.] generation, told us. We HAD to go to college to be successful, and the better the school, the better our jobs would pay.\n\nThen the economy collapsed, and jobs disappeared. Cuts to public schools and universities left fewer jobs for liberal_arts majors. Research was cut. Thousands lost jobs in every field, and our politicians (Democrat AND Republican) are dragging their feet with political fighting and not passing anything to help the situation.\n\n**TL;DR This article is garbage. Horribly, horribly biased writing, barely any substance, and the author is a completely ignorant, heartless bitch who has no clue about what OWS is fighting for, and instead just makes weak, usually-baseless criticisms of things completely unrelated to OWS[.] complaints/demands.**"}