{"doc_id": "892", "name": "2011_11_humanities_student_major_1171_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2011-11-humanities-student-major_1171_TwoXChromosomes.txt", "pub_date": "2011-11-25T00:00:00Z", "Sentiment": "0.078", "Subjectivity": "0.301", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "241", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c32p914", "Reddit_id": "c32pd83", "Subreddit_id": "t5_2r2jt", "Commenter": "textrovert", "length": "1569", "content_scrubbed": "The article is about education, not art. The humanities are: history, philosophy, literary criticism (not literature, that[.] the arts), art history (not art), and anthropology. So I'm not concerned about who pays poets here, I'm concerned about what we believe we have an obligation to teach students getting ready to enter society. Why *should* we fund the chemistry professor more than the history professor? The answer is corporatism. \n\nEconomics and the market are only an expression of what we, as humans, think is valuable.\n\nI strongly disagree. The market ends up defining value, not simply expressing it. Value on the market is that which goes towards material progress, which is often not what human beings believe is valuable. Democratic politics allows us to *collectively* define what we consider valuable, apart from short-sighted individualistic self-interest. Mixing politics and corporatism simply undermines democracy and goes against the collective good. The things we consider basic rights and basic goods should be separate from the market.\n\nEdit:\nWell, what is value if it[.] not economic value?\n\nYou can't be serious...??? Human connection, ethical action, understanding the universe, knowing about the past, freedom from prejudice, empathy, raising a family and spending time with them... none of that has any connection to economics, and we have no way of assigning them economic value under unrestricted corporate capitalism, despite that most people would say they are some of the most important things in life. Do you disagree they're valuable?"}