{"doc_id": "883", "name": "2011_11_humanities_student_major_1088_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2011-11-humanities-student-major_1088_funny.txt", "pub_date": "2011-11-22T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.319", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "273", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c31y2wd", "Reddit_id": "c31y6ql", "Subreddit_id": "t5_2qh33", "Commenter": "[deleted]", "length": "1565", "content_scrubbed": "It is 5 minutes, and I set it to the point that is relevant.  I would encourage you to watch it.  Really, only 5 minutes to be educated by the leading researchers.\n\nMale and female are words.  Words that have been useful in the past.  They are the ends of a spectrum that we call the gender binary - social construct is what it is.  We tend to socialise our children to try and become as close to the ideal as they can achieve.\n\nThe ginger bread person is best to look at to understand the real science of it.\n\n[Ginger Bread](http://imgur. com/knNvV)\n\nThe problem with the binary lies in the fact that it excludes reality.  It excludes XX males, XY females, XXY males and females.  It excludes intersex people who are any of XX, XY, XXY.  It also excludes all the trans community.\n\nThe gender binary excludes all forms of exceptional gender expression.  Feminine males or masculine females.  It forces unnecessary stress and bigotry upon them.  A masculine woman is not a lesbian because of this.  A lesbian woman is a lesbian because she is a lesbian.\n\nMan and Woman are words.  We have as a species created social constructs based on the majority and formed idealisation of these words.  That very few us can actually achieve.  Reality does not like humanities small minded attempts at forcing a binary on it, i. e. male/female/ ; black/white; on/off; gay/straight/ etc/etc... That is our own pathetic nature as a species to grasp the real realities, and it is these very minorities that allow for us a species to see *just* how pathetic we don't understand things."}