{"doc_id": "888", "name": "2011_11_humanities_student_major_1121_linuxadmin", "namespace": "we1sv2.0", "metapath": "", "pub": "linuxadmin", "title": "2011-11-humanities-student-major_1121_linuxadmin.txt", "pub_date": "2011-11-23T00:00:00Z", "Sentiment": "0.04", "Subjectivity": "0.395", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "925", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c328a6g", "Reddit_id": "c328l5o", "Subreddit_id": "t5_2r9lc", "Commenter": "Calcipher", "length": "5096", "content_scrubbed": " I just want to set up a mail server\n\nI think the issue is that mail servers are some of the easiest things to screw up and and very terrible when exploited.  Honestly, if you don't want to learn infosec, you should google around for papers on securing a mail server.  When  I first read your post, I made the assumption that you wanted to learn infosec.  In my personal opinion, every sysadmin needs to know the basics of information security - for better or worse it is our burden to be generalists in technology and specialize from there, but to what extent you need to have these skills is up to you.  I will say that penetration testing and information security are jobs that rely on creativity, will, and a tremendous depth of knowledge like no other field (even people who work in the arts would recognize how creative good information security people are) and that is what drew me in.  The field isn't just about knowing how to hack and prevent hacks, but is a whole different way of looking at tools.  I've belabored the point too long.\n\n However, you're talking like this is advanced stuff, which scares me a little as I feel like I'm getting in over my head.\n\nYes and no.  Running a honeypot system and doing things as \"simple\" as knowing when it has been hacked is a very complex situation.  It is beyond information security and into computer forensics which is where the hardcore information security pros go.  Learning about information security is always going to be over your head.  What I mean is that learning this stuff is a major paradigm change and you are never at a point in which you will understand even a majority of the security world.  What makes a good infosec person (and I would argue computer person in general) is the ability to learn about topics rapidly with little guidance and few resources.  So, yeah, it is over your head, but it is your job to struggle along with it.\n\n Is it the case that you pretty much need to be well versed in infosec in order to do anything these days \n\nThat all depends on what you are planning on doing.  If you are talking about a work environment, no, being well versed is not a requirement as there are other people to help you out.  As I've said above, technology is about compromises.  There are people who present themselves as exceptions, but no one knows everything and you have to be willing to learn a bit about everything and know how to learn those things.  You are interested in systems administration as a career and it is a field where the majority of your learning will not be from a book, but from working with people who know what they are doing.  On the other hand, if you just want to do hobby stuff, you will need to know enough to keep yourself protected.  There is the legal issue, but there is also the issue of how much your data is worth to you.  I know I'm doing a bad job answering this, but I think my point is that you need a base level of knowledge to succeed in the IT world.\n\n with all the hacks that have been happening lately\n\nI wanted to address this.  Most 'hacks' these days are of three types.  Hitting unpatched systems, social engineering, and/or DDOSing.  There is a lot of crossover in these three.  The latter case is hardly legitimate as a hack and there is little anyone can do to prevent it and there is little to gain other than knocking someone offline.  Unpatched systems are everywhere and are the easy targets.  Sure, there are people who develop zero day patches and go on a rampage, but the majority of these hacks are things people could have prevented by simply updating their systems.  Social engineering is a huge field and is very hard to defend against.  If you aren't super technically skilled, this is almost always the quickest path to compromising systems.  Many companies, in fact, when hiring pentesters will stipulate that social engineering is off-limits or, at least, limited in scope (why would you pay someone to tell you what you already know - that people are the weakest link).  So, what can you draw from this?  Well, if you keep your systems patched and firewalled correctly you will prevent the majority if script kiddie hacks.  As for DDOSing, zero day attacks, and social engineering, you have to ask yourself how important your information/network is to you vs how important it is to hackers.  If I just need a relay box, why would I work hard to hack your systems if I could just hit Grandma Windows XPSP1[.] box.  Not saying you are safe (security through obscurity is only a first line of defense), but the odds are in your favor.  \n\nSorry, I've rambled on too long, but my tl;dr of this would be that as a technology professional you need to be curious and willing to learn.  If you let things like \"this is over my head\" keep you from trying stuff, you are doomed in the field and should move to web development (kidding guys, kidding).  The trick is in knowing what is over your head but a logical step in your learning path and what is over your head and requires a whole staircase to get to.  Working on the former, will get you to the latter."}