{"doc_id": "862", "name": "2011_11_humanities_student_major_806_truereddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueReddit", "title": "2011-11-humanities-student-major_806_TrueReddit.txt", "pub_date": "2011-11-15T00:00:00Z", "Sentiment": "-0.044", "Subjectivity": "0.543", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "368", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mcvxv", "Reddit_id": "c2zyi0k", "Subreddit_id": "t5_2qyt6", "Commenter": "kosherkowboy", "length": "2065", "content_scrubbed": "Ok, I like the premise, but once he starts comparing a football game to a Nuremberg Rally... that[.] kind of offensive. However, I do think that the major sports (football, hockey, lax) at my school (a D3 NESCAC school) is one of the worst things that our school does. A *majority* of the football players wouldn't get into this school without a serious admissions bump, while when I was applying to schools the reason I chose a small liberal_arts school was for the intelligence of the student body. I mean I scored 10 points higher on the ACT (which is a massive margin, for those not acquainted with that test) than a kid I was talking to on the hockey team, who also was deciding whether or not to transfer because he said his work was too difficult (apparently studying for a college midterm for more than three hours is out of the question). And at an admissions rate <20%, each athlete let in for athletic reasons means one smart person who got cut. At the same time, no students go to the games; it[.] comical to see the student section of our pitiful bleachers always empty, while the parents of the players show up but hardly anyone else. \n\nI'm sorry for this poorly written rant, but these athletic programs seriously place a drain on college academic culture. I'm sorry to vilify a particular subset of people, but it is the athletes who are the ones who sit in a class they're paying hundreds of dollars per session for, and watch youtube videos, go out drinking Wednesday-Saturday, and have the biggest difficulty doing well in class. They're not getting much out of this school, I'm not getting much out of them being here, and honestly they could be served better elsewhere where their needs were catered to at their level. While I can understand D1 athletics better, where there[.] a good chance that college football is actually preparing them for a career as a football player, D3 football is worthless, no one watches it, no one[.] good at it, and it makes this school worse.\nSorry for ranting-this is just a subject that constantly pisses me off"}