{"doc_id": "872", "name": "2011_11_humanities_student_major_899_atheism", "namespace": "we1sv2.0", "metapath": "", "pub": "atheism", "title": "2011-11-humanities-student-major_899_atheism.txt", "pub_date": "2011-11-16T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.348", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "658", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c30g28q", "Reddit_id": "c30gane", "Subreddit_id": "t5_2qh2p", "Commenter": "blazingtruth", "length": "4135", "content_scrubbed": "**Q1.** Let[.] say that there is free market education... if schools compete for lower tuition costs, can't the quality of the education and the salary of the teachers go down as well in order to cut costs and increase revenues?\n\nYes, some schools would initially cut quality and teacher salary to try to get an edge on other schools. This is, however, poor business strategy. Individuals and parents would take notice, and the schools that were most successful in balancing cost, quality, and reputation would phase the less effective out. In the long run, school quality would increase, teacher salary would increase (actually, it would increase immediately in adopting a private system, given how low it is now), and cost would decrease to the point that education of some sort would most-definitely be universal, especially considering the advent of free/cheap online education such as offered by khanacademy. A transitional voucher system may also be used, as has been successful in Holland and Sweden. \n\n---------\n**Q2.** Also, how will making all the schools private actually help the U_S in its education rankings?\n\nThis new system, due to the forces of supply and demand in the free market, would necessarily lead to a solid fact-based education that would increase America[.] global ranking. Private entrepreneurs can better operate schools than can government officials, due to the availability of knowledge and lack of bureaucracy acting as the middle man. Focus would be shifted away from the indoctrination of students with a dependency of the State, and shifted towards the intention of the school itself. Thus schools of the arts and humanities would also prosper, and some schools would become more specialized for the technical/engineering and creative/musical needs of society. \n\n-----------\n**Q3.** Those who can't afford school will just have to deal with it. Couldn't that dramatically reduce the literacy rates for Americans of the lower income levels? These are just honest questions.\n\nThis is not necessarily true. Those who cannot afford school would benefit from the reduced cost due to competition in the market. Others would go directly to work and gain employment experience. Originally, compulsory school attendance laws were passed as a means to support lazy union workers whose jobs were being taken by competent kids who would do better jobs than the union workers (see the case brief of Wisconsin v. Yoder, dealing with forcing Amish children to go to school against their religious rights). \n\nThat point aside, schools would want to improve their image to attract new students by raising funds from alumnus to allow for scholarships to students to increase availability. This is the same line of thinking used when stores offer 20% off sales. In the long run, these seemingly sacrificial moves actually generate profit. Again, churches and private associations, voluntary unions, co-ops, and other voluntary actions would provide charitable donations. Given the inherently lower/reduced cost, and the increased availability of education, I am confident that everybody would receive an adequate, if not more advanced, education. Literacy rates would improve for intercity regions which would now benefit from the development of schools.\n\n----------\nI'd like for you to read Murray Rothbard[.] \"[For a New Liberty](http://mises. org/rothbard/foranewlb. pdf)\" Ch 7 on Education (p119-), for a greater analysis of how this may look, as I surely have not covered the basis in enough clarity. Rothbard speaks with a very matter-of-fact tone that I cannot match. He also has viable statistics and historical examples to support his ideas.\n\nWell, I hope I could help a little bit. I really am tired of people bashing the free market system without understanding or considering it. I know you are being genuinely honest, but most people don't have the patience to read my responses let alone think about them. It[.] just so different than the framework which most people grew up in -- hence why I said indoctrination to a dependency on the State. I don't know why I even bother caring anymore. **/rant**\n"}