{"doc_id": "879", "name": "2011_11_humanities_student_major_1022_desktopdetective", "namespace": "we1sv2.0", "metapath": "", "pub": "DesktopDetective", "title": "2011-11-humanities-student-major_1022_DesktopDetective.txt", "pub_date": "2011-11-20T00:00:00Z", "Sentiment": "0.003", "Subjectivity": "0.343", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "471", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_mjg4x", "Reddit_id": "c31gp3i", "Subreddit_id": "t5_2t0da", "Commenter": "TarquinniusSuperbus", "length": "2669", "content_scrubbed": "Ok, I'll give it a shot. First, you are obviously a University of Michigan student based on your school folder. I am ALSO a University of Michigan student so I have a little insight into you, pal. First, you're male and in computer engineering. Dual boot = dead giveaway. You probably live in A2 or Detroit because you have nothing about going home/packing/etc on your to-do list, A2/Detroit are the more likely population centers for UM undergrads, and you \"work\" which doesn't make sense for one of the West-Coast/NYC kids who have their parents paying ridiculous out-of-state tuition to go to UM.\n\nSo based on my knowledge that you are a middle-class guy from the southeast Michigan area, I know that (1) you like cars (2) you speed. \n\nNow, I suspect that you live on north campus being an engineer and the fact that I don't recognize the location on the blurry photo. I don't really know North Campus well, so I assume it[.] near there.\n\nYou wrote, \"Alright, me boyos. Have at thee!\" which to me indicates you are a nerd (which is fine, I am too) but being an engineer nerd using the word \"thee\" can only mean one thing: gamer.\n\nI don't think you're a freshman or a grad student, which means that you are between 19 and 21. You probably sleep ridiculous hours, are not in a fraternity (or else you'd have some frat stuff on your desktop), and would not consider yourself a hard party-goer.\n\nBecause you work, you understand the value of graduating on time and therefore are looking at the 4-year college plan rather than the seemingly-standard 5-year plan.\n\nThe number of song-lyric-stuffs on your desktop indicates to me that you like music and perhaps even played an instrument before; I won't delve into that too deeply because frankly I know somewhere between jack and shit about music. However, I do tend to view musicians in 2 categories: the marching band variety, and the artsy variety. I would classify you more into the artsy variety, but not formally trained in art/art history (essentially the photo you have as a background isn't good photography so I think you would have chosen a different background if you were seriously, seriously into photography).\n\nI bet, however, based on the quasi-artistic blurred photograph and the fact that I perceive you as a faux artsy person, I think that you dress relatively well... but not too well. I think it[.] a collegiate development, and that you weren't super popular in high school but are finding some close friends in college. If you are 21 (or have a fake ID) your favorite bar on campus is Ashley[.], but you hate (HATE) Rick[.].\n\n\nAm I close? Do you want to get dinner? I took a long nap and I missed food :("}