{"doc_id": "867", "name": "2011_11_humanities_student_major_854_truereddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueReddit", "title": "2011-11-humanities-student-major_854_TrueReddit.txt", "pub_date": "2011-11-16T00:00:00Z", "Sentiment": "-0.059", "Subjectivity": "0.343", "Score": "56", "Upvotes": "56", "Downvotes": "0", "Wordcount": "305", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c308nxc", "Reddit_id": "c308s9i", "Subreddit_id": "t5_2qyt6", "Commenter": "[deleted]", "length": "1829", "content_scrubbed": "First off, I have precisely zero problem with humanities degrees, and probably would have majored in English or Spanish instead of computer science (I finally went and did the CS degree because I knew I could maraud through the subject matter).\n\nHaving said that, I worked for a firm for 7 years that did disaster planning, and wrote emergency management software. While a lot of the planning section were people with formal backgrounds in emergency management (Police and fire chiefs, utilities managers, hospital personnel, etc), a larger number were people with English degrees. Much of what they did was consultation with metro areas, and development of these massive documents called 'disaster plans'. A disaster plan would usually be about 10-20% analysis of laws and policies and procedures, about 10-15% of good hard scientific analysis of impact (like power grids, epidemic dispersion, % of buildings flooded, etc). The rest of the disaster plan would be.... well, fluff, just lots and lots of unnecessary, frequently bulk copy-pasted text.\n\nEvery now and then, someone from planning would end up in charge of a software project, and they'd be endlessly frustrated that I couldn't just \"make the work go faster\". I finally had to produce the following analysis to help explain things:\n\n\"You can write a 350 page disaster plan, and 30% of it can be entirely copy-pasted fluff, and the doc, will, for the most part be considered a success, by both vendor and client. If I write a 35,000 line piece of code, and 30% of it is a bug-ridden mess, the entire project will be considered a failure, by both vendor and client.\"\n\nThis helped things out, considerably. But, it never stopped the questions of \"well, you did something similar to this before, can't you just ctrl-c, ctrl-v the whole thing, and make small tweaks?\"\n\nNo."}