{"doc_id": "685", "name": "2012_02_humanities_student_major_961_intj", "namespace": "we1sv2.0", "metapath": "", "pub": "intj", "title": "2012-02-humanities-student-major_961_intj.txt", "pub_date": "2012-02-27T00:00:00Z", "Sentiment": "0.167", "Subjectivity": "0.325", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "353", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_q926c", "Reddit_id": "c3vq3iw", "Subreddit_id": "t5_2qowo", "Commenter": "philspwn08", "length": "1832", "content_scrubbed": "are you studying in the US or elsewhere?  In the US, you can't have law as an undergrad major.  with that said, if you are in the US, it honestly won't make much difference I feel if you study \"law\" as an undergrad or english - both would be useful if you went to law school.\n\ni'm 30 and i struggled mightily deciding my ugrad major.  i was expected to be an accounting major and here i am an accountant.  i toyed with the idea or psychology and political science but i think my parents would have disowned me.\n\nWith that, I give you Kurt Vonnegut[.] infamous quote, which he also said at my college graduation speech, \"If you really want to hurt your parents, and you don't have the nerve to be gay, the least you can do is go into the arts. I'm not kidding. The arts are not a way to make a living. They are a very human way to make life more bearable.\"\n\nI'm very thankful my parents steered me away from the arts, because Vonnegut was very correct with his statement.  The arts are very interesting and they can teach you how to think, but you don't learn a specific discipline (and unless you're coming from an Ivy - nobody gives a sh-t about your arts degree).  Many of my classmates, who are probably more intelligent than me, earn considerably less than me - and while it[.] not all about the money, it[.] not fun to live with your parents at 30 because you make $35k working in the NYC area.\n\nI fortunately am very talented in math and accounting came naturally to me and I actually like it.  Being an INTJ, I would bet most of us do enjoy and can excel in a quantitative field.  If you are so driven to pursue the arts, it may be worthwhile for you, but what I've learned is I can have my capitalist job and also have an appreciation for the arts (and apply what I learned from my arts classes in college at work and in life)."}