{"doc_id": "1555", "name": "2012_01_humanities_student_major_539_truereddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueReddit", "title": "2012-01-humanities-student-major_539_TrueReddit.txt", "pub_date": "2012-01-14T00:00:00Z", "Sentiment": "0.183", "Subjectivity": "0.473", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "339", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ogora", "Reddit_id": "c3h54zu", "Subreddit_id": "t5_2qyt6", "Commenter": "maviegoes", "length": "2022", "content_scrubbed": "This is ridiculous. The cost model should be the reverse of what is being proposed. I definitely think there is value in the liberal_arts and can appreciate a well-written book, or a good movie, or an ingenious philosophical thought. Yet, from a national competitiveness standpoint, these skills simply aren't as valuable and we have too many people going to college to specialize in them so that there simply aren't enough jobs for them when they get out (high supply, low demand). Why would we work to make it more attractive to go into these fields?\n\nFrom an employer[.] standpoint, they want more STEM majors (low supply, high demand), so they increase the cost for people trying to get them. In theory it should make it more competitive, but it wont. The majors are difficult enough in math and science to discourage people from doing/completing them currently, let alone incentivize people to not do them more. We put so many dollars (federal/state) into encouraging people to go into these fields because we recognize their value, so doing something like this just goes against that message: PLEASE go into STEM... but it costs more!\n\nMany law schools in this country currently give money to other parts of the university that cannot afford supplies, professor[.] salaries, etc. The transfer happens across different departments frequently. Tuition doesn't have to be increased just because of high cost of lab supplies. As a current engineering student that is in a high-cost lab, money from grants often covers getting new supplies and software for our labs, so it[.] not all out of the university[.] pocket (and they even get a cut of that grant money!) This plan also makes it more discouraging for people in lower socioeconomic classes to get lucrative careers in engineering or math since they are the ones most burdened by loans after graduation. Just another way to reduce the amount of upward mobility for the poor and increase it for the rich because universities don't know how to properly manage their funds."}