{"doc_id": "694", "name": "2012_10_humanities_student_major_129_ornithology", "namespace": "we1sv2.0", "metapath": "", "pub": "Ornithology", "title": "2012-10-humanities-student-major_129_Ornithology.txt", "pub_date": "2012-10-03T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.198", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "268", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_10uqxe", "Reddit_id": "c6h6sq3", "Subreddit_id": "t5_2raa7", "Commenter": "melanerpes", "length": "1659", "content_scrubbed": "I have a similar story: I have a 10 year-old undergraduate degree in liberal_arts, but got really interested in sciences in the past 5 years. I doubt I will actually go into a bio Masters program, but I'm finding ways to get involved in ornithology at the volunteer level, and so far that has been satisfying enough. I already have a Masters in information science, and am now trying to find work as a data-wrangler/librarian for environmental agencies. Having such a niche dream job, I'll have to find other work for now. In the meantime, I'm making sure to network with conservation folk and getting my name out there for when such a position (and they do exist) opens up. \n\nThere are bird-related fieldwork jobs for non-scientists, and [this site](http://birding. aba. org/maillist/BJ) will give you an idea of the scope and variety. The majority are seasonal positions. Three months in a tent or cabin is a good way to find out if you really want to pursue a field research career. I worked a season as the camp cook for a raptor banding site in the middle of nowhere, and I got to try some of the banding. I found that job on the BirdJobs list. \n\nYou could also try volunteering for research-oriented conservation groups before committing to an advanced degree program. Bird banding, migration counts, breeding bird atlases, etc. Get to know the conservation crowd in your area and find mentors. They will help you to figure out if what you want is a career in the sciences. If that is the case, [consider](http://sciencecareers. sciencemag. org/career_magazine/previous_issues/articles/2007_08_10/caredit. a0700114) a post-Baccalaureate pre-Masters program. "}