{"doc_id": "1539", "name": "2012_01_humanities_student_major_448_saplings", "namespace": "we1sv2.0", "metapath": "", "pub": "saplings", "title": "2012-01-humanities-student-major_448_saplings.txt", "pub_date": "2012-01-11T00:00:00Z", "Sentiment": "0.018", "Subjectivity": "0.375", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "473", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_od4u6", "Reddit_id": "c3gege6", "Subreddit_id": "t5_2rukl", "Commenter": "Fudbar", "length": "2791", "content_scrubbed": "To the OP; you've made the_right choice, and the fact that you understand there are negative consequences to your actions and you're concerned about that tells me you'll probably do just fine.  Also, community college isn't horrible.  That[.] the biggest lie in high school.  Keep in mind that every single one of your teachers is a graduate of a liberal_arts college and has a bias because of it.  Of all the friends I know with university/college degrees (I'm 40 BTW), only ONE is working in the field they graduated in.  On the other hand, I know more than a dozen that have BA[.], master[.] degees, even doctorates and only found their career path after they went back to community college or a trade school for re-training.  EDIT:  I mean *real* colleges and trade schools.  Those late night TV ad & matchbook ones are just a scam.  You won't learn anything and they charge an arm & a leg.  If you want to make serious money and get hired the day after you graduate, learning a good trade is a safer bet than a BA any day of the week.   Also, paying back student loans when you can't find work sucks.   Keep that in mind.   It[.] not all about the prestige.\n\n  To anyone else smoking in high school, yes, you can smoke throughout high school and come out ok.  On the other hand, even if you wait until college, it can still mess up your life.   Not because it[.] an evil drug, but because it[.] a fun distraction that can keep you from fulfilling your responsabilities.   You could just as easily mess up your life with a Pokemon or WoW 'addiction'.\n\nAt the end of the day, there are two big problems with smoking at that young of an age.  \n\nOne, you're messing up your relationship with your parents.  As life goes on, parents that love and support you are one of your most valuable assets, and smoking behind their backs can damage that relationship.  They'll be hurt because you broke their trust, and they'll worry about you (because that[.] what parents do) and that will cause them undue stress and pain.    \n\nTwo, and this is more critical, no [responsable Ent](http://norml. org/about/intro/item/principles-of-responsible-cannabis-use-3) should be cool with smoking up or selling to minors.   Anyone that does doesn't really care about you and may even be looking to exploit you.  You'll end up in situations that teenagers really shouldn't be in, and you're much more likely to end up exposed to other much more dangerous drugs at a young age that will be addictive and have horrible long_term effects on your health, like alcohol and tobacco. \n\n**TL:DR?  Being responsible for your own actions is more important than if you smoke or not.  Also, [read this. It[.] what being a good Ent is all about.](http://norml. org/about/intro/item/principles-of-responsible-cannabis-use-3)**"}