{"doc_id": "1612", "name": "2012_01_humanities_student_major_1152_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2012-01-humanities-student-major_1152_TwoXChromosomes.txt", "pub_date": "2012-01-29T00:00:00Z", "Sentiment": "0.116", "Subjectivity": "0.418", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "380", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p1oiu", "Reddit_id": "c3lt4vb", "Subreddit_id": "t5_2r2jt", "Commenter": "[deleted]", "length": "2149", "content_scrubbed": "I would agree that we have made great strides toward gender equality, but we aren't there yet!  Yes you can be whatever you want to be whether it be lumber jack or engineer or environmental philosopher (go with that one, it rocks!) but that doesn't mean you still won't face gender discrimination while trying to obtain your dreams.  \n\nI worked for an organic tree/soil company one summer and things were not all peaches and sunshine for me and the boys.  And I know a lot of girls face problems in their engineering classes.  And even some liberal_arts fields of study, i. e., philosophy, have large gender bias that still dominates.  For instance, in my senior seminar of 12 students I was the only female.  The professor told me on several occasions that I was the top student and went on to write many recommendations for me, but the male students frequently called me a bitch and would ignore many of the points I made in class.   I graduated last spring. From a Liberal Arts college in New England. \n\nAnd these gender biases are all too often prominent in my personal life.  I've dated jerks before who told me I was the only 'capable woman' they've ever been with.  Or mentioned that they didn't normally date smart girls because they were 'too argumentative'.  And even some of my very good platonic male friends will jest about my 'feminist ways'.  Did I mention I was the only person on my trivia team who knew who BETTY FRIEDAN WAS?!?  In fact, the only person in the entire bar!\n\nAnd furthermore, these sexist tendencies still take hold of our larger political, social, and economic practices (in america).  Women hold a vast minority of seats in political office and are significantly less likely to reach the highest positions in government.  We still suffer in our career choices for having children and are frequently looked down upon for our choices regarding children no matter what they may be.  And it is still true that we get paid less for the same job (even with more experience).  \n\nYes, the world of the modern woman is SO MUCH BETTER than it has been in years past, but please do not use this as an excuse to stop fighting! "}