{"doc_id": "1521", "name": "2012_01_humanities_student_major_204_iwantout", "namespace": "we1sv2.0", "metapath": "", "pub": "IWantOut", "title": "2012-01-humanities-student-major_204_IWantOut.txt", "pub_date": "2012-01-06T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.378", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "666", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_o615j", "Reddit_id": "c3eo6wp", "Subreddit_id": "t5_2r5hw", "Commenter": "[deleted]", "length": "3708", "content_scrubbed": "I'm a soon-to-graduate German major from the US, looking to move to Germany. I don't know a whole lot about the EU as a whole, but I've heard it[.] difficult to get employment there because in many areas there is a policy of \"don't hire non-EU citizens unless there are no qualified EU citizens to do the job\". This makes it especially difficult for new graduates.\n\nHowever, soon Germany may be implementing a different policy, where you can automatically qualify for a Blue Card that allows you to live/work in the EU if you make over a certain amount of money. For so-called \"MINT\" jobs (Mathematik, Informatik, Naturwissenschaften und Technik -- basically equivalent to STEM in the US), this salary cutoff will be lower, making it easier for you to live there. \n\nBasically, I don't know about the rest of the EU, but it will soon be a lot easier to immigrate to Germany if you're in a technical career (Math, Information/Computer Science, Science, Technology). I don't know much about accounting (I'm sure it[.] useful) but I think probably your best bet would be to study computer science, engineering, or another applied technical field (by \"applied\" I mean that it[.] a program geared towards practical uses of your knowledge -- not necessarily theoretical). Germany, for instance, is lacking in citizens in these fields.\n\nAnother way to gain access is to study there. I for instance am hoping to do my MA in Germany. This gets me there on a student visa. You can do your MA/MS there, or do another educational program there that will allow you to get a visa, and then once you're there, look for jobs and get your foot in the door that way.\n\nIt is VERY difficult to get hired for a job if you're not already living there. They will only do that in very special cases where you have skills that are rare there. \n\nMake international friends in college in all the places you want to live in/visit. This will be invaluable to you, so that you will have a free place to stay while you go there, scope out the country, or try to orient yourself and perhaps find a job. \n\nLearn new languages. In the EU it is very common for folks to be bi or trilingual, so not knowing multiple languages may set you behind (thankfully, English is one of the most useful, so you're covered there). \n\nAnyways, I am only learning about this myself, so take my advice with a grain of salt. However, these are my opinions. If I could go back in time, I'd definitely make sure I took a minor or second major in something more technical (instead I did a double major_in_the_humanities. d'oh!). I think that would make my life a lot easier now. Luckily, my grades are really good so hopefully getting into an MA program won't be too hard.\n\nLastly, check if you have any relatives that were Italian citizens. Italian citizenship goes by blood, so if one of your ancestors (within a certain number of generations) was an Italian citizen, you can automatically get Italian (and EU) citizenship. Google it for more info. I think Italy is the only EU country that does it that way (for the others, it pretty much has to be one of your parents that is a citizen or else no luck). \n\ntl;dr - Develop marketable technical skills, (maybe) study there, make international friends to help you, learn a 2nd or 3rd language. Language is important but focus mostly on becoming really great in your field -- they will want to hire you for your unique skills, and not your language abilities (though those are good too). So like other people here said, don't just choose something that you think will get you into the EU if you're going to hate it. Ideally, find the most marketable skill that you can be passionate about and good at, and choose that."}