{"doc_id": "1541", "name": "2012_01_humanities_student_major_460_videos", "namespace": "we1sv2.0", "metapath": "", "pub": "videos", "title": "2012-01-humanities-student-major_460_videos.txt", "pub_date": "2012-01-12T00:00:00Z", "Sentiment": "0.105", "Subjectivity": "0.356", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "592", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3ghpry", "Reddit_id": "c3gile9", "Subreddit_id": "t5_2qh1e", "Commenter": "[deleted]", "length": "3590", "content_scrubbed": "I wholeheartedly agree.  I think I'd agree with you and Tyson that the English major should be scientifically literate, though not an expert.\n\nI'm a science educator.  I left a chemical engineering program, and got a BS in chemistry with a teaching certificate.  I taught high school science for a while and did some grad work in chemistry.  That said, I have tremendous respect and admiration for NGT.  However, I have a fundamental problem with the notion that the point of an education is to serve the economy, to get a job of the future, etc.  A couple years back, I read a fantastic article by Mark Slouka in *Harper[.]*, [Dehumanized:  When math and science rule the school](http://harpers. org/archive/2009/09/0082640).  Fair warning:  it[.] long for the typical internet attention span.  Below are some excerpts I found particularly relevant, and moving.\n\nBy downsizing what is most dangerous (and most essential) about our education, namely the deep civic function of the arts and the humanities, we're well on the way to producing a nation of employees, not citizens. Thus is the world made safe for commerce, but not safe.\n\nWhen is the boss ever going to ask my Johnny about the Peloponnesian War? As if Johnny had agreed to have no existence outside his cubicle of choice. As if he wasn't going to inherit the holy right of gun ownership and the power of the vote.\n\nFrom the local PTA meeting to the latest Presidential Commission on Education, the only subject under discussion, the only real criterion for investment—in short, the alpha and omega of educational policy—is jobs.\n\nCould there exist, buried under our assumptions, another system of value? Could our colleges and universities have another, truly \"critical role,\" which they ignore at our peril? A role that might \"serve the nation\" as well?\n\nThe humanities, in short, are a superb delivery mechanism for what we might call democratic values. There is no better that I am aware of.\n\nWhy is every Crisis in American Education cast as an economic threat and never a civic one? In part, because we don't have the language for it. Our focus is on the usual economic indicators.\n\nWhy would a repressive regime support a force superbly designed to resist it? Rein in the humanities effectively enough—whether through active repression, fiscal starvation, or linguistic marginalization—and you create a space, an opportunity. Dogma adores a vacuum.\n\nIt troubles me because there are many things \"math and science\" do well, and some they don't. And one of the things they don't do well is democracy.\n\nThat no one has ever been sent to prison for espousing the wrong value for the Hubble constant is precisely to the point.\n\nIf the value you're espousing is one that could never get anyone, anywhere, sent to prison, then strictly democratically speaking you're useless.\n\nChallenged to defend the utility of his classes, Eure [an English teacher] asks his questioner to describe an American life in which the skills he is trying to inculcate are unnecessary. Invariably, he says, it becomes obvious that there is no such life, that every aspect of life—every marriage, every job, every parent-teacher meeting—hinges in some way on the ability to understand and empathize with others, to challenge one[.] beliefs, to strive for reason and clarity.\n\nIn short, while I agree with NGT that scientific literacy is important for all citizens, I also agree with Slouka that an undue emphasis on math and science, as illustrated by disparities in funding of the sciences vs. humanities, undermines democracy, and our roles as citizens."}