{"doc_id": "1524", "name": "2012_01_humanities_student_major_265_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-01-humanities-student-major_265_AskReddit.txt", "pub_date": "2012-01-07T00:00:00Z", "Sentiment": "0.172", "Subjectivity": "0.389", "Score": "25", "Upvotes": "25", "Downvotes": "0", "Wordcount": "297", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_o71fv", "Reddit_id": "c3ewvyx", "Subreddit_id": "t5_2qh1i", "Commenter": "notreallynothanks", "length": "1717", "content_scrubbed": "Two things I learned during university that would have made my life easier if I had known them when I started:\n\n1. Build good relationships with your professors, TAs, and any work-term or thesis supervisors. This will be immensely useful for job networking, references, and general guidance and support.\n\n2. Go to university with the intention of learning. This was a huge lesson for me. I was an overachiever in high school but mainly because I knew how to jump through the hoops and I followed instructions (i. e. I handed everything in on time). In my 2nd or 3rd year of university, I learned that the readings and assignments were secondary to going to class and really *listening*. Once I started to care more about understanding concepts and their applications, the rest came so much easier. I would go to class and only write down the most basic/essential notes, and absorb the rest through really paying attention. Assignments became much easier because I actually understood what the fuck I was doing/talking about, and everything seemed much more related - it didn't seem that I was doing a bunch of random, irrelevant assignments. (I was a Humanities major, so your mileage may vary, but hopefully you see what I mean.)\n\nThe assignments are important, but going to class with the intention of understanding rather than \"what do I need to write down to pass next week[.] test?\" is HUGE. (This sort of goes along with going to school to learn, expand your mind, and grow as a person, rather than going because that piece of paper will get you a job... because as we're all learning, that piece of paper doesn't guarantee you anything, so you'd better be sure you get something out of the experience.)\n\nEnjoy :)"}