{"doc_id": "779", "name": "2012_10_humanities_student_major_1159_harveymudd", "namespace": "we1sv2.0", "metapath": "", "pub": "harveymudd", "title": "2012-10-humanities-student-major_1159_harveymudd.txt", "pub_date": "2012-10-23T00:00:00Z", "Sentiment": "0.247", "Subjectivity": "0.418", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "280", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11xhbq", "Reddit_id": "c6qfxd2", "Subreddit_id": "t5_2spc6", "Commenter": "fireflycities", "length": "1594", "content_scrubbed": "I definitely didn't think of myself as \"brilliant.\" I applied with a 36 ACT, 2200+ SAT, 780+ SAT II Math, and I think ~4. 4 GPA (my HS inflated grades, so don't compare it to yours, I was like 8th in my class). I also had lots of volunteer work/odd arrangement of awards (one for programming, one for academic, one for writing). \n\nYou can't really \"expect\" any decision at Mudd by thinking about your scores--they admit such a small number of people that they basically go through applications one by one and think about them all and how they would fit in with the community and the people they're already planning to accept. I always got a strong sense that some of the other students around me were way smarter, because there[.] always a good number of just absolute geniuses who are way above me.\n\nIf you're asking because you're interested (if so, yay :D) then what[.] important is kind of having the \"full package\" rather than stats. Your numbers should be good enough to reflect that you're good at what you do, and your application should show you have a interests besides an obsession with a narrow field of study, since Mudd is so focused on having a sense of the other sciences and humanities. Also, there[.] so much student-faculty interaction that how you work with teachers is a *huge* factor in their decision, so having recommendations from teachers who know you well and really like you is indispensable.\n\n\nAlso, (not that I was creeping....) my parents used to teach at SCU and man, that is a ridiculously gorgeous campus. I don't know much about them as a school/community though."}