{"doc_id": "1593", "name": "2012_01_humanities_student_major_939_burlington", "namespace": "we1sv2.0", "metapath": "", "pub": "burlington", "title": "2012-01-humanities-student-major_939_burlington.txt", "pub_date": "2012-01-25T00:00:00Z", "Sentiment": "0.047", "Subjectivity": "0.252", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1042", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ow6zc", "Reddit_id": "c3kpiov", "Subreddit_id": "t5_2ri40", "Commenter": "smacksaw", "length": "5866", "content_scrubbed": "I may have some insight, as I still have a residence in WA and lived in Lynnhood, Capitol Hill and Totem Lake. I know the area and society rather well. I also have residences in Rouses Point, NY and Montreal, QC. I'll see if I can comment from your perspective.\n\nWhat is it like for the average person who isn't a college student and isn't rich?\n\nBurlington and Chittenden county are sort of the \"overgrown town\" thing you're talking about, but for the most part that area is relatively *more* expensive than the rest of VT, but on par with what you'd experience living in less desirable areas of the greater Seattle metro area. Think Marysville or Everett, but not shitty like either place.\n\nand it[.] progressive stances (two things we both really miss about the NW)\n\nThis, I think, is by far the biggest misconception about Vermonters. It[.] like saying \"Seattle rains all the time.\" Vermonters aren't progressive as a whole, but some are. In the NEK, people are very conservative. The difference is that Vermonters are friendly, moderate and prone to compromise. Where you have Olympia, Gregoire, Rossi, do-nothing gov'ts and crappy congressional representatives, in Vermont you have people who have a civic education. Having lived and been all over the USA, I would have to characterise Washington State as possibly having the most ignorant people in regards to politics. Case in point: they keep electing do-nothing Democrats who suck and crooks like Rossi are allowed to run.\n\nGoing back to Vermonters: because they are genuinely nice, friendly and in a good mood, they consist of people who can talk. Vermonters will compromise and are pragmatic. Anything you deem as \"progressive\" was a common-sense consensus based upon the reality of the situation. It[.] not to say Vermont doesn't have some messed-up things, like how local taxes fund education or you have to jump through endless hoops to open a Target store, but it[.] an example in two extremes. \n\nA place like Williston is the obvious choice for a Target and it would serve everyone, but no one has a say in how Williston does it, so people can't have a Target until Williston does it. Or you can live in an expensive area and pay assloads of school taxes and have it go to someone who pays almost nothing in taxes. Schools in VT are not great. There[.] a perverse disincentive to make an area nicer and have nicer schools when the local community doesn't have to improve to grow their tax base and they still get as much money as the wealthiest area.\n\nAll that said, is it really that expensive?\n\nThe problem is that inflation for cost of living has outpaced wages. If you were here a few years ago and locked-in to an affordable house, you can afford to make $30k/yr. Vermont has property taxes that are unlike anything you can imagine in WA. I had a $200k house in Birch Bay and paid $900/yr in property taxes and no state income tax. In VT, that same house would probably be triple to quadruple in property taxes, plus about 5% in state income tax. Thus, your $1000/mo mortgage in WA with $100/mo in property tax for $1100 becomes a $1000/mo mortgage and $300 in property taxes. It[.] how they do things here. In Rouses Point, where I have a house, many people pay higher property taxes than mortgage payments. We're at the point where the village should just buy all of the houses and rent them to us!\n\nThen you figure in your new income taxes, which you don't pay in WA and you'll see that for the same prices, you have less money off the bat, plus you're probably earning much less than you did in Seattle. Another thing - expect to pay more for internet, assuming you can even get it. Vermont is the least-wired state in the union.\n\nDoes the small size feel suffocating at times?\n\nWhat[.] sort of odd is Lake Champlain and the mountains which funnel everyone into a fairly narrow corridor. But you're 90 minutes from Montreal, the most international, progressive and European city in North_America. You're 6 hours from Boston, 6 hours from NYC...\n\nFrom a more \"micro\" perspective, much of VT has strict lot size zoning laws, so unless you live in-town, your neighbour is nowhere near you (which is why no one has internet, either - no denisity). So... suffocating? Different.\n\nDo you talk about all the snow just to deter people from moving there and ruining a good thing?\n\nThe snow is a plus. I think the reality of the situation prevents people from moving here. As I've said: can you afford to take a pay cut, have your costs go up and still survive? Vermonters are welcoming. Come if you can handle it. People love the snow. It[.] not like Seattle where people say \"We like the rain and you may not; we understand why.\" It[.] more like \"Come experience Vermont! We have snow! What, that[.] a bad thing? You silly flatlanders!\"\n\nPeople can't ruin Vermont because Vermont is a state of rules. It[.] a slow pace of life and actually quite conservative in that sense. Which is why I chuckled at your \"progressive\" quip. The last time Vermont flirted with being too progressive, the whole \"Take Back Vermont\" thing popped up. Which flatlanding leafers (mis)understood as a plea to buy maple syrup on the way back to Jersey.\n\nAnd what about the scene- does it dry up in the winter? We're both involved in the arts, so there[.] also a concern that there won't be enough work.\n\nWeather doesn't stop Vermonters any more than the rain prevents Seattlites from wearing sandals in December, which is to say, not at all.\n\nWould it be worth it to come and see what[.] good for ourselves in the hopes of finding our next home?\n\nI think you should contact a Realtor and MAKE SURE THEY LIST PROPERTY TAXES in the sheets they send you. Don't do it backwards. Figure out the budget for yourself and then decide if it[.] worth coming. There[.] no point in deciding you like it and then realising that you can't make it work."}