{"doc_id": "739", "name": "2012_10_humanities_student_major_632_ubc", "namespace": "we1sv2.0", "metapath": "", "pub": "UBC", "title": "2012-10-humanities-student-major_632_UBC.txt", "pub_date": "2012-10-15T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.338", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "488", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11i0lb", "Reddit_id": "c6moety", "Subreddit_id": "t5_2qy2j", "Commenter": "cheapmondaay", "length": "2712", "content_scrubbed": "I just transferred over from Cap, but into 3rd year! I transferred in with a ~3. 4 GPA, though this was from my last 45 credits that they looked at? All 60 of my credits did transfer over though. \nYou'll also have to fill out a \"personal profile\" that UBC introduced for a lot of programs this past year (including Arts) - it basically requires you to sum up some volunteer work, achievements, extra-curricular activities, etc. It gives UBC a broader picture of you as an applicant rather than just basing applications solely on grades - though grades are still (obviously) very important.\n\nOne thing I will say though - and this is my personal view - people really underestimate smaller schools like Capilano. The majority of my professors and courses at Cap were excellent and I feel like I got so much out of them - probably because of the small class sizes and the fact that I actually got to know the professors pretty well. I'd say that the teaching level of the professors at Cap is on par with the professors at UBC, if not higher at times - and I'm basing this on comparing 1st and 2nd year courses at both schools. \n\nMeeting people/making friends at Capilano was also a lot easier than at UBC, again probably due to the intimacy of the campus/classes and I feel like there was less [.]egregation' at Cap compared to UBC (where people seem to be a little cliquier most likely due to sticking together within faculties, frats/sororities, clubs, housing, etc). The age range of students seems a little bit more mature at Capilano as well; friends and acquaintances were always older by a few years, but UBC seems to be full of younger people, especially straight out of high school, which I don't really have much in common with. I have met a handful of great people at UBC as well though - I really recommend you join clubs, where you'll definitely meet many people. Join clubs that you know you'll be involved in, and even though you'd be in 2nd year, look at clubs that relate to the major you're potentially looking into.\nAnd when you transfer over here, you'll be able to participate in Imagine Day, which is basically a day for new students to check the campus out, participate in events, a pep rally, etc. where you'd probably meet a few people as well - and there[.] also a bunch of concerts/parties/etc. that go on for new students as well. \n\nI never took French 12, only did it until grade 11. I ended up taking German at Capilano for a year (2 courses) and another 2 at UBC to fulfill my requirement for the Arts language. There are so many awesome language courses at UBC, and if you're already acquainted with a 2nd language, you can take a language proficiency test to fulfill the requirement. "}