{"doc_id": "1532", "name": "2012_01_humanities_student_major_373_artcrit", "namespace": "we1sv2.0", "metapath": "", "pub": "ArtCrit", "title": "2012-01-humanities-student-major_373_ArtCrit.txt", "pub_date": "2012-01-10T00:00:00Z", "Sentiment": "0.199", "Subjectivity": "0.523", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "518", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ob4as", "Reddit_id": "c3fu8uk", "Subreddit_id": "t5_2qoaq", "Commenter": "[deleted]", "length": "2678", "content_scrubbed": "Sorry to say, you can't show us a painting and expect that we'll be able to say it passes whatever standard of a good painting. You've showed us that you can paint quite realistically, but aside from that I don't know what to say. \n\nI would say your ability to paint realistically is irrelevant. Do you have a lot of good ideas? Do you experiment? Are you driven to create more and more, even if at times you feel extremely discouraged like any person would in that field?\n\n'Can you make it as an artist' is too broad of a question. Is your goal to live exclusively off your paintings? Is your goal to have a decent job (teacher, for example, or any other job under the sun) while making yourself as an artist on the side? What would you be happy with?\n\nI think you may be able to make it as an artist, but that has to do with you. There is no thing you have to be able to paint to be an artist that has 'made it'-- to be an artist is to make art, and that can come with a whole lot of things.\n\n**edit: I'm sorry**, I just realized my tone is really bitchy and negative! By saying this example of your work is irrelevant I wasn't trying to say that all you've achieved up to now or your impressive realism ability is irrelevant, or that your works are irrelevant-- it[.] just that that is too small an amount of information to make a judgment about this topic about. By default I have confidence in you and others as artists to 'make it', because I think someone with a desire to create and live can make it as long as they are practical and flexible about it. I don't like how discouraging people can be to artists (ex: 'It[.] hard to make a living that way,' 'barely anyone ever makes it,' 'it[.] hard to find a job in the arts'), because there are *so many different ways* to be an artist and have a good life and career, even if it[.] hard-- the fact that it[.] difficult to make a living out of it, at least in a purist form, is a *given*, because art is so personal and doesn't necessarily have market value. Whether you're one of the lucky few who can make a living off just studio work or not doesn't really matter at this point, in my opinion, because there are a ton of ways to be successful in the arts, and there are even more ways to be an artist. This may sound tired, but teaching is always a possibility. I know a lot of really good writers who teach English or artists who teach art classes who still have shows/performances on the side and display their work in galleries and whatnot, while also touching the lives of students. It[.] a great option, and even if you don't want to be a teacher, teaching is but one example of what people can do. I wish you good luck."}