{"doc_id": "1534", "name": "2012_01_humanities_student_major_383_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2012-01-humanities-student-major_383_politics.txt", "pub_date": "2012-01-10T00:00:00Z", "Sentiment": "-0.037", "Subjectivity": "0.408", "Score": "32", "Upvotes": "32", "Downvotes": "0", "Wordcount": "347", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3fuoz5", "Reddit_id": "c3fvi1k", "Subreddit_id": "t5_2cneq", "Commenter": "RockyAnderson2012", "length": "2200", "content_scrubbed": "We need to invest in our people and our future -- job opportunities, training, research and development, improved immigration laws to attract and retain talented, hard-working people from other nations, education (I have advocated for enriched pre-school opportunities for every child and free higher education (perhaps with a community service component included)), support for the arts, family planning, universal health care (and a much less expensive system, with better outcomes, as in every other nation in the industrialized world), a vastly improved infrastructure, child care, and transit opportunities.   Those investments pay off in helping to restore our nation[.] competitive edge in relation to other nations, their employees, and their students.  I also believe in creating a more equal playing field for employers and working people so that U_S corporations are not exporting jobs to the detriment of our nation and its people.  Priming the pump with government investments is crucial during a recession.  The real damage was done during the Bush administration, when we were engaged in horrendously expensive (and humanly tragic) wars and, at the same time, enormous tax breaks were given to the wealthy.  (It is the first time in our nation[.] history that we were engaged in wars and, at the same time, taxes were reduced.  Insanely irresponsible.)  Driving up the accumulated debt has been the objective of government haters like Grover Norquist, who has been preaching \"Starve the beast\" for years.  He knows, as we are seeing now, that social programs will be the first ones to go once our debt has skyrocketed.  A true fiscal conservative would make certain that there are sufficient revenues by increasing taxes -- and that we cut out the waste in the federal budget, particularly in the military budget.  Next time your representative in Congress talks about being a \"fiscal conservative,\" -- or next time he/she complains about the federal debt -- ask if he/she continued to support F-22 funding (a boondoggle that continued primarily because there were contractors or sub-contractors in 44 states and members of Congress simply wanted to take the federal bacon back home).  "}