{"doc_id": "698", "name": "2012_10_humanities_student_major_165_pics", "namespace": "we1sv2.0", "metapath": "", "pub": "pics", "title": "2012-10-humanities-student-major_165_pics.txt", "pub_date": "2012-10-04T00:00:00Z", "Sentiment": "0.053", "Subjectivity": "0.465", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "292", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_10xo7l", "Reddit_id": "c6hkqm5", "Subreddit_id": "t5_2qh0u", "Commenter": "[deleted]", "length": "1652", "content_scrubbed": "I'm a university brat currently in college, so I've seen both sides of the issue.\n\nProfessors need to maintain deadlines so that actual work gets done.  Otherwise students will breeze through just on the work they did at the beginning of term.\n\nThat being said, \"delay your graduation\" is not always possible.  When most professors went to college, they could take as long as they wanted to graduate.  They could add majors as they pleased.  Today, the system wants to churn students out as quickly as possible, and sometimes they'll kick you out rather than let you stay.  Case in point: I got really, really sick with various lung infections one term.  I ended up having to miss two exams, and the syllabus would only let me miss one.  My absences were documented with the health center.  I went to the professor to try to ask if I could make up one of the exams, but his reply was that I should just drop the class and take it again.  I went to the department advisor, who told me if I dropped the class I'd have to drop the major or drop out of college entirely.\n\nThis is why I'm graduating with a liberal_arts major instead of a high-demand STEM major.\n\nEdit: Many modern institutions, including mine, have what are called *critical tracking courses*.  These courses must be completed by a certain semester or else you're ineligible for the major.  This is in theory to try to keep people in their seventh semester from taking Bio 1 to try to start a biology major.  Nowadays, if you have to drop a critical tracking course, particularly one that isn't offered every semester, you're screwed.  This particular class was offered every other spring."}