{"doc_id": "778", "name": "2012_10_humanities_student_major_1158_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2012-10-humanities-student-major_1158_Economics.txt", "pub_date": "2012-10-23T00:00:00Z", "Sentiment": "0.085", "Subjectivity": "0.388", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "605", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6qawq3", "Reddit_id": "c6qfrna", "Subreddit_id": "t5_2qh1s", "Commenter": "follyoftruth", "length": "3562", "content_scrubbed": "\"it[.] doubtful that an education in classical philosophy or medieval lit has positive externalities.\"\n\nPositive externalities: benefit that is not transmitted through prices\n\nI would argue quite the opposite in fact. I hear this quick argument thrown around quite a lot, in which liberal_arts style majors and other similar intellectual endeavors are seen as essentially useless (hence your implication they are negative externalities) but I would venture to say that much of what is wrong with the current situation is because of a skewed view of what constitutes a positive externality in the first place. \n\nIt really isn't hard at all to imagine quite a few benefits resulting from such an education. I won't go into them all now, but for you to so quickly dismiss them as being nonexistent tells me you are likely to have that skewed view. If I guess correctly, it[.] probably because you are basing the majority of your value projections on money/prices... which defies the definition of positive externalities in the first place.\n\nIt[.] easy to say that we need more core science majors, but I think too many people have come to view that as some sort of magical cure-all. Of course we need more people well versed in the core sciences, but the problem is that lots of people seem to imagine there are all kinds of jobs just waiting for them. This is false. Positions for PHD[.] are shrinking, and the pool is growing, so competition is getting fierce, and many higher level science majors are just as broke and unemployed as liberal_arts majors. It[.] easy to imagine the liberal_arts student graduating and then sitting at home complaining they can't get a job, because it[.] a stereotype that most of us intuitively can understand. It[.] much harder to realize it[.] happening to majors across the board (with a few exceptions), not because their educational investment was shitty, but because the economy itself is shitty. \n\nI'm not even addressing the issues of the article, even though I think it falls to the same miscalculations of cost/benefit. \n\nIf you disagree, I ask you answer a question for me.\n\nWhat do you really think would happen if suddenly there was a huge shift in people formerly seeking liberal_arts majors towards the core sciences (or whatever area you find the most compelling \"investment\")?\n\nI propose there would simply be a massive unemployment spike in that sector, and not much else would change, at least until the economy in general does. But what do I know, I barely took basic economics courses and am just a lurker around here, my main interests are international politics and technology, so I could be way off the mark. I may also be biased because my best friend studied both philosophy and medieval lit at Cambridge... (gainfully employed as an editor)\n\nDon't even get me started on the artificial inflation of tuition prices... especially when competing with the internet. Personally I think with current technology there is no reason everyone shouldn't have at least the equivalent education of an undergraduate degree, even if they don't have the degree itself. I'd rather have a population of unemployed liberal_arts majors forced to work menial jobs than a population of GED serfs stuck with a low ceiling. (wording on that is a bit off, but I think you understand my meaning)\n\ntl;dr - a skewed view of cost/benefits is what got our economy into the state it is in today, and education as a whole, across almost all majors, has huge positive externalities (aka non-price based benefits) that too many people fail to see."}