{"doc_id": "737", "name": "2012_10_humanities_student_major_602_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2012-10-humanities-student-major_602_AskHistorians.txt", "pub_date": "2012-10-13T00:00:00Z", "Sentiment": "0.278", "Subjectivity": "0.41", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "304", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6m6e40", "Reddit_id": "c6m6me1", "Subreddit_id": "t5_2ssp3", "Commenter": "snackburros", "length": "1734", "content_scrubbed": "Ha, to be honest my interest in the area came from a lot of research on the Chinese labor movement that started roughly in the same time. I actually think the era is well represented in some ways - literature, for example, and the arts. I'm sure a lot of people have seen a John Singer Sargent and read a Mark Twain novel, but probably didn't give the era from which the works are derived from a second thought.\n\nI think a lot of people balked at studying the Gilded Age mostly because it[.] an era marked by economic polarity and inequalities, an ineffective executive branch with lots of corruption, reconstruction ruining the south, and the Long Depression in the 1870s. Our school textbooks tend to teach the really unfun stuff and scare a lot of students away, but I think it[.] truly an era with a lot of intellectual output and a lot of cool things. This is when baseball gets professional, for example. This is when a lot of Americans moved to Paris to create art and some great artists like James McNeil Whistler made their names. This was an age when the first American heiresses married English lords and created the whole Downton Abbey backstory but really also gave a lot more credibility to families like the Vanderbilts and money to the Churchills/Earldom Spencer/Dukedom of Marlborough. Hell, even the Garfield assassination I thought was a pretty cool historical event (and the McKinley one as well). For the layman you can always read something like Sarah Vowell[.] Assassination Vacation for a more humorous read into the assassinations.\n\nBut yeah, I'm just under the impression that the way the era is taught in our schools scare most people off. I certainly wasn't impressed in high school, and I did well on my APs!"}