{"doc_id": "771", "name": "2012_10_humanities_student_major_1068_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2012-10-humanities-student-major_1068_funny.txt", "pub_date": "2012-10-21T00:00:00Z", "Sentiment": "0.157", "Subjectivity": "0.368", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "277", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6pvgbg", "Reddit_id": "c6pytxy", "Subreddit_id": "t5_2qh33", "Commenter": "[deleted]", "length": "1479", "content_scrubbed": "My elementary school teacher was probably one of the biggest influences in my life. Mrs. Johnson was probably the person in elementary school that I felt closest to out of anyone. She recognized in me that I had a talent from a young age, and she offered me opportunities for special choirs, she helped me get songs ready to audition for theatre shows... she even re-wrote the 5th grade christmas program so that it was a play, and then she wrote me as the lead.\n\nThen, as I got older, I got more and more involved in the arts. I auditioned for so many community theatre shows, I took music lessons, I learned how to write plays and books and stories.  Then, in high school, I was the presidents of 2 theatre student organizations. Hell, the mayor of the town appointed me as one of the city commissioners for allocating tax money for public arts.\n\nToday, because of Mrs. Johnson, I am working my way through a college theatre program. I really don't know where I would be without her as an elementary school student.\n\nShe passed away a couple months ago. I live way out of state, so I didn't find out until my mom told me that it was in the newspapers. It[.] a weird thing to say, but I always wanted to be able to go back to my elementary school and tell her how much I appreciated everything she did for me. I just tell myself that she knew from the beginning, and that[.] why she put so much extra effort into teaching me music and theatre.\n\nDamn, guess who[.] feeling glum now."}