{"doc_id": "790", "name": "2012_10_humanities_student_major_1296_assistance", "namespace": "we1sv2.0", "metapath": "", "pub": "Assistance", "title": "2012-10-humanities-student-major_1296_Assistance.txt", "pub_date": "2012-10-25T00:00:00Z", "Sentiment": "0.073", "Subjectivity": "0.297", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "544", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_123q04", "Reddit_id": "c6rwn9r", "Subreddit_id": "t5_2s25d", "Commenter": "existentialhero", "length": "3362", "content_scrubbed": " What are undergraduate and postgraduate programs, all of the different rankings of degrees\n\n\"Undergraduate\" traditionally means a Bachelor[.] degree (BS or BA), which takes (approximately) four years and requires a high-school diploma to start, It also can refer to Associate[.] degrees (AA), which take two years and cover significantly less material. It[.] fairly common for someone to go to a two-year community college to start, get an AA, and then enroll in a four-year school to finish up the bachelor[.] degree using credit from the associate[.] program, either to save money (community colleges are much cheaper) or because they had trouble getting into their four-year college of choice.\n\nIn an undergraduate program, you generally choose a \"major\", which indicates your planned area of study and determines what courses you'll need to take. It[.] usually not necessary to declare before you start; at the school where I teach, for example, you're expected to declare at the end of your second year of classes. You may also choose a \"minor\", which is a second area of concentration with weaker requirements. Generally, you can minor in anything you can major in, and there may be additional minors available as well. It[.] also usually possible to elect two majors. Since you're interested in forensic psychology, it[.] likely that your declared major would be Psychology, although it[.] possible that some schools would offer Forensic Psychology specifically.\n\nMaster[.] degrees take one to three years and come after Bachelors degrees. There are lots of different kinds: Master[.] of Arts (MA) and Master[.] of Science (MS) degrees are basically just more of the same thing as a Bachelor[.], but there[.] also lots of more specialized programs like MBA (business degree), MPH (public health), MPA (public administration), MFA (fine arts), and so on. A Master[.] degree is generally still based on coursework, but it[.] more advanced and specialized than a Bachelor[.].\n\nDoctoral degrees come in two distinct varieties: professional and academic.\n\n* A professional doctorate, like a JD (law), an MD (medicine), or a DD (dentistry) is earned by completing several years of advanced, specialized training in the field. Professional doctors are generally expected to pass a test administered by a relevant professional organization to join the ranks of their field; for example, lawyers have to pass the infamous Bar Exam after completing their JD.\n\n* An academic doctorate (a Ph. D. or sometimes D. Phil.) is basically an academic apprenticeship. The doctoral candidate takes a faculty advisor, who helps the candidate pick a research topic and provides some guidance on the craft of research. The result of three to seven years of work is a dissertation, which can take several forms: in the sciences, it[.] usually a collection of a handful of research articles, while in the humanities it[.] basically a draft of a book. In either case, it[.] supposed to be a substantial, original contribution to research in the field. The dissertation is reviewed by a committee, which decides whether to award the doctorate.\n\nLet me know if there[.] anything else I can help you with. I don't know anything about the psych world specifically, but I'm a math Ph. D. and on the faculty at a liberal_arts college, so I have quite a bit of experience with many corners of the academic world."}