{"doc_id": "672", "name": "2012_02_humanities_student_major_860_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2012-02-humanities-student-major_860_politics.txt", "pub_date": "2012-02-25T00:00:00Z", "Sentiment": "0.144", "Subjectivity": "0.385", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "975", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3v1qnq", "Reddit_id": "c3v43bg", "Subreddit_id": "t5_2cneq", "Commenter": "tsumemakoto", "length": "5720", "content_scrubbed": "To refer to this as a tail wagging the dog argument I've assumed (I know I know) that you either consider the tail to be the governments ability to  subsidize education in a beneficial way for students and the dog to be our ethics or principles behind this aim, or the other way around. This seems to me to be a false dichotomy, either we government-ally subsidize education for people who \"shouldn't be there\" and take those monetary risks, or we face having a student populous which earns a degree not through the quality of their work, but mere persistence and they're left holding the bill for their own education.\n\nAs to your first point I can not speak on the matter, I don't know much about bidding for government contracts.\n\nAs to your second point: \"**sending people to college who shouldn't be there hurts those people and higher education.**\" \n\nI can't tell if this is a strictly elitist attitude towards the aptitude of presumably the people you'd think would use the subsidies (read undesirables/ the poor) or a separately veiled attempt to employ some sense of a caste system in which someone of your obvious clout and experience can judge those who should or should not be allowed to participate in higher education, perhaps a mixture of the two. As someone who has earned a college degree (whether through persistence of effort or quality of work) I would hope that you'd be more attune to the societal pressures of entering post-secondary education. And as you don't state whether or not you ever had the privilege of accepting/denying federal loans we must be left that you paid your own way through college, whether on your own dime, your families, or scholarships which were obtained (again whether through persistence of effort or quality of work.) Who knows. \n\nTo your third point: **\"subsidized higher education has led to record endowments at universities and wonderful for-profit schools there simply to cash in on the easy government money. \"**\n\nI think here you've missed the forest for the trees. While I agree (as a current college student) that higher education institutions have certainly gone up in cost ([by Financial Aid Org[.] statistics between %6-%9 annually](http://www. finaid. org/savings/tuition-inflation. phtml)) I don't believe it is due to your claim that government subsidies of federal loans, but rather as the [CATO institute shows](http://www. downsizinggovernment. org/education/higher-ed-subsidies) market economics of supply and demand. Because there is a larger influx of monies for college students in the market, and the demand for higher education is growing rapidly every year, institutions see a larger demand and raise their tuition rates accordingly. \n\nTo your fourth point: **\"about 3/4 of the people I know with a college degree (and I'll include myself here) didn't earn it through quality of work but through simple persistence.\"** It seems to me that you're using anecdotal evidence here from your personal life experience to measure the entirety of the current educational system. I would hope that you do not assume that just because you are more persistent then some, or even most of the student body, that you are actually of any greater value within the system. Hard work is certainly important, being diligent in your studies is a key factor in success, but being of a persistent nature and of engineering quality work is I think the combination for utmost success. Also, what say you of the last 1/4 of people you mentioned, who simply succeeded due to the quality of their work? Are they all homeless now?\n\nTo your fifth point: **\"almost without exception those same people are working jobs where they never use their educations, but their employers used a requirement for a college degree simply to weed out applicants.\"** \n\nI agree that there are many degree holding adults (in my opinion mostly within the liberal_arts) which may not be in a career field which specifically relies upon their collegial studies, and what of it? It does not denigrate or deteriorate them in any way, nor should it. A degree is a statement of what capabilities a person possesses through persistent work and hopefully an excellent quality of work they produce. Its a shortcut or a litmus test as to their ability to perform, but in no way does it imply that they are only capable of performing tasks suited to the degree which they hold. Employers may view a degree in any way they please, but your jaded take on the worth of a degree I think only speaks to the level of comfort you find in your own career field.\n\nI'd end with your last statement, but to me it screams of an unfulfilled and yearning soul which wishes he could have known then what he knows now. And because of your perceived futility in which most peoples collegial pursuits ended or are continuing, you feel the need to espouse a cautionary tale about obtaining higher education. As if in some way you can show that because there are people in the world who you deem (or are vaguely familiar with) that have not used the degree They earned in the way in which you think should be applied, then the whole system is just a necrotic corpse, a lesson in futility, a ** \"line on a resume.\"** This does not mean the rest of us see it that way. I think your comment here only belies your anger at a system larger than yourself, and I personally think pessimism has no place in this conversation. If nothing else be pragmatic and offer a solution to these problems, and to hopefully dispel any hypocrisy my last statement could raise, I agree with the efforts currently being imposed, I think that if anything we should make the cutoff limit for debt forgiveness at 5 years of civil service as opposed to 10. "}