{"doc_id": "601", "name": "2012_02_humanities_student_major_59_foodforthought", "namespace": "we1sv2.0", "metapath": "", "pub": "Foodforthought", "title": "2012-02-humanities-student-major_59_Foodforthought.txt", "pub_date": "2012-02-02T00:00:00Z", "Sentiment": "0.15", "Subjectivity": "0.395", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "514", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p7auq", "Reddit_id": "c3n5no0", "Subreddit_id": "t5_2rete", "Commenter": "jman42", "length": "2958", "content_scrubbed": "Another engineer from India here. I feel the article attacks a strawman graduate who has closed his mind to everything else and doesn't appreciate anything outside the narrow spectrum of his specialty.\n\nHeaven forbid someone might enjoy reading both Newton[.] laws and Plato[.] dialogues! Plato is clearly a waste of time with no practical, remunerative value. Or is it?\n\nThis seems to be a rather extreme case(even if the author said it for rhetorical purposes). There are a lot of engineers who are well read and have varied interests outside their field(of course I speak from personal experience here - so does the author, or atleast I hope he did, instead of propagating stereotypes). \n\nIn a global world dominated by so-called knowledge workers, the ability to communicate effectively and work well on a team is imperative. But besides raw technical ability, how do you develop the myriad other skills needed to distinguish yourself and excel in your job? How can you learn to inspire people so they want to work towards the sales goals you've set?\n\nIt is a valid point and many folks do neglect the development of soft skills. But many folks improve on them as well in their college. The author seems to think of engineering colleges here in India as an assembly line that churns out graduates. But a good portion of engineering students explore their interests and broaden their horizons in college. Of course, there are a few folks who concentrate solely on their studies to the exclusion of everything else - but that is a minority. \n\nThe ability to synthesize different perspectives into the big picture is far more powerful than narrow expertise in any single field.\n\nThis is another argument that sounds nice but kinda misses the point. Narrow expertise is important when you are a doctor or an engineer with respect to your work. It is your expertise and experience that allows you to to see the big picture with respect to that field. I'm not sure how Plato will help me write a device driver(but that isn't a good enough reason to ignore Plato either).\n\nReal-world problems rarely ever have textbook solutions.\n\nTrue. But textbooks help you to get to the position where you can tackle real world problems. Think of it as a progression.\n\nI agree with the author that a few humanities subject are good for the a graduate as such. But folks who don't do those subjects aren't that hopeless either. No one really stops you from reading what you want, just because you are an engineering graduate in India. How productive will it be to forcefully make the students take subjects they aren't really interested in? If you want to read Plato be my guest(I've read Plato[.] Apology btw, pretty fucking awesome :). But I find scifi and fantasy a better use of my free time. I doubt I'd have liked Plato[.] apology if it was forced on me. Kinda like why I hated poetry in school, but love them now. ) But do not judge someone because they aren't interested."}