{"doc_id": "659", "name": "2012_02_humanities_student_major_663_islam", "namespace": "we1sv2.0", "metapath": "", "pub": "islam", "title": "2012-02-humanities-student-major_663_islam.txt", "pub_date": "2012-02-20T00:00:00Z", "Sentiment": "0.151", "Subjectivity": "0.364", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "414", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3sqh5v", "Reddit_id": "c3t8u11", "Subreddit_id": "t5_2qhbp", "Commenter": "armndnoses", "length": "2210", "content_scrubbed": "Excuses, bruv.\n\nMy mom still gives me heat for it. From day 1 I would tell her, \"Tell such and such to the Prophet [](/pbuh).\" and she would have no retort. She has left it alone for a while now. Instead she grabs my beard  if I get her angry LOL. My older brother still threatens to shave my beard in my sleep. He'll do it, too.\n\nI once read or heard of a hadith somewhere something like someone asking if they should remind/recommend/say to such and such though they do not do it themselves. And the response was why rob yourself of both good deeds/things? It was/is tolerance week/month at my little bro[.] high school, they do this practice of going to 1 of 4 corners based on how strongly they agree or disagree on moral questions for one of their humanities classes. One of the questions was if someone was getting bullied the students should just ignore it and mind their own business. Now, he just saw this happen the other day, not only did people not ignore it, they crowded around the person getting beaten, some even jumped in, noone did anything to stop it and people just circled around to watch. So given he knows what people DID do and probably would do again he just went with 1 other girl to the agree corner as to avoid being a hypocrite. *Everyone*, whether being hypocritical or not, went to the [strongly] disagree corner.\n\nHow many of the Sahaba accused their ownselves of nifaq? And since when did they allow that to disobey their Creator by obeying His creation? \n\nMan up and stop shaving your beard off. If you're trimming that[.] one thing, most people I know do this (it[.] the opinion they subscribe to, or for health reasons, or Allaahu 'Alim). But if you're young, healthy, and uh.. hairy... just let it grow. Be warned though that thing is WILD. You have to tame it! Takes work!\n\nOne of the first comments I got from women as I grew it out was, \":( [...] You look less handsome!\" It didn't phase me at all lol. That[.] why I remember it, because it didn't deter me in the least from keeping and growing the beard. That[.] not why I was doing it to begin with! And if it did affect me like that, time to reset my intention, and, well, just let it keep doing its thing as God wills lol"}