{"doc_id": "770", "name": "2012_10_humanities_student_major_1055_subredditdrama", "namespace": "we1sv2.0", "metapath": "", "pub": "SubredditDrama", "title": "2012-10-humanities-student-major_1055_SubredditDrama.txt", "pub_date": "2012-10-21T00:00:00Z", "Sentiment": "0.088", "Subjectivity": "0.33", "Score": "20", "Upvotes": "20", "Downvotes": "0", "Wordcount": "276", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6pvz72", "Reddit_id": "c6pxlgf", "Subreddit_id": "t5_2ss5b", "Commenter": "theoreticallyme76", "length": "1663", "content_scrubbed": "the point, though, is that without engineers and scientists, we wouldn't have an organized society for the liberal_arts to exist. the liberal_arts enhance our culture and self-understanding, but science and engineering are more or less a requirement for any sort of advanced society.\n\nLet[.] walk through this a little bit. Imagine a world in which all of the engineers and scientists disappeared tomorrow. We'd certainly put the brakes on forward progress but cars and computers and everything we have today would still work. However, over time those things would break and with no one to repair them we'd eventually fall into a pre-industrial lifestyle. Still an organized and relatively advanced society but nothing like today.\n\nNow imagine a world where all the artists and creative people disappeared. We'd certainly continue to exist but again, without a spark of creativity our forward progress would slow. After all, where would a lot of modern technology be without inspirations like science fiction to show what the future might look like. However, we'd still continue to live, albiet in a grayer and less interesting world.\n\nHere[.] the kicker. If you want the world to go to shit real fast you don't make the scientists/engineers or the artists disappear. Imagine a world where all of the truck drivers disappeared. Or all the people who pick up the trash. Major cities would starve within weeks.\n\nThe lesson isn't \"drop out of college and learn to drive a truck\" it[.] \"we live in a complicated and highly connected society where we should learn how to appreciate what each other has to offer instead of acting like arrogant shit-heads trying to 'win'\"."}