{"doc_id": "1522", "name": "2012_01_humanities_student_major_225_wtf", "namespace": "we1sv2.0", "metapath": "", "pub": "WTF", "title": "2012-01-humanities-student-major_225_WTF.txt", "pub_date": "2012-01-06T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.422", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "986", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3eppod", "Reddit_id": "c3eqbwf", "Subreddit_id": "t5_2qh61", "Commenter": "Thraxamer", "length": "6051", "content_scrubbed": "I don't think there[.] a one-size-fits-all approach to education, but for a nation[.] educational initiative to work at a societal level I do think some compromises must be made so that you can say some things with certainty... like \"we have a 95% literacy rate,\" or \"our national math scores are below the average for other, similarly industrialized nations.\" We've made a collective decision on several levels regarding which metrics are valuable to us. Maybe those assumptions are wrong, but that[.] a discussion for another thread as it speaks to what we value as a culture.\n\n\"Throwing money\" is a glib statement, as that implies a certain degree of mindlessness. The sad and frustrating thing about NCLB is that it was far from mindless. On the contrary, it was built with great deliberation and was engineered to work *within* the existing infrastructure as much as possible. \n\nYour source (the Manhattan Institute for Policy Research) isn't exactly [unbiased](http://en. wikipedia. org/wiki/Manhattan_Institute_for_Policy_Research). Anyhow, I don't think policies like NCLB are appropriate solutions because they don't address some very real issues, such as student-teacher ratios and resources for arts, humanities, and sciences. You are correct, in that we have some very real issues that need to be addressed nationally in the US. Any repairs to a system or any fundamental overhaul of the infrastructure will have significant costs, both of time and money. I don't believe that most people -- and, thus, most leaders -- are prepared to invest the time, effort, and money it will take to get us there, though. (I say that because we find it difficult to find funding for other real, physical aspects of [our crumbling infrastructure](http://www. thedailybeast. com/articles/2011/09/09/major-power-outage-shows-weakness-of-aging-electric-infrastructure. html).)\n\nWhat you propose as new models aren't, in and of themselves, particularly \"new.\" KA provides short lectures and a few exercises (all following a traditional, stepped educational format), but after going through all of the comp. sci. videos, I'm not going to make the mistake of presuming I understand computer science. As KA grows, it *might* eventually provide something more fundamental than supplemental, in terms of education.\n\nMIT[.] OCW is another great supplemental initiative, but simply getting some video lectures and a few . pdf files is not the same as participating in a class and any associated labs (or studio/performance sessions, if the class happens to be arts-centric). I *will* be interested in seeing where MITx goes, especially in regards to how the school will handle certification. Maybe that will be a game changer. I certainly hope so.\n\nCharter schools aren't a silver bullet, either. While some teaching paradigms, like Montessori or Waldorf, can be more freely explored in those schools that don't have to follow all of the state[.] rules, they're still accountable for their results to the state (outcome-based). If outcomes slip... well, you can figure out how the rest might go.\n\nLet me get back to your point again. You claim the system is broken. I state that, simply because *any* system can't provide a universal solution, the system itself isn't broken. A system can have issues without being a broken system. If the system were non-functioning (which is what I understand when you say \"broken\"), then people wouldn't be able to graduate, receive certifications, and find work... which they *can* still do.\n\nMaybe a traditional school system isn't the best environment for Wombo Jr., but it[.] not as if other outcomes aren't presently available (homeschooling, charter schools, online education). But even these methods must fall under a system of accreditation. Even these methods require certain outcomes be met. And even these methods demand that a student jump through certain hoops in a given time frame to attain particular goals. Some people chafe at the thought of going through such hoops, and those people may well refuse to be accommodated. Did the system fail them? \n\nIn the real world, working beyond the pace of your team can cause larger problems for your project. As a life lesson, I *can* see why a teacher might want to keep a class from getting derailed by an overachieving student. A good teacher will make an effort to explain that privately to the student. However, continuing to capture that student[.] attention and participation then becomes a job in *management*, not *teaching*... and the teacher might not be prepared or equipped to handle that shift. People generally aren't taught how to deal with outlying cases, regardless of their job; it is more effective to teach the general case. Maybe all instructors need a basic management class as a part of their education.\n\nEvery model will malfunction in some way. I don't believe that an ideal solution will be found. I think that some individuals will be lost, if not due to the system, then due to a teacher, a parent, a fellow student, or themselves. I don't think it[.] useful to simply raise one[.] hands and say, \"The system is broken,\" however. To say it[.] broken is an oversimplification. It[.] not ideal, and we want to strive closer to the ideal. The US, however, is not unified in mind as to what that ideal should be; hence, one can still find those who, frothing at the mouth, demand Intelligent Design be taught in schools... as well as the school boards and textbook corporations who will mollify that crowd.\n\nIt[.] a long, expensive fight that won't be won by any one particular policy or political group. In the meanwhile, then, it is up to parents to teach their children how to be curious, how to think critically, and what it means to be creative. If the parents and their children can have a sense of humor about it all, then they'll be able to roll with the crap the occasional bad teacher or administrator slings their way. If they can have a shred of empathy, they might be able to understand that most teachers are simply trying to do what[.] best as well. "}