{"doc_id": "1575", "name": "2012_01_humanities_student_major_722_self", "namespace": "we1sv2.0", "metapath": "", "pub": "self", "title": "2012-01-humanities-student-major_722_self.txt", "pub_date": "2012-01-20T00:00:00Z", "Sentiment": "0.088", "Subjectivity": "0.43", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "413", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ooosv", "Reddit_id": "c3iul76", "Subreddit_id": "t5_2qh96", "Commenter": "[deleted]", "length": "2316", "content_scrubbed": "UK student. Studied:\n\nHL: Chemistry/Physics/Maths  \nSL: English/Italian/Psychology\n\nI'd recommend thinking carefully about that sixth slot. I did two sciences, but there[.] a few subjects like Art and Music that can only fit into that sixth slot. A few more things:\n\n+ When I did the IB there were two options for SL Maths. Do the harder one unless you're really genuinely terrible at maths. It[.] better.\n+ The 'humanities' slot is bullshit. Pick something that looks interesting to you, but Business is a load of tripe, and Economics is boring, if easy. I did Psych, which was interesting, but not incredibly edifying.\n+ Be prepared for your standard levels to be more hobbies than studies. This isn't to say that you don't have to study for them, but you won't learn that much, so you might as well pick something that[.] interesting rather than something you think will look good.\n+ The extended essay is at least 50% the structure of it. It doesn't matter so much what you write in it, so long as you've got an abstract, footnotes, a bibliography and all that. Put in the groundwork. Also, choose something interesting for the subject, otherwise you'll be deathly bored by the end of it.\n+ If you do HL Maths, there[.] zero mechanics in it, so if you're planning on studying something like mechanical engineering at university, bone up in your spare time over the summer.\n\nI don't know what the standard High School experience is like in Sweden, but typically for the last two years in the UK students only do three subjects, so they get in this mindset about picking what they're going to do for the rest of their lives, which almost never ends up being accurate. The IB lets you develop a pretty broad knowledge base and skill set, so don't try to narrow yourself down too much. Pick subjects that are as different as you can.\n\nEDIT: Was I happy with my choices? Well, mostly. I should have done Music instead of Chemistry. For the rest of them, yeah, pretty happy. In the end, though, it[.] just that I tried to narrow myself down before I went to university for a specific subject. Chemistry ended up being totally useless to me - it was interesting, but I've basically ended up teaching myself all the stuff I would have learned in HL Music, and if I'd taken it I would have had a significant headstart on that."}