{"doc_id": "658", "name": "2012_02_humanities_student_major_661_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2012-02-humanities-student-major_661_philosophy.txt", "pub_date": "2012-02-20T00:00:00Z", "Sentiment": "0.095", "Subjectivity": "0.336", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "1375", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pxomz", "Reddit_id": "c3t8664", "Subreddit_id": "t5_2qh5b", "Commenter": "Mr_Nomadologist", "length": "9438", "content_scrubbed": "Though Jean-Francois Lyotard is often cited for his definition of postmodernism (\"incredulity toward metanarratives,\" *The Postmodern Condition* [1979]), it was Charles Jencks who popularized the term in *The Language of Post-Modern Architecture* (1975), where he described architectural styles that departed from the functionalism of modern architecture. Before this, the term was already in circulation in many literary and artistic circles, and had been applied to the writings of James Joyce, Virginia Woolf, *etc,* and was probably originally a late 19th century art term for painting after French Impressionism. When the postmodern \"era\" began—like any question of periodization—is up for debate: some cite the First or Second World Wars as events of massive disillusionment or disorientation or disembeddedness, and this was reflected in the historiography, literature, art and philosophy immediately following. Others point specifically to the rise of French Poststructuralism, *Ecriture feminine*, and Deconstructionism in the late 1960s and early 1970s as the start of postmodernism as a pastiche movement in the humanities and social_sciences. \n\nPostmodern thought has antecedents in the epistemological skepticism of David Hume, statements by Friedrich Nietzsche on the \"death of God\" and the self-referential nature of language, the \"later\" Wittgenstein[.] philosophy of \"language-games,\" the Frankfurt School[.] Anti-Enlightment critique of modernity, and the radical ontology of Martin Heidegger. Some might even say that the oracles of Heraclitus, the ancient Greek sophists and Hellenistic school of Skepticism were all also very early forms of proto-postmodernism (I leave you to wrap your head around that term).   \n\nThat[.] the genealogy or intellectual pedigree of postmodernism. The \"plainest\" introduction to its *themes* may be Richard Rorty[.] *Philosophy and the Mirror of Nature* (also 1979). Rorty was a trained analytical philosopher, in the same, broad Anglo-American school that educated Noam Chomsky. Rorty claimed that traditional philosophy relied on a representational or \"correspondence\" theory of truth—that our language, our science, our perceptions could accurately mirror reality and arrive at a quality that it called \"truth.\" But, piggybacking on the paradigm theory of science by Thomas Kuhn, Rorty argued that truth was not a property of an external nature that we could mirror back to ourselves; truth was a property of people[.] *beliefs* about nature, and was accepted as such by society on the basis of how coherent (therefore, persuasive) they were. Thus, the problems and the solutions of normative science were the results of a particular vocabulary and assemblage of metaphors that, pragmatically speaking, scientists found to be functional. Switch the vocabulary, alter the paradigm or shift the metaphors, and a new set of problems and solutions emerge. There is nothing inevitable or representational about our science. \n\n(Of course, this should come as no surprise to Noam Chomsky, who himself upended the behaviorist paradigm—with its attendant vocabulary, metaphors, problems, and solutions—in favor of a functionalist theory—with a new set of vocabulary, metaphors, problems, and solutions—of the cognitive sciences, which he helped to found.)\n\nNormative science—and the analytical philosophy that championed it—constitutes *one* of the \"metanarratives\" that Lyotard poses incredulity toward. Rorty[.] post-analytic philosophy is a variant of philosophical postmodernism. Other postmodernists have accomplished similar criticisms of other metanarratives. For example, the French Postructuralism of Michel Foucault and Roland Barthes was a critical response to the theory of Structuralism, originating with Ferdinand de Saussure in comparative linguistics and, at the time, advocated by literary Formalists such as Roman Jakobson and anthropologists such as Claude Levi-Strauss. The general tenet of Structuralism was the existence of over-arching, a-historical structures or patterns that explained many disparate cultural phenomena—from literature to mythology to history to social interactions to language itself.  Roland Barthes, in particular, challenged the existence of the author in literary analysis. In his \"Death of the Author,\" he criticized this Cartesian unity with its deliberate designs and intentions structuring literary works as illusory; a handy and legitimizing construction of literary critics themselves. \n\nMichel Foucault[.] historicism is a more famous (and influential) example. Borrowing from Nietzsche, Foucault applied a \"genealogical\" method to the history of various social institutions. Foucault[.] historicism demonstrates the contingency or construction of notions that we may take for granted or assume to be immutable truths. He does this by tracing their genealogy or specific development through history, and how this development is always shaped by power. Knowledge and power are inseparable. For example, in *The History of Sexuality*, Foucault traces our conceptions about sexuality in the present—which we now take to be natural truths about sexuality—back to ancient forms of sexuality that radically differ from our own. He locates these attitudes in the texts and authorities of the time. There is no unified or objective principle of sexuality operating \"structurally\" through history. Sexuality—like other subjects that he scrutinizes (madness, health, criminality)—are all \"discourses\" shaped by the contingencies of history and the power of social institutions at any given time. \n\nIn *Of Grammatology*, Jacques Derrida challenges the unity of meaning in language itself. Deconstruction is the explosion of meaning in a text by recognizing the inherent \"play\" within language. Often texts contain meanings that undermine their own authorial messages. A deconstructionist sniffs these meanings out and teases them into light, disrupting the supposed unity of the message. This \"dissemination\" of meaning prevents a single, definitive interpretation of a text. It also challenges the boundaries of a text itself. A text becomes a nexus of innumerable other texts, all arising from this proliferation of alternate meanings in its language. In fact, Derrida saw the whole world as a text, including explanations of the world (metaphysics). Metaphysics, he explained, is \"logocentric,\" meaning that it excludes or represses interpretations that disrupt the rational unity of its own metanarrative. \n\nRather than belabor each \"major\" postmodernist in detail (can we talk of major and minor postmodernists? I smell metanarrative), I will suffice it to say that postmodernist thought also challenges the hegemony of imperialism and colonialism (as \"postcolonialism\": see Edward Said; Homi Bhaba; Gayatri Spivak); the mimetic relationship between reality and virtuality (see *Simulation & Simulacra*, Jean Baudrillard); the mental apparatus theory and methods of psychoanalysis (see Gilles Deleuze and Felix Guatarri); the notions of orthodoxy and theology in religion (as \"radical hermeneutics\": see John Caputo); and the social constructions of gender and sexuality (as \"second-wave feminist theory\": see Helene Cixous; Julia Kristeva; Judith Butler). These are only examples of philosophical or theoretical postmodernism. As I pointed out at the start, postmodern attitudes and concepts disrupt traditions and decenter prevailing logics in almost every field or discipline, from painting to music to novels to dancing to architecture to science to historiography to religion.\n\nWell, that may be a lot more \"plain language\" than Noam Chomsky or the OP wanted, but I've given a history of the term, a history of the pastiche movement (including historical antecedents), and several examples of theorists who applied Lyotard[.] incredulity toward metanarratives to specific instances of metanarrative. \n\nI will close with a quote from Richard Rorty, who I personally think is the \"plainest\" and most pragmatic postmodernist, which I hope sums up the general attitude of the philosophy itself—postmodernism as a kind of irony or critical realization that its own critical distance is always-already mired in web of inescapable problems, attitudes, and assumptions: \n\n \"All human beings carry about a set of words which they employ to justify their actions, their beliefs, and their lives [...] I shall call these words a person[.] 'final vocabulary.' [...] I shall define an 'ironist' as someone who fulfills three conditions: (1) She has radical and continuing doubts about the final vocabulary she currently uses, because she has been impressed by other vocabularies; (2) she realizes that argument phrased in her present vocabulary can neither underwrite nor dissolve these doubts; (3) insofar as she philosophizes about her situation, she does not think that her vocabulary is closer to reality than others, that it is in touch with a power not herself.\n\n \"The opposite of irony is common sense. For that is the watchword of those who unselfconsciously describe everything important in terms of the final vocabulary to which they and those around them are habituated. To be commonsensical is to take for granted that statements formulated in that final vocabulary suffice to describe and judge the beliefs, actions, and lives of those who employ alternative final vocabularies\" (*Contingency, Irony, & Solidarity*, Richard Rorty [1991]). \n"}