{"doc_id": "1619", "name": "2012_01_humanities_student_major_1229_mensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "MensRights", "title": "2012-01-humanities-student-major_1229_MensRights.txt", "pub_date": "2012-01-31T00:00:00Z", "Sentiment": "0.025", "Subjectivity": "0.302", "Score": "26", "Upvotes": "26", "Downvotes": "0", "Wordcount": "1226", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p4qhp", "Reddit_id": "c3miu38", "Subreddit_id": "t5_2qhk3", "Commenter": "[deleted]", "length": "7818", "content_scrubbed": "Ok.\n\n***On MRAs***\n\nPopulation:\n\nThere are probably less than 100,000 active MRA[.] globally. I'll define active as 1) aware of discrimination, 2) discussing it online, 3) lobbying or campaigning for social change via protest groups 4) researching and publishing pro-male or feminist-critique literature in academia. Of 3 and 4, which are the most important groups for change, there are probably less than 3-5,000, and of those a small minority are the one[.] able to accomplish most of the more vocal tenets. This is not to say the rest aren't trying, but they don't have the necessary connections, experience, occupations, or lobbying platforms that a small few do [think people like Warren Farrel, Paul Elam, the founders of [New Male Studies](http://newmalestudies. com/OJS/index. php/nms/index) Journal, Several Aussie Father[.] groups like Fathers4Equality, etc] \n\nThe vast majority of MRAs do not participate in protests, although they might donate financially to organizations, or are attempting to be active/are active in academia. Most of the men who would consider themselves to be MRAs because they've witnessed discrimination, or because they've experienced discrimination, aren't considering themselves MRAs ***because they don't know about it.***\n\nOn core principles:\n\nAs an extremely small movement [your average Occupy movement of a top 20 US city is more active, and has more people than the entirety of the Men[.] Rights Movement,] we have an pretty inclusive policy at the moment. Experience discrimination? C'mon down and join us. We have no spokesman, no chairperson, no voice for our qualms. We, like most early movements, lack leadership and guidance. There is no critical mass in the immediate future. \n\nOur principles stand on seeking equality. Equality of child custody [and thus child support payments,] equality of alimony [or destruction of,] equality in crime sentencing, equality in DV funding, equality in Cancer funding, equality in the workplace... the list goes on. Mainly we want acknowledgment of the demonisation of men and boys, and the recognition that males suffer, have always suffered, and the dismissal of the false mythos that men have always oppressed women [even when they protected them.] \n\nThe problem is that as a new movement, with diffuse principles, with small membership, the only contingency is that you identify yourself as one. You'll see why this is different from feminism in a moment.\n\n***TL;DR about MRA[.]:*** MRAs are extremely different in their principles, we don't agree on our own principles, and we've only just started being activist in the last 20 years or so, and mostly in the last 10 on the internet.\n\n***On Feminists***\n\nPopulation:\n\nThere are ***far*** more that 100,000 feminists involved in academia and government globally. [NOW has over 500,000](http://www. now. org/organization/faq. html#member) and growing. Here is a small list [globally,](http://en. wikipedia. org/wiki/Category:Feminist_organizations) but do keep in mind there is a slight difference between a woman[.] group, and a feminist organization, even if that difference is difficult to discern for your average man or woman. There are self professed and active feminists in every western nation[.] government, at all levels ranging from the Judiciary to Parliaments/Congresses, to every level of state bureaucracy. They are not endemic, nor are they representative of the entirety of government, but they are there, and they actively lobby for legislation [and they achieve this goal.] Some even have active [and represented] feminist political parties. \n\nIn Academia almost every western university will have a Feminist arm. It may be the Women[.] Studies program, it may be called Gender studies [which is hilarious because there is no study of the male,] it might simply be called Feminist Studies. In some Universities, depending on its culture and political leanings, the entire liberal_arts branch of the university system may have feminist leanings. Feminists are involved in every Domestic Violence program, in every campus rape program, in every family court system at some level, either by starting it, heading it, or comprising most of the members [or all 3.] \n\nOn core principles:\n\nFeminism, unlike the Men[.] Rights movement, has core principles and tenets that make up the foundation of its ideology. The MRM only has \"we want equality,\" Feminism has a full blown ideology and rationalization for this ideology. It has an academic field that actively studies and pursues these tenets. It has researchers, authors, journal publications, books, magazines, or sections in non-feminist publications.\n\nFor the purposes of brevity, I'll simplify it [and yes I must generalize here,] but feminism[.] core principles are that there is a difference in the way men and women are treated in society, there has always been a difference. Feminist theory posits it is a direct result of the Patriarchy social system, and that it oppresses women in favor of men. The authors and distributors of these theories have had a ***direct impact*** on legislation of governments all over the world. They affect court decisions, laws, business practices, and academic institutions. \n\nI've said many times that these are feminists. If you took a course in college [or several,] or you self identify as feminist because of blogs you read, or merely because you are a woman, you are not a feminist. Being pro-choice, doesn't make you a feminist. Feminists are the one[.] that make the policies of inequality, that write the literature of demonisation, that see oppression everywhere. There are millions and millions in the places that matter.\n\nYou are not a Republican or a Democrat if you watch certain news programs, or only agree on some of the issues. While they may divide on specific legislation or courses of action for an issue, they have key tenets and core principles that bind them, and that they all agree on. You are not a feminist if you don't agree with the oppression of women everywhere by all men. The key tenets of feminism AFFECT FAMILIES, MEN WOMEN AND THEIR CHILDREN. The key tenets of feminism actively fight to deny 50/50 custody legislation [NOW in the US and groups in Australia have done this.] They actively fight to demonise men with the use of false statistics or denial of statistics in rape and domestic violence campaigns [Active in every western country, specific US examples are the Duluth Model and the 1 in 4/1 in 5 rape statistic.] They actively fight to promote a wage gap that does not exist. They actively fight to keep the image that women are oppressed by males.\n\nYou are not a feminist if you don't know about the origins or the current actions of your movement, and in fact I'd call you ignorant and foolish if you didn't want learn about this. \n\n***TL;DR about Feminists:*** Feminists have millions of members in the places that count: governments, NGO[.], and academia. They have large amounts of funding, from members, non-members, and governments. They have a specific platform and specific core principles that they abide by.\n\n***TL:DR about my wall of text:*** When we \"generalize\" about feminists, we are not generalizing, we are speaking specifically about the feminists that affect legislation, public policy, court decisions, and write anti male academic literature. If you are an average forum goer, who has learned from feminism because you took a couple of courses, or read some blogs, and self-identify, I don't consider you a feminist. I just consider you ignorant. This might piss you off, and it should. Never join a movement that you don't understand, whose leaders do things you wouldn't approve of, and about whose [history you are ignorant.](http://ia600402. us. archive. org/30/items/fraudoffeminism00baxerich/fraudoffeminism00baxerich. pdf)"}