{"doc_id": "679", "name": "2012_02_humanities_student_major_914_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2012-02-humanities-student-major_914_AdviceAnimals.txt", "pub_date": "2012-02-26T00:00:00Z", "Sentiment": "0.036", "Subjectivity": "0.206", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "293", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3veeo8", "Reddit_id": "c3vewtc", "Subreddit_id": "t5_2s7tt", "Commenter": "despaxes", "length": "1605", "content_scrubbed": "Tell me then, what do you find to be the purpose of life, what is \"fun\" for you?\n\nIf you play video games, who writes the stories (goes for movies and TV too). Who designed the avatars/background? If you read, obvious there. If you travel, guess who looks into the ideas and cultures of other people? Who researches languages?\n\nOh, that[.] all humanities.\n\nEDIT: Also, I don't remember reading Derrida/Marx/Foucault, or learning French/Old French, Middle English, and etymology in high school. I also never took Logic or Ancient Greek Literature. I don't remember having to study abroad to do research on a time period of a country. I don't remember having to be able to do enough research to fill 25 pages on about 5 pages of text.\n\nAlso, I may digress, but I can hold a conversation on most medical discussions with my sister (nurse) or my friends brother(doctor) and I've had to help my friend with his coding (programr) and we talk at length about technology and astronomy. I have read astrophysicist[.] dissertations and while struggling through some of it, I was able to talk about it with them later intellectually. Most of this because of the research I've done as guess what, an English Major. Can they reciprocate and speak to me at length about what I do? Hardly. And I don't dare feign the ignorance to think I know enough about their subject to do it, or to even be well versed in it. But I try, and I respect what they do. The fact that you are ignorant enough to suppose that you can do what I do is disillusioned and laughable as much as it would be for me to do the same with what you do."}