{"doc_id": "675", "name": "2012_02_humanities_student_major_888_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2012-02-humanities-student-major_888_AdviceAnimals.txt", "pub_date": "2012-02-26T00:00:00Z", "Sentiment": "0.093", "Subjectivity": "0.316", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "520", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_q6wcg", "Reddit_id": "c3vcc86", "Subreddit_id": "t5_2s7tt", "Commenter": "zazzle_frazzle", "length": "3025", "content_scrubbed": "I have a feeling I'll get tons of down votes for stating this fact alone... I've worked in financial aid for 10 years this March.  \n\nFrom experience, I'd say the \"free ride\" idea floating around the US is largely a myth.  Sure, some students get everything paid for through grants and scholarships (I'm not referring to those whose parents just straight up pay out of pocket).  However, the majority really do not.\n\nAnother common misconception is what financial aid is.  Loans are considered financial aid.  It may not be your preferred method, but the loans are supposedly funds you would not otherwise have readily available to pay for your education.  I'm not saying this in a flippant way; I myself have loans and without them couldn't have followed the educational path I took when I was 18.\n\nLet[.] talk about educational paths.  Everyday I see students attending our institution from out of state that just can't afford it.  Parents will even say they can't afford it but in the same breath say they won't tell their kids no.  In a way, there is a sense of entitlement there.  There[.] nothing wrong with wanting the best for yourself or your kids, but there comes a point where you have to be realistic.  Is it realistic for families to pay $30k+ a year, financing a majority of it?  That means there[.] a potential to borrow well over $120k when it[.] all said and done.  And for what?  Is a liberal_arts education really worth that much when you can get the same thing in your home state or public institution if you attend a private?  Again, I have a liberal_arts degree so I'm not bashing that.  There is benefit to a liberal_arts education.  I just don't think it[.] worth anywhere near that amount.\n\nFor people stating \"just declare yourself independent.\"  It[.] not that easy.  If you are applying for federal aid, there are specific federal requirements that must be met before you are considered an independent student, regardless of parental support.  Financial aid offices can use professional judgement to make a student independent, but most will require extenuating circumstances, like a breakdown in the family unit.\n\nIs the system perfect?  No, not by any means.  The cost of education just goes up and up every year but that[.] because our federal and state support is being slashed.  Students today want every amenity you can think of, and that costs money.  Something[.] got to give, but what?  I'm not pretending to know the answers, because I simply don't.\n\nPeople who work in financial aid seem to get a bad reputation.  I wish that wasn't so.  I know so many passionate individuals who are simply inspiring in what they do.  Heck, I wouldn't be where I am today without  financial aid and those people.  There are good aid administrators and bad, just like in any profession.  It[.] challenging to help students with limited funds and increasing government oversight.  But I've got to say, I couldn't imagine myself doing anything else.  It[.] not easy work but it is so rewarding.\n\nWow, that got long..."}