{"doc_id": "1543", "name": "2012_01_humanities_student_major_468_learnprogramming", "namespace": "we1sv2.0", "metapath": "", "pub": "learnprogramming", "title": "2012-01-humanities-student-major_468_learnprogramming.txt", "pub_date": "2012-01-12T00:00:00Z", "Sentiment": "0.14", "Subjectivity": "0.364", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "237", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3glnbz", "Reddit_id": "c3gmohr", "Subreddit_id": "t5_2r7yd", "Commenter": "dsampson92", "length": "1447", "content_scrubbed": "Basically, classes are described as being a certain number of hours, and this corresponds to roughly the number of hours you will spend in class each week.  Most classes are three or four hours, and will typically meet either monday, wednesday, and friday, or tuesday and thursday, though there are many exceptions.  Sometimes a class may be listed for a slightly different number of hours compared to how many are in each class.  A typical semester is between 12 and 18 hours, and a typical degree is maybe 120-130, with roughly half (big estimate, it could be 1/3 or 2/3) of that being specific to one particular major.  \n\nMost schools have a set of \"general education\" or core classes that everyone must take.   They can be very specifically defined (you must take MATH121, ENGL101, HY101, etc), to the very broad (12 hours humanities, 12 hours math/science, etc).  Most schools are somewhere in the middle.  For example [these](http://catalogs. ua. edu/catalog10/500514. html) are my gen ed requirements.  You will note that engineering students (CS included) have different requirements due to the usual workload of engineering students.  Some schools allow classes to count for both gen ed and you r major, if they overlap, or will allow certain high school credits (AP) to count.  Generally you get the gen ed stuff done in the first year or two, and concentrate exclusively on your major in your upper years.  Does that cover most everything?"}