{"doc_id": "1577", "name": "2012_01_humanities_student_major_731_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2012-01-humanities-student-major_731_funny.txt", "pub_date": "2012-01-20T00:00:00Z", "Sentiment": "0.098", "Subjectivity": "0.319", "Score": "54", "Upvotes": "54", "Downvotes": "0", "Wordcount": "325", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3ivwfm", "Reddit_id": "c3iwdaf", "Subreddit_id": "t5_2qh33", "Commenter": "TBatWork", "length": "1816", "content_scrubbed": "Have a plan, know what classes you're going to take and need for transfer. \n\nMy community college had a little worksheet that layed out *everything* you need to transfer from community college to a state school, and another sheet for transferring to a state university. Even better, find out where you want to transfer, talk to one of their counselors and figure out what you can get done at a community college level that will transfer over to your major. I was given the option to finish my English degree in *one year* when I transferred, and I only spent two years at community college taking classes that counted. I opted to double major instead.\n\nA liberal_arts degree is valuable if you know what you're going to do with it. I went into technical writing, so I can say I'm actually using my degree for something. I do know people with liberal_arts degrees that don't have jobs, I know people with liberal_arts degrees that are making a great living, and I know people with hard_science degrees without jobs because they didn't do internships and feel entitled to a million dollars an hour despite no experience in the field, and a poor GPA; they also feel like the debt justifies their expected wage. Experience *always* trumps a degree. \n\nTake advantage of college resources like job placement. I simply lucked out with a craiglists ad, but I regret not taking advtange of the job placement department. \n\nDid you fill out FAFSA and financial aid? You might be able to get something out of it. I qualified for free school and a living stipend, so I was paid to go to college. Work and go to class too, if you can afford the time to do so. Try to get out debt free. \n\nSure, it was unsolicited advice, but I'm pretty passionate about education and had a great experience with community college and transfering. "}