{"doc_id": "801", "name": "2012_10_humanities_student_major_1365_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2012-10-humanities-student-major_1365_canada.txt", "pub_date": "2012-10-27T00:00:00Z", "Sentiment": "0.151", "Subjectivity": "0.399", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "265", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6sk4xt", "Reddit_id": "c6sldd4", "Subreddit_id": "t5_2qh68", "Commenter": "[deleted]", "length": "1650", "content_scrubbed": "Why should we be absolutist one way or another? There are absolutely great benefits to obtaining a liberal_arts education that extend beyond practical market applications. An appreciation of high culture and a desire to broaden our understanding of the human condition are wonderful things and I hope that people continue to pursue them.\n\nBut at the same time, it[.] clear that the traditional liberal_arts education is not a workforce training program, yet secondary students are encouraged to pursue post-secondary education as a tool to increase their employment prospects. Now, for any given individual this is probably decent advice--because as more people earn degrees it looks relatively worse to employers when you don't have one, even if the degree isn't relevant to the workplace--but when large numbers of people who aren't fundamentally interested in a liberal education pursue one for the sake of employability, it really harms them as a group (by taking up time they would rather spend working or doing other things to pursue qualifications that aren't intrinsically beneficial to their future employers) and it also harms those who would like to educate themselves for the sake of that education (by devaluing the relative worth of their education).\n\nSo perhaps we can agree that the traditional liberal_arts education is important and that we want people who are interested in spending their lives furthering an appreciation of the human condition to do so. But hopefully we can also acknowledge that these degrees have been valued by society for the wrong reasons and discuss how we can shift our broken educational incentive systems."}