{"doc_id": "649", "name": "2012_02_humanities_student_major_578_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2012-02-humanities-student-major_578_funny.txt", "pub_date": "2012-02-17T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.26", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "248", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3sa8wz", "Reddit_id": "c3scism", "Subreddit_id": "t5_2qh33", "Commenter": "SeriousCritic", "length": "1629", "content_scrubbed": "***Bejelewed*** (2002)\n\nThis particular depiction has long been held as the most humanistic of S. W.[.] work. It incorporates a multitude of themes which characterize the plagues of our era, which are not limited to:\n\n* *missing the bus*, as we see an intentionally and masterfully motion-blurred vintage 1955 Ford Motorized Catapillarham exiting left, against the direction of our eyes' natural right-dominant reading direction as dictated by da Vinci,\n\n* *playing Bejeweled until one[.] eyes bleed*, which for years both prior and since the generation of the piece has reduced the overall workmanship in international flourescent-lit offices (though the trend has still been found to reduce suicide rates in cubical centers established highrise buildings),\n\n* *airbourne particulate pollution plaught*, a phenomenon which was first observed in 1989 in Portland, Oregon as a sophistocratic alternative to lesser pollution schema locally referred to as *smog'n'grog*,\n\n* and finally, *the rule of thirds* which has contrained the creative potential of dual psycholog/photography majors in liberal_arts colleges nationally for over a decade, and has been dismissed as an expectation which, in utility, was recently found in a gallup poll to waver between \"kinda cool\" and \"really, super-gay, bro\".\n\n*Bejeweled* is usually held to be a representational piece and likely was not based on any real-world counterpart outside of the artist[.] own imagination. Perhaps it is because of this that the work has gained a cult following among upper-middle class youths. The work is frequently likened to the erotica graphic novel *Dharma Bums*."}