{"doc_id": "776", "name": "2012_10_humanities_student_major_1155_highschool", "namespace": "we1sv2.0", "metapath": "", "pub": "highschool", "title": "2012-10-humanities-student-major_1155_highschool.txt", "pub_date": "2012-10-22T00:00:00Z", "Sentiment": "0.197", "Subjectivity": "0.407", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "346", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11x8v2", "Reddit_id": "c6qeddq", "Subreddit_id": "t5_2r8t0", "Commenter": "bona_fide_supraman", "length": "2074", "content_scrubbed": "I'd love to help! I'm a high school senior applying to college and I go to a relatively competitive school. \n\nI'll assume your definition of top colleges is Ivy League equivalent.\n\n1) SAT Score:\n\n* minimum for whites: 2200\n\n* minimum for asians: 2250\n\nI'm not being racist, this is pretty much the truth. Also, the higher the score the better, but after 2300 it doesn't matter. \n\n2) GPA\n\n* the higher the better, but I'd say above a 3. 8 uw if you are taking the most rigorous course load. I'm not sure about weighted.\n\n3) Extracurriculars\n\n* As many as possible, but each one should show depth. Depth breadth. \n\n* I don't think any are more highly looked upon.\n\n* Colleges LOVE to see leadership in your extracurriculars. This means student body representative, club president or some other position, etc. \n\n* Awards are always nice. Preferably state or nationwide.\n\n* You'll hear it a bajillion times, but be passionate about what you do, or at least try hard faking it.\n\n* Make your summers meaningful. Don't do nothing. I know that Stanford and Princeton have asked on supplements what you did over the last two summers. It better be some cool stuff. \n\n* Jobs or internships are highly looked upon. [Someone asked about a research internship and I replied about how to get one](http://www. reddit. com/r/highschool/comments/w3lnn/has_anyone_here_done_any_original_research/), so you could look at that. \n\n* Make your community service hours meaningful. \n\n* Try to have extracurriculars centered around what your interested in.\n\n4) Enrollment\n\n* Take the most rigorous courses. They do look at the rigor to see if you'll be able to keep up with their classes. I don't know how colleges know the rigor. I'm not clear on AP vs IB vs duel enrollment vs honors, since my school only has AP but take the most rigorous. \n\n5) Application Essays\n\n* Application essays should show your character. \n\n* Application essays aren't usually the deciding factor. They might change the original decision 1-2% of the time. \n\n* 2 teachers for recs, 1 from humanities and 1 from math/science.  "}