{"doc_id": "792", "name": "2012_10_humanities_student_major_1305_washington", "namespace": "we1sv2.0", "metapath": "", "pub": "Washington", "title": "2012-10-humanities-student-major_1305_Washington.txt", "pub_date": "2012-10-26T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.418", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "959", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_122gbc", "Reddit_id": "c6s074m", "Subreddit_id": "t5_2qjvz", "Commenter": "vinylshrapnel", "length": "5634", "content_scrubbed": "As a product of one of the first charter schools in Arizona, I really don't see this opposition to be anything but fear of the unknown. The description in the voters guide is very accurate on how they are run. They are non-profit and run by people who care about the education of the students.\n\nCharter schools have the potential to be great as well as bad. The bad ones don't get their charter renewed. The good ones tend to outperform public schools. \n\nCharter schools only take funding away from public schools in that the student is no longer attending it. The funding follows the student whether public or charter. Why should a school get the funding for a student if said student no longer attends? Charter schools are public schools that have more control over their curriculum and class size. Typically government funding comes with strings attached. Accept this funding and you must implement this or that. Charter schools get more control over the way they run their school by only accepting funding with minimal strings attached. Private schools can discriminate and have one sentence they are required to comply with, and it is about fire codes. Public schools have to comply with a stack of papers about an inch thick with regulations. Charter schools (at least the one I attended) have about a page or two worth of stuff they have to comply with, dealing with fair, nondiscriminatory enrollment typically by lottery if their is not enough space for everyone. Also siblings of students get preferential enrollment so as to allow them to attend the same school. They cannot discriminate based on grades unlike private schools and this allows any student to get in assuming they are in the correct grade for the school and there is enough room. Limited class sizes create a much better student teacher ratio and improves learning. \n\nOne of the unique things about my school was that no teacher had a teaching degree. While this might seem like a bad idea, it is not. Teaching degrees allow a teacher to teach any subject regardless of their knowledge level on said subject. This means an English major could teach pre-calculus. My school had a different approach. They only hired teachers that had at least a bachelors degree in the area they were teaching. Many had masters degrees and there were several doctorates as well. This resulted in teachers actually teaching subjects they cared about and had a higher level of knowledge than someone with a teaching degree. They were also some of the highest paid teachers in the state. \n\nIf you look at Arizona and how successful their charter schools have been over the past 15 years, you will see they typically perform better than the public schools. In fact my school was the highest performing school in the state between charter and public schools. It was only bested by one private school, which could discriminate based on grades and intelligence, etc. A well modeled charter school with lower class size, better student teacher ratio, and superior curriculum can take average students and have them performing near the top. don't get me wrong there are some terrible charter schools out there. But they don't last long, because their charter gets revoked. The good ones are able to open additional schools allowing more choice and freedom from the district limitations. If a public school is known for not being very good, I do not want my kids to be forced to attend because of what street I live on and the fact that I can't afford private school tuition. \n\nI am grateful for having attended a charter school. We had 6 grades (7th-12th), two classes per grade consisting of a maximum of 20 students each for a school wide maximum total of 240 students. It was a more personal learning environment. By the time I was in my senior year, my graduating class size was down to 21 students. I ten in my class. 10:1 student teacher ratio makes learning incredibly more focused. There weren't the typical \"clicks\" like the public schools that had 4000 students enrolled. Everyone pretty much knew everyone else. Had I gone to the public school I was supposed to attend, I would have had to deal with gangs on campus, class sizes around 35-40 students, and generally a terrible quality of curriculum. The curriculum my charter school used was typical of a liberal_arts college. By the time a class graduates, they are well read with classic literature and philosophy and able to debate and write at a college level, take at four years of language (which happened to be our only elective), and has two years of calculus, physics, fine arts, drama, choir, and one year of algebra, trigonometry and geometry, precalculus, biology, biochemistry, poetry, and music composition. These are average students enrolled in this school but are able to excel due to limited class size and teacher who know the material due to their own degrees in the subject.\n\nAs a Washington resident it makes me sad to see us failing to provide viable options to our students and their families. I want every student to be afforded the same opportunity I had to attend an alternative to public schools. Bad charter schools get weeded out, while good ones can spawn more charter schools in the same image. If you want to see an excellent example of the implementation of good charter schools check out [Tempe Preparatory Academy](http://www. tempeprep. org) and the [Great Hearts Academies](http://www. greatheartsaz. org) that were based on TPA[.] model. I wish this type of education was more widely available to students across the US and as a Washington voter I will once again vote  for their approval. "}