{"doc_id": "1582", "name": "2012_01_humanities_student_major_799_ubc", "namespace": "we1sv2.0", "metapath": "", "pub": "UBC", "title": "2012-01-humanities-student-major_799_UBC.txt", "pub_date": "2012-01-22T00:00:00Z", "Sentiment": "0.101", "Subjectivity": "0.369", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "317", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_os5zh", "Reddit_id": "c3jmnva", "Subreddit_id": "t5_2qy2j", "Commenter": "holyshamoley", "length": "1708", "content_scrubbed": "All the Arts grads I know have jobs, including myself. It[.] more about the soft skills than the hard skills - critical thinking, etc. \n\nETA: I posted this from my phone and it[.] too hard to type and elaborate as much as I wanted. Anyway...\n\nI think that the job search troubles any Arts people suffer from has less to do with their resume, and more to do with not knowing what your passion or ideal career is. People in the sciences, those are much more specialized programs with obvious consequences. I majored in Poli Sci and Anthropology, and really didn't want to become a political scientist or practicing anthropologist as a career. But I was fortunate enough to start a part-time job after 2nd year that enlightened to me to my current career in HR. And it[.] true, I didn't learn specific HR practices in my schooling, but there[.] a definite connection. Poli Sci is about power relations, and Anthro is about culture, and those are two areas that having an awareness of has helped me as I learn the skills I need to continue in my career. I am currently doing a post-bac in HR, but that[.] more for my resume than a requirement. \n\nIt[.] just important to remember that you will likely have to work your way up, i. e. start as an Assistant and work into a career. But if you are a hard_worker and a smart person, then you will get there. And that is why Arts kids shouldn't have problem - because despite what Sauder or Sciences kids might say, you still have to work hard and be smart to get an Arts degree. What I've heard, and I think it[.] true, is that it[.] easier to pass Arts courses, but it[.] easier to get a higher grade in a Sciences course, just due to the increased objectivity of the material."}