{"doc_id": "632", "name": "2012_02_humanities_student_major_385_mensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "MensRights", "title": "2012-02-humanities-student-major_385_MensRights.txt", "pub_date": "2012-02-12T00:00:00Z", "Sentiment": "0.133", "Subjectivity": "0.412", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "704", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pm0ky", "Reddit_id": "c3qjfjh", "Subreddit_id": "t5_2qhk3", "Commenter": "[deleted]", "length": "3894", "content_scrubbed": "[OkTrends](http://blog. okcupid. com/index. php/the-biggest-lies-in-online-dating/) reported that men who listed their earnings as 100k or more received most of the messages from women. I experimented with this myself by making several different profiles with different incomes listed. The more income I listed, A) the more initial messages I got from women and B) the more likely any given woman to respond to my message, and C) the more they tried to \"sell themselves\" in their messages. Many of the messages were long, detailed affairs often explaining *why* she would be a good match for me, and many of the women volunteered their number before I would have even had a chance to ask. Conclusion: Many women will not hesitate to whore themselves out to a man who makes enough money - and the amount isn't even that high, only 100k/yr. The majority of these women weren't high earners themselves - many were \"liberal_arts\" graduates earning less than 60k/yr, so the whole \"I'm just looking for a man on my level\" argument flies right out the window*.\n\n*(Many women on OkCupid put \"educational requirements\" in their profile, usually demanding \"at least a Bachelor[.], but preferably a Master[.]\". When confronted on this, they typically respond with \"I'm just looking for a man on my level that I can talk to.\")\n\nMy real profile had me listed as a student with an undisclosed income. My height was listed as 5'6\", and I'm not terribly athletic looking but I have a handsome face. Using OkCupid for about 3 years, I could count the number of initial messages I received on 1 hand, and my reply rate was something like 10% before I formulated a strategy that boosted it up to around 40%. (I published my \"method\" on the forums, much to the dismay and protest of women...). But even then, the quality of woman I was getting involved with wasn't that high. It was still hard to find a \"put her money where her mouth is\" kind of woman. They were all so very \"independent\", but as soon as a cock was involved they expected the man to pay. I even had 1 chick ask me right at the beginning of the date \"I hope you brought enough cash for both of us because the last 3 bums made me split the bill.\" Suffice to say it was a short date.\n\nEventually, however, I finally did meet a decent woman who not only put her money where her mouth was, but she took *me* out and paid for the first date. We've never had any issues with money or anything; sometimes I pay, sometimes she pays. She[.] an amazing woman; I even taught her about men[.] rights and found out she agreed with most of it. We've been together for almost 2 years, drama free.\n\nI will say though, despite my success, online dating is the **worst** place to meet women. Most of the women on dating websites are there because they're too picky to meet a man in real life, so they resort to the Internet because \"They know what they deserve and won't settle for less!\" You also have women who have been in the workforce for a few years, have had enough, and are just waiting for Mr. Right to walk in to take care of them so they can quite their ohsostressful office job and take up knitting.\n\nAside from this long rant - no, feminists have no problem with \"patriarchy\" *when it benefits them*.\n\nYou would probably find that the women who complain about society being a ''patriarchy'' are not usually the same women as those who are looking for a man to be a provider\n\nYes they are. The *very exact same* women who brag about how they \"don't need a man\", and how \"no man is gonna tell them what to do/how to dress/etc\", and how they're ohsostrongandindependent... are the very same women that, as soon as a cock is involved, expect men to pay their way.\n\nThere isn't a view which ''women'' hold, they are very different and can hold opposite views to each other\n\nYes, we are all aware of how each and every woman is her own special unique snowflake. /s\n"}