{"doc_id": "802", "name": "2012_10_humanities_student_major_1368_iama", "namespace": "we1sv2.0", "metapath": "", "pub": "IAmA", "title": "2012-10-humanities-student-major_1368_IAmA.txt", "pub_date": "2012-10-27T00:00:00Z", "Sentiment": "0.251", "Subjectivity": "0.355", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "328", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6slxla", "Reddit_id": "c6sn4hy", "Subreddit_id": "t5_2qzb6", "Commenter": "bloopeeriod", "length": "1912", "content_scrubbed": "I disagree. I think that money can buy happiness. This supposed truism  is lore, repeated by many because many find themselves without it and because it is comforting. And in comfort we often find happiness.  And it is a comfort to know that we can be happy and content sans cash. But no money more problems is the flip side of more money more problems, and the difference between those problems is the difference between Third World Problems and Western Culture problems. You will be utterly denied any opportunity for future happiness should you find yourself unable to pay for life saving surgery. There are no happy corpses. Children require nurturing and money buys almost everything a body needs to thrive. Take care of the body and the psyche will pursue happiness naturally. When your child requires nurturing you will need to pay for that. I am talking about food, clothing and medicine but also costs associated with nurturing their innate talents in the Arts, Sports, and higher education. Money gives you the power to exert influence over events and outcomes in your life, and in the lives of those whom you effect. Creating happy memories in life makes for a life well spent and a sense of contentment and fulfillment. Beyond that, healthier, more fully realized persons make for healthier , happier communities. When a painter flourishes we all receive the privilege of enjoying the art. When you listen to music you are listening to wealthy peoples offspring (the large majority- of course not all of them). Because music lessons. In theater some talent are known as triple threats because they are accomplished singers, dancers and musicians (or a different combo of three skill sets). Talent like that is produced at a price. It doesn't just jump up on the stage one day and do a fantastic routine out of the blue. \nAnd it really does make happiness a more laborious pursuit when you got no gas."}