{"doc_id": "796", "name": "2012_10_humanities_student_major_1330_shitredditsays", "namespace": "we1sv2.0", "metapath": "", "pub": "ShitRedditSays", "title": "2012-10-humanities-student-major_1330_ShitRedditSays.txt", "pub_date": "2012-10-26T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.372", "Score": "30", "Upvotes": "30", "Downvotes": "0", "Wordcount": "403", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6s6ss4", "Reddit_id": "c6s8kg1", "Subreddit_id": "t5_2s4m9", "Commenter": "openbrd", "length": "2634", "content_scrubbed": "So to sum up your arg\n\n1. Many STEMlords are not taught to take ethical responsibility regarding STEM things.\n\n2. Therefore reddit admins do not take ethical responsibility for reddit.\n\nI agree with this.\n\nHowever, reddit[.] design is not devoid of cultural influence or theorizing. The reddit admins created reddit using democratic theory--the theory that mob rule produces the best decisions including the best ethical decisions. This is basically just completely false. Mob rule reflects the lowest common denominator and all throughout history has been dominated by the vulgar, cruel, evil. So reddit[.] design based on the myth of democracy/mob rule played a big factor in it becoming a shitlord[.] shitpool. \n\nRight now, the reddit admins attempt to hide behind democracy and the law itself. They say, \"We let the users vote. It[.] democracy. Therefore it[.] ethically ok.\" They also say, \"We follow the law to the letter and are not ethically responsible for anything more than that\"\n\nSo you've successfully identified a big part of the problem. And this is not just a problem with reddit but with silicon valley, the military-industrial-complex, the pharmaceutical industry, and many more. It[.] a STEM issue where STEM majors generally refuse to take responsibility for the ethical implications of their behaviour. They tend to have extremely simplistic ethical codes such as democracy=good or ethics means following the law.\n\nOh one final note. It[.] true that Technology, Engineering, and Math tend to be completely devoid of ethical understanding and the practitioners typically refuse to take ethical responsibility. However, many sciences are more mature and do take ethical responsibility. Social sciences in particular tend to have very strict ethical oversight mechanisms. But redditors don't think social_sciences are real. The TE part of the STEM is the worst part because TE people have power combined with stupidity. Studying technology or engineering gives you power without actually educating you or making you smarter. You can have engineers who know how to build nuclear weapons and simultaneously harbour extreme delusions regarding the most basic aspects of life. They've never examined their own beliefs, have never examined their own lives, and are just ignorant unconscious cogs in various life-destroying machines. They are self-absorbed without being self-aware. They have power without intelligence, without autonomy. They reject responsibility. Character development, perspective, humility, autonomy, wisdom are the fruits of the liberal_arts and this is what \"TE\" people tend to be completely lacking in. \n"}