{"doc_id": "712", "name": "2012_10_humanities_student_major_299_askphilosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "askphilosophy", "title": "2012-10-humanities-student-major_299_askphilosophy.txt", "pub_date": "2012-10-08T00:00:00Z", "Sentiment": "0.15", "Subjectivity": "0.411", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1117", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_113uwx", "Reddit_id": "c6jad2d", "Subreddit_id": "t5_2sc5r", "Commenter": "Eat_Toys", "length": "6472", "content_scrubbed": "I earned my BA in philosophy from a prestigious small private school with several fairly famous philosophers and plenty of funding back in spring 2011. As repeatedly pointed out already in this thread, your mileage seems to differ greatly with the school. Disclaimers aside this is my experience.\nAt the university I attended there was never a class with more than 30 people in it, many with 10 or less and I did several independent studies as well. There was always a great deal of live discussion and debate both between the class members and between the professors. Some upper level classes were discussion only based on the readings you did outside of class (that and the never ending stream of original and interpretive philosophical papers to be written). Upper level undergrad classes were combined with graduate students frequently (though the grad students had more readings, longer papers, and were generally held to a much higher standard). They also let advanced undergrads take graduate seminars. So the undergrad/graduate student divide wasn't very prominent. Only one of the classes I took was taught by a TA, which is worth keeping in mind since at many schools apparently the famous philosophers only teach graduate classes, luckily that was not my experience at all. \nAn average lecture tends to break down along lower level and upper level/ graduate seminar lines. The department I was at only used primary source, or translated primary source materials. Even in intro level classes all students were expected to read everything from Plato to Heidegger[.] original texts rather than explanations of their ideas in a text book. In lower level classes there was probably half the class period spent in argument and discussion as directed by the professor and half as lecture explaining the more difficult concepts to the class. Upper levels classes generally had no lecture at all and were treated like seminars where we discussed and debated around a table with the professor, other students, and visiting professors. Advanced undergrads and graduate students were frequently expected to give lectures on their areas of expertise to the class and answer questions and defend their interpretations to the faculty and class as well as presenting and defending papers live to an audience. I participated in all of 2 group projects: one a shared seminar lecture on Foucault and Hadot that I wrote with another undergraduate and another was group project in a medical ethics class where we made and presented a power point presentation arguing for a change in hospital procedure.\n\nThere was tremendous amounts of very challenging readings on a daily basis. I was once assigned 800 pages for a single class period (though this was the most egregious reading assignment I have ever received).  There was generally no homework other than reading. Tests were rare, many classes did not have them and the few that did had no rote memorization. All tests were essay exams where you were expected to write a few pages on the fly live in class about a prompt you were not given until the test actually began. Most of the actual grades came from original papers. Most of the prompts were extremely open so you could pursue your own interests. While lower level papers were quite easy often and rather short upper level papers were often graded quite harshly and students were expected to write publishable papers for an A. A+[.] were never given. \n\nI have absolutely no regrets about choosing to be a philosophy major, but I also realize my story is an unusually happy one. My philosophical training has absolutely shaped every facet of my life from here on out. I ate, breathed, and slept (ok that is lie, I got almost no sleep) philosophy for four years. When I wasn't studying, I was working for the philosophy department. In my free time I found myself always interpreting and parsing my all my entertainment media and interactions with friends and strangers through a philosophical lens. I have found that I learned how to think in rational terms and how to build and interpret arguments on the fly as well as deconstruct them in any real life situation, no matter what the subject is. There is no way I would be able to do this without years of rigorous training. Having a broad history of philosophy background has helped me understand all other subjects I have run into in the Western sciences and cannon better because I understand how empiricism, linguistics, idealism, economics, etc. came to be and how they inform and underpin modern thought. I have also found myself able to communicate ideas and understand people much better since I was forced into the habit of speaking, thinking, and writing very clearly. All the lectures I gave have left me with no fear of speaking in front of groups of people. \n\nNow, as you know, a philosophy BA entitles you to be nothing in particular. Lots of places just want someone with a Bachelors degree which you will have.  I was offered a real philosophy job right after graduation that paid very well as a junior medical ethics consultant for a major hospital. I ended up not taking the job because I wanted to stay with my girlfriend and recover some from my rather crazy senior year. I was offered a managerial track job at Best Buy because of my degree and very strong interview skills I developed as a philosophy major, so real jobs do exist. Also of course you can go law school (philosophy is the feeder track to pre-law) or go into grad school in a number of fields. That said, the academic job market is absolutely awful in the humanities right now, and law isn't much better. The competition to get into top tier schools (the only people who actually get tenure track jobs at this point) with full funding for graduate school in philosophy is insane. That said, I have no regrets. In philosophy I found a community, language, and a way of life that I never would have otherwise. I finally found a home and a way to express the thoughts and ideas I have been obsessed with for my entire life. After taking a year off I spent my life savings on graduate school applications knowing full well the madness this was, and was lucky enough to get into my top three schools fully funded. I am working on my PhD now, and can't imagine doing anything with my life. I wouldn't be the person I am today without being a philosophy major.\nIf you (or anyone else) has any specific questions, I would be happy to answer them.\n"}