{"doc_id": "1520", "name": "2012_01_humanities_student_major_179_classicalmusic", "namespace": "we1sv2.0", "metapath": "", "pub": "classicalmusic", "title": "2012-01-humanities-student-major_179_classicalmusic.txt", "pub_date": "2012-01-06T00:00:00Z", "Sentiment": "0.213", "Subjectivity": "0.376", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "265", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3egx4i", "Reddit_id": "c3ejgk4", "Subreddit_id": "t5_2qhyq", "Commenter": "[deleted]", "length": "1537", "content_scrubbed": "I can say the same thing about jazz to a certain extent, and it[.] probably more apparent because jazz education hasn't been around as long as classical music.  \n\nIn some ways it[.] good to see how much of the pedagogy is becoming standardized, and people are able to learn the \"right\" things.  In that respect there may be more proficient musicians then they used to be 20-30 years ago. I notice it especially in Asia(where I'm from) where quality of jazz musicians are steadily improving as more students go overseas to study the music.\n\nThe problem, like you said, is that most musicians end up sounding somewhat generic.  In some ways this can't be helped, because for jazz, we don't have the same kind of environment like our teachers did when they were learning their music(I wonder if this applies to classical music).  \n\nI've also heard several drummers friends say the same thing about pop drummers too.  It[.] funny because they mention how some of the famous pop drummers have crappy technique, and not-so-great sense of time(to our standards), and yet they were able to play with such feel/personality.. and that[.] something that a lot of young drummers struggle with.\n\nI guess this is all just sign of the times. We live in society where we follow numbers, and musicians are kind of being sold like sports cars, or computers.  We want faster, better, and bigger profit.  That[.] our culture.. I just wish that it didn't happen in the arts as much, and that expression of individuality and beauty is celebrated on it[.] own terms."}