{"doc_id": "743", "name": "2012_10_humanities_student_major_676_mlplounge", "namespace": "we1sv2.0", "metapath": "", "pub": "MLPLounge", "title": "2012-10-humanities-student-major_676_MLPLounge.txt", "pub_date": "2012-10-16T00:00:00Z", "Sentiment": "0.08", "Subjectivity": "0.487", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "293", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6nb3gy", "Reddit_id": "c6nbaiy", "Subreddit_id": "t5_2t403", "Commenter": "CraftD", "length": "1674", "content_scrubbed": "Do freshmen have enough background in psychology to really understand that material and it[.] impact on behavior?\n\nI'm in a Psychopharmacology class on how drugs effect the nervous system and people[.] psychological states right now that[.] open to Freshmen. Can't imagine a class on memes is more complicated than that. I think Gen Ed Psych classes are expected to be pretty self-standing with regards to how much they themselves have to prepare you for what they expect you to know.\n\n \n\nSomething like the \"Modern Film\" or \"Jazz Appreciation\" classes my college offered.\n\nThere are some really stupid filler classes out there that you're only doing yourself harm by taking, true. But on the other hand there are times when you do have the opportunity to learn something you want to know in a strongly organized classical education environment that you wouldn't be able to otherwise.\n\nI know I'd jump on the chance to take a Photoshop, drawing, or cooking class if I had an extra slot open in my schedule. Things I may not want to get hired for, but things I'd like to learn in a way a college course would be ideal to learn from.\n\nGuess the point there is that classes like that aren't always horrible to take, it[.] just abusing them as an excuse not to take classes you ought to be taking is damaging.\n\n \n\na good number of recent graduates complain that \"college is useless\" and \"I have a degree and piles of debt, and no one will hire me\"\n\nAnd this is the part where us business and engineering students usually just get in a circle and laugh at the Liberal Arts students like rich English aristocrats after all those hours of actually difficult classes.\n"}