{"doc_id": "732", "name": "2012_10_humanities_student_major_536_engineering", "namespace": "we1sv2.0", "metapath": "", "pub": "engineering", "title": "2012-10-humanities-student-major_536_engineering.txt", "pub_date": "2012-10-11T00:00:00Z", "Sentiment": "0.129", "Subjectivity": "0.393", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "325", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11c6dh", "Reddit_id": "c6l6a8l", "Subreddit_id": "t5_2qhpi", "Commenter": "rroach", "length": "1802", "content_scrubbed": "High school can you leave wildly unprepared for college level math and science classes. Even kids with high school AP (advanced placement) calculus classes will sometimes have to start from Calculus 1, or even trigonometry. One girl I talked to said her high school chemistry class consist of fill in the blank sheets that the teacher passed out. Nobody really wants to attend college just to find out they have to retake all of their high school classes.\n\nSecondly, it is *hard*. Not impossible, but simply very difficult. Far more so than an English degree, or any of the Humanities. Plus, the credit load for some Engineering schools can be 20 or 21, versus 16 for others.\n\nIf you don't take the credit load, school can last 5 years full time, more if you have to attend part-time to pay for school, or rent. Which is true for me. I've had to cut my income to below poverty level, just so I can afford to pay for room and board from money I've saved up over 2 years. My tuition, I have to take out loans. Increasingly expensive loans. \n\nI know I'll be able to pay for them once I graduated, but there[.] this suspiciously reasonable doubt I have. \"Can I actually make it through these classes?\" It took me two years to get to relevant Engi classes and things are only getting more difficult. All those easy English and History and intro classes are spent. New students hear people like me bemoan our class load and get spooked.\n\nAnother reason is that with any sort of bachelor[.] degree, you can still get a relatively good job in a corporation. You get benefits, good pay, vacation, 401k and weekends off. You might not make as much as an in demand engineer, but you won't have to work two jobs to get by.\n\nSo basically: basic knowledge, dedication, money and more dedication. Not everyone has them."}