{"doc_id": "781", "name": "2012_10_humanities_student_major_1164_india", "namespace": "we1sv2.0", "metapath": "", "pub": "india", "title": "2012-10-humanities-student-major_1164_india.txt", "pub_date": "2012-10-23T00:00:00Z", "Sentiment": "0.206", "Subjectivity": "0.497", "Score": "16", "Upvotes": "16", "Downvotes": "0", "Wordcount": "673", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11xtcq", "Reddit_id": "c6qhae7", "Subreddit_id": "t5_2qh1q", "Commenter": "spaceman2121", "length": "3931", "content_scrubbed": "For #3\n\nI studied English in Delhi University, will finish my Master[.] later this year. After nearly five years here in DU[.] North Campus, I have a pretty good idea of humanities education in Delhi.\n\n**Quality of Education: Very High**\nI studied in the US for an year before coming back to India (went to study CS, ended up studying English), so I'm familiar with the quality of instruction in the US as well as Delhi. I can honestly say that the quality of education in DU is very high, higher than the University I went to in the US (SUNY-Buffalo). Most of my professors have PhDs from Cambridge, UC-Berkeley, Brown, JNU, etc. Many came back to Delhi after years of teaching abroad.\n\nMy college itself has some exceptional teachers, including quite possibly the finest theater teacher in the country (Keval Arora - Google him. He[.] the smartest man I've ever met).\n\nThere is little emphasis on rote-learning. My professors are extremely liberal, so liberal in fact that I've smoked weed with them in their house. North Campus, DU has to be among the most liberal places in the entire country. \n\nThe DU English program also ranks among the top 70 English programs in the world, ahead of many major Universities.\n\n**Quality of Infrastructure: Poor**\nThis is true for most Indian colleges. DU[.] infrastructure is crumbling. Most of it is antiquated. Shoddy buildings filled with hold-ridden desks, no power backup, and of course, no air-conditioning.\n\n\n**Quality of Students: Sub-Par**\nThis is one thing that has put me off humanities education in India: barring the top 10-15% of students in a class, most are dumb, ambitionless, pretentious fools. This is something which plagues humanities education everywhere, but it[.] more acute here in DU. Most subscribe to some form of Bohemian, hippy philosophy, which essentially means being lazy and talking a great deal and not doing much. It put me off humanities education so much that I rarely attended college in my Master[.] and concentrated on starting an entrepreneurial venture. \n\nThe top students, to be sure, are exceptionally well read and quite brilliant. Most end up becoming professors themselves or become civil servants.\n\n\n**Quality of Life: Good**\nA lot depends on your gender. If you're female, you should be prepared to handle all sorts of advances from all sorts of men.\n\nOtherwise, DU can be a whole lot of fun. If you're serious and studious, you'll likely find a bunch of people who are equally ambitious and serious (though that is rare here). Else, this place is crawling with people who'll hang out with you, smoke a joint with you, talk about music and movies and party 7 nights a week with you. DU North Campus attracts students from all over the country. You'll easily find people who are like you here.\n\n**Cost: Extremely cheap**\nConsider this: for my 5 years here, I must have paid a grand total of $550 in tuition fees. Getting an apartment here can be a little expensive, but you can always split the costs by getting a roommate. Since there are so many students around, there are a lot of cheap dining options. You can have a pretty good life here on around $400 per month here (including rent and tuition).\n\n\n**Overall:** If you can ignore the dumb, ambition-less students who fit into the humanities stereotype to a T, you'll fall in love with Delhi University. This place has a vibe unlike any other university in India. It[.] one of the most liberal environments I've come across in the country, especially if you find the_right kind of people to hang out with (and make friends with the professors). The professors are incredibly well read and most will go out of their way to help you.\n\nI'm not familiar with Bangalore/Pune/Mumbai in terms of humanities education, but Delhi University ranks before them on all metrics.\n\nAnother option you can consider is JNU in Delhi, which is possibly better than DU.\n\nIf you have any other questions, just PM me"}