{"doc_id": "1620", "name": "2012_01_humanities_student_major_1232_books", "namespace": "we1sv2.0", "metapath": "", "pub": "books", "title": "2012-01-humanities-student-major_1232_books.txt", "pub_date": "2012-01-31T00:00:00Z", "Sentiment": "0.304", "Subjectivity": "0.533", "Score": "52", "Upvotes": "52", "Downvotes": "0", "Wordcount": "290", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p4niq", "Reddit_id": "c3mjga7", "Subreddit_id": "t5_2qh4i", "Commenter": "rz2000", "length": "1716", "content_scrubbed": "I think Carl Sagan is an example of some of the best that humanity can do, especially when there is an all too common, mistaken dichotomy between rationalism and romanticism.\n\nConfidence that the universe is knowable and that we have the capacity to discover what it is, and how it works, is the epitome of a romantic ideal in my opinion. Yet we end up with statements like, \"I'm not religious, but I am spiritual\" sounding profound, because it is too common to think science has something to do with being complacent about what we've discovered so far rather than about optimistically building on our foundations to learn even more, and being fascinated by what lies beyond our current understanding. Enjoying ignorance and reveling in mysticism, to me, seems pessimistic and lazy, and in no sense of the term whatsoever \"open minded\".\n\nAnyway, what I see in Carl Sagan[.] romanticism isn't just a rebuke of superstition, but also the lack of dynamism that is prominent in applied sciences. How many engineering students regularly post on Reddit about their poor opinion of liberal_arts education? Bridges don't collapse because of poetic justice, and space shuttles don't work better on the backs of effective PR, but large projects are never started without the courage of dreams either. Alan Lightman has some of the best comments on the value of literature and why it has become his life[.] mission at MIT. Oppenheimer, Einstein, and many of the other brilliant greats were dramatically affected by their appreciation of all aspects of human achievement.\n\nIt would be great if the trope of pretending science is dry, and the trope of saying we need to focus on STEM subjects were both gone from the public debate."}