{"doc_id": "1571", "name": "2012_01_humanities_student_major_675_mit", "namespace": "we1sv2.0", "metapath": "", "pub": "mit", "title": "2012-01-humanities-student-major_675_mit.txt", "pub_date": "2012-01-18T00:00:00Z", "Sentiment": "0.122", "Subjectivity": "0.384", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "478", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_om5w2", "Reddit_id": "c3icjm8", "Subreddit_id": "t5_2qh3w", "Commenter": "tangomango13", "length": "2609", "content_scrubbed": "I'm a junior at MIT majoring in business, previously majoring in chemical engineering and prior to that thinking about computer science. I'll go through each of their points one by one with my views.\n\nLow focus on humanities: I agree with this. Many students look for their humanities classes to take with disdain and just want the easiest ones. If you are very into that stuff though, you can take the classes and still very much enjoy them, or take the ones that are much smaller and will only have people who actually want to be there.\n\nSelf-driven passions: I would also agree with this. It can be easy to devote all your time to schoolwork and then just want to relax the rest of the time. Personally I find that developing your non-school skills is extremely rewarding so it[.] natural to put time towards that.\n\nSleep and exercise: I would agree a lot of students don't get enough sleep. I would argue that most get around 6 hours, which is decent. It[.] really dependent on your course load and extracurricular. If you overload yourself, obviously you won't get enough sleep. I also think not enough students get exercise as I tend to see the same people at the gym all the time.\n\nSelf esteem: I certainly think I'm at a higher self esteem level than when I entered, but I didn't come in at the top of my class or anywhere near that, and I'm still not near that top either. You need to some in expecting to be among the brightest minds so you're not set up to be disappointed when you don't get straight A[.] anymore. And also keep in mind that grades aren't everything.\n\nHeavy coursework is prevalent but not always unmanageable. Time management is the key to success.\n\nSocial intimidation/inspiration: One thing I've learned is to not give a crap about what other people think. I'm perfectly happy only taking 4 classes per semester since I'll graduate perfectly on time and have plenty of time for fun and sleep as well. I see no point in taking so many classes you're going to get Bs or Cs in all of them unless you kill yourself with no sleep, so just take fewer and don't care what the masochists think. It[.] not worth it. Your happiness and sanity come first.\n\nCan't really comment on the hacker stuff.\n\nThe dorms are all extremely diverse, which is why there[.] a dorm rush so you can look for the one you really like. I have a freshmen friend who started in one dorm for the Fall, is moving into another for the Spring, and wants to try one more next Fall, so it[.] not impossible to move around to find new cultures and friends.\n\nAll in all I love MIT and would definitely regret not coming here."}