{"doc_id": "1589", "name": "2012_01_humanities_student_major_882_engineeringstudents", "namespace": "we1sv2.0", "metapath": "", "pub": "EngineeringStudents", "title": "2012-01-humanities-student-major_882_EngineeringStudents.txt", "pub_date": "2012-01-24T00:00:00Z", "Sentiment": "0.186", "Subjectivity": "0.374", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "745", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3kbo60", "Reddit_id": "c3kc3au", "Subreddit_id": "t5_2sh0b", "Commenter": "vegetarianBLTG", "length": "4110", "content_scrubbed": "Ok so first: some of my history. I started as an accounting major. My school had a 5 year program that got you an MBA, a bachelor[.], and prepped you for the CPA exam. I have family who are accountants, they make good money, good enough that money is never an issue for them. I loved that about accounting, plus I loved math and it was always my best subject. I thought I was set.\n\nJunior year rolls around, and I decide to take a year off and actually do some work in the field before getting involved with the graduate level classes. I do this and realize I can't stand doing accounting from 9-5. I just couldn't see myself doing that the rest of my life. Didn't know what I WANTED to do for he rest of my life, but could rule out accounting. So I did Liberal Arts. \n\nI had had a Poli Sci minor with my accounting degree, so when I had to choose concentrations (which are the 3 sections for the L. A. degree at my school) I chose Poli Sci, Philosophy, and LGBT studies. Each of these is equal to a minor (6 classes) and then you do 2 additional classes in one field. For me, this was philosophy.\n\nDamn, have I enjoyed getting my Liberal Arts degree. I feel so much more well rounded as a human being. I feel like I got closer to that mythical \"adult\" that every kid is supposed to eventually turn into but doesn't. I became a better reader. A better analyst. A better critical thinker. I feel so much fulfillment.\n\nI watch current events unfold and I feel like I'm able to form much more nuanced opinions about a lot of things. \n\nPlus, I met awesome people. One of the great things of having concentrations is that you're not just with this same bunch of kids for 4 years. I'm in poly sci classes. I'm in philosophy classes. I'm in LGBT classes. Sure, some kids are in the same classes with me (my concentrations do go somewhat together). But, even so, I've met people who are planning to work for the federal government. People who are going on to a PhD in Philosophy (people who just like weed; overlap may occur). Queer rights activists who have worked for the ACLU. I've made really awesome friends.  I'd recommend a Liberal Arts to degree to anyone who was thinking about getting one. They're not te shitty degrees that a lot of reddit tends to make them out to be. We don't make the [bottom 11 for unemployment by major](http://www. huffingtonpost. com/2011/11/08/the-11-majors-with-the-hi_n_1081625. html#s459292&title=Computer_Administration_Management) and if I had more time I'd show even further how it[.] not a bad degree at all. Google around and you'll see it[.] pretty good. Especially if you already have an EE degree. \n\nNow, for International Relations, I feel like I can only kind of talk about it. I've never taken a class in it and I'm not sure if my school even offers it, but when I read that, I immediately thought of my international business class that I took which essentially boiled down to \"other people have other cultures and you have to respect others if you want to make money off of them\". As far as business class, I don't really recommend them unless you NEED that diploma for either some kind of certification or a graduate program. Most of the stuff tends to be common sense and repetitive (with a couple stat classes thrown in).\n\nBut damn, I love my Liberal Arts degree. I'm not totally done yet (I graduate in May of this year) but I finish not only with an LA major, but a business minor from my former major. I've had the opportunity to discuss Plato, Socrates, Hobbes, and others led by Professors who know their shit. I've had the opportunity to study western elections and Post-1949 China on to present day with a similar atmosphere. I've gotten to read queer_theory with some of my favorite professors ever. All of this with peers who may not always agree, but who are focused on discussing these topics in a rational, and critical way. It has been an amazing experience and if you want to do it, I think you'll definitely enjoy it.\n\nFeel free to PM me with any other questions that you think of; I may have missed some stuff while retyping this beast of a post out."}