{"doc_id": "599", "name": "2012_02_humanities_student_major_52_foodforthought", "namespace": "we1sv2.0", "metapath": "", "pub": "Foodforthought", "title": "2012-02-humanities-student-major_52_Foodforthought.txt", "pub_date": "2012-02-02T00:00:00Z", "Sentiment": "0.044", "Subjectivity": "0.279", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "243", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3n4h75", "Reddit_id": "c3n4y7n", "Subreddit_id": "t5_2rete", "Commenter": "AlexFromOmaha", "length": "1475", "content_scrubbed": "FFT has a lot of the worst kind of liberal_arts fluffbunnies, and they're a bit of a repressed class on Reddit as a whole, so they tend to be a little territorial here.\n\nI can't speak to the Indian job market, but in fairness to the Western posters, there are employment opportunities for the liberal_arts. Philosophy and political science are often used as pre-law degrees. Even if you don't pass the bar, an education rooted in the idea of ethics and governance opens up positions in the corporate world, especially in ethics, compliance, and human resources offices. Students trained in language arts can find work doing journalism or public relations. art_major can learn graphic design skills, and there[.] a lot of demand for good graphic design. Conversely, astronomy is a very hard and very competitive science with limited employment opportunity.\n\nWe make fun of liberal_arts majors because there isn't a clear way towards gainful employment for everyone with a degree. My degree is in bioinformatics, so I'm employable for programming or statistics work. It[.] pretty much written on the paper. A philosophy major who doesn't know what he[.] going to do with the degree by his sophomore year can't say his degree qualifies him for much besides the generic any-degree-will-do middle management positions. That[.] nothing against the philosophy program, though. That[.] just a student who failed to apply his learned critical thinking skills in an ironic and amusing way."}