{"doc_id": "765", "name": "2012_10_humanities_student_major_954_japan", "namespace": "we1sv2.0", "metapath": "", "pub": "japan", "title": "2012-10-humanities-student-major_954_japan.txt", "pub_date": "2012-10-20T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.284", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "321", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11teap", "Reddit_id": "c6pl65k", "Subreddit_id": "t5_2qh2u", "Commenter": "i_amnesia", "length": "1785", "content_scrubbed": "I went to Waseda and my friend went to Keio at the same time, so I got a glimpse of what it was like at both places.\n\nAs far as housing goes, I got lucky with this one. I lived in the international student dormitory right across from campus, so commuting was a cinch. My friend at Keio (along with other friends at Waseda) had to live in apartments or with host families elsewhere in Tokyo, so commuting to school was a pain.\n\nI was a SILS (School of International Liberal Studies) student at Waseda, so I got to take language classes and liberal_arts classes. Just avoid the liberal_arts classes taught by Japanese professors--I took mine from mostly visiting professors and they were awesome. My required language classes were... Well, let me preface this by saying that I couldn't get into the level I actually was because of my kanji level at the time of the placement test. So I was stuck learning old grammar points for most of the year. So I was bored a lot in my Japanese classes (1 hour, four days a week). The teachers were alright, I guess. Plus we had Japanese Language Education majors come in to the class about once a week for conversation. Oh, and all of my classes transferred back to count towards either my major or graduation.\n\nMy friend at Keio was a \"Bekka Program\" student because she was a language major. She took mostly language courses, plus a couple liberal_arts classes. If I remember correctly, she got a lot out of her language classes.\n\nAs far as social aspects go... I am biased towards Waseda. The campus and surrounding area (Takadanobaba station) have a \"college student\" feel where there are lots of places to get cheap eats and hang out. Plus, it[.] on the west side of the Yamanote, closer to Shin-okubo, Shinjuku, Harajuku, Shibuya and Ikebukuro."}