{"doc_id": "746", "name": "2012_10_humanities_student_major_706_atheism", "namespace": "we1sv2.0", "metapath": "", "pub": "atheism", "title": "2012-10-humanities-student-major_706_atheism.txt", "pub_date": "2012-10-16T00:00:00Z", "Sentiment": "-0.018", "Subjectivity": "0.218", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "258", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11ky8q", "Reddit_id": "c6noak5", "Subreddit_id": "t5_2qh2p", "Commenter": "Vanilla_Cookie", "length": "1545", "content_scrubbed": "The worst case I know about personally happened to a friend and colleague in a general humanities class.  The student stated that due to their religious beliefs they could not study any artists who depicted female nudity in any of their paintings.  Of particular concern was Edouard Manet and *Olympia* specifically.  Since roughly half this professor[.] second unit test covered various realists who at one time or another had painted female nudes and since there were two specific questions on the test about *Olympia*, this of course would have required completely restructuring both the course and the test for this individual.\n\nThe professor declined to do so and suggested much as you did that they could appeal to higher authorities.  The student did this and stopped coming to class but did not drop.  Last I heard anything, the student was still trying to appeal their F in the course and was circulating a petition to have my friend fired.  This of course will go nowhere (officially anyway) but still causes quite a bit of irritation.\n\nI had a student write a letter to the editor of the local paper, which was published, referring to my \"Satanic\" characterization of the origins of the Southern Baptist Church, i. e. the split among Baptists (and other sects) over slavery.  (The area was heavily Southern Baptist.)  They were never brave enough to confront me personally, and I ignored it, though the chancellor has received letters demanding that I be fired and the course (US history intro to 1877) be removed from the curriculum.  "}