{"doc_id": "668", "name": "2012_02_humanities_student_major_764_suicidewatch", "namespace": "we1sv2.0", "metapath": "", "pub": "SuicideWatch", "title": "2012-02-humanities-student-major_764_SuicideWatch.txt", "pub_date": "2012-02-22T00:00:00Z", "Sentiment": "0.027", "Subjectivity": "0.33", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "693", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_q2518", "Reddit_id": "c3u3aio", "Subreddit_id": "t5_2qpzs", "Commenter": "SicSemperHumanus", "length": "3714", "content_scrubbed": "Hello, my fellow bipolar friend! Ain't it a bitch? First and foremost thing I need to ask is, are you receiving professional help and are you medicated? Because if the answer to both those is \"no\" my immediate suggestion is to do so. It really can turn things around, I've been at it for a while now and it[.] taken some time to dial things in but I'm really lightyears ahead of where I was a year ago. I no longer experience manic episodes (which is a bit of a bummer initially but in the long run hasn't been as terrible a loss as I thought it would be), which used to be really, really crazy for me. I need to use fingers and toes to count the number of times my manic episodes have either seriously ruined some aspect of my life or damn near killed me. Anyway, the point is that medication can bring some degree of stability to your life so that you can get your shit together.\n\nIf the answer to both those questions was *yes* though, you've got a whole nother issue. What drugs have you tried, what are you on now? Dosages? Different combos? It takes a while, believe me on that, but if you keep trying and you're honest with your doctor they can help you get what you need, they really can. If the problem[.] the doc, that[.] a bit more difficult depending on your area/financial situation, etc. Still, stick with it: the road seems long but the rewards are usually worth it (though I can only speak for myself on that score I suppose).\n\nAnd as for this dream of yours, of being a comedian... dude! You're *bipolar*! We're freakin *born* comedians! [This list](http://en. wikipedia. org/wiki/List_of_people_with_bipolar_disorder) has eleven alone all of whom are pretty top notch in my opinion, and there are loads of others. For some reason or another, bipolarity lends itself to the arts (of which comedy is an oft-forgotten form). Every comedian and artist struggles in the beginning. Every one of them, I promise you. The ones that didn't are dirty rotten liars, because this shit is not easy. But if that is what you want, if that is what fulfills you more than anything else then you've got to stick with it. After a pretty long stint as varying law/econ majors I'm finally settling in to art history and I can't tell you how relieving it is. You've got to stick to what you love and know. I know that[.] hard with bipolarity, oh hell yes it is. Those days you feel like just lying in bed and doing nothing? Those times when you sit down to write or read or whatever the hell it is that comedians do to get their stuff down but just can't? Those are the times when a) medication can be a goddamn godsend and b) you should fight hardest to do even a little bit. Even some small success out of what would otherwise be another wasted day. Looking back, it makes it a little easier to recover from in my eyes.\n\nLook, this stuff isn't easy. I know how hard life can look, especially through bipolar eyes. It[.] an absolute nightmare, it really is. But think about it, you're nineteen. You've got a lot on your own personal plate without adding on the fact that your family is dealing with a serious load of heavy shit right now. I know it[.] discouraging and painful and hard. But, I gotta tell you... this is it buddy. I don't know if you're religious or anything but I am not. As far as I can tell, this is the only life you're ever going to get. And you never know what[.] coming down the line, good or bad. And you'll never know until you see it. Suicide is tempting, but really once you think about it, it just doesn't make any sense. In death, you have nothing, no hope and no chance. You are gone, there is no you. But as long as you're alive? Well, it[.] more than death has to offer you. Think about it some."}