{"doc_id": "680", "name": "2012_02_humanities_student_major_918_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2012-02-humanities-student-major_918_AdviceAnimals.txt", "pub_date": "2012-02-26T00:00:00Z", "Sentiment": "0.11", "Subjectivity": "0.45", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "324", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3vf1nl", "Reddit_id": "c3vf74m", "Subreddit_id": "t5_2s7tt", "Commenter": "despaxes", "length": "1900", "content_scrubbed": "Discovering information. Synthesizing what I know into new knowledge.\n\nTell me friend, how do you discover new knowledge unless it is your own empirical evidence? From papers likely transcribed by hired english_major who make everything easier to understand? How do you convey your new knowledge? Through Language? My oh my, it seems everything hinges upon the humanities. All human expression is in the humanities? Wow!\n\nYes, your level of competence in the field of humanities may exceed others to the point that you would find it pointless to major it in, but you're missing the point. You are capable of utilizing the tools I research, but you don't understand them completely. It would be akin to memorizing all these formulas, and knowing when to use them all, but not knowing the proofs of the formulas or the math behind them.\n\nscience has taught me to critically think, and in a more organized and logical fashion than any English program could.\n\nHow do you know that?\n\nthat likely dumb terminology down enough for you to understand it.\n\nThanks for that assumption.\n\n trouncing my (humanities) peers on essay writing\n\nhumanities, or English? There[.] a huge difference.\n\n I actually almost wish more of my courses were discussion/essay based, as they're far easier to do. \n\nFunny, I excelled in Calculus and Chemistry. Remembering stuff is just as easy for me.\n\nIs English a very difficult major? It depends on the classes you take honestly. If you take all senior level courses straight from the start, I assure you it is much more difficult (and rewarding). If you just do what you have to. Yeah, it[.] rather easy, but not the easiest. So yes, going for the bare minimum, an English Major would have an Easier time than a  Science or Math major. This is why I said **good**.\n\nYou also seem to be suffering from some delusion that your major is somehow impossible to comprehend to others.  "}