{"doc_id": "797", "name": "2012_10_humanities_student_major_1346_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2012-10-humanities-student-major_1346_explainlikeimfive.txt", "pub_date": "2012-10-26T00:00:00Z", "Sentiment": "0.012", "Subjectivity": "0.361", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "309", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_125adg", "Reddit_id": "c6sbuii", "Subreddit_id": "t5_2sokd", "Commenter": "severoon", "length": "1926", "content_scrubbed": "In theory, a university is a collection of colleges.\n\nA college is a post-secondary educational institution that focuses on a general area of study, offering degrees with majors and minors in that area of study.\n\nTypical areas of study include: liberal_arts and sciences, engineering, journalism, music, and others.\n\nSo, if you have a post-secondary educational institution that offers degrees in just one of these areas, such as Russian Lit, Chinese, History, and Physics (these are all liberal_arts and sciences), then you have a college.\n\nIf you have an institution that is a collection of colleges, each focusing on a different area, then you have a university.\n\nWhy do this? Why not just have a single college cross boundaries between areas of study?\n\nThe theory and history behind it is that different areas of study allow students to focus in different majors, but simply satisfying the requirements for a major isn't sufficient to produce a well-rounded student. Besides focusing in a particular area of study, the student must satisfy a certain set of requirements outside that major field of study as well, often referred to as \"distribution requirements\".\n\nSo now you can see why these areas have been traditionally split up. Students that are focusing on music probably need a very different set of distribution requirements to be well-rounded than a physics student. This is why, typically, within a university a student will actually be in one of the colleges within that university, and have to satisfy the requirements for a degree (including distribution requirements) that are set by the college–not the university as a whole.\n\n[source: Having briefly pursued two degrees in two different colleges within the same university, I transferred between colleges within my university and I know all about the headache of having to satisfy two disparate sets of distribution requirements in two different colleges.]"}