{"doc_id": "697", "name": "2012_10_humanities_student_major_163_republican", "namespace": "we1sv2.0", "metapath": "", "pub": "Republican", "title": "2012-10-humanities-student-major_163_Republican.txt", "pub_date": "2012-10-04T00:00:00Z", "Sentiment": "0.069", "Subjectivity": "0.356", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "262", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6hi7ff", "Reddit_id": "c6hk1v9", "Subreddit_id": "t5_2qndt", "Commenter": "AsskickMcGee", "length": "1575", "content_scrubbed": "Your \"rant\" pretty much summed up my main complaints concerning this summary. Hurrayforzac did a pretty good job, but his political leaning seemed to make him think he needed to paint absolutely all points of this plan in a bad light, even the few decent ideas.  \n\nI actually work in academic research and can testify that losing high level scientists that *we train* to their home countries is a giant problem facing the nation. The whole \"We shouldn't give them high-tech well paying-jobs that 'Mericans want\" idea is quite childish. Take, say, a PhD-level Mechanical Engineer. The (very productive, very profitable) jobs he is qualified for (both industrial and academic) are not jobs you can just *give* to anyone. The jobs require someone with his very specific education and we don't produce very many of those qualified people per year. Taking a chunk of these people and putting visa obstacles in their way is taking an investment we've worked on for several years and throwing it at other countries. I'm not much for absolutist political slogans, but \"staple a green card to every diploma\" sounds pretty good to me.  \n\nNow you might say, \"but college graduates are having a tough time finding work! Keeping foreign graduates makes more competition.\" Theoretically, that[.] true, but the *types* of fields that are in huge supply with very little demand (Arts, Humanities, etc.) are not the sort of things that foreigners come here to study. International students swell the ranks of the science and engineering fields, and we need more and more of those every year.\n\n"}