{"doc_id": "1573", "name": "2012_01_humanities_student_major_713_srsdiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "SRSDiscussion", "title": "2012-01-humanities-student-major_713_SRSDiscussion.txt", "pub_date": "2012-01-19T00:00:00Z", "Sentiment": "-0.051", "Subjectivity": "0.326", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "299", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3istoi", "Reddit_id": "c3isy3l", "Subreddit_id": "t5_2t5sa", "Commenter": "dedaigneux", "length": "1677", "content_scrubbed": "And this is what happens when I'm sick for a week: I lose all context of what has already been said. Thanks for the link.\n\nThat[.] interesting that you understand the hipster subculture as poseurs. I've heard things like that thrown around, but I never quite 'got' it. I hang out with people who've I've been told are hipsters, and skulk around places I've also been told are hipster dens. Perhaps there[.] a regional definition that I'm missing. I live in the Southwest, not California, by the way. It seems around here that arts + left_wing = hipster.\n\nI may also look down on people because I think that a classical liberal_arts education is incredibly valuable, and find how incredibly unempathetic and ignorant the general population is about social justice matters incredibly infuriating. Of course, being told that it[.] \"worthless\" to highly value literacy and the ability to write a proper essay may have embittered me to my \"traditional\" allies of geeks. Well, they were playing D&D at lunch while I was in student council and the debate team, so I guess we both got thrown in trash cans, but never ran in the same circles.\n\nOh diesel. Another thing I'd like to be able to afford. I got a Corolla when the market fell apart for a screaming deal when the used car market was bad. I'll also stop feeling bad about 30+ mpg.\n\nI feel that I have been associated with being a hipster, and then told by the same people that I am also \"elitist.\" Perhaps, again, this is a regional thing, since perhaps we don't have enough poseurs here. Although, it[.] kind of hard to fake being working class when you actually are working class.\n\nThank you for your perspective, by the way."}