{"doc_id": "721", "name": "2012_10_humanities_student_major_364_unitedkingdom", "namespace": "we1sv2.0", "metapath": "", "pub": "unitedkingdom", "title": "2012-10-humanities-student-major_364_unitedkingdom.txt", "pub_date": "2012-10-09T00:00:00Z", "Sentiment": "0.117", "Subjectivity": "0.187", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "259", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_116psi", "Reddit_id": "c6jt60v", "Subreddit_id": "t5_2qhqb", "Commenter": "diracnotation", "length": "1478", "content_scrubbed": "University of Manchester Physics 04-08\n\n2 hrs of lecture per week for each course. For some courses, especially in later years these would be a back to back double lecture.\n\nLecture sizes from ~300 for first year compulsory to ~30 for 4th year electives.\n\n1st & 2nd year  -  1 hr per week 4 person tutorials on core moduals.\n\n3rd -   1 hr/pw 20 person workshop \n\n4th  - 1 hr/pw  workshop for each modual \n\nAll years, 2 days per week of Labs, with contact time to phd students in years 1-3, professors in 4th.  Labs worth 20 credits (2 moduals) in years 1-3, 40 in year 4.\n\nTutors and Lecturers available by email and in their offices during normal hours (10-6)\n\nWeekly non-compulsory homework for each modual (it was worth 5% of grade for year 1-2 courses).  Graded in tutorials.   Some courses had a coursework component if the lecturer wanted to set it.  These were usually 10-20% of the grade.\n\n1 group work project per year  with a research methodology angle , usually worth half a modual. \n\nMost of the course books were available at the library  but copies were limited.   Lots of handouts given in ectures, most of which were made available on-line by the lectures.  \n\nAttendance was compulsory at Tutorials, Labs and Workshops but not a Lectures.\n\n\n\nI felt all through my course that I was getting excellent teaching and contact time, especially compared to some of my friends doing humanities who got 6 hrs per week in a 300 person lecture and 1 30 person workshop."}