{"doc_id": "722", "name": "2012_10_humanities_student_major_417_nonprofit", "namespace": "we1sv2.0", "metapath": "", "pub": "nonprofit", "title": "2012-10-humanities-student-major_417_nonprofit.txt", "pub_date": "2012-10-09T00:00:00Z", "Sentiment": "0.095", "Subjectivity": "0.439", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "275", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11898j", "Reddit_id": "c6k6l6t", "Subreddit_id": "t5_2qlfy", "Commenter": "[deleted]", "length": "1542", "content_scrubbed": "This is a really remarkable thing to offer.\n\nThe non-profit I run should be relying heavily on our web presence, but we have fallen short.\n\nWe were hit very hard by the economic collapse of 2008. Since we rely heavily on foundations and grants, we did not feel the full brunt until 2009. (Our budget went down by nearly 40%.) Before money became incredibly tight, we spent a greaat deal to have a very nice website created. Unfortunately, we could not afford to have it maintained and updated. Having had it now for 4 years, we have been witness to the troubling layout and lack of access. It has certainly given us serious problems i n recent years. We could no longer afford to pay the designer to make updates and finish the areas that were discussed. We did, however, pay everything that was contracted. We are not some assholes expecting work for free. We are artists and we know the importance of paying for the art of others.\n\nWe probably would not fit into your mission, as we do not have any really heart tugging narrative. Though I will fight to the death that the arts are incredibly important to not only students, but the community at large. It raises the quality of life significantly. At a time when the Gov't has taken great pains to remove the budget for the NEA, my non-profit continues to work hard and spread the opportunities for live artistic experiences. \n\nAnyway, I applaud the work you do, and I hope you have tremendous appreciation for your willingness to help non-profits in need. It is very honorable. Thank you.\n"}