{"doc_id": "788", "name": "2012_10_humanities_student_major_1282_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2012-10-humanities-student-major_1282_AskHistorians.txt", "pub_date": "2012-10-25T00:00:00Z", "Sentiment": "0.048", "Subjectivity": "0.382", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "859", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_122iav", "Reddit_id": "c6rszzo", "Subreddit_id": "t5_2ssp3", "Commenter": "khosikulu", "length": "5306", "content_scrubbed": "Oh man, the archive.  The archive itself is an opponent.  Those of us who deal with postmodern and postcolonial studies (not exclusive categories) have to deal with the legacy of what Tom Richards and others call \"The Imperial Archive.\"  The gathering of knowledge, and its arrangement by the ruling order in a given place and time, leaves a fundamental stamp on that knowledge that affects the ways we think about what they describe and the range of narratives we pull from it.  In the imperial or colonial context this may have been stronger because the collection of knowledge and recording of government function themselves were part of the system of domination that characterized empire (See Bernard Cohn, *Colonialism and Its Forms of Knowledge* on this point).  Although I think a lot of the postcolonial/subaltern/lit-crit turn went too far (Gayatri Spivak, oi vey) the fundamental point is really hard to argue with: the archive is not objective; the records, the selection that is preserved, the location of those records, and the way they're organized, all change the way we read them.  As I work on my book revisions, I'm realizing that the colonial model of progressive change has dictated the entire way I organized the presentation as a dissertation.  I suspect that most fields have to deal with these issues in one or another manner although Africanists and South Asianists have perhaps had the starkest encounter with poststructuralism because of the colonial past and the limitations of the archives in those times and eras in terms of telling a story that the majority of the population recognizes.\n\nI work on land and geographical science before the 1940s, which has been the subject of a major push to read maps as texts and consider the subjectivity of the scientific operations that defined \"territories.\"  The literature connected to this from the history of cartography, historical geography, and modern geospatial sciences is really vast.  But it[.] an archive of information or knowledge, like any other, textual, material, or oral, and it[.] been filtered at least twice by the time the historian publishes.  Mapping is often wrong, not just incomplete; sometimes reports and maps lie, and we need to know when, how, and why.  In questions of land, what are the struggles on the local and the grand colonial scale that inform them?  \n\nLet me share a specific example of an archival \"argh,\" one that works neatly with historyisveryserious[.] (hooray Kate Beaton!) focus above.  I wanted to go through criminal cases from one of my regions and look at the criminalization of acts against property, especially trespass, in so-called \"native areas.\"  But the colony decided that only the crime and the \"bare facts\" should be preserved and they purged the transcripts themselves for anything after 1900.  So how do I find that information?  They eliminated it because the desiderata were seen as useless paper once the \"facts\" were discerned and described \"objectively\" by the court recorder, but in reality a tremendous amount of circumstantial data and telling verbiage about the meaning of property and boundaries was lost.  Oral history, newspapers, and petitions sent through magistrates that were \"lost\" during the purge era but went to the archives later, all exist to help fill it in.  But these records are also arranged based on what the magistrates thought to be important.  \"Miscellaneous unidentified papers\" turned out to be the richest repository of all!    Up to that point (and likely still), even when I was challenging colonial land policy[.] operation *I was recognizing its divisions and its rough narrative as legitimate and thus granting it a certain authority as a result*.\n\nSo how do we read through the unintended bias of governmentality?  How do we incorporate oral history, locate \"hidden transcripts\" (to borrow James Scott[.] coinage from *Domination and the Arts of Resistance*), and recover the worldviews that came into collision and generated the interactions and outcomes we're seeking to explain?  An open mind and having good reasoning behind our assessments is about the only remedy, beyond a certain expected level of comprehensiveness in our investigations.  We're going to be challenged, and reinterpreted, by those who read the archive again through the lens of their own time, no matter what we do.  \"What actually happened\" *means* something different to us than it did to the people at the time, and it will mean something different in the future, even if the basic description of the events is very similar.  Explaining the confrontation over land and livelihood today, for me, requires understanding both the way people thought about land and the ways they adapted these ideas to changing conditions.  \n\nIf that weren't enough, historians have to recognize these things, fairly account for them, **and** make the end result readable (which a huge amount of postcolonial studies literature is emphatically not).  I'm not even sure this post is readable, but maybe something got across.  I love doing archival work, and locating an important detail is rewarding.  But the archive skews our view and changes the way we see the past, just like the prevailing ideas in our disciplines do.  The truly educated, so the saying goes, never graduate."}