{"doc_id": "1580", "name": "2012_01_humanities_student_major_752_mit", "namespace": "we1sv2.0", "metapath": "", "pub": "mit", "title": "2012-01-humanities-student-major_752_mit.txt", "pub_date": "2012-01-20T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.508", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "430", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_opwwu", "Reddit_id": "c3j3peq", "Subreddit_id": "t5_2qh3w", "Commenter": "masont", "length": "2448", "content_scrubbed": "MIT '10, course VI-3 (CS) here.\n\nI think the comments in that section are legitimate, although I would take them with a relatively large chunk of salt. It is, after all, one person[.] view of what is supposed to be an intensely personal and subjective experience.\n\nI will completely and ardently disagree that MIT students, in general, have little passion for the humanities. I think one of the most exhilarating things about the MIT student body was how amazingly passionate everyone was about seemingly random things. Personally, I took several music composition classes as a part of my humanities requirements, and found it very rewarding to discuss both composition and music history with my peers. I had friends who were passionate readers, writers, performers, and just about anything else you could come up with. It[.] possible the author of the article just happened to have the wrong set of friends, but I'd just like add a dissenting opinion.\n\nYou dream of MIT probably because it[.] supposed to have the most rigorous technical curriculum in the entire world. Would you really want to show up and find out that you easily have time for a vast array of other activities? It might be true that it[.] difficult to pursue non-technical passions, but that doesn't stop us. We're also supposed to be (to a large degree) crazy people with crazy passions.\n\nWhile at MIT, I started dancing, both hip-hop and breakdancing. It completely changed me as a person, and is a huge part of my life now. It took time of course, and it wasn't unusual for me to get back to my dorm at midnight after rehearsal, take a quick shower, and finally start my coursework. I somehow eventually found a way to work about 12 hours of dance into my schedule per week. Later on, I even joined an a cappella group on top of that. I made it out in one piece, and even managed to sleep a reasonable amount. MIT provides you endless opportunities, and it[.] really up to you to take them. \n\nThat being said, not everyone has the time or energy to finish their coursework and still do something else significant. There[.] no shame in that, and I don't think it should come as a surprise to anyone that MIT is a difficult school.\n\nJessica gave a great and comprehensive answer in the linked article, but I just wanted to add another viewpoint from someone who recently graduated from MIT and spent 4 deliriously happy years as an undergraduate (and one more as a graduate student)."}