{"doc_id": "767", "name": "2012_10_humanities_student_major_994_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2012-10-humanities-student-major_994_funny.txt", "pub_date": "2012-10-21T00:00:00Z", "Sentiment": "0.088", "Subjectivity": "0.294", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "326", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11ujpy", "Reddit_id": "c6psnw5", "Subreddit_id": "t5_2qh33", "Commenter": "[deleted]", "length": "1822", "content_scrubbed": "Let[.] just end this debate once and for all, quality of ones life is determined individually, as is one[.] success in life. There are liberal_arts majors who are doing very well and engineers who can't find work. Yes the is a tendency toward engineers starting out at a higher pay, but there is a trade off on amount work and type (this coming from a guy who sits behind a desk 60 hours a week). In the same line of thinking, there are liberal_arts majors that can't get laid to save their lives and engineers that have regular sex. Engineers enhance quality of life in a global setting through gadgets, energy creation needs, transportation and life prolonging/saving technology.  \nLiberal arts majors enhance the quality of life on a more individual level through, movies, music, art and books. These are what inspire people and our greatest venues for emotion.  \nEngineers: Imagine if you didn't listen to music while working, never had any movies to watch, only had technical journals to read and never had anything to go out and experience.  \nLiberal Arts: Imagine if you didn't have the tools to create your art, if you had to write by candle light, didn't have any audio mixing software, and art supplies were not mass produced and you had to walk to get them.  \nEngineers and Liberal Artists create a symbiotic relationship together, as does every person of a society.  \nIf you let what you did in college for 3-5 years define who you are as a person, congratulations you have failed at life. I got my BS in Electrical Engineering and I was on my university improv team for 4 or the 5 years I was in school. Engineering taught me how to make a living, Liberal Arts taught me how to make a life. \n\ntl;dr: Engineers and Liberal arts_major need each other and you shouldn't let what you study define you as a person. "}