{"doc_id": "663", "name": "2012_02_humanities_student_major_693_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2012-02-humanities-student-major_693_canada.txt", "pub_date": "2012-02-21T00:00:00Z", "Sentiment": "0.088", "Subjectivity": "0.296", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "704", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3tgrbi", "Reddit_id": "c3thbts", "Subreddit_id": "t5_2qh68", "Commenter": "[deleted]", "length": "4153", "content_scrubbed": "I didn't say anything about tuition increases for Medicine, what I was talking about was the lack of openings in medical schools, and rolling out the old chestnut of \"Doctors make more when they graduate so it is ok\" is just specious\n\nActually, you didn't say anything about the lack of openings in medical schools. What you wrote: \"If you want more spaces for doctors to be trained here then consideration should be given to reversing the current system of regulating tuition. Remove the protection on liberal_arts degrees and add additional funding to expand departments that benefit society both in healthcare and technology.\" In other words, raise tuition on the humanities and use it to fund the medical school.\n\nAs for the suggestion that is unfair to suggest that because Doctors make more they should pay more, I respectively disagree. A doctor who graduates from Medical school and completes their residency is guaranteed a position. No other professional school has this, and high tuitions pay for the incredibly expensive infrastructure that medical schools require (which they need, despite the fact, that as I mentioned, they receive more ancillary funding than any other faculty).\n\n You are still ignoring that the issue isn't the cost to attend medical school, the issue is that there aren't enough facilities for more students to attend. \n\nActually, I never commented on that issue because, as I demonstrated with the quote above, you never brought it up. I would agree that a general increase in residency positions, as well as focused funding towards improving the gap in GPs, is an excellent idea. Neither of these things were brought up by you, and trying to change the goalposts of your argument is pretty unfortunate. If that is what you're really trying to argue, then don't complain about the meagre funding Arts departments receive or their low tuitions in comparison to Med school.\n\nIf you have issues with how fundraising is done for your school then I suggest you volunteer to canvas for more money for your faculty, but holding a grudge because another faculty brought in a big donor is just petty.\n\nHolding a grudge? I hold no grudge, I am just suggesting that your complaint is highly spurious. You're the one talking about robbing Arts students to pay for medical students by anguishing over the fact that they have protected tuition increases. One of us sounds bitter, and just a hint, it[.] not me. I understand and accept arts faculties won't receive the same kind of donor support, and they just have to get by. Maybe medical schools could try it some time.\n\nWhat I am suggesting is that funding should go to what will benefit society the most. I never suggested defunding arts programs, rather the opposite. Remove the regulation that is keeping that tuition artificially low and use the increased funds to expand training for medicine and technology.\n\nYou are suggesting that Arts students should have their tuition raised and have the difference funnelled towards Medicine. This is abhorrent considering many arts students struggle with a debt load already. You back it up by suggesting that Medicine has more value to society. You might be correct, which is why a Doctor makes, as I stated, an average of 200,000 a year in this country. The fact that Medical schools across the country receive more funding per student than every other faculty also backs this up. Now you want them to be subsidized by someone in another faculty in addition to the lucrative funding they already receive? \n\n At my nearest University for every medical or technical student there are five arts or social science students. Even a moderate increase could yield a huge pool of funding for expansion.\n\nThis about sums up your argument: I want the Arts students to pay for another faculty. Why don't we reverse the logic: I want a new Arts building for my University. Why don't we just raise the Medical students tuition because after all, they will be able to pay for it once they get a job? \n\nEDIT: Thanks for the downvote. It is basically a \"I just got destroyed by someone else who demonstrated I was full of shit\" admission! Thanks.\n"}