{"doc_id": "809", "name": "2012_10_humanities_student_major_1444_cascadia", "namespace": "we1sv2.0", "metapath": "", "pub": "Cascadia", "title": "2012-10-humanities-student-major_1444_Cascadia.txt", "pub_date": "2012-10-29T00:00:00Z", "Sentiment": "0.15", "Subjectivity": "0.341", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "295", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_129mjr", "Reddit_id": "c6tplvr", "Subreddit_id": "t5_2s4dh", "Commenter": "[deleted]", "length": "1789", "content_scrubbed": "**Your Candidate[.] Name:** Penny!\n\n\n**Party:** The Green Party of Cascadia\n\n\n**Political Stance:** Left\n\n**Stances:**\n\n\n**Energy:** As much alternative energy as we can do. Let[.] say, electric cars, wind power, solar power. Not a big fan of coal and nuclear, so we'll be phasing those out.\n\n\n**Gun control:** Thorough background checks, no automatic weapons. No private trading and selling. If someone wishes to own guns for personal use, that is ok as long as they have been background checked. Also, I'd like to have people go through a training in order to buy weapons so that they know how to safely use and store them. Educating people will cause many fewer accidents.\n\n**Education:** Focus on getting students jobs; areas we'll focus on will be science for alternative energy. I think more money should be going to the arts, too, especially in elementary schools, since I've noticed that many schools fail to have a variety important, creative elective classes.\n\n**Immigration:** Have them pass a simple test, and let them in. That easy. I don't have a problem with illegal immigrants; for example in the US, there are so many immigrants willing to do very laborious jobs that many people are not willing to do. \n\n\n**Representation:** Popular vote for sure. Each county/district will have representatives/senators, similar to the US government system as far as reps and senators go.\n\n\n**Monetary policy:** One regulated currency. Banks should not be big and cooporate, rather each town or county would have it[.] own smaller banks, like a credit union. I would also regulate the tax system in a way that lower and middle incomes pay a lower, reasonable rate and higher incomes pay a higher rate. Tax breaks will be easier for the lower incomes, however everyone will have to pay some."}