{"doc_id": "686", "name": "2012_02_humanities_student_major_1007_jobs", "namespace": "we1sv2.0", "metapath": "", "pub": "jobs", "title": "2012-02-humanities-student-major_1007_jobs.txt", "pub_date": "2012-02-28T00:00:00Z", "Sentiment": "0.226", "Subjectivity": "0.489", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "272", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_qam27", "Reddit_id": "c3w5k4b", "Subreddit_id": "t5_2qhnd", "Commenter": "caques", "length": "1791", "content_scrubbed": "[www. linkedin. com](http://www. linkedin. com/) I feel is under-utilized by many... not only can you see what companies are hiring, but it will also tell you if you're connected to anyone in the company so you can ask for a referral. Great site for networking & doing any sort of research.\n\n[www. mediabistro. com](http://www. mediabistro. com/) is very helpful if you're looking for any sort of design/publishing/marketing work. They also offer online courses I believe, and host networking events in various regions from time to time. \n\n[www. indeed. com](http://www. indeed. com/) I've heard a lot of good things about... though haven't used much myself. \n\nfor ny [www. nyfa. org](http://www. nyfa. org/) has a lot of listings for the fine arts/galleries... none of it is ever that exciting, but a lot of museums list openings there... as well as various schools & theaters... plus, if you're in the arts... you're desperate.  \n\nBeyond these, I've found there are generally sites similar to these (mediabistro for instance) that cater either by region or by industry. There[.] a site called [stylecareers. com](http://www. stylecareers. com/) for anything related to fashion and design... i'm sure there[.] something similar for engineering or what have you... \n\n also, it never hurts to talk to head hunters/agencies... they have connections, and if you develop a good relationship with them, it can be very helpful in finding work... repeat business is always welcome... last thing to come to mind is to know the companies that would hire someone who has your skill set and check the career section of their page if they have one to check for new openings... though... if you find the mediabistro/stylecareers of your industry, it[.] likely that most of the jobs will find their way there anyway. \n\n"}