{"doc_id": "655", "name": "2012_02_humanities_student_major_647_uofmn", "namespace": "we1sv2.0", "metapath": "", "pub": "uofmn", "title": "2012-02-humanities-student-major_647_uofmn.txt", "pub_date": "2012-02-19T00:00:00Z", "Sentiment": "0.111", "Subjectivity": "0.411", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "680", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pxcos", "Reddit_id": "c3szogk", "Subreddit_id": "t5_2s492", "Commenter": "_nagem_", "length": "3872", "content_scrubbed": "I was a tour guide for the Visit Office and have befriended plenty of new freshman over the years through the student group I was involved in, so I'd say I have a very good idea of what kind of people live in each of the dorms. But I should let you know that in the end, they'll all be fairly similar and you could find people your style in any of them, but here goes:\n\n * Bailey - Don't live here unless you plan on taking classes in St. Paul (no offense, Bailey). You'd end up taking a bus to your classes every day, which isn't the greatest system. It[.] quiet, though, and kids in Bailey become very close friends as they're usually \"stranded\" there on the weekends with the decreased Campus Connectors.\n\n * Middlebrook - There are several Honors floors here, as well as the arts floors on 11 and 12. If I had to use one word to describe Middlebrook it would be \"eccentric\". A lot of my friends lived here, and there was always something ridiculous going on, but not always something the average college kid would find fun. Stuff like Star Wars themed cupcake parties or musical chairs to dubstep, etc. The general Middlebrook crowd is nerdy/artsy, a little weird, but always interesting.\n\n * Comstock - This one is usually older and quieter students. There[.] also the Lavender house on the 6th floor (GLBTA), and several other houses based around nationality. Comstock is close to everything, though.\n\n * Territorial/Frontier - These are both freshman only residence halls, and are mirror images to one-another. Territorial gets the \"party dorm\" rep, and you'll see plenty of it there, but Frontier also has an active \"night life\" if you will. The 4th floor in Frontier is the CSE house, which is a lot like Middlebrook but more nerd culture and less artsy culture. Think more video games. They also work really hard there, and passing physics and calc is a lot easier with the study networks created on 4th Fl Frontier.\n\n * Pioneer - No carpet and no AC make this one look bad, but it[.] a neat older building and has an interesting mix of 4/2/1 person rooms. Because it[.] an old building there are a bunch of awesome hidden nooks and crannies around.\n\n * Centennial - This is nearly all one-bedroom dorms and has the most older students (it[.] still important to note that freshman will vastly outnumber the other students in any residence hall at the U, most of our students live off-campus after freshman year). It[.] quieter, and I've seen less friendships formed here than at other dorms - most of it[.] residents stick to themselves.\n\n * Superblock in general (Pio/Centen/Frontier/Territorial) - there is always a bunch of things going on here centered around freshman. Also, Centen has late night dining, which is awesome.\n\n * Sanford - This one has the best dining hall, by far. Most athletes live here their freshman year, as it[.] close to the athletics buildings (which is probably why the dining hall is so good...). There[.] two sections - Reno and Tower. Reno is the older building that[.] been renovated, and has very large rooms, while Tower is the newer building with a more typical dorm layout. \n\nGet the 14 meal plan. You won't eat it all (probably), but it[.] the one you'll want, trust me. I'd recommend a double room, as that[.] what most of our dorm rooms are. If you plan on Pio the 4 rooms are kinda cool, you'll almost always have a roommate around to talk to so you're rarely bored. Plus you get a middle shared room so you can have friends over while you're roommate(s) are sleeping! \n\n\n**TL;DR** If you're nerdy/artsy and can stand a little bit of the awkward, live in Middlebrook. If partying is your style, live in Territorial. If you'd like the older crowd around, Comstock. If you want the standard freshman experience, Frontier. If you like your privacy, Centennial. All the others are pretty similar/don't have any standout characteristics. "}