{"doc_id": "653", "name": "2012_02_humanities_student_major_628_engineeringstudents", "namespace": "we1sv2.0", "metapath": "", "pub": "EngineeringStudents", "title": "2012-02-humanities-student-major_628_EngineeringStudents.txt", "pub_date": "2012-02-19T00:00:00Z", "Sentiment": "0.221", "Subjectivity": "0.463", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "342", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pwhg5", "Reddit_id": "c3sssvs", "Subreddit_id": "t5_2sh0b", "Commenter": "bananapajama", "length": "1998", "content_scrubbed": "Try your best not to think of it as memorizing a bunch of stuff. Try to understand the arguments, the context they were made in, why they were necessary or new for their time, etc.\n\nI'm going to assume your class is divided into some kind of logical flow. You should be able to divide the material up into broad headings. What I recommend is taking a large sheet of paper and divide it into columns. For example, if your curriculum goes through an overview of philosophy from greek to modern times, you could perhaps divide it into particular eras of thinking. You may want to have separate sheets for different philosophical questions (theology, metaphysics, epistemology).\n\nThen, the rows might be something like \"important background events\" in which you might put info like the official adoption of christianity in rome. Or you might have a row like \"most important figures\" or \"most important works of writing.\" Be detailed in your answers (don't just list the works of writing, why were they monumental?), but concise. At the end of this table, the majority of the information learned in class should be reflected somewhere.\n\nNow this all very much depends on your curriculum. The skill for learning any kind of course, including engineering courses, is to pick up on the different themes. Now engineering courses tend to be easier for this: you can sort it by particular boundary conditions or flow types etc. It tends to be pretty obvious. (Essentially, this table could be thought of as the humanities version of a formula sheet.)\n\nHonestly, I find this the fun part about humanities courses. How does everything link together? If you can do a good job on this summary table (or whatever format you choose for your humanities formula sheet), I can practically guarantee you won't be sitting there the night before the exam trying to memorize shit.\n\nThen for your little 3\"x5\" note card, take one side to summarize your table, and the other side to put those details you can never remember."}