{"doc_id": "630", "name": "2012_02_humanities_student_major_366_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2012-02-humanities-student-major_366_Economics.txt", "pub_date": "2012-02-11T00:00:00Z", "Sentiment": "0.155", "Subjectivity": "0.451", "Score": "30", "Upvotes": "30", "Downvotes": "0", "Wordcount": "347", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_plbqb", "Reddit_id": "c3qadeg", "Subreddit_id": "t5_2qh1s", "Commenter": "stev_meli", "length": "2038", "content_scrubbed": "I am surprised that Brookings would fall for the self-selecting bias so easily. Individuals who graduate from college are usually the best and brightest people already when compared to those who fail to finish college or never go. Brookings is implying that these individuals receive higher earnings *because* they finish college, rather than the more likely causal analysis that these individuals finish college *because* they are the brightest.\n\nMany people may object and say - well ok, what difference does it make? I think it makes a big difference in the context that the compelling mantra of my generation is/was *just go to college, it doesn't matter what you major in.* People think that going to college is an almost panacea to a lifetime of higher earnings. That is why so many government programs and cultural pressures put an emphasis on getting kids into college.\n\nHowever, as the current economic situation reveals (more so in European countries like Spain I think), it *does* matter what you major in. Just going to college isn't enough any more if you don't learn marketable skills for the 21st century. Many countries offer a college education for free (or heavily subsidized) and while the intention was at least noble, the results show that it affects students' incentives to tackle tough majors. It creates a gross mismatch between those who demand labor and those who supply it. \n\nI know it is easy to hate on liberal_arts majors (as I myself was). If I knew now what I knew then, I definitely would have majored in something else. The problem is that we all bought into that mantra i mentioned before and when the economic crisis hit, all of a sudden it was like - *Oh by the way, you major actually matters.* I hope future generations don't make the same mistake - but its articles like this one by Brookings that maintains the status quo.\n\ntl;dr - In general, intelligent and innovative people will earn more than non-intelligent or non-innovative people. College is more likely a consequence rather than a cause."}