{"doc_id": "654", "name": "2012_02_humanities_student_major_633_philosophyofscience", "namespace": "we1sv2.0", "metapath": "", "pub": "PhilosophyofScience", "title": "2012-02-humanities-student-major_633_PhilosophyofScience.txt", "pub_date": "2012-02-19T00:00:00Z", "Sentiment": "0.095", "Subjectivity": "0.398", "Score": "20", "Upvotes": "20", "Downvotes": "0", "Wordcount": "568", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pwoiz", "Reddit_id": "c3sulfc", "Subreddit_id": "t5_2r7mh", "Commenter": "puffic", "length": "3438", "content_scrubbed": "You have a good general idea.  There are serious philosophical and social problems regarding the way we treat science.  To boil these problems down to the way we refer to science as an entity is a bit too narrow, though.\n\nAs a society, we have become increasingly aware that religion and political ideology don't offer very good guides to knowing the truth or finding value in our lives (but don't tell /r/politics I said that).  Rather than acknowledge that we can't find any abstract guarantor of truth or meaning (the problem of nihilism), we instead have decided to put our faith in capital-S Science.\n\nI think this has had some major effects on our thinking:\n\n*(1)*  We tend to view science as being more perfect than it actually is, which you touched on.\n\n*(2)*  We have dumbed science down.  In most disciplines, science has been reduced to a set of simplified principles and methods.  As with any ideology, it[.] difficult to have faith in something complicated or difficult to wrap your head around.\n\n*(3)*  We have decided that scientific progress is social progress.  We are very quick to believe that research in fundamental science pays social dividends.  When does that actually happen on a large enough scale to make it a good investment?  Don't get me wrong, guys.  I think subjects like astronomy and fundamental physics are fascinating and well worth spending money on.  But that[.] not because I believe they will somehow generate a return on investment.  These subjects should be treated like the arts and humanities: as fundamental human pursuits.\n\n*(4)*  We have applied scientific and pseudo-scientific methods where they do not belong.  For example, the business community has used economics, \"decision science\", and other social scientific methods to help us control what people do in the workplace.  Not only that, through modern marketing techniques (which have a scientific bent) we are all treated as simple model consumers.  None of this makes us meaningfully happy.  It doesn't improve our lives.\n\n*(5)*  Related to points number 2 and 4 above, we have couched otherwise good ideas in unnecessary scientific terms.  The best example of this is New Atheism (the brand of atheism most popular in /r/atheism).  They see the question of God[.] existence as a scientific one, setting up an epic God vs. Science battle.  But this is pretty obviously absurd.  While there is a scientific discovery here and there that might affect our religious beliefs, there[.] not a whole lot that scientific approaches can do to shed light on God[.] (non-)existence.\n\n*(6)*  We have denigrated other worthwhile pursuits as being less valuable than science.  These other worthwhile pursuits include philosophy, history, and the arts.\n\n\n\n**Concluding notes:**  So far I have attributed all of these problems to our society[.] growing faith in Science.  At this point I need to step back and acknowledge that there are probably other ideas and societal factors that play a role in causing these problems.  I was mainly trying to get at TherapeuticTherapist[.] original concern: Science as a deity.  A full discussion of these problems would have to be a bit more broad.\n\nIf anyone needs an example or clarification of anything I said, please speak up.  If anyone else has any other items to add to my list, please let me know.  It is in no way exhaustive.\n\nIf you had read this far, thank you!\n\n**Edits:**  Formatting and grammar issues."}