{"doc_id": "725", "name": "2012_10_humanities_student_major_465_introvert", "namespace": "we1sv2.0", "metapath": "", "pub": "introvert", "title": "2012-10-humanities-student-major_465_introvert.txt", "pub_date": "2012-10-10T00:00:00Z", "Sentiment": "0.14", "Subjectivity": "0.356", "Score": "1635", "Upvotes": "1635", "Downvotes": "0", "Wordcount": "502", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6kduyb", "Reddit_id": "c6khn0f", "Subreddit_id": "t5_2qlr2", "Commenter": "Eakin", "length": "2886", "content_scrubbed": "I think this has a lot to do with treating \"smartness\" as a one-dimensional continuum. Sure, you can measure things like IQ to get a generalized sense of one[.] overall intelligence (though even that has its own problems) but it[.] much more accurate to look at it as a collection of different skills and abilities. The brilliant writer might not be able to do simple math without a calculator. The master coder might be absolute rubbish at organic chemistry. Pick a couple dozen different skills and chances are nearly everybody[.] above average in at least one or two.\n\nWhat you're good at shapes your conception of yourself and what[.] important. You'll value the skills you possess more than is strictly accurate. Plus the more you practice at it the better you'll likely become over time. It[.] easy to see how a lot of people convince themselves that they're \"above average\" this way. \n\nEDIT:\nWow, when I originally wrote this I never expected it to garner this sort of response. Thank you all for your feedback and thoughts. I certainly don't think that what I wrote is a comprehensive or definitive guide to the nature of intelligence, nor do I think I'm the_right person to come up with something like that. I will clarify a few things.\n\n1. I only discuss 'academic' activities in my post but I didn't mean to imply that this effect was limited to just those. A professional or tradesman working in a blue collar industry might easily be as smart or smarter than the highly educated liberal_arts student. The plumber with a knack for intuitively grasping how pipes fit together and the chemist with a knack for intuitively grasping how chemicals fit together are employing something very similar.\n\n2. What do I think intelligence is? It certainly isn't how many facts you memorize, we can all agree on that. IMO, it has a lot more to do with how one applies those facts to a new situation. The intelligent person would be quicker to see connections between seemingly unrelated things, or see a problem from an unexpected angle. Of course being educated matters, you can't make the connections if you don't have the vocabulary of facts to draw upon. But the difference is that while both the educated idiot and the educated genius can recite the facts and figures pertaining to a military campaign, only the genius can look at, I don't know, schoolyard bullying and apply their knowledge of that military campaign to understand it more easily. My post was addressing perceived intelligence rather than actual intelligence and why so many people think they are above average, not whether they actually are above average or not. \n\n3. Yes, I know about Dunning Kruger. I'm not sure if it[.] a perfect fit for this phenomenon but it[.] certainly related\n\nEDIT 2:\n\nOK guys. Einstein, fish, trees, I get it. You don't need to reply to me with that quote, several dozen people beat you to it."}