{"doc_id": "634", "name": "2012_02_humanities_student_major_399_uchicago", "namespace": "we1sv2.0", "metapath": "", "pub": "uchicago", "title": "2012-02-humanities-student-major_399_uchicago.txt", "pub_date": "2012-02-12T00:00:00Z", "Sentiment": "0.107", "Subjectivity": "0.362", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "347", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pmr8l", "Reddit_id": "c3qnkm1", "Subreddit_id": "t5_2qh46", "Commenter": "magnaswimgirl", "length": "2057", "content_scrubbed": "There aren't any official activities hosted by Admissions, so the other two are right in saying that your host will be your primary source of entertainment. That said, the current students in the office are there to help you as soon as you arrive and are more than happy to offer recommendations about things to do for the evening. Just ask when you check in! It[.] highly likely that University Theater will have a show going up the weekend that you are here, so I'd recommend checking that out. Other options might include intramural sports, parties, or maybe you'll enjoy just hanging out in the house lounge and chilling with people. [Here](http://www. uchicago. edu/students/events/) is the list of events for February (make sure you view it in month format). Check out what night you'll be staying over and see if anything is happening that might interest you! It[.] not comprehensive, but it has some ideas.  Doc Films is also another option. You can see their calendar of movies [here](http://docfilms. uchicago. edu/dev/calendar/). \n\nWhat time are you coming to campus on Thursday? Or what kinds of classes are you interested in visiting? The Admissions Office has a list of classes that will be available for you for visiting, so make sure you mention that as soon as you check in. If you are interested in the humanities/social_sciences, I'd recommend trying to arrive on Thursday morning and come to the office ASAP because those classes tend to be on Tuesdays/Thursdays. If you are interested in language/science/math-y stuff, that will probably be on Friday. Regardless, as soon as you check in at Admissions, mention that you're interested in visiting a class on Friday. Whoever is there can help you pick out a class right then and give you all your information so you can just wake up, get breakfast, and go to class on Friday instead of running back to Rosenwald. It sounds obvious, but there are a shocking number of students that do that. Just my two cents from someone who did an overnight, has hosted, and now works in the Admissions Office."}