{"doc_id": "1572", "name": "2012_01_humanities_student_major_710_srsdiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "SRSDiscussion", "title": "2012-01-humanities-student-major_710_SRSDiscussion.txt", "pub_date": "2012-01-19T00:00:00Z", "Sentiment": "-0.013", "Subjectivity": "0.413", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "266", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3iratq", "Reddit_id": "c3irja9", "Subreddit_id": "t5_2t5sa", "Commenter": "butyourenice", "length": "1515", "content_scrubbed": "the thing about this, though, is that it assumes the group of redditors who hate big bang theory are the same group of redditors who actually are scientists. surely there is overlap but the community of actual career scientists on reddit is still small. while reddit does seem to appeal more to people in STEM-fields than other fields, that college sophomore who read the wiki on the LHC is not really a scientist, though he may think he knows everything there is. \n\nso that[.] who i am referring to when i say \"looking into a mirror\" - big bang theory is, as it has been called, \"smart humor for dumb people.\" and i posit that the redditors who have the bitterest vitriol towards the show are the ones who see themselves reflected in it - that is, they see people trying to sound pre-eminent in or at least supremely knowledgeable on physics when they really aren't. i don't think scientists inherently lack social skills, either - i do, however, think the plurality of the anti-humanities STEM students and young professionals who are attracted to sites like reddit, do, so again the show may hit a sore spot there. toss in the running penny-leonard friend-zone theme and more and more you start to see situations redditors hate to find themselves in portrayed in the show.  \n\ni see there are numerous reasons not to like it, and surely your reason is an understandable one. but personally, this is why i think redditors (or, i should say, \"that subset of redditors who emphatically hate the show\") hate the show. "}