{"doc_id": "806", "name": "2012_10_humanities_student_major_1403_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2012-10-humanities-student-major_1403_explainlikeimfive.txt", "pub_date": "2012-10-28T00:00:00Z", "Sentiment": "0.046", "Subjectivity": "0.283", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "789", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_128j22", "Reddit_id": "c6t3cd2", "Subreddit_id": "t5_2sokd", "Commenter": "kyrie-eleison", "length": "4539", "content_scrubbed": "Ages are approximate/typical at the start of the school year.\n\n* Age 4 - Preschool / Pre-K(indergarten)\n* Age 5 - Kindergarten\n* Age 6 - First Grade\n* Age 7 - Second Grade\n* Age 8 - Third Grade\n* Age 9 - Fourth Grade\n* Age 10 - Fifth Grade\n* Age 11 - Sixth Grade\n* Age 12 - Seventh Grade\n* Age 13 - Eighth Grade\n* Age 14 - Ninth Grade / Freshman Year of High School\n* Age 15 - Tenth Grade / Sophomore Year of High School\n* Age 16 - Eleventh Grade / Junior Year of High School\n* Age 17 - Twelfth Grade / Senior Year of High School\n\nAfter high school, you can stop schooling and join the workforce. This is especially typical of students who (at the start of 9th grade) opted to go to Vocational School. In the morning, before lunch, they'll take their core academic classes - variations of Math, Science, English and Social Studies - and then in the afternoons they'll go to a different school to study something like welding, automobile repair or cooking. Some of these vocational students also go to a trade school, where they'll earn an Associate[.] Degree, a 2-year degree, or a certification specific to their field.\n\nIf you opt for college/university, you have two options. The first is junior college / community college. This is generally a 2-year program that will either end with an Associate[.] Degree or transition to a program at a bigger 4-year college/university. If it ends with an AD, then it[.] on the student to apply to another university if they so desire. Some community colleges, though, have agreements with 4-year institutions that will allow the student to take their general education courses at the community college and then finish a Bachelor[.] degree at the 4-year. Community college is MUCH cheaper than most 4-year universities; they are also much less prestigious. (Sometimes, this step is pretty standard. It[.] becoming increasingly common in California, I believe. It[.] certainly very common in the more rural / low-income areas.) \n\nOtherwise, you can go straight to a 4-year Bachelor[.] Degree program. Generally with a combination of general education courses and courses in the student[.] chosen major (program of study), the degree is typically finished in 4 years. With the proper planning and depending on the school, program, etc., it can be done in 3. (Some high schools offer AP/Advanced Placement courses. At the end of the year, students take the AP test. If you score well enough, you can \"test out of\" certain gen-ed courses, so a new college freshman can begin their college career with a semester[.] worth of credits.)\n\nAfter college, you can go to graduate school. Some schools will offer a combined degree program, where in 5 years, you can earn a Bachelor[.] Degree and Master[.] Degree (which would usually take 6 years.) The Master[.] Degree is generally a 2-year degree. What a Master[.] can accomplish is really dependent on the field. In speech pathology, for example, it[.] required to become certified to practice, meaning the next step - the doctorate - is unnecessary, unless you want to teach at the university level. In education, teachers will often come back for a master[.] to stay current in their field, qualify for tenure, etc. The Master[.] is usually finished with a thesis, a long paper of original research, some kind of project in your field, or an intense exam. Again, it depends greatly on the field, but there[.] almost always some kind of capstone.\n\nIf you intend to pursue a doctorate (PhD, MD, JD, etc.) the Master[.] may be optional. It depends on the school; some require that doctorate applicants have a Master[.], others don't. The timeline for a PhD can be anywhere from 2 years to 7 years. Again, this depends on whether or not you got a master[.]. Often, schools will wave requirements (usually the \"foundation\" or \"survey\" courses that you'd take in the first couple of years) if you have an MA, cutting down the time to degree. Time to degree also depends on the student. I believe 7 years is the average \"get your ass done by then\" guideline. At the end of most doctoral programs, you'll have to complete a dissertation, a book-length paper. (There is some movement to changing this, especially in the humanities, with the advent of fields like the Digital Humanities, where papers are fairly secondary.)\n\nIn college, standing (freshman, sophomore, etc.) is usually based on number of credits earned. A very determined student can be a senior by their third year, whether or not they're finishing in 3. Generally, though, it follows the same pattern as high school.\n"}