{"doc_id": "611", "name": "2012_02_humanities_student_major_165_australia", "namespace": "we1sv2.0", "metapath": "", "pub": "australia", "title": "2012-02-humanities-student-major_165_australia.txt", "pub_date": "2012-02-05T00:00:00Z", "Sentiment": "0.106", "Subjectivity": "0.411", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "560", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pbwrj", "Reddit_id": "c3o5atu", "Subreddit_id": "t5_2qh8e", "Commenter": "tspix", "length": "3533", "content_scrubbed": "American teacher here, 8 years experience in primary, special ed background, and credentialed to teach high school physics - I've been investigating the possibility of moving to Australia and attempting to find a teaching position.  A couple things to keep in mind:\n\n1) There is NOT a huge market for teachers in most of the Australian states.  They frequently have a surplus of primary teachers and liberal_arts secondary teachers, with shortages in science and maths... very similar to America right now.\n\n2) They have rigorous requirements to become a teacher in Australia, including a one year preparatory program with a minimum of 45 days of supervised student teaching.   If you're looking at completing a teacher prep program in the US, make sure it meets the migration requirements.  If you're looking at completing the program in Australia, keep in mind that you will likely be considered an international graduate student, and fees will be high.  You may qualify for the Teach for Australia program (similar to Teach for America - six weeks instruction, followed by immediate placement), but I don't believe Australia will recognize that credential as proof of skilled teaching qualification/employment if you try to migrate permanently.\n\n3) As a new teacher, the job will control your life.  It definitely gets easier as you gain experience, but you'll be responsible for completing many responsibilities outside of the school day and planning good lessons and grading takes longer than many expect.\n\n4) The school year in Australia more closely matches the calendar year.  They do have summer break, but it is typically December-January (their summer).  They often have the school year divided into 4 terms (as opposed to two semesters), so there are a couple weeks off around April, a couple weeks off around June, and a couple weeks off at the end of September, in addition to the summer break (which is a bit shorter than our 10 week break).\n\n5)Starting salary is typically around $40,000, but depends on which state you're looking at, as well as public(government) vs. private(independent) schools.  This is similar to the US average when adjusted for health insurance.  My understanding is that there is universal health care, so you won't have health insurance deducted, but I'm not sure about retirement deductions.\n\n6) In my visits, I've noted that prices throughout many areas of Australia are similar to larger US cities, although in some regions they are definitely higher than US prices.  This is taking into account the current exchange rate and considering primarily food, housing, and entertainment.  \n\n7) Also, keep in mind that the Australian school system (secondary especially) is often a bit different than American.  You might want to check out this page at [wikipedia](http://en. wikipedia. org/wiki/Education_in_Australia).\n\nOverall, whether you can teach and travel comfortably in Australia will depend on your lifestyle and travel habits.  If you are happy living on a budget (possibly with roommates), and traveling as a backpacker/camping/taking public transport, then it can probably be done.  If you're wanting to rent your own place, eat out a lot, buy expensive cable/internet/phone packages, have a new car, fly frequently and stay at moderate hotels... then no, it[.] not going to happen.\n\nHowever, keep in mind, that since I'm an American who[.] simply researching the concept but hasn't actually gone through with it, it is completely possible that all of the above is entirely fucking wrong~"}