{"doc_id": "1507", "name": "2012_01_humanities_student_major_10_travel", "namespace": "we1sv2.0", "metapath": "", "pub": "travel", "title": "2012-01-humanities-student-major_10_travel.txt", "pub_date": "2012-01-01T00:00:00Z", "Sentiment": "0.166", "Subjectivity": "0.369", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "393", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3cvxv8", "Reddit_id": "c3cxc8a", "Subreddit_id": "t5_2qh41", "Commenter": "superkidney", "length": "2203", "content_scrubbed": "-not at all.  Your room is small, but it[.] easy to fit five+people in one room at any given time, and most of your time on ship will probably be spent in classes, at meals, or hanging out on deck somewhere (or at least mine was.)  Additionally, most of the time you're out in port exploring, coming back in only for meals and sleeping.  \n\n-it was as safe as anything I could imagine.  You do have the option to go exploring for yourself, and that can be as risky or as safe as you make it.  But most of the time you'll be with friends, and that[.] safe as can be, and if you're really worried, you can go exclusively on SAS-sanctioned trips which will make sure you get home safe and sound.\n\n-the only time the water was really rough was on large open-water crossings, especially around cape horn and crossing the pacific.  If you went on a voyage that focused on South_America or Europe, you'd avoid most of that.  A lot of people got sick, but most got over it within the first couple of weeks.  Even my friend who could never get her sea legs managed to get along.  The biggest swells we saw were 20 feet, crossing from Japan to hawaii.  I'd consider it a worthwile sacrifice.\n\n-The classes are pretty general ed.  There are business and literature courses and other globally-focused humanities, but there[.] very few hard_sciences.  Sometimes they'll offer voyages with a theme for Engineering or such, but they don't really have any science classes that aren't marine biology, because there[.] no room for a lab on board.  That just means that you should do it earlier in your university career, if you still can.\n\n-The money is the biggest hurdle for most people.  I paid for it by being on scholarship at my university and being a spoiled brat at the mercy of my parents.  I don't know anyone who said they regretted the financial sacrifice.  The thing about it is that even though it might cost you a significant amount of money, it gives you the truly valuable motivation and experience that very few other experiences could give you, and that most employers will value.  Plus the alumni association is expansive, with names in top-notch and innovative businesses, like IBM and Kiva microlending.\n"}