{"doc_id": "644", "name": "2012_02_humanities_student_major_554_australia", "namespace": "we1sv2.0", "metapath": "", "pub": "australia", "title": "2012-02-humanities-student-major_554_australia.txt", "pub_date": "2012-02-16T00:00:00Z", "Sentiment": "0.045", "Subjectivity": "0.386", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "399", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3s2tkg", "Reddit_id": "c3s3fwi", "Subreddit_id": "t5_2qh8e", "Commenter": "KidKenosha", "length": "2364", "content_scrubbed": " so if you miss some subject in hight school it is not big deal, just learn it by yourself and move on, if you can't do it you are not good enough for uni math level.\n\nI think you fail to understand the value-add in modern teaching. It[.] not just rote provision of information -- the Internet will provide everything you ever needed to know about calculus, say, at the click of a button. Good teachers not only present pieces of information, they help students relate those pieces in a way that helps them to see the bigger picture and how it impacts on their world and worldview. This is alluded to in the article! That assistance might be the difference between finally clicking and understanding a difficult subject, and giving up and never going further.\n\n Most other sciences don't need high level math, law, liberal_arts, even accounting, I know that some need, but anyway, what ever they teach in the Asian high school will not stop anyone from studying most sciences\n\nI don't think you understand quite how pervasive high-level maths is in modern science. You may not need more than a basic understanding of arithmetic and possibly some statistics to begin studying university-level biology, but when you start dealing with population dynamics (say) you're going to wish you'd been paying attention in calculus. Any kind of serious chemistry will involve group theory. Modern physics is almost entirely abstract maths. Even psychology needs a heavy level of statistics, particularly if you really want to see new patterns in your data.\n\nI think you are conflating the foundations of a good education with the set of skills that are strict prerequisites for you to perform your chosen career. Even if your job were to be completely devoid of mathematics, there is still value in having a good feel for mathematical concepts. For example, I imagine the GFC would have been a lot less terrible were people more cognisant of the danger they were putting themselves in, be the traders, investors or mortgagees. Not to mention numerical literacy to a level allowing sensible reading of odds relating to smoking, obesity, gambling, and a number of other potentially negative influences and lifestyle choices.\n\nAnd I am in full agreement with you that Asian education systems are badly biased against personal growth vs academic, and that this is a negative thing."}