{"doc_id": "1538", "name": "2012_01_humanities_student_major_413_lawschool", "namespace": "we1sv2.0", "metapath": "", "pub": "LawSchool", "title": "2012-01-humanities-student-major_413_LawSchool.txt", "pub_date": "2012-01-10T00:00:00Z", "Sentiment": "0.061", "Subjectivity": "0.441", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "271", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_obl3v", "Reddit_id": "c3g0q68", "Subreddit_id": "t5_2rb9g", "Commenter": "johnnymd", "length": "1591", "content_scrubbed": "this is really awful, to be honest. i can tell you're trying hard, and are trying to be sincere, but this is not going in the_right direction. \n\nthe adcomms will be offended at (as others have pointed out) how pretentious, trite, and wordy this is, and how much fluff is in here. \n\ntake out the parts where you rehash your resume. no one wants to see that AGAIN - they already have your resume.\n\nremember that adcomms are likely very intelligent and can read through the lines. are they going to believe your fanciful transformation from undedicated engineer to enlightened, idealistic, humanitarian english major? **or will they see the truth that you failed out of engineering, chose an easy major to switch into, and are now seeking the only high-paying, least embarrassing post-humanities career choice?**\n\n(sorry, but you needed to hear that. maybe it[.] not the case, but i feel there[.] a good chance it is. i was also a humanities student, FWIW) \n\ni really think you need to scrap this and start over. but here[.] where you can start with what you've got.\n\n1) remove all the poor writing (cliche, fluff, wording you think is SOOPER clever but sounds awfully overwrought) \n\n2) take from this draft a theme/narrative that you can write strongly about. (no, not that you're a humanitarian, care about others, or will influence people. those were all utterly unconvincing parts of your statement)\n\n3) write a sincere statement on that theme that doesn't include a rehashing of your resume\n\nalso, go to top-law-schools. com for many more opinions on this PS than you'll get in this subreddit."}