{"doc_id": "677", "name": "2012_02_humanities_student_major_896_iama", "namespace": "we1sv2.0", "metapath": "", "pub": "IAmA", "title": "2012-02-humanities-student-major_896_IAmA.txt", "pub_date": "2012-02-26T00:00:00Z", "Sentiment": "0.13", "Subjectivity": "0.235", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "372", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_q7kd3", "Reddit_id": "c3vde1m", "Subreddit_id": "t5_2qzb6", "Commenter": "TheCenterHolds", "length": "2323", "content_scrubbed": "I serve as a student representative on my University[.] (a top-tier liberal_arts school) admission committee and the president of the student writing tutors, so I can speak to this a bit. Although I don't actually grade the essays directly, I read dozens of them and often have occasion to offer up my comments during meetings. I'll try to answer all 5 parts of the question, but do note that I have absolutely no experience with large public school policies:\n\n1. For college admission essays, steering clear of fraud is the best policy. Far too many applicants think that \"telling the school what it wants to hear\" is the best policy; unless you're both a superb actor and writer, it[.] not. A well-written (obviously this is critical... typos are the reddest of flags) essay that speaks candidly about a formative personal experience will go much further than a similarly well-written essay about plans to save the world.\n\n2. Although my school has fairly open-ended prompts, high school counselors tend to offer their kids the same advice. Consequently, I've read something like 200 stories about \"how going on a 10-20 day mission/backpacking/hiking/climbing/out-of-country trip\" allegedly changed some kid[.] life. Most of those personal essay-memoirs are just well-decorated bullshit, but sometimes it[.] truly inspiring to find an exemplary essay written honestly.\n\n3. I'm a student senator, the writing tutor president, and I'm close to several faculty members who work for the admissions office, so I was offered the position as \"student representative\" my junior year.   \n\n4. Committees, always committees. There[.] usually the whole \"zeitgeist\" effect where a topic is chosen for its trending popularity in higher education. \"Engaged learning\" and \"leadership development\" are two prolific themes these days. \n\n5. I think this question applies more to standardized testing, but I'll answer it generally. Being a good writer is far more a talent than it is a skill. To improve your writing, read and never stop reading. Learn to \"hear\" our language, and you'll find that you writing becomes increasingly more fluid until it almost seems to flow directly from your brain to the paper without hitting too many grammatical/stylistic obstacles. \n\nI hope that this is of some help! Haha, this is also my first Reddit post... "}