{"doc_id": "753", "name": "2012_10_humanities_student_major_827_writing", "namespace": "we1sv2.0", "metapath": "", "pub": "writing", "title": "2012-10-humanities-student-major_827_writing.txt", "pub_date": "2012-10-18T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.39", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1047", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11omq6", "Reddit_id": "c6ob77i", "Subreddit_id": "t5_2qh2n", "Commenter": "Mithalanis", "length": "5566", "content_scrubbed": "Former creative writing major here.  Here[.] my experience, and hopefully it helps inform your decision.\n\nI have a BA from a private, tier one liberal_arts school.  My college focused entirely on undergraduate work, so I never had a class taught by a TA - every one of my teachers possessed a Doctorate in their respective field, or was on a track to get one.  I majored in CW, focused on poetry, but burned out all my electives on extra lit courses and fiction workshops, including the fiction capstone classes and advanced form classes.  I avoided, like the plague, all Lit Crit classes.\n\nI, personally, found majoring in CW at this school to be unparalleled in what I want to do with my life.  It taught me not only how to write but how to critique.  I must also say, though, that I apparently had wonderful teachers by comparison to what a lot of stories I hear floating around here - my professors were not grumpy, set in their ways old men who taught there was only a single way to write a story / poem - though the fiction prof was quite terrifying, and both of them were absolute beasts if you crossed them (EG, tried to cheat in their class / pass off someone else[.] work as your own).  But most importantly, it gave me time to write.  That sounds a little silly, but I mean it gave me time to *write* - do what I've always wanted to do, and dig in so that I knew all I had to do in a night was write five pages for the next day.  If it took me five hours to write those five pages, that was okay, as long as they were damn good pages.  There wasn't a time limit where I felt I had to rush to get stuff done (well, there were always deadlines, but it filled what in other classes would be used in studying - I was writing, and focused on writing, not trying to write while worrying about taking my car to the shop, affording groceries, or trying to find a job).\n\nAlso, the peer review is something that I long to find again.  My classes were small, but even in the smallest (six people plus professor, IIRC) there were more people whose job / assignment it was to read what I'd written and comment on it in an intelligent way.  That[.] six more people than I can find now, and each of them had wildly different ideas of what did / didn't belong in writing.  So not only was I reading the greats through my lit courses / writing courses, I was also reading a wide swath of writers in the same place as me, trying to achieve different things, and all with a unique, identifiable voice.  So I really had to step back and look at what was being written and why, and dig in and look at all the working parts of a given story in order to properly see why it was / wasn't working in order to talk about it.  It re-taught me to read, in a way - or, to quote my fiction prof, \"Taught me to read as a writer.\" (The first part being, \"You all know how to read as readers - you wouldn't have come this far if you didn't.\")\n\nSo, in terms of writing, it was invaluable.  My writing improved by leaps and bounds, the difference between a creek in a dinky state park and the Nile.  In terms of reading, finding new authors, being able to meet authors coming to give readings, talk to established writers about their craft, I wouldn't trade it for anything.  In years since graduating, I've gone to books on writing by authors I admire, and while many of them are amazing, none of them could have given me what my workshops did, what my professors did, and, ultimately, what my classmates did.  (Kind of related side story: the poetry majors in my graduating class were all of four people, including myself - but two of them and I went through all our core classes together.  It was amazing to see their work, like my own, go from the amateur-level to stuff that I actively looked forward to reading every week.)\n\nHere[.] the downside.  Part of the problem was that I graduated in 2008.  Remember what happened that summer?  Economic crash.  I've had a terrible time finding a job with my degree.  Someone said about all the writing jobs out there, but the problem is that a university degree in \"writing\" is different from \"creative writing\", and jobs, I've found, tend to want the former.  Basically, after spending a year doing odd jobs (painting houses, working at a Wal-Mart) for a few months at a stretch, I finally ended up fleeing the country to South Korea to teach ESL (which can be done with any degree) and did that for two years to pay off my loans.  Upon returning to America, I have, once again, found no work.\n\nSo the pitfalls are that you're really going into a corner job-wise.  You're also, as someone else said, basically getting a worthless degree without upgrading it to a Masters.  It[.] one of those jobs where if you want to teach, you might be good, but since you don't, there[.] not a whole lot out there that is remotely related to CW with only an undergraduate degree.  Frankly, honestly, it[.] up there with a music degree in terms of uselessness - along with philosophy and art, sadly.\n\nAnother problem that a lot of people have leveled at CW programs is that they tend to teach you how to write, but not what to do with your writing.  This is my case.  I learned tons about writing, but not about marketing my writing.  I didn't really know where to send stuff to try and get my foot in the door, so to speak.  However, my poetry professor did advise me to submit a poem I wrote to a fledgling journal, and it did end in my first publication.  So kudos to him.\n\n**TLDR** - I would not trade my CW degree for anything, but it  hasn't made life easy."}