{"doc_id": "623", "name": "2012_02_humanities_student_major_222_lifeprotips", "namespace": "we1sv2.0", "metapath": "", "pub": "LifeProTips", "title": "2012-02-humanities-student-major_222_LifeProTips.txt", "pub_date": "2012-02-07T00:00:00Z", "Sentiment": "0.084", "Subjectivity": "0.262", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "411", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3or2d3", "Reddit_id": "c3owshk", "Subreddit_id": "t5_2s5oq", "Commenter": "powertopeople", "length": "2361", "content_scrubbed": "This is the system that[.] used by many world memory champs as referenced in [this](http://www. amazon. com/Moonwalking-Einstein-Science-Remembering-Everything/dp/0143120530/ref=sr_1_1?ie=UTF8&qid=1328657442&sr=8-1) book (which is one of the better books I've read). Basically every number corresponds to a consonant and then you can freely fill in vowels wherever you want. So remembering 33 could be the word 'mom'. \n\nTo remember very long numbers you can use what are called memory palaces (from the book). A memory palace is a real physical place that you've been that you can walk through in your head (like your house, apartment, any physical place you can visualize). Then you place these objects that you create (via number to letter conversions) in your memory palace and walk through them in order. Let[.] look at an example.\n\nTake the number 3345568 = mmrll(sh)v\n\nSo I turn those seemingly random letters into the words: mom roll shave\n\nNotice if I strip the vowels I get my original direct number conversion: mm rll (sh)v\n\nNow - I take those three objects and place them in my memory palace as I walk through it (in my head). It helps to close your eyes and actually imagine this. So at my front door I imagine shaking hands with my mom, then I walk inside and see a roll of toilet paper on the counter of my kitchen and then turn right and see my shaven cat laying in the living room with hair EVERYWHERE. \n\nWhen I want to remember these numbers I walk back through my palace - Shook hands with my **mom**, then saw a **roll** of TP, then saw my **shave**n cat. \n\nIt takes practice to convert back and forth in real time, but it works. This also works for concepts as well. I'm in college right now and one of my liberal_arts electives is criminology, we recently had to memorize the major constitutional amendments as pertaining to criminal rights. This is a class I don't ever go to, nor do I study for. To remember the 4th amendment I pictured myself standing outside my apartment with all my shit thrown out the door by the police doing a search, there was an overturned chair that looked like a 4 - illegal search and seizure is the 4th amendment.\n\nMemorization has nothing to do with intelligence and everything to do with creativity. I study a set of slides once and never have to look at them again - it[.] a very handy skill to develop."}