{"doc_id": "1603", "name": "2012_01_humanities_student_major_1075_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2012-01-humanities-student-major_1075_UofT.txt", "pub_date": "2012-01-27T00:00:00Z", "Sentiment": "0.22", "Subjectivity": "0.411", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "572", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_oxebo", "Reddit_id": "c3lfnoa", "Subreddit_id": "t5_2rbaq", "Commenter": "uoftguy", "length": "3379", "content_scrubbed": "Hi there, 4th-year student taking majors in English and Physics here :P.\n\n1) You can check out admission requirements [here](http://www. adm. utoronto. ca/adm-awards/admissions. action). Just enter your information in the form (click \"I'm a student from outside Canada\", etc.). Since you're thinking of applying for Chemistry, you'd be in the Physical Science stream if you choose to apply to Uoft St. George. I just quickly clicked through to the information for students under the US high school system, and I read: \"Successful applicants have presented scores of at least 600 in each SAT component ... Some programs require higher scores.\" So it seems that we do take the SATs, but your scores are quite a bit higher than the minimum so I don't think you have to worry too much. A 3. 94 GPA is very competitive, for sure.\n\n2) The quality of life is pretty good! There[.] a lot to do on and around campus. A few minutes southwest of campus there[.] Chinatown and there[.] always a million places to eat there. There are a couple of pubs and bars nearby as well, though I understand you're not into the whole partying scene (don't worry, I'm not either!). And southeast of campus, maybe a 30 minute walk, there[.] a huge shopping mall. And, as others have mentioned, the gay village is nearby as well. Toronto[.] a huge and diverse city and there[.] many communities that have their own different atmospheres :P. On the campus itself there are two athletic facilities, and you pay for those with your tuition so you'd be able to make use of those. If you're into sports, there are drop-in basketball games and intramurals. There[.] also tons of clubs here you could join, ranging from choirs to magazine/newspaper committees to groups for foodies, and so on so forth.\n\n3) I think the major difference is that Canadian Universities are mostly public, whereas many US colleges are private. So, that means there[.] probably going to be more students at UofT. This can be intimidating for some, but it also means you'll probably be able to meet a lot of diverse people as well. Also, because we're such a large university, we also have a diverse amount of classes and the Arts and Science program is flexible, so you can take anything ranging from French to Classics to Physics to Astronomy to Philosophy to Sociology to Sexual Diversity Studies to Statistics to... well, I'm sure you get the point. It[.] one of the main things I like about UofT.\n\nOh, someone else mentioned engsci. I should tell you that engineering science and the Science program offered at the Faculty of Arts and Sciences (you'd be in the latter if you chose chemistry) are quite different programs. The Science program is a lot more flexible in that you can create your own schedule. Engsci is more rigid; your courses are chosen for you and you have very little choice. And of course, it[.] an engineering program so the focus would be quite different. I started in engsci, and then transferred to physics, so if you have any questions about the differences, feel free to ask.\n\nLenaro is right in that the cost of international tuition is quite expensive, but you might also be able to find some scholarships to offset that. [This link might be a good place to start!]http://apply. utoronto. ca/adm-awards/html/financial%20aid/international. htm) I know my friend from Hong Kong came here on a full scholarship, for instance."}