{"doc_id": "595", "name": "2012_02_humanities_student_major_1_metacanada", "namespace": "we1sv2.0", "metapath": "", "pub": "metacanada", "title": "2012-02-humanities-student-major_1_metacanada.txt", "pub_date": "2012-01-31T00:00:00Z", "Sentiment": "0.026", "Subjectivity": "0.396", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "333", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3mm401", "Reddit_id": "c3mnk4g", "Subreddit_id": "t5_2sh5g", "Commenter": "[deleted]", "length": "1978", "content_scrubbed": "The reality is there is a lot of antisemitism on reddit in general. [/r/canada](/r/canada) can be bad, but to get a real dose, you've got to hang out in [/r/worldnews](/r/worldnews). \n\nIn general reddit also has a hardon for Iran and arab dictatorships. The number of pro-Ghadaffi supporters in worldnews was pretty sickening. Same with pro-Assad supporters. And, of course, you'll have an article which says Israel killed a couple of Palestinian militants planting a bomb on the border wall, and it'll get 500 comments expressing the erudite opinion of 'fuck Israel,' while  an article on yet another massacre in Syria on the same day will get ignored and downvoted.\n\nIn regard to antisemitism itself, most posters in places like [/r/worldnews](/r/worldnews) have enough brains to hide behind anti-Israel sentiment. So whenever I wander over there, if I see anybody posting something that is outright antisemitic I tag them in RES. There[.] about 20-30 posters you see regularly there, that are outright antisemitic, and tend to dominate the conversation. You can learn a lot simply by following over a long period of time and taking notes.\n\nAnd to anybody who does have honest criticism of Israel on reddit, that isn't fueled by antisemitism... we'll to you I say you need to watch your allies more carefully. To use an analogy, you're like somebody who wants to change inner city gang and thug culture, and encourage more people to go to school and succeed in life... and half of the people 'on your team' are card carrying members of the KKK.\n\nI sincerely hope there aren't too many people out there who get most of their understanding of the world from this place. But the reality is it[.] like being stuck in a room packed with first year humanities students: they don't know much about the world, most of what they know is a gross oversimplification at best, and outright wrong at worst, but they're convinced they know everything.\n\nReddit is an utter shithole.\n\n/rant off."}