{"doc_id": "674", "name": "2012_02_humanities_student_major_885_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2012-02-humanities-student-major_885_AdviceAnimals.txt", "pub_date": "2012-02-26T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.546", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "352", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3vbqgx", "Reddit_id": "c3vc514", "Subreddit_id": "t5_2s7tt", "Commenter": "mrgreyshadow", "length": "2171", "content_scrubbed": "It makes perfect sense.\n\nHigh school classes don't necessitate effective learning. College classes tend to necessitate slightly more effective learning. None of these classes mean shit if you think an engineering degree is a magic box of paycheck and career, especially if you think all non-engineering study is useless. \n\nEngineering degrees are a speculative bubble that is currently inflated. A lot of you guys think that solely because you majored in engineering, you will be employed and make upper-middle class wages for the rest of your life. Right now, that[.] sort of true. In twenty years, there will be dozens of Asia-born engineers willing to work for less than you to work harder than you. If you quit learning about engineering after a BA, I guarantee you that you will be fucked one generation from now. \n\nIf you can only communicate in English and you disregard things like rhetoric or clarity because they're \"useless\" English major[.] study, you will be fucked even worse in that environment. That[.] why I said - enjoy it while it lasts. Us english_major can find steady pay in practically every business and in explaining your engineered shit to people (tech writing). If we're bilingual, we can get jobs in almost every company and government bureau doing translation and interpretation work. TESL teaching programs allow greater pay, especially in private schools and as the market globalizes. There[.] also room in academia and follow-up postgrad stuff in everything non-STEM, especially with good academic performance. We write grants and letters to beg or threaten. We get to pirate things without guilty consciences because we'll probably never patent anything. If we're excellent writers and communicators, there[.] a tiny chance we can make it in the arts. \n\nThis is all an idiot[.] pissing contest anyway. No field of academic study excludes any other, and no degree alone assures success. A lot of successful engineers and writers are dropouts and autodidacts, and a lot of seemingly well-educated people are fucking terrible at everything. The only limitation of a study is the student. That applies to every kind of study, college or otherwise."}