{"doc_id": "681", "name": "2012_02_humanities_student_major_919_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2012-02-humanities-student-major_919_AdviceAnimals.txt", "pub_date": "2012-02-26T00:00:00Z", "Sentiment": "0.12", "Subjectivity": "0.335", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "364", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3veldl", "Reddit_id": "c3vf98l", "Subreddit_id": "t5_2s7tt", "Commenter": "theskrim", "length": "2179", "content_scrubbed": "Watching this exchange unfold has been fascinating. Two things I want to add, though—because both y'all are talking past each other:\n\n1) Majors are not disciplines. Both of you are conflating the two. An English major and a biology major (as programs of study) both teach students to pay attention to certain things, to recognize patterns, to sort information. That[.] what college is for. The English *discipline*—plus the humanities in general—differs from the biology *discipline* in that it encourages different ways of thinking moreso than it values (as biology does) pure volume of experiential data—i. e., the scientific method. These are not \"comparable\" in any sense. You can do things with a novel that you can't do with a scalpel; you can do things in a lab that you can't do in a writing workshop. Plus, it[.] more of a historical accident (look up Charles Eliot) than \"natural\" that college students are required to declare their affinity to a specific discipline via the major system.\n\n2) Dyslexda, you *are* making good points, but you're also being a jerk. Stop that. What bleepingsheep is trying to say (and what I think a *lot* of students in general don't ever realize) is that the whole point of education is to liberate the individual. College-level education, if done right, should prepare you to deal with the stuff of just being alive. This is exactly what so many people don't understand about reading literature, or writing poems, or discussing why an author used a specific word: this stuff really does equip you to handle the question of what it means to be a human being. \n\nIt[.] insane how many people never quite get this. How many people devote their energies to video games and expensive pets and exotic travel to entertain themselves, how many people require political parties or military service or organized religion to acquire an identity, how many people believe that this, and only this, is the way to live.\n\nScience is an amazing force, and supplies us with ever-changing ways to increase and maintain the conditions of human life. But only the humanities—art, literature, history, and so on—can really make sense of what that life means.\n\n\n\n\n"}