{"doc_id": "810", "name": "2012_10_humanities_student_major_1445_uofm", "namespace": "we1sv2.0", "metapath": "", "pub": "uofm", "title": "2012-10-humanities-student-major_1445_uofm.txt", "pub_date": "2012-10-29T00:00:00Z", "Sentiment": "0.069", "Subjectivity": "0.374", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "402", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_12bccd", "Reddit_id": "c6tq3ca", "Subreddit_id": "t5_2rjkn", "Commenter": "carlsvision", "length": "2324", "content_scrubbed": "I am a philosophy major.  I love the breadth of the theoretical side.  You can explore anything from \"are we in the Matrix?\" to \"What would happen if I went back in time and tried to kill my own grandfather?\" to \"Do we have free will or not?\" Classes cover these topics and more -- whatever you are interested in as far as philosophical questioning goes, there is a class for it.  The faculty are extremely well respected internationally, however they are very personal.  I have only met one or two who do not insist on being called by their first name.  Many of them are young too, which is cool.\n\nMany people do not think that philosophy is at all a practical major.  To this I have two responses: First: college is not a trade school, though, each year it begins to look more and more like one as students pursue business degree and engineering degrees or computer science degrees.  There is not anything wrong with these degrees, but college is not simply about being handed a training manual for whatever field you think you might want to get into.  It is about actually acquiring knowledge, developing your ability to think, and exploring the vast arena of topics which we have delved into in our human history.  Liberal Arts get a bad rap, but they really shouldn't.  College is not simply about training for a career.  Philosophy is one of the oldest of these topics.  And it is also one of the topics which challenges you to think the most critically.  \n\nSecond: though perhaps the subject matter is not readily applicable to any career outside of academia, the study of philosophy yields many skills which are extremely valuable in real life: clear argument, critical thinking, and the ability to write succinctly.  It also teaches one to hear out the argument of one who disagrees with you.  If you can demonstrate these skills to a company or an interviewer, which you should be able to do given your practice in philosophy class, you will prove very valuable to a hiring company.  Furthermore, if you plan on going to grad school, Philosophers are routinely the highest scoring degree-earners on the GRE (Physicists, in all fairness, sometimes just edges out philosophers in math, but are no match in writing and comprehension).  \n\nWalk in the footsteps of Socrates.  You shall not be disappointed. \n\nEdit: Typo"}