{"doc_id": "1540", "name": "2012_01_humanities_student_major_458_lostgeneration", "namespace": "we1sv2.0", "metapath": "", "pub": "lostgeneration", "title": "2012-01-humanities-student-major_458_lostgeneration.txt", "pub_date": "2012-01-12T00:00:00Z", "Sentiment": "0.228", "Subjectivity": "0.375", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "481", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3gi2d8", "Reddit_id": "c3giejw", "Subreddit_id": "t5_2r40j", "Commenter": "ciscomd", "length": "2640", "content_scrubbed": "I got a student worker job when I got to university. A few months later, a very well-regarded graduate program needed someone and they asked my boss[.] boss, who recommended me because I was known for acting professionally and working my ass off. It was a much better job - the highest level student worker job - but still just a student worker job. When I graduated (May of 2011) I signed up for 1 graduate class just so I could keep the job until I found a permanent position. It looked good on my resume and helped me get into what I'm doing now: educational technology. When I got to this job, they gave me all new Mac gear (iMac, Macbook Pro, iPad2) and I'm given a lot of freedom (obviously; I'm on Reddit right now). You could make more as a business major or as a good engineer, but I personally do not think I could be happier. My job will never pay 6 figures, but I am very happy with the pay and perks. I worked my ass off to get here and now I'm going to start a masters in educational technology and make a career out of it. \n\nTo answer your other questions: I didn't do any negotiating and I'm in Arizona. \n\nLike I said, good jobs still exist, you just have to be patient, work hard, build a reputation. Do something with your time other than playing video games. I worked as basically an office assistant awhile back in an old-school office where everyone was still printing Excel spreadsheets out and then walking them over to their co-workers, who would then retype them on their own computers. They were all doing this several times a day. I don't have any formal tech training, but with just my nerd-level computer interest I built them a shared drive that shot their productivity through the roof and saved them a ton on paper and ink. It got me a great reference and a bullet point on my resume that potential employers love (shows initiative and creativity). I'm not terribly athletic but I've done a couple sprint triathlons in my spare time, and if I'm given an opportunity to talk about my hobbies in an interview, that[.] a good one. I also read a lot and can have an intelligent discussion on basically any topic that an interviewer is interested in-- that[.] part of what[.] so valuable about a liberal_arts degree: we're well-rounded. (Example: when I was interviewing for this job, I noticed a bunch of high-quality nature photographs in my future boss[.] office. Since I have a genuine interest in photography, I talked to him about photography and that helped us connect on a personal level and make the interview go smoothly). \n\nAlright, did I ramble enough? I hope this helps someone who is reading. Good luck. "}