{"doc_id": "1578", "name": "2012_01_humanities_student_major_746_srsdiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "SRSDiscussion", "title": "2012-01-humanities-student-major_746_SRSDiscussion.txt", "pub_date": "2012-01-20T00:00:00Z", "Sentiment": "0.119", "Subjectivity": "0.449", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "553", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3ititg", "Reddit_id": "c3j1oc5", "Subreddit_id": "t5_2t5sa", "Commenter": "dedaigneux", "length": "3085", "content_scrubbed": "I apologize if what I originally wrote came off as a hatred of hard_sciences. I make a living in web development, so I'm hardly purely artsy and contemptuous of technology and industry.\n\nWhat I mean is that there seems to be a social push now towards valuing geeky pursuits, but not a parallel validation of artsy or \"academic\" pursuits. Majoring in Engineering or Mathematics was a mark of a being a geeky loser a couple of decades ago, now it[.] a badge of accomplishment. However, english_major (or philosophy_major, like moi), get this stink of liberal elitism, viewed as a useless parasite on the vast economic engine that is our proper society. I haven't seen a convincing rebranding of the liberal_arts. Especially if you study things like Gender Studies or a 'dead' language like Latin, god forbid.\n\nThis may be colored by my working class background. Perhaps it[.] more acceptable to go into the liberal_arts if your parents are wealthy. Mine certainly were not.\n\nAt the risk of lowering myself to this level of self-aggrandisement, my bookshelf...\n\nI am aware that it comes off as self-aggrandizing, but as someone who makes my living in the book industry, I care deeply about the books I own and find a lot of self-validation in them. I am aware that my love of books is a bit extreme from the outside. I don't take pride in my books because other people don't have them (okay, I do for the collectible ones, since that[.] why they're collectible), I take pride in them because I love books.\n\nI'm hardly a Marxian, but I can almost guarantee you I've read more of Marx[.] writing than you have.\n\nWait, you said you were a physics/economics major? As a philosophy major that did an honors thesis in Hegel and Marx and assisted in student research on Marxist Feminism, I *highly* doubt that. Although I have no doubt you know far more about physics than I do.\n\nand an athlete to boot\n\nI was in varsity dance and softball in high school, I don't have anything against sports.\n\nare these assumptions you would make about people like me just because we don't choose to major in liberal_arts. \n\nI make these assumptions of people who bag on the liberal_arts. People that say to me things like knowing how to write a coherent paper that is over five pages long (don't laugh, I know people with graduate degrees who never wrote more than that) is useless... well, I tend to assume that since they think it[.] useless, they didn't bother to learn how to do it. I don't spend my time doing things I think are useless, so I gather most people do the same.\n\nThe mark of a genuinely intelligent person is one who is able to recognise the importance of ideas beyond their own sphere of expertise, rather than simply dismissing that which is outside their bubble.\n\nFunny that I'm reading this as if you insinuate I don't. That[.] not what I meant, and I apologize if my original post insinuated as much. I actually *completely agree* with you, because I'm contemptuous of people who bag on me because I couldn't get past Calculus 2, but spent a year of my life reading Feminist Marxist theory."}