{"doc_id": "619", "name": "2012_02_humanities_student_major_206_cscareerquestions", "namespace": "we1sv2.0", "metapath": "", "pub": "cscareerquestions", "title": "2012-02-humanities-student-major_206_cscareerquestions.txt", "pub_date": "2012-02-07T00:00:00Z", "Sentiment": "0.16", "Subjectivity": "0.434", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "331", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pe0b8", "Reddit_id": "c3oqf9y", "Subreddit_id": "t5_2sdpm", "Commenter": "zmilts", "length": "1934", "content_scrubbed": "I have a secret to tell you, most large universities offer a VERY personalized classroom experience in classes that actually matter.  At WVU (a university with 26,000 when I graduated) I had no more than 20-30 people per class once I hit junior level core classes.  My senior level classes had maybe 10 and my Master[.] classes often had the minimum required of 5.  Sure, my anthropology class was over 150 students, but what CS major wants personalized attention in a class like that?\n\nThe whole \"large universities don't offer personalized classes\" bit is a lie.  If you are really serious about pursuing a career in computer science, a liberal_arts school is probably not your best bet, unless money is a legitimate concern (which unfortunately it is for most of us :().  While I don't think the college really matters all that much, a LOT of HR people will unfortunately not be able to see past that.  Everyone here is correct though, that unless you are looking for some break-neck top of the line think tanks (like Google, Microsoft, Facebook, etc), your college of choice after 2 years in the industry really doesn't matter (depressing, right?)\n\nAlso, you need to be sure you know what you what with Computer Science.  Computer Science, at its core, doesn't really have anything to do with actually programming.  While most computer programrs are probably computer science majors, you could have a career in Computer Science and never once use a compiler.  In most of my higher level classes, we almost never had to actually write compilable code.  At the most it was pseudo-code.  It was more about thinking about creating an efficient algorithm to solve a complex problem.  Also a lot of graph theory and NP-Hard problems :).  Your mileage will vary depending on college of choice, though.  So you'll have to make sure you like that stuff too, at least enough to grin and bear it while you also get your programming classes."}