{"doc_id": "808", "name": "2012_10_humanities_student_major_1434_cork", "namespace": "we1sv2.0", "metapath": "", "pub": "cork", "title": "2012-10-humanities-student-major_1434_cork.txt", "pub_date": "2012-10-29T00:00:00Z", "Sentiment": "0.288", "Subjectivity": "0.344", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "289", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_129ep9", "Reddit_id": "c6tj0yz", "Subreddit_id": "t5_2rl9n", "Commenter": "oisincotter", "length": "1516", "content_scrubbed": "I don't go to UCC but all my friends do and from what I know it[.] a very good university. The arts program is one of the best in the country but arts is seen as a 'waster' degree but that[.] a load of shite. UCC is the second best university in ireland by rankings and it does well in global rankings too. I'd recommend it. I wish I went there but they didn't offer the course I wanted.\n\nAs for Cork. It[.] a hell of a lot cheaper than Dublin and if you spend a bit of time looking around you'll find cheap places to shop for what you want. I recommend aldi, dealz, and tesco as well as the English market.  \n\nForeign students are usually advised to live in student accommodation to be close to college and also have the support of the staff there in case they come across an issue. I know in my university the campus accommodation staff are very helpful to foreign students. It[.] also easier to live on campus, looking for a house can be stressful. Plus UCC is very close to the city center.\n\nIt[.] quite small but full of rich history and culture. It[.] always abuzz with plenty stuff going on, especially if you're interested in more cultural things in life. There[.] good museums, good theatre and good film. Not as good as it used to be but still quite good. If you're into food Cork is amazing with loads of good restaurants and markets. It[.] my favourite city I've been to for food.\n\nIt[.] also easy to get to other parts of the country from Cork and you can fly to most of Europe from Cork Airport quite cheaply."}