{"doc_id": "786", "name": "2012_10_humanities_student_major_1255_debatereligion", "namespace": "we1sv2.0", "metapath": "", "pub": "DebateReligion", "title": "2012-10-humanities-student-major_1255_DebateReligion.txt", "pub_date": "2012-10-25T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.258", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "244", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_122382", "Reddit_id": "c6rnhs0", "Subreddit_id": "t5_2snuc", "Commenter": "Mayniak0", "length": "1433", "content_scrubbed": "To Atheists: Are you smart enough to be an atheist? \n\nFrankly, this sounds like an attempted insult, and quite arrogant too. If that was not your intention, I would suggest rephrasing it. To answer it though, yes, I would say so. It doesn't necessarily require being smarter than others to be atheist, but as I am not accepting unproven and unsupported claims concerning the existence of a god then I would say I am definitely more logical, at least in this area.\n\nHow would you respond to [1] this video by John Safran?\n\nI'll try and break it down.\n\nPeople smart enough to understand science...\n\nI don't understand everything in science, atheism requires no such thing. All it requires is that you not accept some very specific claims, or whatever reason.\n\nYou're a humanities student with an arts degree...\n\nThis doesn't apply to me. I'm a mechanical engineer.\n\nIf I come over to your house right now...\n\nThat[.] creepy...\n\nwhy the big bang theory is more rational than genesis...\n\nAgain, atheism doesn't require that knowledge, nor does the big bang theory necessarily relate to atheism in any way. I probably could work my way through a reasonably acceptable explanation though, at least for the occasion.\n\nBought a copy of Stephen Hawking[.] Brief History of Time...\n\nI haven't purchased on personally, but my Dad did way back when...\n\n... on page three...\n\n... and I did finish it.\n\nUntil next time, go to hell...\n\nIsn't that nice."}