{"doc_id": "762", "name": "2012_10_humanities_student_major_929_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2012-10-humanities-student-major_929_politics.txt", "pub_date": "2012-10-20T00:00:00Z", "Sentiment": "0.144", "Subjectivity": "0.426", "Score": "37", "Upvotes": "37", "Downvotes": "0", "Wordcount": "885", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6p53ty", "Reddit_id": "c6p7m4e", "Subreddit_id": "t5_2cneq", "Commenter": "[deleted]", "length": "5667", "content_scrubbed": "You've missed my point a little bit.  Or I've explained it poorly (seems silly to blame you for my opaque writing).  *I* don't expect rapists to be revealed within a 30 minute interview.  But, in a way, the college does, and, even more accurately, our society does.  These people admitted to the very top schools are supposed to be the best and the brightest among us, right?  Consider the following:\n\nI'm not suggesting that Amherst[.] application system itself is problematic but reaffirming arl5240[.] astute point that a huge part of higher education has traditionally been about \"character.\"  When somebody in the 1920s talked about a \"Harvard Man\" they were talking about a set of stereotypes and cultural iconographies *very distinct* from whatever classes said \"Harvard Man\" may have been taking.  There was something \"special\" that it meant to be a \"Harvard Man,\" which supposedly indicated to others that you had some unique claim to positions of political/ social/ financial power, etc.  And it wasn't limited to Harvard, by any means, I'm just using that as an example.  Any prestigious New England academic institution was similarly situated.  Even prep schools.  Ever seen School Ties?  Scent of a Woman?  That[.] the kind of culture that I'm talking about.\n\nIf this notion seems antiquated, that[.] not necessarily because these kinds of values have necessarily been scaled back, but only driven underground into a kind of hidden systemic elitism still very much present at Ivy-League-Caliber Institutions (and here I don't mean only or literally the \"traditional Ivies\"... since schools like Amherst and Williams would very much be a part of this tradition, and Brown, for instance, might not be), but really the entire college world to a much lesser degree.\n\nThere is a valid reason why upper division institutions have every reason to consider such a seemingly abstract and divisive notion as \"character\" in their admission processes and post-graduate culture.  As was examined in a recent episode of This American Life, \"soft skills\" including self-discipline, sociability, attentiveness, organization, optimism and other far more subtle social intelligences-- soft skills tend to be a far better indicator of ultimate lifetime success than either \"crystalline knowledge\" (the sum total of actual facts a person knows) or \"fluid knowledge\" (a person[.] general capacity for abstraction/ intuitive understanding/ accretion of new knowledge).  What is meant by \"ultimate lifetime success\"?  Almost any traditional measure finds that \"soft skills\" are inextricably bound up with high performance: pay scale, familial success, self-measures of happiness, independent measures of happiness, or even likelihood to not spend time in jail-- all of these are statistically linked to high soft skill permeation.\n\nThis is a big reason (read: a huge reason) why colleges are interested in much more than their applicant[.] raw test scores: extracurricular activities, club and class offices, volunteer work, teacher recommendations, and, increasingly, peer reviews-- all demonstrate that the student is more than a data-filled computer but a \"real and well-rounded person,\" by which we mean somebody capable of working well with others, well-liked and respected by others = Socialized.  This person is Socialized enough to attend this institution successfully without either disrupting others or cracking up and dropping out halfway through.\n\nAnd successful graduation of the \"traditional college experience\" in which one lives, works, plays, and learns/ creates with others is similarly intended to represent much more than simply the knowledge that outlines its borders.  In a manner reminiscent of Ancient Greece, the classic \"college experience\" is \"citizenship training,\" and, more than anything else, this is what your bachelor[.] degree symbolizes.\n\nAnd yet... the most socialized... the most \"civilized\" members of society created by this higher education system have been the architects of countless wars, the toxic asset crisis, every kind of evil and terrible politics and legal scheming in the country.  The proliferation of rapists and rape cover-ups in institutions of higher learning is only one of the many examples of Ivy-league mythbusting.  Study after study demonstrate that these Harvard and Yale alumni CEOs of huge financial firms would qualify as sociopaths or narcissistic personality disorder sufferers in every sense but one: their personal and public success.\n\nThis presents us with a tremendous tension or conflict: if the best of the best of the graduates of these institutions often turn out to be the worst of the worst in terms of *actual* moral character, either our colleges are picking the wrong people to turn into our future leaders... or the college experience itself is profoundly damaging them.  The truth is probably a bit more nuanced than either of these choices, but the stakes are very clear.  If this kind of thing *is* happening regularly at our most beloved and respected institutions, if its happening at higher rates here than throughout other institutions or in the population as a whole (as she suggests in her essay) something is horribly wrong with our student bodies (pun not-intended).\n\nSo, no, you're right, Amherst[.] system isn't broken, most likely *the whole system* is broken... but Amherst doesn't want to be the one to admit that, do they?  For them to say (as another liberal_arts institution did in the early oughts) \"everyone on our campus is a potential rapist\" would be to undermine their implicit understanding of their supposed role in our society: cultivators of our best and brightest citizens."}