{"doc_id": "1513", "name": "2012_01_humanities_student_major_106_iwanttolearn", "namespace": "we1sv2.0", "metapath": "", "pub": "IWantToLearn", "title": "2012-01-humanities-student-major_106_IWantToLearn.txt", "pub_date": "2012-01-03T00:00:00Z", "Sentiment": "0.067", "Subjectivity": "0.388", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "437", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_o1w5m", "Reddit_id": "c3drl3j", "Subreddit_id": "t5_2rjo5", "Commenter": "dan_w_l", "length": "2513", "content_scrubbed": "I was inspired by Kastman Breuch[.] work on post-process pedagogy (see her \"Post-Process \"Pedagogy\": A Philosophical Exercise\", 2002). I'm a graduate teaching instructor in composition, so this might not be entirely applicable. But the idea is to create a dialogic atmosphere in the classroom. It stems, maybe, ultimately, from Paulo Freire[.] Pedagogy of the Oppressed and other works, which I also recommend. \n\nOn a more practical, day to day basis, the best things I learned were to dress well so the students respect you, hand back graded material as soon as possible (they love this - if it[.] within a week they'll think you're a superhero), don't be afraid to talk to them about their interests at the start of class (\"how[.] everyone doing?\" or \"how are your other classes going\"). I also like to do an informal evaluation with questions like: How could I make this class better? What would you like me to do differently? sometime within the first four weeks. \n\nMore than anything, try to throw away your notions of what a \"teacher\" is. This has helped me the most. Students don't like \"teachers\". They've been yelled at by them for years, come to fear them, hate them. Just be a person. A good person, a nice person who can help them become better people, better thinkers. \n\nDon't be afraid to say you don't know something (my electrical engineering students obviously know more about thorium reactors than I do, and I don't mind this, because in turn I can tell them about Greek philosophy and other humanities funsies) or to have someone look up facts in class. There[.] no reason to not know anything in the digital age. \n\nThis is just a big ramble, now, but I like to think of my class sessions as dialogues, exchanges, rather than that tired old \"I'm going to transfer my knowledge to you\" experience. I was shy at first, but I realized it was so much more effective to just talk rather than lecture.\n\nOne last bit: proxemics are key. That is, students are much more willing to participate when they're sitting in a circle, facing each other, away from desks or tables. Have them re-arrange the room, get up, move around, talk to each other, know each other by name. And know them by name. In a university setting, you might be the only teacher that knows who they are. \n\nPowerPoints: never. YouTube videos, on the other hand, if you have a projector or the necessary technology, are a blast, keep everyone interested, and add the dimension of multimodality to the classroom which is always appreciated. "}