{"doc_id": "633", "name": "2012_02_humanities_student_major_390_cscareerquestions", "namespace": "we1sv2.0", "metapath": "", "pub": "cscareerquestions", "title": "2012-02-humanities-student-major_390_cscareerquestions.txt", "pub_date": "2012-02-12T00:00:00Z", "Sentiment": "0.225", "Subjectivity": "0.334", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "327", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_plils", "Reddit_id": "c3qlkwv", "Subreddit_id": "t5_2sdpm", "Commenter": "[deleted]", "length": "1905", "content_scrubbed": "First of all apply to the best schools. Don't worry about money, most ivy[.] and ivy level educational programs will make damn sure you don't have loans. I wish I knew this before I started at a CC but if anyone says \"Go to state it costs less.\" Laugh in their face. The high tuition is a tax for rich students to pay so poorer students don't have to. \n\n[list of noloan schools](http://talk. collegeconfidential. com/parents-forum/452165-master-list-no-loan-no-income-income-limit-colleges. html)\n\nFrom there filter through the schools that have noted good CS programs. Use something like the US Rankings but keep in mind how subjective those rankings are. Number 1 probably isn't that different from number two, which isn't that different from number three. \n\nJust find something on that list you like, has programs you like, and that you can probably get into. \n\nFrom there identify your local state performers. State schools accept CLEP more often and being willing to study for an exam for credit can get you a degree in business IT. I know it[.] not Comp Sci, but keep in mind that if you can get business IT BA by gaming the online colleges that accept credit for exam then you can get your humanities, social science, and basic math and science out of the way. You probably won't do it. That[.] okay, but be aware that you can wipe out two years of tuition right now. The reason you want to be in a State School briefly is unlike the ivy[.] they don't have bankroll'd pockets. While their sticker price is lower, their scholarship system is nearly a lottery except it[.] a lottery with *very little money*.\n\nAll that said, Computer Science is a great choice for a major right now. Even if you get saddled with loans, if you intern, work on an app or two (doesn't have to be awesome, you're just signaling \"self starter\") you can take care of student debt without much difficulty. \n\nGood luck and godspeed. "}