{"doc_id": "1584", "name": "2012_01_humanities_student_major_836_exmormon", "namespace": "we1sv2.0", "metapath": "", "pub": "exmormon", "title": "2012-01-humanities-student-major_836_exmormon.txt", "pub_date": "2012-01-23T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.262", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "837", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_osxi1", "Reddit_id": "c3jxqoe", "Subreddit_id": "t5_2r0gj", "Commenter": "[deleted]", "length": "4582", "content_scrubbed": "Congratulations! You have been in a socially-constructed prison your entire life and you are just now becoming aware of the walls. I have been directly in your seat, and I must urge caution. You have just become aware of your situation. The next step is self-awareness. These are good things.\n\nQuick version: **Keep your head down, focus on school, focus on a graduation strategy that gets you into college with as much non-parental support as humanly possible. Things are not as scary as I am going to make them seem.**\n\nThere are 3 more years left on your sentence. But it[.] not a true prison; you have a lot of leeway about how you spend your time and how you prepare. Use this time wisely. The LDS Church, as silly and contrary as it is, is the least of your problems. The problem is when you get *out*. The Church lifestyle has a plan for you. A very **specific** plan. And in order to deviate from this (not go on a mission and then immediately get married), you are going to need to become your own support. The support you have now may drop out from under you as soon as your plans unfold.\n\nFollow along for now, but what you need is an escape strategy. You have time to formulate one. A sequence of events that leads you towards the greatest chance of success and personal liberation.\n\nI must urge you not to rebel too much while you are still at this age; the amount of legal control and authority your parents have over you as legal guardians is startling. I know this first hand. A non-adult has few rights, and most of those can be taken away or pushed to the side with few repercussions. Mostly because there is no one of any authority to speak on your behalf. Be aware of what a Guardian Ad Litem is. You may never need one, but you should be aware of your right to one and how you can get one should you need it. They're basically lawyers for kids. Wiki it, find out where they can be found in your area. That would have saved me six months of my life at age eighteen had I been aware of their existence.\n\nThe most important thing you can do right now is secure good grades. Do well in school; use tutors if they are available. Use the internet, find resources. College is going to be your best strategy. I'm going to get a lot of flack for this, but my personal recommendation is to find a list of the highest salaries and highest job demand by-degree and then pick one of those fields. I picked Engineer, *late* in life. I'd be rolling in yachts if I'd have made this decision earlier.\n\nWhy Engineer? Why not 'my dream job'? The truth is, your degree is largely irrelevant to most jobs. They care that you have one. But a high-profile degree opens more doors than a ho-hum degree, *and they cost the same amount to complete.*\n\nI went to college to become an artist. Liberal Arts sort of degree. More or less complete rubbish, as I would later learn. I did not finish this degree, and after I left I self-taught myself more than I had ever learned at the institution. Had I aimed for Engineering (which I am now), it would have cost me the same amount of money while giving me a broader degree I can use more places. It gives you a valuable degree for the same cost as any other.\n\nNo where does it say you can't be an Engineer and a Painter. Engineer and a Musician. Engineer and whatever you want to be. Bob Ross was a Drill Sargent. Bob Ross. Drill Sargent. Yelled at soldiers all day; told them to get in line and dust off their shoes. Happiest guy you've ever seen on PBS. Happy little trees. That guy.\n\n'What you do with your life' and 'how you managed to end up there' have almost nothing to do with each other. You want to maximize your ability to fulfill your dreams when you get the chance. Can't get a job in your field? You'd be a stones-throw away from a residential electrician[.] job. Down economy? No one[.] building houses? Work in a production job using the CAD-CAM stuff you learned as part of your major. Still not enough? Program database backends using the computer half of your degree.\n\nPlenty of options. All the while, you spend your free time painting or writing a novel or scheduling gigs with your band.\n\nI'm starting to ramble. This hits a little close to home for me and I'm having trouble collecting my thoughts. [This is a post by mithryn](http://www. reddit. com/r/exmormon/comments/ofqrb/need_some_fellow_exmo_lovesupport/c3gw7x4) that is excellent advice that I recommend you follow. It'll contradict a bit of what I've said, getting yourself a 'useful' degree rather than your dream degree, but I assert that it is still sound advice."}