{"doc_id": "707", "name": "2012_10_humanities_student_major_254_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-10-humanities-student-major_254_AskReddit.txt", "pub_date": "2012-10-06T00:00:00Z", "Sentiment": "0.098", "Subjectivity": "0.281", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "933", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6ip8xx", "Reddit_id": "c6iss97", "Subreddit_id": "t5_2qh1i", "Commenter": "noworryhatebombstill", "length": "5710", "content_scrubbed": "I didn't realize universities were awarding degrees in \"socialism!\" Barack Hussein Obama really has sunk his Red little claws deep into the beating heart of American education, huh? ... I kid, I kid.\n\nFirst, some points of clarification. One, I'm not going to bother addressing the economic value of arts, humanities, & social_sciences (AHSS) degrees. The career prospects of graduates or the degrees' sale-ability to employers is a discussion to be had elsewhere. Second, while I'm sure there are universities where you can pass Intro Sociology by weakly dribbling saliva onto the exam page, I am discussing *rigorous* instruction in the liberal_arts. We're talking about departments that take their educational duties seriously instead of those that shuffle anti-intellectual Division I jocks back onto the field with Bs. So... think of a freshman seminar at Swarthmore, not a massive lecture that meets once a week at Generic State University. Finally, just as I don't advocate a STEM education that lacks meaningful AHSS credits, I also don't advocate an AHSS education without any solid instruction in hard_sciences and mathematics. To sum up, I'm defending the classic, strenuous, diversified liberal_arts education as an intellectually critical tradition.\n\nWith that out of the way, the first thing that jumped out at me about your post was that you singled out Writing as a defensible degree among the humanities and arts. This was curious to me because a humanities or arts education *is* an education in writing. In my pursuit of a History B. A., my professors put my prose through its paces. They assigned everything from descriptive paragraphs to 75-page, thesis-driven, annotated research papers. I attended writing workshops, edited the essays of my classmates, and spent hours in my adviser[.] office discussing how best to compose my arguments. I didn't just write within my field, either. My college required that we demonstrate proficiency across disciplines. So I wrote chemistry lab reports and newspaper op-eds. I wrote summaries of archaeological data. I wrote in APA and MLA. I wrote flowery creative scribbles you'd no doubt dismiss, but still I wrote them. I wrote *a bare minimum of* 15-20 pages a week every week for four entire years. Sure, history was the *topic* of most of my writing, but the writing itself was the bread and butter of my education. \n\nIf you value a world filled with competent expository writing, then you value the liberal_arts. To the next point!\n\n Why is it ignorant to dismiss the humanities and the arts? What demonstrated intellectual value is there in any art degree? Or any humanity degree? Or any social science degree, except psych, socialism, law or economics?\n\nThis is a planet filled with humans who live in societies. You are a human who lives in a society. I am too. So is everyone either of us has ever known. Every bawling *homo sapiens* who has ever thundered out of her mother[.] vagina into the dirt of this earth is a human who has lived in a society. The apparatus that you are currently using to contemplate our discussion-- your brain-- evolved, was wired, and operates within a society. Human society is as much a part of us as carbon or water. We can't even begin to understand ourselves, our thought processes, and the world we live in until we begin to study humans and society.\n\nYou evidently agree, to a point. You see law and economics as fields with demonstrated intellectual value. Presumably, this is because they are pragmatic and directly applicable to the every day. You need law to administer a government. Economics can help us sensibly regulate our material lives and exchanges. Given this, I get that many humanities degrees do not appear as immediately practical. \n\nBut you're missing something important. Just as engineering and hard_sciences are supported by a scaffold of math, law and economics are girded with philosophy and history. You simply cannot seriously study the applied fields (STEM or AHSS!) without a formal and rigorous background in the theoretical underpinnings. Law makes no sense if you do not understand how our form of government came to be and is justified. If you have no acquaintance with Locke, Hobbes, Montesquieu, Plato, and a host of other philosophers, good luck making accurate heads or tails of *any* Supreme Court decision! You're equally up a creek if you try to develop economic strategies without being aware of similar historical situations. Even more basically, you can't collect data about trends over time unless you're familiar with the kinds of financial records that prevailed in the past or the wars and socio-political events that might affect your conclusions. \n\nYet we don't just need students of history who major in Pre-Law. We need some individuals who will go on to specialize in history itself. Just as innovation in pure mathematics gives the applied sciences more intellectual tools, specialists in history and philosophy create the arguments, paradigms, and methodologies that trickle down into the applied humanities. Aside: I recently read an interesting book on the relationship between political philosophy, law, and politics called \"The Forum and the Tower\" by Harvard Law professor Mary Ann Glendon. If you're interested in an expanded version of my above argument, I'd recommend it. \n\nSince I've already written you a book, I'll end it here for now. I do have one other very important point about the need for humanities in a positivist, materialist, scientific society (it has to do with fundamental epistemological fuzziness and the importance of deconstruction), which I'll address if you're interested. But if you just want it in one word: Foucault. \n"}