{"doc_id": "1548", "name": "2012_01_humanities_student_major_507_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2012-01-humanities-student-major_507_college.txt", "pub_date": "2012-01-13T00:00:00Z", "Sentiment": "0.177", "Subjectivity": "0.41", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "345", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_odk9v", "Reddit_id": "c3gx4kp", "Subreddit_id": "t5_2qh3z", "Commenter": "[deleted]", "length": "1943", "content_scrubbed": "Reed college has a program for seniors in high school to take a class there: http://www. reed. edu/outreach_programs/young_scholars/index. html\n\nI didn't do this program, but I'm currently attending Reed if you have any questions about that. If you really enjoy learning, rather than simply going to school for grades and to get a job (Not that nobody at Reed goes for jobs), then you may want to look into it. Reed is excellent with Biology and the Humanities, but I've heard mixed things about the art program. There[.] also Lewis & Clark and PSU, which I know very little about.\n\nOn a more personal note, I chose Reed because I felt it was the best for me. Ideally, I would like to end up in academia, that[.] where I've wanted to go for a few years because I enjoy learning and honestly can't imagine myself in an office trying to make my way up the corporate ladder (I am, however, still considering medical school). Anyways, Reed is sometimes called a \"grad school prep school\", which is kind of what I wanted. It has no sororities/fraternities, I think we have some sports teams, but they're not really well-known by people other than those who play on them. I also really liked Reed[.] focus on pure math (I'm considering majoring in physics or math, and I've always been fascinated by pure math).\n\nNot sure if that anecdote helps, but on the subject, I'm also considering transferring away for financial reasons as well as location (I live in VA, Portland is far away). Probably to UVA, which I'm only really applying to because last time I got in I got a full ride, plus it[.] close by.\n\nTL;DR: Keep in mind what you want to do after college, the location, the financial difficulties (Or comfort) that may result from it, and what you want to learn. And then look at schools that fit your criteria. Also, if you have any questions about Reed, I can answer them (Though you could also just visit the campus and take a tour or something)."}