{"doc_id": "604", "name": "2012_02_humanities_student_major_73_gatech", "namespace": "we1sv2.0", "metapath": "", "pub": "gatech", "title": "2012-02-humanities-student-major_73_gatech.txt", "pub_date": "2012-02-02T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.475", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "840", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p7hm3", "Reddit_id": "c3n8dor", "Subreddit_id": "t5_2r8t2", "Commenter": "[deleted]", "length": "4642", "content_scrubbed": "Recent Alum reporting in. When I was going through the whole college admissions process, Tech never entered my mind. I was pretty dead set on going out of state. But my dad wanted me to pick at least one college in-state, and Tech was my first and only choice there (I grew up a Tech fan, had a Buzz in my crib that is probably responsible for my irrational fear of anything with a stinger). I got more excited about GT after attending many recruitment events and ended up applying. When it came down to choosing a school, it was between Tech and a small liberal_arts school in Maryland. There was no contest - $32,000 for a school not many people hear about was a joke compared to getting the HOPE scholarship for an incredibly prestigious institute. I have no regrets. I changed my major three times at Tech - Bio to Psych to HTS - and feel I experienced a pretty wide spectrum of what Tech has to offer. \n\nHere[.] what I liked:\n\n* Student Involvement: it took me about 3 years, but when I got involved on campus, I got seriously involved. In fact, getting involved on campus increased my love for Tech tenfold. I really enjoyed giving back to new Techies, other Techies, and Tech itself. I'm probably repeating others here, but there is a club for anything someone could ever want, and if there[.] not... someone[.] probably going to start one. \n\n* Professors: this is kind of tricky to include, but when I changed my major to HTS, my relationships with my professors were much improved. It[.] a smaller major, so we had smaller classes that gave us more time to interact with our professors. I got to take classes with my favorite professors at least 3 different times. It was a great atmosphere to learn in, especially when the professors were truly passionate about the subject. That made it more like listening to someone tell a story rather than give a lecture. \n\n* Tech really tries hard to help its students out in the long run. Internships, co-ops, career fairs, major fairs... I could go on and on. There[.] always some workshop going on, and students are assaulted with emails every day with tips on getting involved on campus, getting research opportunities, etc. \n\nHere[.] what I found frustrating:\n\n* Professors: While I had some wonderful experiences with my professors, I did have some awful ones my first couple of years. I had a set of professors (it was a jointly taught course) tell us that we were wasting their research time and then proceeded to berate us for not doing better in the class. It was a huge turn off, as I had already found them very difficult to approach. I have had professors that cannot lecture to save their life, which made it easy to skip class. No one paid attention when this kind of thing happened, and I admit, it must have looked like we were a bunch of bratty kids. While I have found some professors to be really great life resources, I have also found them to be unapproachable, distant, and generally not nice. \n\n* Students: When I was a Bio major, I wasn't smart enough for my engineer friends. When I was a Psych major, I wasn't smart enough for my Bio friends. When I became a liberal_arts major, I wasn't smart enough for anyone. What a lot of people at Tech fail to realize is that both the state requirements AND the majors require a lot of work in a lot of difficult fields. Yes, I was a biology major taking biology classes, but I HAD to take calculus based physics. I HAD to take computer science. When I was a Psych major, I was still required to have computer science, physics, etc. Even when I was an HTS major, I was taking a lot of scientific classes in which I would be reading scientific reports. It was hard_work of a different sort. But this feeling goes beyond general \"management/liberal_arts hate.\" I get the feeling that every department looks down on every other department. I can't tell you how many \"well MY engineering major is better because...\" \"NO MINE is harder because...\" conversations I've sat through. Guys. We get it. Tech is hard. But it[.] hard for EVERYONE, regardless of what you're learning. Geez. Getting off my soapbox now. \n\n* I sometimes find it tedious that so many people promote the Tech stereotype. Yes, I myself am a pretty big nerd, and I'm proud of that. But I don't feel the need to pigeonhole myself into one stereotype. As a girl at Tech, I was immediately categorized as ugly, stuck-up, nerdy, or dumb, depending on the crowd I was in. Certain majors are \"better than others,\" that kind of thing. There[.] a lot more to people at Tech than just being smart/nerdy/socially awkward, but that[.] just the image people both put forth and go on. "}