{"doc_id": "1591", "name": "2012_01_humanities_student_major_900_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2012-01-humanities-student-major_900_politics.txt", "pub_date": "2012-01-25T00:00:00Z", "Sentiment": "0.168", "Subjectivity": "0.411", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "488", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3kd897", "Reddit_id": "c3kgj0t", "Subreddit_id": "t5_2cneq", "Commenter": "BolshevikMuppet", "length": "2866", "content_scrubbed": "As someone who studied education as a problem of public policy and whose girlfriend is getting her master[.] degree in education, I have some disagreements.\n\nI don't think education should be compulsory.\n\nI absolutely disagree.  Very few children are going to choose of their own volition to get an education.  We force children to go to school for the same reason we force them to brush their teeth, go to the doctors and (should) force them to get their shots: the children aren't capable of making that decision, and parents can't always be trusted either.\n\nI don't think we should be telling every child that they're going to be lawyers, doctors, and astronauts. It[.] massively unrealistic and an utter lie.\n\nI'll agree with that in general.  Every student should be encouraged to focus on things they enjoy, but given rational advice on what they are likely to be *able* to accomplish.\n\nI don't think we should keep telling - and nearly forcing - high school graduates into universities. First, not everyone is cut out for it. Secondly, society can't function if every single person has a liberal_arts degree. Yeah, being a plumber isn't glorious but it[.] sorta needed in order for a modern society to work.\n\nMaybe.  The problem is that we also don't need that many plumbers.  What we need is a push for more science and technology in schools.  There[.] little value in the modern world to be able to analyze The Great Gatsby.  There[.] *huge* value in being able to invent a wireless laptop charger (as one young lady did).  We need to invest, not in \"vocational\" pursuits, but in new-industry pursuits.\n\nAnd, not for nothing, but as society has become more and more technologically-advanced, the need for a large cohort of manual or semi-skilled workers has been diminished greatly.\n\nI do think public schools should be able to get rid of problem students and have the_right to refuse to educate them if they are consistently and massively disruptive and dangerous to a school environment\n\nWhat are you defining as \"massively disruptive\" or \"dangerous\"?  In general, I agree, but then we're butting heads on the issue (again) of whether you want to make the schools about providing the best and the brightest the best education possible, or trying to get everyone up to some minimum.\n\nI do think we need to show to students (and parents) that trade schools and community colleges are perfectly fine alternatives to universities.\n\nIt[.] the same problem as #3.  I'll grant you community colleges (though, depending on their set-up, they can only give Associate[.] Degrees or set up a situation where a student tries to transfer), and especially in-state schools.  But, again, we simply don't have need for that many semi-skilled laborers.  Until we figure out a way to treat basic IT stuff as a \"trade\", we won't get what we need from sending kids to trade school.\n"}