{"doc_id": "1537", "name": "2012_01_humanities_student_major_411_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-01-humanities-student-major_411_AskReddit.txt", "pub_date": "2012-01-10T00:00:00Z", "Sentiment": "0.01", "Subjectivity": "0.429", "Score": "34", "Upvotes": "34", "Downvotes": "0", "Wordcount": "1164", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3fwazt", "Reddit_id": "c3g0e3j", "Subreddit_id": "t5_2qh1i", "Commenter": "robertbieber", "length": "6934", "content_scrubbed": " People should have the_right to control who has access to their property.\n\nAnnddd, there[.] where you went wrong.  \"Intellectual property\" is not property.  Copyright is governed by a completely different set of laws than property, and exists for a completely different set of reasons: to compare the two is simply absurd.  Copyright infringement under most circumstances, for instance, is not a criminal act but a civil tort.  Copyright also expires and passes into the public domain (theoretically, although big media has managed to buy enough congress critters that I'll be surprised if any new works ever actually enter the public domain).\n\n Even if piracy isn't stealing, it[.] still wrong.\n\nReally?  Let[.] stop, for a moment, and trace through a hypothetical chain of events.\n\n1. Individual A creates some great artistic work.\n2. Individual A sells a copy of said work to individual B.\n3. Individual C copies said work from individual B.\n\nNow, consider the total benefit to all parties from each of those events.  In step 1, Individual A gains an artistic work that he didn't have before, so we can count that as a clear net benefit in wealth for all parties concerned (currently only one).  In step 2, Individual A receives some money (without losing access to his artistic work, mind you), and individual B loses some money and receives the artistic work.  Assuming that the net change in value was positive for individual B (which it presumably was, because he voluntarily parted with his money), this is another net increase in wealth for all involved (two people, at this point).\n\nNow let[.] take a look at step 3, the part where the dirty evil \"pirate\" copies the sacred work.  This step must constitute a massive loss in wealth, right?  After all, our legislators are willing to shut off the Internet to prevent it!  So what is the net change in value?  Well, Individual C clearly experiences a net gain in value, and loses nothing for it.  Individual B neither gains nor loses value, except perhaps by the minor inconvenience associated with making the copy.  And Individual A, the hallowed creator?  He neither gains nor loses anything.  In fact, he[.] a completely uninvolved third party in this transaction, which took place voluntarily between two other individuals in their private lives.  So what, exactly, is so evil about this act of sharing?\n\n My analogy is this: If you have a lawnmower, and your neighbor doesn't, you probably wouldn't have a problem letting him borrow it if he asked. But if he snuck into your backyard, used it without asking, and returned it, you'd feel violated - even if it wasn't technically stealing.\n\nAllow me to make an equally valid analogy.  Suppose that you have a shoe, but you don't know how to tie it.  Your neighbor, however, is an expert in tying shoes but wants to use your lawn mower.  You attempt to exchange services but end up horribly mangling the shoe with the lawn mower because it turns out that you were both so obscenely wasted that you had been trying to make analogies between property rights to inherently scarce resources and temporary government-enforced monopolies ensured for a limited period of time to incentivize artistic expression.\n\nOnce again, comparing \"intellectual property\" to actual property rights is absurdly incorrect.  This is one of many reasons that the term is misleading to laypersons and its use should be discontinued.  And while we're on the subject of avoiding deliberately misleading terminology, can we stop referring to private file sharing as \"piracy?\"  It[.] kind of hard to have anything even resembling a rational discussion when you start out by referring to your opponents with a term that also refers to people who plunder, maraud and rape on the high seas.\n\nNow, in the interest of shortening this wall of text, I'll try to wrap this up as briefly as possible.  The most important fact for you to grasp is this: **you can not own an idea**.  Once you have told someone an idea, given them a copy of a song, etc., **you have no inherent right to dictate what they do with it afterwards, because the copy you gave or sold to them has become their own private property**.  For the vast majority of human history, there has been no right to control what others did with a work or an idea that you voluntarily transferred to them, inherent or otherwise, and the arts, literature, and invention all flourished nonetheless.\n\nCopyright was introduced as the copying of artistic and literary works started to become a big business, to prevent *other* big businesses from reproducing your work en masse and pricing you out of the market because they made no initial investment to produce it.  Its purpose is to provide a **temporary** monopoly so that you can make a decent return on your investment, after which time the work passes into the public domain, where anyone can copy it freely for the public benefit.\n\nThere are two very important aspects of these origins that we need to understand.  The first is that the original term of copyright was not very long.  28 years in the U_S, IIRC.  This was in an age when books had to be reproduced by laborious typesetting and printing, and books had to be subsequently shipped by slow transportation methods to markets.  Even *under those circumstances*, 28 years was considered a long enough period of time to recoup your investment on a work under copyright.  We now live in an age where a best-seller or a hit song can make you a millionaire through digital creation and distribution faster than you could have even typeset a book on an old-fashioned printing press, and yet the term of copyright has gotten *vastly longer*, up to the author[.] life plus 80 years in the U_S.  Not only is the term obscenely long, but congress has applied retroactive extensions, which are utterly nonsensical: obviously it is impossible to incentivize authors and artists to produce more works *in the past*, so retroactive extensions serve no realistic purpose other than lining the pockets of those who depend on copyright for their livelihood.\n\nThe other important point to consider is that at its conception, copyright was never a prohibition on private conduct between consenting individuals.  At the time, reproducing a work meant very large, very expensive equipment.  You could theoretically make a copy of a work by hand for a friend, but it would be a laborious and time consuming practice, and not something that anyone would ever realistically file suit over.  Copyright was originally, in effect, a restriction solely on commercial copying.  In the Internet age, it has turned into a restriction on private interactions between individuals by uninvolved third parties, and that kind of policing of our private lives is not justified by whatever marginal incentive to create may be provided by the bankruptcy-inducing lawsuits that big media has unleashed on the public."}