{"doc_id": "687", "name": "2012_10_humanities_student_major_8_atheism", "namespace": "we1sv2.0", "metapath": "", "pub": "atheism", "title": "2012-10-humanities-student-major_8_atheism.txt", "pub_date": "2012-09-30T00:00:00Z", "Sentiment": "0.138", "Subjectivity": "0.436", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "632", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6fuqfk", "Reddit_id": "c6fv5rx", "Subreddit_id": "t5_2qh2p", "Commenter": "theholyraptor", "length": "3740", "content_scrubbed": "Your implication that people going to college would increase the amount of smart people in the U_S is flawed in my opinion.  From my experience and understanding of the colleges I've attended, classes I've taken, and people I've seen is that a college degree is devalued for two reasons. There is a huge number of people getting degrees that don't have a gaurenteed career path with them, as has been mentioned aka the English major to Starbucks barista concept.  I think another bigger issue that is overlooked or not talked about is the internal devaluation of the college education by schools themselves (or pressures on the schools).  In order to move all those people demanding degrees through the system, the system has largely failed at it[.] original goal. I think it is the fault of both economic pressures and poor leadership. There are degrees with skills that are truly marketable such as becoming a doctor, an engineer, a computer scientist or a nurse.  (Forgive me if you think I neglected one.)  Those are in a somewhat different category at a college as they learn important skills towards a specific career path.  Other majors also learn skills towards very generalized career paths and those skills are often more common sense and open to interpretation.  Look at business majors.  For every business major I've seen that busts their ass to do well and succeed in a grand way, there are the thousands of students who took business to get a degree because they feel they are supposed to get a degree after high school and don't know what to do with themselves.  Other areas prepare students for job with very specific skills, such as some of the arts, but the job availability is severely limited.  The original intent of college (such as all the liberal_arts programs) was more to teach via the socratic method and other forms critical thought while providing a broad overview to challenge your preconcieved notions and ethnocentric ideas.  For example, take a decent Philosophy of Religion class, and if you're religious at all, you may learn of whole new ways of thinking about your religion and others.  I think that was the original intent with all of the general education requirements and obtaining a degree.  Now days, most general education classes I've heard about or taken are a complete joke and most of the students don't care, are taking whatever class based on how easy it is, how quickly they can knock out mulitple requirements and do the bare minimum in the class.  I would say the vast majority of college graduates in the US have had little change in their critical thinking skills (or their writing skills for that matter.)  The devaluation of education also effects programs like engineering where I see students turned out who wouldn't have passed their classes in a more rigorous enviroment.  Obviously the higher end schools which tend to have better financials and better professors do better but then there is that whole issue of grade inflation at the top tier schools.  I know plenty of college graduates I would not consider overly intelligent.\n\nAs to the comments about skilled labor jobs, I see CNC machinists and CNC programming jobs CONSTANTLY in demand.  Most of the machinist related classes all disappeared from community colleges except for welding typically (and those were barely spared at some of the community colleges I've taken classes at) so yes I'd say there is a constant need for some skilled labor jobs that are going unfilled because people skilled the skilled labor type classes (except mechanics which are a dime a dozen most places these days because those programs still exist and people who don't aspire to a 4 year degree see that as their preferred option.)"}