{"doc_id": "682", "name": "2012_02_humanities_student_major_930_drugs", "namespace": "we1sv2.0", "metapath": "", "pub": "Drugs", "title": "2012-02-humanities-student-major_930_Drugs.txt", "pub_date": "2012-02-27T00:00:00Z", "Sentiment": "0.032", "Subjectivity": "0.38", "Score": "21", "Upvotes": "21", "Downvotes": "0", "Wordcount": "414", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3vbj77", "Reddit_id": "c3vh6ra", "Subreddit_id": "t5_2qh7l", "Commenter": "ahippyatheart", "length": "2519", "content_scrubbed": "A hippy is negative stereotype because they are full of hot air.  All talk no action.  The same reason Carter is viewed as a presidential failure.  He was a genius, who was able to identify problems.  However, he couldn't motivate people to take action and do something about it.  His antithesis was Reagan.  We need more Teddy Roosevelt[.] than Jimmy Carter[.].  Both understood that congress was bought and paid for.  Teddy went about his merry way fucking the corruption up with his big stick, while Jimmy decided to call it quits and twiddle his thumbs.\n\nThe hippy also has a bad image because the summer of love (ashbury heights specifically)/Woodstock devolved into a hedonistic fuckfest covered in vomit, shit, and piss.  Tim Leary thought dosing the population was a way to wake them up and severely underestimated humanities ability to not give a shit about anything but selfless pleasure.  Furthermore, the whole movement is poetically viewed through Lenon[.] rose tinted glasses, instead of objectively.  Finally, the hippy is so distracted by ideals and their own movement that they become unable to criticize the faults within their groups own belief system and courses of action (or inaction [not always a bad thing [wu wei](http://en. wikipedia. org/wiki/Wu_wei)]).  \n\nFight Club is an accurate criticism of the phenomenon.  It warns of following false prophets who preach freedom from the system only to suck you into another cult (Tyler says to not do what the system tells you, his followers are lemmings who chant about Robert Paulson.)  Fight Club preached finding your place in society and fixing problems from within the system.  Tearing it down just leads to another corrupt, directionless leader taking the reigns (project mayhem. [also ows because they clearly do not have a viable succession plan.])  The people who say fight club is a great movie missed the point, while the people that joke that it is overrated or a waste of time are living its message.  Fight club can be viewed as a failure, in that more people absorbed its purposely false prophecy at face value than heeded its dire warning against conformity (even following a blind faith in the antiestablishment movement is conformity.)  Or apple telling you to think different, and then producing noncustomizable products en masse all while selling you on the idea of individuality.  The same analysis can be applied to the hippy movement.\n\n\"Be the change you want to see in the world, [dont just sing about it in drum circles]\" - Gandhi"}