{"doc_id": "622", "name": "2012_02_humanities_student_major_215_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-02-humanities-student-major_215_AskReddit.txt", "pub_date": "2012-02-07T00:00:00Z", "Sentiment": "-0.079", "Subjectivity": "0.385", "Score": "382", "Upvotes": "382", "Downvotes": "0", "Wordcount": "400", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3or8xx", "Reddit_id": "c3ov3vi", "Subreddit_id": "t5_2qh1i", "Commenter": "Raven776", "length": "2095", "content_scrubbed": "Just to clarify for people that are curious, cause some people seemed to be... curious. The reason he explained the fake blood was because there were blood stains all over the rim of the bathtub (the tub itself clean, just... the hard to get places were red). He just changed the shower curtains, and he said it was fake blood and he'd clean it all up by tomorrow and that he was doing a photoshoot. He takes photos of generally fucked up things, this being a liberal_arts college, so I really just shrugged and went on my day. Now, I don't usually see his photos, or rather I don't ask to see them, but I never saw anything to do with bathtubs being printed out or anything anywhere in the apartment. I figured, like any photoshoot you film in the infinitely terrible lightning of a bathroom with heavily contrasting colors and shades or something (not a photography major) that they just came out bad.\n\nThe realization that this was cow blood and what he and his girl friend did in it came when I overheard a conversation he had with his girlfriend over the phone. It was obvious that it was, indeed, real cow blood that he got from some butcher in china town (what the fuck?) and that he had sex in it with his girlfriend, who was on the other side of the line. I was off in my own little world until that, but up until then they were just talking about... photo stuff... and he didn't see me behind him, being a city street where you usually don't have to worry about people being around you and oh god...\n\nI bleached the hell out of that tub. I bleached it so hard.\n\nAnd then I did my best to subtly bring up the fact that semen is not water soluble (sp?) by making a joke that the dorms down the street had a pipe burst cause people were unfing in the showers and washing it down the drain.\n\nSometimes I try to look back and figure out where I could have misunderstood. I try to pick apart this story and hope, for dear god, that he was just... but... it smelled like real blood. It washed away like real blood. I'm from a rural county and I've seen cow blood... That was cow blood... Why?"}