{"doc_id": "637", "name": "2012_02_humanities_student_major_415_mensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "MensRights", "title": "2012-02-humanities-student-major_415_MensRights.txt", "pub_date": "2012-02-13T00:00:00Z", "Sentiment": "0.13", "Subjectivity": "0.414", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "332", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3qr94c", "Reddit_id": "c3qrlfh", "Subreddit_id": "t5_2qhk3", "Commenter": "Blinkdog", "length": "2043", "content_scrubbed": "Hands-on get-shit-done skills are best taught by getting your hands on and shit done.  They are valuable, but not ideal for teaching in a university environment.\n\nThat said, the ability to think critically, take in a broader perspective, and to articulate your thoughts is a useful and worthwhile skill set for anyone both on and off the job, no matter what that job might be.\n\nThe mess that is the american higher education system has not been able to do as good a job as it should in teaching these skills though.  I actually did a persuasive speech on the subject for the class I had with this teacher (public speaking). \n\nAt the core of the issue is a feedback loop.  Students are bombarded with universal promises of a better life through higher education, so they are willing to take on large debt burdens to achieve their higher education.  Banks are eager to sign them up, because currently there is no way to get rid of student loan debt, not even through bankruptcy, and the secondary market for student loan asset backed securities is always hungry for these literally risk-free investments.  With more available students, schools want to increase enrollment, so they expand their administrations to handle admissions, marketing, campus planning etc.  With large administrations come large administration costs.  To cover them, schools increase tuition.  Students are willing to take on the increased debt. Rinse and repeat for a few decades and you have tuition rates that have grown 900% over the past 33 years, 650 percentage points higher than inflation, and almost all of that tuition going to fund administrations obsessed with measurable success and marketable products.  Where you once had three full time professors for every part-time teachers assistant, now the ratio is reversed.  And where you once had liberal_arts programs that turned out strong critical thinkers and active citizens, now you have underfunded, understaffed departments that excrete students with barely more knowledge than they had when they arrived."}