{"doc_id": "1567", "name": "2012_01_humanities_student_major_643_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2012-01-humanities-student-major_643_politics.txt", "pub_date": "2012-01-17T00:00:00Z", "Sentiment": "0.085", "Subjectivity": "0.35", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1143", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3i2gq8", "Reddit_id": "c3i55aq", "Subreddit_id": "t5_2cneq", "Commenter": "Pipstydoo", "length": "6422", "content_scrubbed": "I wanted to take the time to post, in sequential order, the comments you made which might be the reasons why DerBafog is upset about what you have been saying.  They are in paragraph form, as follows:\n\nI am really glad I picked a legitimate degree (finance).  I feel it is safe to assume I am not the average American. [My girlfriend] received an art history degree (job security... lulz).  I worked with a large number of graduates at my last job who had both good and rather worthless degrees.  I knew chemical engineers who couldn't find a job but english majors who could only because the english major spent a majority of her free time reaching for a goal.  I just feel so many young people expect to be handed a job when they leave college.  The economy cannot support [a] system where a majority of your graduates leave with majors that require going back to school to be valuable.  Are you telling me watercoloring is worth the 50,000 dollars spent at a university? It is not in any sense of the word a good investment.  So yes, I picked a legitimate career and field to work in.  I never said fuck the arts, but fuck over paying for a degree that has no return on investment.  I thoroughly enjoy art, music, dance, ect. but I did not decide to drop a bunch of my parents money (student loans in my case) on a degree that was going to make it tough to pay back that money invested. Sorry for being practical and not thinking blowing your money on a bachelors in anthropology is a good idea.  The difference is that in my interview the employer will see what I have done on paper as proof, where none of you can.  I am allowed to express my opinions on the matter, I have seen first hand what picking a unusable major can do to you. Keep them in a massive amount of unforgivable debt while they scramble to figure out how they can salvage the mistake the made.  I was thinking about my future while I was looking for a career path and not what interested me. I am not being offensive, I am being a realist.  I in no way am telling people not to be an artist, a dancer, or a professional mime, but you can't complain that you can't find a job when you pick a path that has such a large pool of people with a limited number of job openings.  I support following your dreams, but I don't support putting yourself under a mountain of debt so you have to move home and complain about there not being jobs in your field. \n\nI can only speculate, but I suspect DerBafog had several issues with your statements because of the reasons listed below.  They are sentence-by-sentence responses to the above paragraph:\n\n- You immediately declare some degrees to be legitimate and, by default, others illegitimate\n\n- You rate yourself above average and, by default, classify others who chose different degrees and/or career paths as below average, or at least below you\n\n- You laughed at your girlfriend[.] art history degree\n\n- You again make the assertion certain degrees are worth more than others, and by your words I assume you believe chemical engineering is more valuable than english\n\n- You provided anecdotal evidence using a chemical engineer and an english major to support your hypothesis that hard_work is more important than the degree you receive, which not only directly contradicts your belief in the importance of a \"legitimate\" degree, but also fails to account for the ever-present demand for writing skills and the ever-shrinking pool of research funding at the federal level, among other factors\n\n- You assert young graduates believe they have to do nothing or make no effort to get a job after college.  Your use of the words \"expect\" and \"to be handed\" are culturally- and socially-loaded terms with negative connotations\n\n- You again assert certain degrees are more valuable than others and even go so far as to say some people may need to go back to school to validate their degrees\n\n- You call to question the value of watercolors in a somewhat nonsensical example.  You might have meant art degrees in general.  What you implied was that an art degree is without value, an implication you explicitly confirm when you say \"it is not a good investment\"\n\n- You again declare your degree to be legitimate over others\n\n- You deny any disdain for an art degree despite statements to the contrary above.  You then procede to use the word \"but\" after your denial, which invalidates the statement prior to the use of the word.  You then declare art degrees to have no return on investment while simultaneously implying the only return that can be considered such is monetary\n\n- You declare your enjoyment of various arts and then use the word \"but\" once again, at which point any implication of your support of the arts is invalidated after the use of the word.  You go on to assume the people who get degrees outside of those you deem legitimate have used their parents' resources unwisely.  You imply these same people are perhaps coddled by their parents or otherwise taken care of, while you yourself used student loans to better your situation.  You imply those people who[.] parents paid for their educations wasted their parents' money\n\n- You again imply a degree other than your own is illegitimate, in this case anthropology.  You state anthropology is a waste of money\n\n- You state none but yourself has achieved anything of worth and certainly nothing others might put on a resume\n\n- You claim to \"have seen first hand what picking an unusable major can do to you\" which seems a shallow attempt at providing anecdotal evidence and again furthers your assertion that some degrees are legitimate and others not\n\n- You imply a degree in something other than the fields you deem legitimate is a \"mistake\"\n\n- You imply combining interest and career is not useful and that to do so imperils one[.] future\n\n- You imply being a \"realist\" requires a person to get a degree in a field you deem legitimate\n\n- You simultaneously state your support for careers in arts and that you aren't telling people what to do, and then you use the word \"but\" which invalidates anything said before the use of the word\n\n- You state your support for \"following your dreams\" and then you use the word \"but\" which invalidates anything said before the use of the word\n\nAgain, this is all pure speculation.  Nonetheless, I hope it gives you a better understanding of how you might have riled someone like DerBafog with your statements."}