{"doc_id": "1597", "name": "2012_01_humanities_student_major_1006_iama", "namespace": "we1sv2.0", "metapath": "", "pub": "IAmA", "title": "2012-01-humanities-student-major_1006_IAmA.txt", "pub_date": "2012-01-27T00:00:00Z", "Sentiment": "0.17", "Subjectivity": "0.434", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "267", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3l7ipd", "Reddit_id": "c3l7rzu", "Subreddit_id": "t5_2qzb6", "Commenter": "HonestAbeRinkin", "length": "1568", "content_scrubbed": "There[.] more emphasis on \"STEM\" than ever before in US schools. The problem is that interest isn't the only reason we're failing at teaching the topics. The reasons for STEM issues in school boil down to different problems in science than in math than in technology than in engineering. Sure, you can teach two of them as related and at the same time, but more than that and you're just lumping 'the hard stuff' together.\n\nThere are more students interested in science and math than ever, the problem is that good teachers are not evenly distributed across the US so most students enter university as a combination of underprepared in mathematics (the foundation for the sciences) and with an inauthentic view of science because most teachers *have never been scientists or completed any scientific research at all*. This means that what teachers are advertising as science is not at all what the scientific community really does. Lots of people want to major in the sciences, but very few graduate with degrees in a science - most change their majors to social science or humanities.\n\nIt also doesn't help that teaching in the US at the high school level is seen as \"If you can't do, then teach\". This means that those people who didn't get into medical/professional/graduate school are the ones teaching high school science courses for the most part. Very few people intend upon teaching high school science as they go through their degree - it[.] a backup plan. I think this is mostly because of society[.] emphasis away from teaching as earning higher social status."}