{"doc_id": "673", "name": "2012_02_humanities_student_major_862_redditlaqueristas", "namespace": "we1sv2.0", "metapath": "", "pub": "RedditLaqueristas", "title": "2012-02-humanities-student-major_862_RedditLaqueristas.txt", "pub_date": "2012-02-26T00:00:00Z", "Sentiment": "0.138", "Subjectivity": "0.435", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "403", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_q6s2j", "Reddit_id": "c3v6onj", "Subreddit_id": "t5_2se5q", "Commenter": "mmmmmtacos", "length": "2433", "content_scrubbed": "The striking movement[.] website can be found [here](http://www. bloquonslahausse. com/). It[.] in French but you'll see the general look of it, which my nails are inspired by.\n\nWe're striking because the Quebec government wants to raise school fees for higher education by 75% over the next few years. Even though this won't affect me directly (I'm in the second year of my phd, before long I'll be done paying university fees), I do not believe in a society where education is a luxury or determined by the market. Education should be accessible to all. Raising those fees means only the professions that insure a good salary (law, medicine, engineering...) will attract students, and things like social_sciences, political science, literature, the arts, will be gradually abandoned. The liberal_arts are, in my opinion (and in my movement[.] opinion), essential to a society[.] self-awareness and growth. They are at the root of all movements hoping to end discrimination, abuse, structural inequality. Feminism, amongst a lot of other social movements, would suffer greatly from this political decision.\n\nAlso, **I had a great political lacquerista idea!!!** I was thinking of recreating this manicure for anyone who wants one. We'd have a booth with four stations: 1) cutting/buffing/filing and base coat; 2) red coat and an intermediary top coat; 3) square scotch tape and black coat; 4) cleanup with acetone and paint brushes, top coat.\n\nAt each station, different information would be given about the strike, in relation with the step of the manicure that is given, because what else are you gonna do while getting your nails done? Chat, of course! For example, the filing and base coat would give \"background\" type information on the situation of students today, their debt rates, the rising number of part_time students who often never finish their degrees, etc. The one where the square is painted would give information on different strike activities since the square is the symbol of the movement, etc...\n\nThis would not only be for students, but for anyone passing by, so we can get the information out to people (women, of course, but I can see a bunch of dudes also wanting one!) and raise awareness while having fun and offering a free service. Not to mention all the people who would ask, \"Hey, nice nails, where d'you get them done?\" which would get conversations going about the strike.\n\nI think this might go viral! :D"}