{"doc_id": "1515", "name": "2012_01_humanities_student_major_117_math", "namespace": "we1sv2.0", "metapath": "", "pub": "math", "title": "2012-01-humanities-student-major_117_math.txt", "pub_date": "2012-01-04T00:00:00Z", "Sentiment": "0.009", "Subjectivity": "0.381", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "487", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_o2e7c", "Reddit_id": "c3dwtxu", "Subreddit_id": "t5_2qh0n", "Commenter": "richarizard", "length": "2700", "content_scrubbed": "I remember teaching high school math and hearing a lot of students say the same thing as you. (Usually phrased as, \"Why do we have to learn this?\" or \"How will this help me in the 'real world?'\") You're not alone in your frustration. What kills me is that it took me until several years after I quit to really think of the_right answer.\n\nFirst off, let me say there are plenty of pragmatic but not very useful answers to your question. There is an artistry to math, but if you don't like it and don't go much past high school or early college level, you're unlikely to see or appreciate it. There are also endless applications to math, but if your interests are in the arts or humanities, you're unlikely to use that, either.\n\nHere is the answer I wish I had thought of when I taught: You should learn math because you live in a country that is wise enough to make you learn math.\n\nIf you want to learn a little about an author or a music genre or a sport, you can do so without too much hard_work. You can find an interesting book or article about it, read it, and feel smarter (as you should). However, math doesn't work like that. You can read compelling books about specific mathematicians, theorems, or aspects of math history. However, when it comes to learning about domains, inverses, probability, sines, and cosines, there is no fascinating book that will turn it into a dramatic story for the non-mathematician. If you're not naturally drawn to it, it is boring and requires you to spend hours practicing something you have no desire to practice. I'm not sure it[.] all that different from a kid practicing piano 30 minutes a day even when s/he hates it.\n\nBut (and I'm assuming you attend a public school here), there[.] a reason your district is mandating that you take this course. Over centuries of human knowledge, we've agreed that this is important to know. There are people who disagree, and there are private schools and colleges that cater to that. However, I side with the public education system here. You should learn it because it[.] valuable to learn. It might not be crucial to your job down the line, but who cares? If schooling were *just* about job training, then you probably knew all you needed to know in 6th grade. At least in this country, schooling is also about learning, enriching yourself, and becoming a worldly, intelligent person.\n\nWhatever your feelings for the teacher or your particular school, at least respect the system. It[.] not perfect, but it[.] good. You may be correct that it will never help you in the \"real world,\" but you're not in that real world, you're in school. It may never help you, but becoming a little bit smarter will not hurt you either."}