{"doc_id": "1579", "name": "2012_01_humanities_student_major_748_education", "namespace": "we1sv2.0", "metapath": "", "pub": "education", "title": "2012-01-humanities-student-major_748_education.txt", "pub_date": "2012-01-20T00:00:00Z", "Sentiment": "0.085", "Subjectivity": "0.294", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "306", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_opeof", "Reddit_id": "c3j21kw", "Subreddit_id": "t5_2qhlm", "Commenter": "MacDancer", "length": "1851", "content_scrubbed": "I see a couple issues with this plan.\n\nFirstly, it would put pressure on the University to produce students who make a lot of money. Engineering and sciences departments already bring in more money for the University through grant-writing than fine arts and humanities departments; is it wise to increase the earning-power disparity between sciences and humanities? As an individual with a B. S. and a B. F. A., I see it as a good thing that arts and humanities are valued more highly in the university than in the \"real world\".\n\nSecondly, the highest-earning students will have reduced motivation to attend UC over a private university, and *many of these high-earning students donate generously to their alma maters*. Not only might UC potentially lose some of the best and brightest, it would also lose an unknown but potentially rather large amount in estate donations starting in ~50-60 years.\n\nFinally, collecting on these debts seems like a complicated and expensive operation. If it could be rolled into federal taxes or dealt with by the same folks who deal with federal student loan collections, that seems like it would work fairly well, but I would be wary of the UC handling collections internally or contracting it out to a for-profit.\n\nOne last thought, what happens when a student[.] parents want to pay tuition up front? Will they get a discount? Will they pay a deposit which may be partially returned if the student doesn't get a job? Will there be an overall tuition floor and/or ceiling? There are lots of details to consider.\n\nAll that said, UC needs money, and its reserves aren't going to last forever. Despite my reservations I'd consider supporting a version of the plan that kept UC attractive to high-achieving individuals, maintained departmental parity, and closed loopholes that otherwise might allow the system to be gamed."}