{"doc_id": "745", "name": "2012_10_humanities_student_major_695_truereddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueReddit", "title": "2012-10-humanities-student-major_695_TrueReddit.txt", "pub_date": "2012-10-16T00:00:00Z", "Sentiment": "0.043", "Subjectivity": "0.29", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "560", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11kr9k", "Reddit_id": "c6nii4j", "Subreddit_id": "t5_2qyt6", "Commenter": "Translucent_Owl", "length": "3158", "content_scrubbed": "Oh for God[.] sake. Reading the article title, I thought this might be about some school arbitrarily forcing its students to take several years of chemistry. But \"suffer through a year of chemistry\"? One year!? One? Jesus, just go to school and knuckle down. \n\n\"I have to take a subject I'm not a hundred percent interested in\" Oh dear, you must be literally the first person in the history of modern education to have that problem. And yes, we should definitely let all 15-year-olds choose exactly what they study: after all, 15-year-olds are renowned for their life experience, maturity, and general knowledge of the world. \n\n He[.] forced to spend a year of his life studying chemistry every day, which translates into a year of misery for him and our entire family, and paying for tutors who just get him through the course.\n\nOh dear, the poor diddums. A year of misery for the entire family? Yes, no doubt this is a grave injustice, and your son is Nelson fricking Mandela.\n\n How will Mr. Bernstein react when his work colleagues ask him how things are going? \"Not good ... *sob* ... I ... I just can't take it any more ... \" \"Why, what[.] wrong, David? Marital problems? Getting a divorce?\" \"No, it[.] much worse ... My son ... They're making him take chemistry .... in high school!!!\"\n\nSeriously, if his son needs tutors (note the plural) to get him through high school chemistry, Bersntein might want to get him checked out for learning difficulties. \n\nHe will forget everything he \"learned\" a week after the class is over.\n\nOkay, so why not use your Washington Post column space to campaign for chemistry to be taught differently to your son, rather than not at all?\n\nKids have to suffer through some classes they don't like just so they can be prepared for the real world.\n\nWell, they do.\n\n\nI don't know what you do for a living but I love what I do and rarely engage in work I don't enjoy. \n\nThat[.] nice, Mr. Nonprofit executive. I wish we all had that luxury. \n\nyou are not allowing him that same time to take a public speaking course, which he could be really good at, or music, or political science, or creative writing, or HTML coding for websites.\n\n... And I didn't get to take Advanced Basketweaving at school. I still turned out alright. \n\nBut he will lose out on so many other more important opportunities, and so will our society, which will have deprived itself of his full contribution.\n\nOh dear. Yes, I'm sure if he had *just* been allowed to take that one public speaking course, he would have grown up a passionate and idealistic pollitician who would have brought about world peace and ended world hunger. As it is, because of that chemistry course he will drop out of high school and take to hard drugs. \n\nThis article is the equivalent of the butthurt redditors who turn up in every Askreddit thread about education complaining \"But *why* should I *have* to take Gen Ed college classes in liberal_arts?!? I already know I'm going to be a Doctor of Logic and Saganology, why should I have to take English 101?!?\"\n\nExcept that Bernstein is ostensibly older and more mature; and gets to whinge in the Washington Post rather than Reddit. "}