{"doc_id": "714", "name": "2012_10_humanities_student_major_313_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2012-10-humanities-student-major_313_canada.txt", "pub_date": "2012-10-08T00:00:00Z", "Sentiment": "0.132", "Subjectivity": "0.396", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "476", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1150so", "Reddit_id": "c6jg5la", "Subreddit_id": "t5_2qh68", "Commenter": "SilvioBurlesPwny", "length": "2539", "content_scrubbed": "I have lived in all of these cities except for Calgary and Edmonton.  Here are a few thoughts, \n\nMontreal is by far the best place to be in Canada when you are young.  The arts scene is dynamic, the music is the best in Canada, there are countless bars and always something to do.  Plus the downtown population is very young and transient so easy to find friends.  My French was poor but I still found work as there are a ton of companies there.  \n\nToronto is where you make your money.  The most jobs, the most money, the biggest population.  Yes there is traffic but it is only people who live north of St Clair or in the burbs (Scarb, Markham, Etob) who drive.  The public transit is the best in Canada and you can shoot across town in under 30 mins.  Toronto is also incredibly diverse, that means good interesting friends and incredible, and cheap, food.  Like Montreal, there is always something going on, but it is much more uptight than Montreal and sometimes I feel like they are trying too hard. \n\nI live in Ottawa right now and the city has its perks.  Living in the Glebe and Downtown makes everything incredibly close.  The bike paths run up and down the canal and you can bike anywhere within 15 mins.  There is a big student population and it is generally a pleasant place to live.  It is a bit boring though.  Bureaucrats are a notoriously boring and conservative bunch.  The job market isnt the best here though.  It is government and service, and tech if you want to live out in Kanata, which you don't. \n\nI grew up in London.  Generally a bad place to be young.  Maybe good to raise a family if you can find a good job (manufacturing is slowly dying here) in the University, in finance, or one of the hospitals.  London has a chip on its shoulder and is a bit white trashy.  Might be because there is nothing really to do except drink and fight.  Perk is that London has the best minor hockey team in Canada, by far, and it is cheap to live there.\n\nVancouver, well, next week I am flying there for a job interview, so I may be putting my roots down there.  I only spent a summer out west so it is tough for me to gauge.  Vancouver and much of the west coast has a good vibe.  People are generally more laid back, but sometimes I feel it is a veneer for being up tight.  The housing market seems over priced, but renting, it is not the end of the world.  I am 27 and still in no hurry to get a mortgage.  Great bars, good food, lots going on, and for the summer spectacular weather.  Downside, no outdoor winter hockey.  "}