{"doc_id": "1531", "name": "2012_01_humanities_student_major_372_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2012-01-humanities-student-major_372_news.txt", "pub_date": "2012-01-10T00:00:00Z", "Sentiment": "0.05", "Subjectivity": "0.319", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "442", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_oay42", "Reddit_id": "c3ftwwe", "Subreddit_id": "t5_2qh3l", "Commenter": "Infamous_El_Guapo", "length": "2551", "content_scrubbed": "Here is the problem and why I have little pity for the author.\n\nI was sold on the idea that I could do anything with a degree in the liberal_arts.\n\nThere are degrees which one requires to work in a specific field (e. g. Medical degree, economics, engineering, biochemistry) then there are degrees which are less useful in the workforce (e. g. psychology, sociology, english literature). I am not saying that these degrees are worthless but they are less useful because of the larger numbers of graduates to compete against and because there are fewer jobs out there which require such degrees.\n\nWhen young people head off to college, university, or trade schools there is one thing all of them should have in the back of their minds: 'What kind of career do I want?' They may not know exactly what they're after when they get there but they need to figure it out in the first year or two then focus on it. \n\nToo many young people pick a field of study without considering 'How will this degree help get me a job and pay off the debt I have incurred from furthering my education?' only to get a severe wake up call when they graduate. It[.] silly.\n\nBut who[.] to blame? The author lumps much of it on the schools themselves saying:\n\nColleges and universities want your money. They shroud their avarice in flowing gowns and ivory towers, but they are not cradling knowledge so much as they are selling sheepskin.\n\n\nwith the assurance that a master[.] from one of the best universities in the world would make me more competitive than the average college graduate, I bit the bullet and filled out another aid application.\n\nand\n\nMy advice to a student thinking about shelling out $40,000 to $80,000 on a diploma?  Perhaps you should invest in a luxury car. They hold their worth better than diplomas and, if you ever had the need, you can live in them.\n\nBut is the author[.] disgust justified? Not really. \n\nSchools are there to educate but they are there for profit as well. They are businesses, and businesses like to stay in business. If their customer base is demanding psychology and sociology degrees then they'll shift gears towards that because that[.] what their market dictates. \n\nWhat about placing some blame on the parents, who are likely footing a fair chunk of the bill? Why aren't they partially responsible for not better advising their offspring? \n\nWhat about the students themselves? It[.] their future afterall and their choice. Like most of life[.] decisions, responsibility for choosing a useful college degree rests mostly on you, the buyer."}