{"doc_id": "1592", "name": "2012_01_humanities_student_major_901_uoit", "namespace": "we1sv2.0", "metapath": "", "pub": "uoit", "title": "2012-01-humanities-student-major_901_uoit.txt", "pub_date": "2012-01-25T00:00:00Z", "Sentiment": "-0.017", "Subjectivity": "0.33", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "368", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ovf3w", "Reddit_id": "c3kgvfb", "Subreddit_id": "t5_2s1kn", "Commenter": "BaconatedGrapefruit", "length": "2030", "content_scrubbed": "Graduating engineering student here! I overall enjoyed my time here. I will say though, a lot of of the people who bitch and complain have no idea what the hell their talking about.\n\nThe wireless is spotty? Ya, that[.] because you're trying to use it at peak times, just like everyone else. What the fuck do you expect? Find a ethernet port or learn to deal.\n\nThe food has improved exponentially. Cafe food tends to suck wherever you go, especially if you're a picky eater. Spoiled kids are spoiled.\n\nThe good residence requires a meal plan? Deal with it. South Village is probably one of the nicest residences in Ontario. Don't believe me? Go to Carlton and look at their prisons of a residence and get back to me. Or Western and enjoy living with three other people in a room half the size.\n\nWebct/mycampus is a pile of shit? You do realize the blackboard platform (what Webct essentially is) is used at most schools in some form or another, right? Go ask them how often it goes down (hint: it[.] a lot).\n\nMind you there are numerous downsides.\n\nThe laptop program is relatively useless for certain faculties and programs.\n\nThe Proffs can be godawful stupid and the university seems resistant on giving new good proffs tenure - expect a lot of proff churn.\n\nNot uncommon for a TA to speak limited english, really annoying when you're trying to learn in tutorial.\n\nSince we're a commuter school, for the most part, student life and activities are pretty nill.\n\nThe school is moving a bunch of faculties downtown which can be a bit of a pain in the ass.\n\nLiberal arts studies are next to non existent.\n\nOshawa is a godawful town with barely anything going on so it can get pretty dull.\n\nThe City doesn't want us living here (but they want our money!) so if you plan on living off campus prepare to jump through flaming hoops to obey the stupid bylaws.\n\nLike I said, really enjoyed my five years here and I'm happy I came. To say that there are no problems is asinine, but a lot of what people complain about is stupid and overblown."}