{"doc_id": "740", "name": "2012_10_humanities_student_major_653_socialism", "namespace": "we1sv2.0", "metapath": "", "pub": "socialism", "title": "2012-10-humanities-student-major_653_socialism.txt", "pub_date": "2012-10-15T00:00:00Z", "Sentiment": "0.17", "Subjectivity": "0.383", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "285", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11ie3v", "Reddit_id": "c6mynvw", "Subreddit_id": "t5_2qjii", "Commenter": "[deleted]", "length": "1595", "content_scrubbed": "I think the lack of social awareness is for a reason. Most students start high school without really learning that much about politics. In engineering you have a full course load and none of the courses are about humanities, politics, economics, development, etc. (at least in my school). I've gotten about 4 non-engineering electives in my entire undergrad and two of those need to be business related which doesn't leave a lot of room for learning about that sort of thing. On top of that you are always so swamped with your technical work that a lot of people can go through an entire undergraduate degree without seeing the importance of formulating political views. Then when fourth year comes around, a lot of these companies want to hire these students and pay them very good money and without a developed political compass a lot of students jump at this.\n\nI did a one year internship for a corporation and I can honestly say that I can not do that for the rest of my life. Some companies are probably better than others but I could never work a job my whole career working on projects that I do not think are pushing our society in the_right direction. I recently got into high performance housing (specifically solar thermal systems on building applications) and am going to start doing a masters on that so I can specialize in that field and continue doing that sort of work for my career. I feel a lot more confident and enthusiastic about my work knowing that I doing design work for projects that are trying to move society in the_right direction. I also have dabbled in fuel cells."}