{"doc_id": "789", "name": "2012_10_humanities_student_major_1289_teachers", "namespace": "we1sv2.0", "metapath": "", "pub": "Teachers", "title": "2012-10-humanities-student-major_1289_Teachers.txt", "pub_date": "2012-10-25T00:00:00Z", "Sentiment": "0.145", "Subjectivity": "0.442", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "308", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_123k78", "Reddit_id": "c6rv8x9", "Subreddit_id": "t5_2qqcs", "Commenter": "callmeprofessor", "length": "1652", "content_scrubbed": "I have very little experience in art as a subject, but I really hope that the arts aren't cut. Even though I think Glee is way over-the-top regarding the way it goes about claiming that \"the arts need cut\" (or at least, Sue claims this), this is really how a lot of people/parents feel. I'm not the type of person who should tell another that they shouldn't pursue their dream of doing XYZ, but Glee tries to glorify things like dance, and then it makes \"bad guys\" out of parents who say it[.] a bad decision to major in dance. They need a middle ground, i. e., do dance if you want, but it will be VERY HARD and competition will be insane.\n\nI really like art programs. I think they're important. I believe they're more important than sports. (Americans, please don't kill me for saying this.) Creativity, thinking for yourself, deciding things... that[.] important for a kid to learn.\n\nWhen I was in high school, I fancied myself good at art. (I wasn't. Trust me.) I could draw cute animals and the occasional anime-esque fanart, but boy did art/design majors sound fun! I had a lot of fun in my art classes even though I obviously did not pursue art as a career; our teachers played Italian opera music and we did projects that were fun and engaging, but also left some of the decision-making to us. It was great. It was a class that was easy to earn an A in if you came in and tried hard, but it was VERY important for relaxing and having fun in between stressful classes like calculus and chemistry.\n\nI can't say that art programs will still be going strong in four years or not; I just wanted to say that I hope they are. I believe our kids need them."}