{"doc_id": "613", "name": "2012_02_humanities_student_major_183_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2012-02-humanities-student-major_183_AskAcademia.txt", "pub_date": "2012-02-06T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.26", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "263", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3oaalk", "Reddit_id": "c3oewnu", "Subreddit_id": "t5_2sakj", "Commenter": "zouave1", "length": "1475", "content_scrubbed": "Firstly, when you state: \"If, as you say, Comparative Literature teaches the ability to \"synthesize, analyze and craft ideas\", then advising against graduate school, which is, more or less, further training in the synthesis, analysis, and crafting of ideas, implies a certain hypocrisy\" you are assuming that the training you receive as an undergrad is similar to that which you learn in grad school – it is not. In grad school you learn how to become a researcher, regardless of subject. Right now you have a small cadre of research skills. This is not the same thing.\n\nSecond, you appear as if you're upset with the university system as a whole and its function within a capitalist society. We're with you on that one. We're trying to give you practical advice. Clearly, at this point in history, the function of a university is to make profit. The ability for the school to prepare you for a job exists only in so far as it stems of a crisis of legitimacy, whereby the university is seen by most as not preparing one for much of anything, and simply taking your money. The difference, for humanities, or social science majors, is understanding this, and then deciding whether you want to take the skills you have and apply them to things out in the 'real' world, or continue to hone your abilities as a researcher within grad school – with the full knowledge that you will have little funding, have to move constantly, and that you may never end up in a job in your field."}