{"doc_id": "718", "name": "2012_10_humanities_student_major_331_berklee", "namespace": "we1sv2.0", "metapath": "", "pub": "Berklee", "title": "2012-10-humanities-student-major_331_Berklee.txt", "pub_date": "2012-10-08T00:00:00Z", "Sentiment": "0.089", "Subjectivity": "0.388", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "321", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_115scc", "Reddit_id": "c6jlqse", "Subreddit_id": "t5_2regy", "Commenter": "SerenadeOfSlight", "length": "1837", "content_scrubbed": "The tuition is definitely steep, there[.] no getting around that, however there are definitely ways to make it far more manageable. If you're seriously interested in coming, here is what I would recommend:\n\n* Get good at your instrument before you come here.\n\nThey can be generous with scholarships, but you definitely have to earn them. It helps if you don't play one of the common instruments (read: guitar and voice). I know they also have scholarship opportunities for composition. So if you're into that, more power to you.\n\n* Take some liberal_arts courses at your community college.\n\nFind out what the requirements are at Berklee for Liberal arts, and take those classes somewhere cheap. Email counselors at Berklee and verify with them that they'll take your transfer credit.\n\n* Study their core requirements.\n\nEverybody who goes through their program has to pass a certain amount of classes in Harmony, Ear Training and Arranging. You get tested on these things when you enter the school. (They may have changed this to during the audition process, I'm not sure.) If you do exceptionally well on these tests, you pass out of the classes, and get credit for all of them.\n\n* Test out of everything else that you can.\n\nEven once you're at the school, they have tests that give you \"credit by exam\". Take advantage of these. There[.] no reason to sit in a class and learn something that[.] irrelevant to you.\n\n\n.\n\nOverall, my best advice to you would be to try and get as much scholarship money as you can, and then get through the program as efficiently as possible. This doesn't mean blow through the college without absorbing anything, it just means that you shouldn't be paying money for them to teach you things that are irrelevant, or that you could learn on your own. If you have any questions feel free to pm me or respond.\n\n\n "}