{"doc_id": "769", "name": "2012_10_humanities_student_major_1050_subredditdrama", "namespace": "we1sv2.0", "metapath": "", "pub": "SubredditDrama", "title": "2012-10-humanities-student-major_1050_SubredditDrama.txt", "pub_date": "2012-10-21T00:00:00Z", "Sentiment": "0.169", "Subjectivity": "0.403", "Score": "60", "Upvotes": "60", "Downvotes": "0", "Wordcount": "392", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6pvz72", "Reddit_id": "c6pwwjl", "Subreddit_id": "t5_2ss5b", "Commenter": "PJCoursey", "length": "2538", "content_scrubbed": "the point, though, is that without engineers and scientists, we wouldn't have an organized society for the liberal_arts to exist.\n\nI suspect the lawyers, political philosophers, business-people, journalists, ethicists, teachers, technical writers, police officers, economists, chefs, clothiers, and military officers could lay equal claim to the success of an organized society. \n\nIn fact, I'm willing to bet that a good majority of architects, industrial designers, computer scientists, environmental scientists, aerospace engineers, doctors, and zoologists could cite a book, a painting, an essay, or some sort of aesthetic experience as inspiration for their work. \n\n the liberal_arts enhance our culture and self-understanding, but science and engineering are more or less a requirement for any sort of advanced society.\n\nI'm a graduate student in a humanities program in one of the top engineering schools in the U_S. I teach undergrads as part of my role here, so I get to interact with the hard engineering side on a regular basis. The idea that liberal_arts, in the form of communication, thinkers, or inspirers, are not needed by engineers and scientists is disappointingly small-minded. \n\nThese kids want to become aerospace engineers because they love science-fiction, or computer scientists because they were inspired by videogames. They quickly learn that not being able to effectively communicate an idea means the downfall of their career. And, of course, no one funds science if not for the business majors of the world. \n\nSo, I propose to you that instead of viewing the great STEM - Liberal Arts War as an either/or proposition, that you reframe your mental model as one of symbiosis. Sure, liberal_arts kids wouldn't survive without the medicines, roads, or homes built by the engineering community. And we're completely grateful for their contributions. But it[.] important to recognize that artists and craftspeople provide a great deal to the engineers. \n\nThe iPad doesn't exist without Star Trek. Consumer computer technology is pushed relentlessly forward because of the videogame industry. Democratic governments (especially the U_S) don't exist without philosophers. And, sure, engineers brought humans to the moon - and soon to Mars - but that didn't happen without a President who understood the emotions of people, and writers who could craft a speech that stirred the hope of a country. \n\nWe work together in a cycle of inspiration and creation. \n\n*Edit: Softened some rhetorical language*"}