{"doc_id": "690", "name": "2012_10_humanities_student_major_31_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-10-humanities-student-major_31_AskReddit.txt", "pub_date": "2012-10-01T00:00:00Z", "Sentiment": "0.069", "Subjectivity": "0.302", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "354", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6g5vmi", "Reddit_id": "c6g6cca", "Subreddit_id": "t5_2qh1i", "Commenter": "Male_Librarian", "length": "1990", "content_scrubbed": "I am taken aback by your outlook on otters (kidding). Thank you for the very detailed and well thought out post - understanding your state of mind has made me rethink some of my prior statements, but my advice, particularly #3 and #4 remain pertinent. \n\n(3) I would start where you are the most comfortable. If you are the most comfortable at school, start there. You can start by investigating which clubs or academic societies are on campus through your student life association. If you excel in a particular subject, seek an opportunity to do peer tutoring. If you enjoy the arts scene, look at the calendar of events for your local theater, art houses, coffee shops, etc. Or find a reddit meetup. There are a host of ways you can follow your interests to groups of similar, like-minded people. Explore those avenues and see if you can make a connection with others.  \n\n(4) It[.] not really a matter of going to each friend and asking how they feel about you. That is, as you pointed out, highly impractical and does come off as needy. However, if you have a bad day, and identify yourself as feeling 'down' to a friend, chances are they will try and build you back up. Regardless of the circumstance, whether what they say to you is true or not, people who have a vested interest in your happiness will try and say the_right things. \n\nAdditionally, I would advise you to speak with a counselor or therapist at some point. I understand there is a stigma attached to doing this that often creates reluctance, but I can attest that having an objective, third party to speak to about your emotions and thoughts is extremely helpful. I have sought out the counseling services offered by my employer before in the past, even in times where I had no feelings of angst or depression, and have always found it extremely helpful. If you lack this type of open relationship with a friend or acquaintance for the time being, I would recommend seeing someone who can facilitate the role of listener. "}