{"doc_id": "1553", "name": "2012_01_humanities_student_major_527_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2012-01-humanities-student-major_527_AskAcademia.txt", "pub_date": "2012-01-14T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.367", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "336", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ogqfj", "Reddit_id": "c3h3nhq", "Subreddit_id": "t5_2sakj", "Commenter": "in_question", "length": "1777", "content_scrubbed": "On an average day, I wake up at 5am, go to work by 7:30 and leave work around 5:30pm, I come home and spend time reading and grading usually 2-3 more hours of work centric efforts.   On weekends, I generally work most of Saturday at home, and Sunday I tend to relax a bit.  Overall, I'm probably working 60-80 hours, and that is split between teaching, research, writing, supervising graduate students, and administration.  on average i can expect to spend at least 15-20 hours a week in meetings and administration, though that can be more. I've been teaching quite a long time, so that doesn't take me as much time as newer professors, I generally aim for around 1 hour out of class for each hour in class and that accounts for 12 hours in preparation and teaching.  Grading varies week to week on top of that and can take up to around 40 hours in a week if i get screwed, but usually it is around 0-20 hours.  i try to maintain at least 10 hours of reading a week to keep current in the field.  Supervising graduate students rarely takes less than 5 hours per week and can take 20 or more, especially as several come close to doing their research projects.  That then leaves very little time for my own research, but that is what the rest of the time does.  Now, the issue there is between funding applications which seasonally will take 80 hours to produce if it is new, and 10 or so hours if it is a rehash, so that cuts into the research time too.  All in all, I'm saying that on a normal week I get maybe 10 hours of my own research time in, if i'm lucky.  Writing time i tend to use the hour and a half between breakfast and leaving for work, or around 6am until 730am.  I am in the social_sciences and have worked in the humanities also, and it isn't much different.  "}