{"doc_id": "657", "name": "2012_02_humanities_student_major_656_stanford", "namespace": "we1sv2.0", "metapath": "", "pub": "stanford", "title": "2012-02-humanities-student-major_656_stanford.txt", "pub_date": "2012-02-20T00:00:00Z", "Sentiment": "0.008", "Subjectivity": "0.418", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "656", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_py2mj", "Reddit_id": "c3t6a67", "Subreddit_id": "t5_2r7qd", "Commenter": "VardamanB", "length": "3630", "content_scrubbed": "First, congratulations! I'm currently here for the graduate program in journalism and I'm absolutely in love with the place. I came with the same fears: is it going to be social, will I meet new people, what[.] the over all atmosphere, etc. So to answer your questions:\n\n1. The social environment here is great depending on where you live. I live in Rains grad housing and I think it[.] absolutely the most social housing at Stanford. We have events every single day. They aren't parties or anything super special, but it could be something like a dancing class for an hour or a morning run or Thursday Night Thing (booze in one of the lounges, relaxed, easy going). We also host graduate-wide parties which are surprisingly fun. \n\n2. My department is really small so I like getting to know people from other departments. That hasn't been hard. I'm friends with a lot of people in mechanical engineering, aerospace and aeronautics, environment and energy, and other all-things math sorts of people. I know one English PhD student and that[.] the extent of my contact with liberal_arts people (aside from my program). So yes, there[.] interaction between departments if you just look for it. \n\n3. Munger is gorgeous, EV is lonely and barren, Rains is fantastic (the apartments are a little old and they feel old, but it[.] more than made up for with the community) and Lyman is on the other side of the planet. \n\n4. Most people here are already in relationships. I don't know if I've actually seen anyone \"date\" per se, but everyone single has at least had their own little side thing. I don't know if it[.] a \"there[.] not enough time in the day to date\" kind of thing or a \"I really don't want to date anyone here\" kind of thing, but, yes, what you've read is typically true: we don't \"date.\" People fuck. Fucking happens. You into fucking?\n\n5. I don't talk to undergrads and they don't talk to me. I like it that way as every time I've heard one speak I think \"Fuck you, you fucking idiot.\" I'm not actually that mean, they just come off as highly irresponsible/unabashedly coddled by the university. I have a class with one undergrad and a few co-terms and they always ask for extensions and it[.] just completely unlike my old environment.\n\n6. The graduates here are absurdly nice/friendly/social. I was really, really, really surprised. I thought everyone was going to be an outcast who would rather stay indoors and read than go out for a beer. Again, though, it really depends on where you live. I've heard and seen how lonely EV can get and it[.] downright depressing at times. It[.] also creepy as shit in some of its areas. Little god damn bungalows everywhere. Some of us are awkward/too uptight, but it shouldn't be too difficult to find a healthy group for you. \n\nI only have positive things to say about the place. I wouldn't say my social life has been neglected in any way, I'm just better at doing more things than I used to. I've grown accustomed to the workload and how to do what I need to do on time. My friend put it best: At Stanford, every single day you have to be on top of your shit. It[.] true, and that doesn't mean you can't have fun, it just means that you have to incorporate having fun into your schedule of being on top of your shit. But don't expect to go out every night or even more than once a week. Downtown Palo Alto is kind of weird (but still enjoyable) and typically people hang out at each other[.] apartments instead. \n\nAnd yes, you will still have time to reddit... but my redditing has dropped tremendously since I've been here to be honest. I don't even know what the fuck facebook is anymore. "}