{"doc_id": "1616", "name": "2012_01_humanities_student_major_1204_mcmaster", "namespace": "we1sv2.0", "metapath": "", "pub": "McMaster", "title": "2012-01-humanities-student-major_1204_McMaster.txt", "pub_date": "2012-01-30T00:00:00Z", "Sentiment": "0.025", "Subjectivity": "0.283", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "486", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3m3vfa", "Reddit_id": "c3m9voc", "Subreddit_id": "t5_2r79x", "Commenter": "huzaifa47", "length": "2677", "content_scrubbed": "B Line is an interesting point because it goes against the University[.] long_term strategy of having a pedestrian friendly campus, they were the one[.] who advocated for it leaving campus back in 2008. Secondly B Line is not a regular bus, it is a BRT(Bus Rapid Transit) line that is the bread and butter flagship bus of the city. It is supposed to take people from one end to the other in less than an hour max. On the same route the 1A King takes an hour+. It is merely a 5 minute walk from even the Arts Quad/Student Center to get to the Hospital. \n\nBy running it through Westdale, not only are you slowing down the route, you will have pissed of Hamiltonians because there will be alot of Mac students taking the bus from Westdale to Divinity College, that is not an effective usage of a BRT line. That bus also services Westdale Highschool, Columbia College, St Mary[.] and Highland down in Dundas. It also caused quite a bit of damage to campus roads that had to be relayed every summer. It also increases safety issues because based on my conversation with a Bus Driver there is least amount of tolerance for being late on the B Line, having taken it for a couple of years I can recall many instances of a Bus Driver Gunning it to catch up. \n\nAs for the 12 Months thing, It will be very useful for the students who stay back in the summer; however I have seen no economic analysis from Erl proving his push. You cannot lobby anyone based on the idea of \"oh it looks like a good idea\"; these numbers are easily crunchable with no more than 30 minutes of research work (Protip: Go to Registrar[.] office to get # of summer students, Talk to MSU Business Manager about the specifics of our contract). The reason we have a cheaper bus pass is because of the sheer number of students that subsidize costs for the HSR(which mind you, according to a recent report has multiple routes serving Mac at a loss), HSR will absolutely not budge unless we reach an Economic Threshold, for that I have a feeling the Bus Pass costs for the entire student body will go up by quite a bit. \n\nAs for Wifi, I know quite a bit about this project since it[.] something I've been working on briefly in my capacity as the External Affairs Commissioner. There are quite a few spots(eg: BSB) that lack Wifi and others that lack bandwidth for high volumes. UTS has specific dollar figures that it is requesting the Administration or University to fulfill. It can be potentially beneficial for increasing study space, there is a major shortage of space in the Libraries and Empty Classrooms can be a great alternative. In the future it would also be useful for Interactive Collaborative Learning. \n\n\n\n\n\n\n"}