{"doc_id": "726", "name": "2012_10_humanities_student_major_480_personalfinance", "namespace": "we1sv2.0", "metapath": "", "pub": "personalfinance", "title": "2012-10-humanities-student-major_480_personalfinance.txt", "pub_date": "2012-10-10T00:00:00Z", "Sentiment": "0.103", "Subjectivity": "0.404", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "285", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6jw09n", "Reddit_id": "c6kliiu", "Subreddit_id": "t5_2qstm", "Commenter": "PlayForMeeps", "length": "1691", "content_scrubbed": "On this note- you need to carefully analyze the costs and benefits of taking out loans to go to school. It[.] frustrating to watch people react to stories of massive student loan debt and think that means you should go and get a bargain-basement education. Not all degrees are created equal, and not all programs are created equal. Look for a *good* school- what[.] their four year graduation rate? Where do their graduates go after graduation? What[.] the relationship between students and professors? These things are important- an extra semester or careless advisor can cost you. And pay attention to what kind of networking and hands-on opportunities you'll have while in school and following graduation- they matter. \n\nI've gotten a lot of criticism for going to a private liberal_arts college with tuition approximately 2. 5x what I'd pay at a state school, but I wouldn't want to be anywhere else. When I was applying to schools I didn't understand how big of a difference small class sizes and available/approachable professors could make. I'm studying chemistry and was able to get research experience after my first year. I've had the opportunity to meet a number of researchers from other institutions and should have my work published before my junior year- to me, all of that is completely worth the debt I took on. \n\n\nThat being said, of course, I worked my ass off applying/interviewing for scholarships and don't pay even close to full tuition. Think about what you want to be doing in 10 years, but don't attend a school based solely on cost. I'd rather have to take out more loans in exchange for valuable experience, networking, and the opportunity to become a better person. "}