{"doc_id": "784", "name": "2012_10_humanities_student_major_1238_berkeley", "namespace": "we1sv2.0", "metapath": "", "pub": "berkeley", "title": "2012-10-humanities-student-major_1238_berkeley.txt", "pub_date": "2012-10-24T00:00:00Z", "Sentiment": "0.14", "Subjectivity": "0.36", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "429", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_121hmo", "Reddit_id": "c6rez32", "Subreddit_id": "t5_2qh9w", "Commenter": "ultralame", "length": "2629", "content_scrubbed": "Don't believe the naysayers.  There[.] always a way in.   I have seen this at Stanford, Harvard, Caltech, etc.\n\nI got in, back in 1992 with a lower GPA than anyone in my dorm (except a couple athletes), marginally lower SATs and I did it from out-of-state.  I got lucky, but here[.] what I learned about how I got accepted...\n\nBerkeley is made up of multiple colleges within the university.  [Letters and Science (humanities + most natural sciences), Engineering, etc.](http://berkeley. edu/academics/school. shtml)  You aren't getting into Engineering or L&S.  Those colleges turn down even great students because *everybody* wants to get in to those.\n\nBut the other colleges: Environmental Design, Chemistry, Information, Natural Resources... those are not as in-demand.  The thing is, you have to declare a major within one of those to be accepted.\n\nWhen I was at school, 2/3 students in ChemE dropped out. changed majors after freshman year.  And they didn't have that many applicants.\n\nAt the time I was there, Library Sciences (now Information) had something like 6 undergrads; if you had a pulse they accepted you.\n\nNatural Resources (Wood Engineering, I shit you not) was a great place to sneak in the back door.\n\nOnce you are in, all you have to do is maintain a non-failing average and you will be first in line to transfer colleges sophomore or junior year.  And for most majors, Freshman year is a lot of the same classes (science-based majors all take Chem, Physics, math; then there[.] english, history requirements, blah blah blah.  I am sure much has changed since I graduated 15 years ago, but I am sure that you can find classes that work.)\n\nSeriously, I knew people who had already decided to switch majors by the time we showed up in the dorms.  No problem if you just keep up some decent work.\n\nDoing a quick search, it looks like Chemical Engineering (now Bioengineering) is not easy to get into as a freshman.\n\nBut looking here, at transfer stats, you see that Nat Resources looks promising, especially Conservation and Resource Studies (50% admission of transfers):\n\nhttp://students. berkeley. edu/files/Admissions/12626_5. Info_TransAdm. pdf (2ns to last page)\n\nNote that I also went and ran a custom table for Cal here:\n\nhttp://statfinder. ucop. edu\n\nWhich shows that for the majors you can correlate in the two tables, it looks like undergrad admissions are HIGHER than the transfer admissions.\n\nYou can always call the admin offices of those colleges and tell them you are interested.  If they seem excited to hear from you (and I know that[.] lame, but it[.] true), you are on the_right path.\n\nGood luck!\n\n\n\n\n\n"}