{"doc_id": "671", "name": "2012_02_humanities_student_major_836_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2012-02-humanities-student-major_836_UofT.txt", "pub_date": "2012-02-24T00:00:00Z", "Sentiment": "0.112", "Subjectivity": "0.347", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "401", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3urf3c", "Reddit_id": "c3usd24", "Subreddit_id": "t5_2rbaq", "Commenter": "[deleted]", "length": "2286", "content_scrubbed": "Humanities student here (History/Religion double major) and would like to comment on the social aspect that you brought up. Honestly, you arent missing much. Unless you are part of a frat, a club, organizing your own events to meet people, enrolled in the school with a series of friends from high school, or live on campus, chances are you, like I, will finish your program without experience certain popular social things that universities have to provide (and by popular social things, I am specifically referring to what Hollywood/popular media have popularized).\n\nSince enrolling at UofT (UTM) then transferring to St. George so far (I have 1 semester left), I have attempted to immerse myself in the social experience that the university has to offer and honestly it all a huge joke and isn't worth it. It is a big waste of time. You are better off just concentrating on finishing your degree as soon as possible, with the best grades possible, and getting the hell out of here. Not saying to not be social but if you don't want to be disappointed, lower your standards and expectations greatly. It is what I have done and things have become so much simpler and less hectic.\n\nBetween my time at UTM and St. George, I think I have dedicated at least 500 hours, maybe more, to helping classmates, in person and over the internet, to helping others prepare for exams, write essays, and even at times, help them argue for better grades, which has earned me the nickname of \"The Professor\". But I share this with you for the reason that out of said amount of invest hours, not a single one has developed into a friendship. I am not bitter one bit, indifferent actually. But it made me realize that, unlike high school, people at the university level are all *users*, who use people to get wherever they are going in life then discard them once they have served their use. Most of these *users* just don't have time for others outside of school interactions, such as studying, collaboration, due to their hectic life style; studying, working, and a lot of them have a girlfriend/boyfriend to accommodate. Hence why I am not bitter, but at the same time I have come to the conclusion to have zero expectation from your fellow class mates because they are probably in the same boat as you."}