{"doc_id": "628", "name": "2012_02_humanities_student_major_360_shittyaskscience", "namespace": "we1sv2.0", "metapath": "", "pub": "shittyaskscience", "title": "2012-02-humanities-student-major_360_shittyaskscience.txt", "pub_date": "2012-02-11T00:00:00Z", "Sentiment": "0.029", "Subjectivity": "0.405", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "301", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pkz42", "Reddit_id": "c3q7h8s", "Subreddit_id": "t5_2sw51", "Commenter": "chalks777", "length": "1904", "content_scrubbed": "This is a poorly structured question, and needs some definition to become worthy of Science.\n\nFirst, what is an analgesic?  \nWe all know that every painkiller is an analgesic, but interestingly, not every analgesic is a painkiller.  This is known as the square-rectangle hypothesis, and is easily demonstrated by finding both in the same set of points *[Krevald & Berg (pdf)](http://alexandria. tue. nl/repository/books/369233. pdf)*.  I don't like to make assumptions while doing Science, but the poor nature of OP[.] question forces me to do so.  I will therefore be talking about the subset of analgesics that are not also painkillers.\n\nSecond, what is a non-painkiller analgesic?  \nThis is difficult to nail down, as wild non-painkiller analgesics (or WNPAs) are exceedingly difficult to capture.  Most leading scientists agree that Australia has the most potential for finding more, but currently the only known species live in France.  They were only captured after they willingly gave themselves up.  Regardless, all known WNPAs can be ground up to form Iocane powder.  Most other analgesics, like the Advilius Americana are easily captured, and can simply be processed in the chemical plant to create Advil.\n\nFinally, what is the proper way to use an WNPA?  \nThis is where we tread from science into social \"science\", so I apologize in advance.  Most use this analgesic as a poison to subdue their enemies as it[.] both odorless and tasteless.  You must carefully analyze your opponent however, as there are several things that could influence which glass they would drink from if given a choice.  Major factors include whether they have ever lived in Australia, and perhaps most interestingly whether you've been in a land war in Russia.  I recommend reading further about these social_sciences at your local liberal_arts school.  However, I don't really recommend going to a liberal_arts school."}