{"doc_id": "605", "name": "2012_02_humanities_student_major_74_gatech", "namespace": "we1sv2.0", "metapath": "", "pub": "gatech", "title": "2012-02-humanities-student-major_74_gatech.txt", "pub_date": "2012-02-02T00:00:00Z", "Sentiment": "-0.004", "Subjectivity": "0.418", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "378", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p7hm3", "Reddit_id": "c3n8wuz", "Subreddit_id": "t5_2r8t2", "Commenter": "Throwaway979837", "length": "2174", "content_scrubbed": "In the spirit of full disclosure, I'm using a throwaway account.\n\nThe good:\n\n* The camaraderie is incredible. When pulling all nighters in the library, it was always encouraging that there were so many people doing the exact same thing as you. \n\n* The library. Although not the best when it comes to books, GT makes sure the library is incredibly comfortable since for most students, it is their second home. Almost everything you'd need (besides a bed) is readily available. \n\n* Not being an engineering major at an engineering school. I loved the way major classes involved around technology and science (yes, even the liberal_arts). It provides a very different perspective that you normally wouldn't find in a liberal_arts school. \n\nThe bad (and the ugly):\n\n* I felt like the put academic reputation above everything else, including student welfare. I was raped on campus by a fellow student and when I approached the administration about it, I was vilified. Seriously, there[.] been few times in my life where I've been treated worse. The case was reviewed by a bunch of students who had no idea what they were doing. Even though there had been reports of separate instances where this guy had raped other students, he was not punished. Unfortunately, I've heard from many sources that this is often the case. An inside source told me that it is because GT is terrified of getting sued. I was also given a 'gag order' where I was told GT would punish me if I told anyone that that guy had raped me. Even though I've already graduated, I'm still afraid of Tech coming after me - hence the throwaway. \n\n* Sexism is rampant. A lot of guys (not all of them) often treat women horribly. Academically, girls are often underestimated. I've heard of many instances where girls have to fight to get assigned significant portions of group work or even handle power tools. Outside of academics, it is even worse. You can only be a slut or a bitch (They call it TBS - Tech Bitch Syndrome where if girls are not interested in a particular guy, they've automatically got TBS). \n\n* Professor/student relations are very difficult. Other people have elaborated on this point quite well. "}