{"doc_id": "803", "name": "2012_10_humanities_student_major_1371_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2012-10-humanities-student-major_1371_AskHistorians.txt", "pub_date": "2012-10-27T00:00:00Z", "Sentiment": "0.154", "Subjectivity": "0.426", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "278", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6sngtd", "Reddit_id": "c6snv0s", "Subreddit_id": "t5_2ssp3", "Commenter": "khosikulu", "length": "1559", "content_scrubbed": "Is this someone who went through the system in the 1960s or early 70s, when there were jobs?  Who went to an Ivy League school (which now mostly support their grads all the way through too)?  I had colleagues like that when I taught in the Ivies but they were born very much in a silver-spoon environment and often had a sense that those without the resources shouldn't be part of the academy.  It was annoying and, being one of those born without resources (but with the requisite white male privilege and the gift of adaptability to new social environments, whether in rural parts of southern Africa or the halls of privileged academe) this was obnoxious to me.  I've had four students in the last three years go on to graduate study in history, and none of them are paying for it out of their own pockets.  They do have to teach or otherwise sing for their funding suppers, but that[.] all right--it serves them in terms of professionalization as well.\n\nThe JDs or MDs keep that level of investment  necessary because they'll make it back.  In Classics, or areas like that, you only make it back at the very top levels, and after many years of sacrifice.  You can (and likely will) spend $250k on a PhD, but *make sure it isn't your own money*.  Programs that require grads in humanities and even social_sciences to take out massive loans are running on a business model that serves their bottom line but is fundamentally inhumane.  Some of those with the biggest burdens on grads for their funding aren't great, but they're far better than the first group."}