{"doc_id": "669", "name": "2012_02_humanities_student_major_765_metacanada", "namespace": "we1sv2.0", "metapath": "", "pub": "metacanada", "title": "2012-02-humanities-student-major_765_metacanada.txt", "pub_date": "2012-02-22T00:00:00Z", "Sentiment": "0.217", "Subjectivity": "0.372", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "361", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_q1tbj", "Reddit_id": "c3u3ecx", "Subreddit_id": "t5_2sh5g", "Commenter": "relationship_tom", "length": "1975", "content_scrubbed": "I live in Conservative central (Southern Alberta). Been here a while so I like to think that I have a good read on the Conservative mindset. With that said, most of these bills are not what most Conservative voters want. They don't even know what the fuck most of them are. They voted against the liberals and NDP and for the Conservatives on a few some things like scrapping the gun registry and a lot of the farmers for the wheat board thing (Even though a good portion of them will get fucked by this). \n\nFor a good amount of the other bills, it was presented to them in a way that doesn't give a good idea of the nature of the bill. It was fed as an easy to support slogan akin to the recent protect children fiasco. \n\nConservative voters, like most voters of all parties, don't even know the majority of the basic issues their party is about. I like to think that I keep up on politics a lot more than most and I couldn't tell you most of the things the Conservatives, Liberals, or NDP stand for. So when you say that 34% of voters support even the majority of what the gov't is doing, it[.] a bit of a stretch. \n\nI talk to friends and family in Lethbridge, Red Deer, Calgary (The old school Conservative Calgary communities of Elboya and the like, Harper[.] area), and they don't even know half the issues that people on r/Canada bitch about. Half these people are Liberal as fuck in their values but they despise the Liberals. Most everyone I teach about the internet that are staunch Conservatives now stream/torrent movies and load free music on their ipod. Many expect the gov't to fund the arts and music programs they like. They think we should be getting a lot more tax dollars from Fort Mac. Now that they are older, they want ramped up funding for healthcare. They think talk of increased privatization is bullshit. These are people that have voted nothing but the_right for decades. \n\nReally, Canada as a whole is central left_leaning to very left_leaning. \n\n\n\n"}