{"doc_id": "736", "name": "2012_10_humanities_student_major_587_futurology", "namespace": "we1sv2.0", "metapath": "", "pub": "Futurology", "title": "2012-10-humanities-student-major_587_Futurology.txt", "pub_date": "2012-10-13T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.284", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "274", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11ctww", "Reddit_id": "c6lyjt1", "Subreddit_id": "t5_2t7no", "Commenter": "ClassicalFizz", "length": "1604", "content_scrubbed": "The k-12 school system really needs to change. Its a left-over from the industrial revolution that trained the masses the few skills, basic knowledge, and obedience to authority that they would need for their factory jobs. \n\nAll those factory jobs are gone now, but we are still training people to arrive at a certain time, and move between simplified modular tasks  when the bell rings. The tasks are still kept very simple, repetitive, and generally dont require much creativity or real thinking (although teachers do try to ad this in to their classes, its mostly not achieved and its possible to get straight As all thru school without every having come up with one single original thought).\n\nSo, how can things change? First of all, the complete curriculum should be on computers and available for testing at the whim of the student so that any of the bright students who want to excel can simply go thru the material at their own pace and progress thru all the grades at their own speed. Holding the genius back because the rest of the class is still learning 2+2=4 (for the 10th time) is really damaging to those bright children. \n\nAllowing students to follow their areas of interest. \n\nAllowing students to participate in physical activity if they wish. Stop forcing active little boys to sit still and listen for 6 hours. If they want to run outside and do active learning, that should always be available for them. \n\nAt higher levels, One-on-one tutoring and apprenticeship (which is really just tutoring for the arts and the trades) should be available in all categories, not just the basics. "}