{"doc_id": "1611", "name": "2012_01_humanities_student_major_1144_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2012-01-humanities-student-major_1144_AdviceAnimals.txt", "pub_date": "2012-01-29T00:00:00Z", "Sentiment": "0.011", "Subjectivity": "0.397", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "448", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3lp9ww", "Reddit_id": "c3lqop7", "Subreddit_id": "t5_2s7tt", "Commenter": "[deleted]", "length": "2674", "content_scrubbed": "Well, the modern research/university system was invented in Prussia in the 1800s.\n\nErrr. Wrong. Sorry! Bone up on medieval history a little more before you make that ridiculous stretch. Cambridge was founded in 1209ish and had much the same model as we currently have - which is that the focus is on **contributing to scholarship** not teaching students. \n\nThe whole methodology is a product of the methodical German mindset. \n\nWell, that[.] another stretch - Deutschland is a rather large country with rather different cultures between regions. Stuttgart is not like Berlin is not like Munich. I'm not sure I'm comfortable with your (rather hollywood) generalization of Germans. \n\n. In some ways, it[.] oddly out of place in anglophone countries - because the people in our culture think differently than German speakers do.\n\nWell, if you want to make a cultural argument then anglo-saxxon culture **IS** Germanic, as is English itself. If anything we've more in common in a cultural sense than we would with the French. \n\nBut yea, keep on with the pseudo racist \"germans are like robots beepboop\" shit. As someone who speaks passable german and has spent some time in Stuttgart and Berlin I find your assertions pretty laughable. \n\n\nThey still provide a far better education over there in central Europe, than we do in the Anglophone world \n\nWhich is why our Universities consistently put out better research... amirite? Or maybe it was why central Europe was host to the discovery of DNA[.] structure... oh wait, that was the UK. \n\nInterestingly, the system does not work well in the humanities.\n\nYou just sound like you couldn't hack it... or never got to upper division classes, which are typically small and intensive in Humanities departments. \n\n\nIn the humanities there are more opinions floating around than hard facts, and so the job really ought to be focused on teaching the students how to think critically rather than on trying to impart a familiarity with a vast system of concepts.\n\nUh, yea. That[.] what they do. In order to think critically you must have more than one lens with which to think with - this is why \"vast systems of concepts\" are useful in disciplines like philosophy and history and English.\n\nWhatever, you're not an academic and you've obviously got some sort of entitlement complex about grades. If i were to go out on a limb I'd say you're mediocre smart and a bit lazy and had some ego-crushing bad grades delivered to you and instead of learn better time management or figure out how to think better you got offended because, well, you *deserved* that 4. 0! How *dare* they give *you* a measly 2. 9! Can't they see how *brilliant* you are??!\n\n\n\n"}