{"doc_id": "1558", "name": "2012_01_humanities_student_major_579_academicphilosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "AcademicPhilosophy", "title": "2012-01-humanities-student-major_579_AcademicPhilosophy.txt", "pub_date": "2012-01-15T00:00:00Z", "Sentiment": "0.218", "Subjectivity": "0.448", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "344", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_oim98", "Reddit_id": "c3hktat", "Subreddit_id": "t5_2r7v0", "Commenter": "robersa3", "length": "1952", "content_scrubbed": "Currently a philosophy grad student. I went to a small, private liberal_arts college, ranked decently but certainly far from top 10. The extra attention definitely helped me because I wasn't prepared academically for college.\n\nI studied PPE, but if I could do it all over again, I would have probably studied math in undergrad, with a minor in philosophy. I don't like math. I certainly don't love it. But, I think it would have been more valuable to me in the program than my politics courses were (they were great, I loved them, but maybe 2 actually helped me for grad school in philosophy), and I think some math might be more impressive towards admissions committees, who are drowned with a hundred humanities-type applicants each year.\n\nThere have been some recent articles / research that top 10 philosophy PhD programs tend to accept students from top 10 universities at a much higher rate than other universities, so that[.] probably your best bet: try to get into a school with a lot of name recognition. It does not mean you will get the best quality education, but application committees definitely notice it.\n\nMy last bit of advice is to be humble. Philosophy attracts some smart cookies. You're a high school student, so you are probably pretty used to sitting in classes full of kids who can barely spell. When you take that next step, it can be a bit of a shock to see how much better prepared other people are. Take it all in stride, and remember that it is a long haul.\n\nFinally, choose something halfway practical in undergrad. If you can somehow manage a math / comp sci / philosophy type deal, that would be golden. In my grad program, probably 80% of the grad students realize in the first year that working in academia is not what they expected, and choose different routes, even though at one time they were just as enthusiastic and passionate about philosophy as you are.\n\nKeep up the good work! Good luck with your applications!"}