{"doc_id": "811", "name": "2012_10_humanities_student_major_1468_askcomputerscience", "namespace": "we1sv2.0", "metapath": "", "pub": "AskComputerScience", "title": "2012-10-humanities-student-major_1468_AskComputerScience.txt", "pub_date": "2012-10-30T00:00:00Z", "Sentiment": "0.088", "Subjectivity": "0.342", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "397", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_12d5va", "Reddit_id": "c6u4kyf", "Subreddit_id": "t5_2shke", "Commenter": "fodder008", "length": "2216", "content_scrubbed": "I went to a public liberal_arts college and graduated with a BA in computer science since a BS was not available there. Between me and the approximately 10 other CSci only one of us did not have a job before graduation and the vast majority of us had more than one offer. The singe person without unemployment was due to him not looking for work until the last minute and because he has a police record. That being said he has received a lot of interest despite all of these things.\n\nEveryone is starved for programrs and a CSci degree is a simple way for businesses to quickly judge some base level of competency. [This study](http://www9. georgetown. edu/grad/gppi/hpi/cew/pdfs/Unemployment. Final. update1. pdf) done by Georgetown and published at the beginning of this year shows recent CSci graduates with an unemployment rate at 7. 8%, in my area (the midwest) it[.] under 2%. All these would tend to indicate that no, most people are not going to care if you have a BA rather than a BS.\n\nI'm not sure what else you could do with a degree in Computer Science besides some form of programming. You could probably do what everyone else with a college degree does for their first job and maybe a little better since most people seem to hold attaining a CSci degree in high regard (at least in my experience).\n\nRegarding the Stats vs Math degree from what I've seen Stats and Math pull from very different job pools and from that same Georgetown study unemployment rates for recent Math graduates was at 6. 1% and experienced Statistics graduates had 4. 4% unemployment (no data for recent grads). \n\nAny way you split it, it looks like you are going to find a job with any of these four degree options. My advice is choose the one that you enjoy the most. What do you hope to get out of a CSci degree for instance? Do you want to program 8 hours a day? Or do you mainly enjoy programming Math or Stats related stuff? If it[.] the former that[.] great welcome to the club! If not, that[.] also great; we need more Math and Stats people out there who are interested in programming. Both of those areas are heavily integrated with computers nowadays, so you get the best of both worlds in some sense. Go do what you want to do!"}