{"doc_id": "684", "name": "2012_02_humanities_student_major_958_mma", "namespace": "we1sv2.0", "metapath": "", "pub": "MMA", "title": "2012-02-humanities-student-major_958_MMA.txt", "pub_date": "2012-02-27T00:00:00Z", "Sentiment": "0.072", "Subjectivity": "0.269", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "603", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3vo653", "Reddit_id": "c3votyu", "Subreddit_id": "t5_2qhj4", "Commenter": "Crants", "length": "3472", "content_scrubbed": "It[.] showing the evolution of Martial Arts (hence the title).\n\nThe first part shows man[.] evolution from earlier apes... Granted, the chimpanzee isn't TOTALLY accurate, but it gets the idea across. From there, it goes on to show that from the very beginning, man has fought. You have..,. I guess a  Greek Soldier shooting a takedown against some kind of African tribal warrior, who then turns around and gets thrown by a Roman guy, who gets kung-fu'd by what appears to be a Shaoiln Monk (He[.] Chinese, anyway...). He gets Karate'd, and that guy takes on an old fashioned Fisticuffs fella. He gets beaten with Muay Thai (Muay Boran, maybe?) and HE gets beaten by a modern pro boxer, who in turn gets beaten by a generic MMA guy.\n\nThe timeline might not be exactly correct (Muay Thai may have been around for thousands of years, according to Wikipedia) but the video is designed to give the impression that MMA as it stands today has taken the best of it[.] predecessors, and evolved to become a more complete, competitive and exciting sport.\n\nTakedowns from Greco-Roman and Freestyle wrestling, strikes and throws from eastern martial arts like Judo, Karate and Kung-Fu, the clinch game and vicious leg kicks from Muay Thai, the guard, gloves, and strikes from western Boxing... without these, we wouldn't have MMA as we know it today. And without these, a fighter is not a complete mixed martial artist.\n\nPeople like GSP (Black belt in Kyukoshin Karate, trains with Canada[.] Olympic wrestlers, BJJ black belt, top-class boxing...) and Anderson Silva (Black Belts in Judo, Taekwondo, BJJ, Muay Thai, skilled in Capoeira and Boxing...) epitomise the theme this video is trying to get across. \n\n\n\nThere are two major things to take away from this video. \n\nFirst is respect. Respect for where the sport has come from, and the people that made it what it is. Respect for the arts that came before, and what they have given to MMA today. \n\nThe second is... I guess I'd call it hope. A sense of excitement for what[.] to come. \n\nToday, we're seeing the new generation of MMA guys. First, we had the 1 disipline specialists (Royce Gracie, Ken Shamrock *et al.*) \n\nThen we had the guys who had a couple of things going for them. A two or three type martial artist, I guess (this means guys like Chuck^(wrestling/karate/kickboxing) and Rampage^(Boxing/Wrestling/Boxing. again) . \n\nNext up, the generation that[.] in it[.] prime now, and will be on its way out in the next few years.  These are the guys who are champions in a couple of things, and highly skilled in EVERYTHING ELSE. This means guys like GSP and Silva. Even Nick Diaz, Frank Mir, BJ Penn... Big Nog has become this. Guys without no obvious weakness. \n\nFinally, after what turned out to be a hell of a wall of text, we come to the guys who will be champions soon. These are the guys who, since they started fighting, have trained MMA. Guys who don't need to learn... for instance, how ot set up their takedowns with striking, like an ex-wrestler might, because *they've been doing it from the start*.  I've heard Jon Jones described like this, although he did some wrestling in college. These are the young guys who will be tomorrow[.] champions. \n\nThis is what I mean when I say hope. It[.] excitement for who will be the next champ? Who will be the next innovator, the guy who changes the MMA world forever? It[.] not just about improving, it[.] about evolving. \n\nAnd that[.] why I think the video is pretty fucking cool. \n\n"}