{"doc_id": "1509", "name": "2012_01_humanities_student_major_47_cogsci", "namespace": "we1sv2.0", "metapath": "", "pub": "cogsci", "title": "2012-01-humanities-student-major_47_cogsci.txt", "pub_date": "2012-01-02T00:00:00Z", "Sentiment": "0.026", "Subjectivity": "0.295", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "271", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_nzp69", "Reddit_id": "c3d7w8p", "Subreddit_id": "t5_2qh0k", "Commenter": "pork2001", "length": "1662", "content_scrubbed": "I do like the idea of repurposing disused malls to include a minischool. The infrastructure is already there to accommodate people (bathrooms, food, HVAC, lighting) and there is plenty of parking. Some types of labs could be arranged too. Biology has been moving somewhat to things like computer-based dissection and other tools, chemistry has been moving to microchemistry in labs, physicis does require some equipment though and engineering labs are expensive-equipment intensive. But that[.] the sciences. The humanities would be less in need.\n\nI was involved on the edges with Carnegie-Mellon[.] West Coast University which has extensive video and remote conferencing classrooms. They allow students all over to participate in classes in the Mountain View buildings and interact with a professor fairly easily.\n\nWe are entering a time of changes, some good and some bad. Some will allow more flexibility in learning, such as MIT[.] open university schemes. Some force changes in traditional things such as open office hours where students could get physical access to a professor. \n\nI think another change that would be useful would be open and self-paced learning. Some people need to learn at their own pace; as an undergraduate I flunked a hard physics course when I simply could not keep pace with the lectures and successively fell too far behind. Yet in later years I returned to the material and was able to absorb it at my own speed, overcoming confusing material by reading outside the textbook in other treatments. That worked. I suspect other people too may not fit the mechanical forced pace of conventional schooling. So I hope new ways come to be."}