{"doc_id": "703", "name": "2012_10_humanities_student_major_216_christianity", "namespace": "we1sv2.0", "metapath": "", "pub": "Christianity", "title": "2012-10-humanities-student-major_216_Christianity.txt", "pub_date": "2012-10-05T00:00:00Z", "Sentiment": "0.12", "Subjectivity": "0.316", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "276", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1102zr", "Reddit_id": "c6i9clt", "Subreddit_id": "t5_2qh6c", "Commenter": "BlueBird518", "length": "1562", "content_scrubbed": "Greenville College in Greenville Illinois. Liberal Arts Methodist school - studied English literature and Mass Communication.\n\nHad to do 36 chapels a semester and do community service if you didn't make that many.\n\nGirls and Boys in separate dorms - no one of the opposite sex allowed in the dorms from 11 PM til 11 AM.\n\n\"Lifestyle Statement\" - No sex, drugs, smoking, drinking, swearing, or rated R movies. I know people who did them all :P Curfew was at 11 PM for freshman and sophomores and I think 1 AM for juniors and seniors.\n\nRequired to live on campus unless you were married or needed at home (parents who needed help/sickly, etc)\n\nDorm room checks regularly for rule breakers. Doors had to be open at all times when visiting with the opposite sex. But this was only for senior housing. If you were freshman/sophomore in the dorms, the boys or girls could not be in your room AT ALL, but had to visit in the common room.\n\nHad required Christian courses every year called CORE, and they lecture on the foundations of Christianity and such. My favorite was \"Science and Christianity\" which taught how to find God in science. And the last one \"COR 401\" was a project lab. Each year had a theme, such as... money, or gender stereotypes. Then in groups of 6, as a project, had to find an issue within this theme and present it to an audience with research, surveys, and a Christian solution. These \"CORE\" classes were required to graduate. \n\nGood things .... \"Humans vs Zombies\" competition every January. Last person to not become a \"zombie\" was the winner."}