{"doc_id": "1583", "name": "2012_01_humanities_student_major_831_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2012-01-humanities-student-major_831_funny.txt", "pub_date": "2012-01-23T00:00:00Z", "Sentiment": "0.094", "Subjectivity": "0.316", "Score": "319", "Upvotes": "319", "Downvotes": "0", "Wordcount": "753", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3jvtue", "Reddit_id": "c3jwdez", "Subreddit_id": "t5_2qh33", "Commenter": "snipawolf", "length": "4181", "content_scrubbed": "There are far more easy jokes to make than that! Any of these are guaranteed mountains of steaming hot Red:\n\n* There are no Matrix sequels, or Star Wars prequels, and Indiana Jones is a trilogy.\n\n* If you have a humanities major you must work at Starbucks.\n\n* If there is a celebrity that you approve of, you must refer to them by their official title, \"[First name] FUCKING [last name]\"\n\n* Speaking like an English nobleman (\"You sir, are a gentleman and a scholar!) can often intimidate peasants into backing away from your awful \"This!\" post.\n\n* Don't just post \"repost\" if you have already seen something before. Try to work a pun in there first if upvotes are desired.\n\n* if you make exactly what I want and at a reasonable price, I will be compelled to recommend shutting up and taking my money.\n\n* Due to the immense danger placed upon a redditor who expresses a dissenting opinion, \"SO BRAVE\" can reveal your begrudging respect for the protestor, and cause more courageous souls to speak their minds.\n\n* Sarah Jessica Parker is a horse.\n\n* Justin Beiber hasn't hit puberty yet, and there is no evidence that he will.\n\n* All Nickelback songs are the same shitty song.\n\n* Any minor greivence you experience in your cushy life can instantly be made hilarious when paired with the first world problems meme.\n\n* \"Checkmate, Atheists!\" Because it is fun to win debates against stupid people, even if you made them up.\n\n* P-dub has just faded into obscurity. Warlizard and forthewolfx no doubt wish they could follow.\n\n\n* Because Australians live on the opposite side of the globe, they perceive reality upside down.\n\n* Team forretress 2 is a great hat simulator, huh guys?\n\n* But where is the black guy THIS time?\n\n* Anything at all pertaining to dub step, you can write WUB WUB WUB WUB WUB WUB as a witty response.\n\n* You have more options with Skrillex, like criticizing his fans for only liking drops.\n\n* If you are wondering, never hesitate to ask \"is that you?\" if you suspect a celebrity is hiding behind an account.\n\n* Atheists eat babies, LOL!\n\n* MacBooks are $2000 Facebook machines, because obviously such simpletons are not capable of anything else on their computer.\n\n* Insert forced 4chanisms into everything, because life is about looking down on other, lesser internet communities. Speaking of which, don't forget to disparage Facebook, Tumblr, 9gag, Digg, and Funnyjunk for their simple and unsophisticated le rages and cat pictures.\n\n* You can compare Twilight with anything awful and say that it is still better than Twilight for great effect. The opposite sex will be swooned by your developed tastes.\n\n\n* Talk about how big bang theory doesn't depict the true PHD physicist that you are.\n\n* You can quote a TV show completely out of context, but they must be either Arrested Development, Community, or 30 Rock. \n\n* The acceptable quotes are \"Like the guy in the 3000 dollar suit is going to [verb], COME ON!\" \"streets ahead.\" and \"I want to go to there\" respectively. Other quotes are apparently not memorable enough to post on all but the most relevant threads. \n\n\n* Modern Warfare 3 is an awesome expansion pack!\n\n* Every time a new cure is found or a new discovery is made, mention how it is either the start of I Am Legend, or the Mayans are right.\n\n* Post a slowpoke meme of literally anything that happened in the past. Post a Why Not Zoidberg? meme every time anyone asks for something. \n\n* Call anything admirable a GGG and anything you do not like a Scumbag Steve. \n\n* Make a classic reddit switcheroo, or better yet make a post linking to all the other ones.\n\n* Call someone a hipster and be sure to talk about how they liked it before it was mainstream. \n\n\n* it was me personally who drew a trollface on that fundraising poster in your dorm.\n\n* **X Z I B I T**\n* Impressive feats done by an Asian are said to be at his difficulty level.\n\n* And, of course, \"Lawyer up, Delete the Facebook, and hit the gym.\" Or any of the multitude of variants derived from said mantra.\n\n* Also, you can call any of these assholes out and take the Karma for yourself. Like acing in cards or something. (I don't play cards!)\n\nThanks for the input! What did I miss?\n\n\n"}