{"doc_id": "774", "name": "2012_10_humanities_student_major_1112_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2012-10-humanities-student-major_1112_AskAcademia.txt", "pub_date": "2012-10-22T00:00:00Z", "Sentiment": "0.271", "Subjectivity": "0.282", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "329", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11vcrm", "Reddit_id": "c6q1q9g", "Subreddit_id": "t5_2sakj", "Commenter": "fighterjock12", "length": "1871", "content_scrubbed": "I double-majored in English and Aeronautical Engineering. It was a bureaucratic nightmare, but completely worth it. I had to get paperwork signed by the deans of both colleges, get my plan of study signed off by both advisors each term, and still get overrides for most of my English classes because they were \"out-of-department\" since engineering had to be my primary. I managed to get a lot more classes to double count than I thought, but it still took me five years. And that was at 18-21 credits a semester. It probably could have been 4. 5, but I flunked thermodynamics the first time. No one likes thermo anyway.\n\nAll that for what it is, it was one of the best decisions I ever made. Not only have I managed to integrate these two fields in ways that would never occur to many, but the variety of coursework gave me a really good mindset on both ends of the spectrum. Humanities courses gave me a great lens for the cultural implications and restrictions of engineering design projects and the engineering problem solving techniques did a lot to improve my skills in literary analysis. When I applied for engineering jobs when I graduated, many companies were excited to see my second major (once they got over the initial shock) because engineers are notoriously bad at communication, but they still have to do a lot of it, particularly at entry-level. When I was applying for grad schools in English, many were excited to see the engineering background because there[.] such a push for a digital humanities expansion at many schools as well as some departments that I talked to which were looking to broaden their science and literature tracks. I could go on about this for days, but it was definitely a great idea for me and I suspect it will be for you too. Especially because, no offense, anthropology is about as useful in the job market as English right now."}