{"doc_id": "727", "name": "2012_10_humanities_student_major_481_intj", "namespace": "we1sv2.0", "metapath": "", "pub": "intj", "title": "2012-10-humanities-student-major_481_intj.txt", "pub_date": "2012-10-10T00:00:00Z", "Sentiment": "0.022", "Subjectivity": "0.384", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "356", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_118cf1", "Reddit_id": "c6km8ys", "Subreddit_id": "t5_2qowo", "Commenter": "tricupcake", "length": "1886", "content_scrubbed": "I was going to say I'm not sure where to start, but that would be a lie.  I just turned forty and feel like my life, up to now, has been a failure.  Well, not a complete failure, but I feel like I should have accomplished more.  But I guess that[.] fairly standard for us.  My first marriage didn't work out because my ex was a truly horrible person.  My second husband is wonderful so at least I figured that part of life out.\n\nI have a music degree because when I started college, I wanted to be a middle school band director.  Well, that, and music was all I knew at the time.  I had a very hard time fitting in at school (poor, overweight, introvert, embarrassing last name) and music was my refuge.  But by the time I got to my sophomore year in college, I got extremely burned out and changed to a general liberal_arts degree with a music major.  Since then, I have been a bank teller, help desk representative, process analyst, software tester and now I am an operations manager.  I find that this position suits me well because it involves being faced with diverse problems and needing to figure out a solution.  But there[.] still a part of me that wants to do something in the world that makes a difference, that helps people directly.  Sometimes I feel like my entire career has been very shallow.  I think this is why I go through phases of not knowing what I want to do when I grow up.  Also, getting bored easily could contribute to this feeling.\n\nRight now, my main goals are to get healthy, get pregnant and get out of debt.  Nothing in my life has been easy for me but I'm ok with that.  I know that without my life experiences, I wouldn't be the person I am today and wouldn't realize just how strong I really am.\n\nMy main pet peeves are people who aren't authentic, people who tell me I'm weird for being an introvert and people who can't chew with their mouths shut :)"}