{"doc_id": "742", "name": "2012_10_humanities_student_major_674_chemistry", "namespace": "we1sv2.0", "metapath": "", "pub": "chemistry", "title": "2012-10-humanities-student-major_674_chemistry.txt", "pub_date": "2012-10-16T00:00:00Z", "Sentiment": "0.098", "Subjectivity": "0.492", "Score": "100", "Upvotes": "100", "Downvotes": "0", "Wordcount": "295", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11kl2e", "Reddit_id": "c6nasho", "Subreddit_id": "t5_2qhf9", "Commenter": "Die_Stacheligel", "length": "1585", "content_scrubbed": "This article really frustrated me on many levels, but none more than when the author said\nBut my son is not going to be a scientist. The very thought of it makes me laugh.\n\n \nI personally am proof that this idea is absolute bullshit. Back when I was 15, being a chemist was so far from a possibility that, like the author, I would have found the idea laughable. At that age I was very passionate about the arts and the humanities. Nonetheless, I had to take a basic science curriculum in high school and found it to be nothing special (*including* chemistry) until I stumbled into a biology course one semester. From the start I was fascinated and LOVED biology; so much so that I decided to major in it once I started at university. Fast forward a few years and I'm a sophomore taking the much dreaded organic chemistry; except for me, I actually kind of liked the course. a lot. I started doing some work in a lab and found that my love of chemistry only grew. Fast forward again a few semesters and I'm currently pursuing my PhD in organic chemistry. \n\nThe point is this: if you or anyone else thinks that they know what you will or will not become at the age of 15, they're almost certainly wrong. There[.] no way to see that far into the future. The point of a good education is to give students a background in a diverse set of disciplines so that when the time comes and they realize their calling, they can pursue it intelligently and passionately. This is just as true of chemistry and the sciences as it is for the humanities. I would have hoped the author had realized that. "}