{"doc_id": "1602", "name": "2012_01_humanities_student_major_1074_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-01-humanities-student-major_1074_AskReddit.txt", "pub_date": "2012-01-27T00:00:00Z", "Sentiment": "-0.072", "Subjectivity": "0.377", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "330", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3ldgan", "Reddit_id": "c3lfmxk", "Subreddit_id": "t5_2qh1i", "Commenter": "Andergard", "length": "2076", "content_scrubbed": " gender theory is impossible to explain *especially* if you have a degree in it.\n\nFTFY based on my observations of discussions with, and without, gender theory students and/or lecturers at university.\n\nIn brief, the general notion is that there are two genders, because there are two sexes. If you disagree with that, people will probably see you as just inventing subcategories because you feel like it. You or someone may have whatever specific gender they want, but the truth of sexes remains a biological fact; the rest is generally seen as individual differentiation. Take for instance a person who[.] born female, but feels she[.] a guy (I take no opinion on the validity or non-validity of these feelings); I could see myself, as a mostly straight male, being attracted to her as a possibility, because she[.] female (though she defines herself differently in gender-terms). However, were she to have gender-changing surgery and/or other physical changes, she would essentially \"be\" male, and my sexual attraction would probably shift into the realms of whether I'm bi-curious enough, etc.\n\nIn brief, there are two sexes; everything else is a matter of definition. That said, sexuality (and identity) is indeed a whole sliding-scale of soft, fuzzy lines (though social conditioning tries to enforce elsewise). I get terribly amused at people trying to disprove the above-mentioned biological binary, \"because gender theory!\" - this is not to say your post falls into this category at all, but ehm... there are a lot of 19-28ish (especially female) university students (especially within the Arts faculty) who have a tendency of \"not really getting\" gender theory, sometimes because their lecturers drum a ludicurious version of it into them (often laced with rampantly militant feminism), sometimes because they want to \"earn their Special Snowflake badge\" via redefining sexes according to perceived genders, as opposed to y'know biology.\n\nAll that said, your post is probably quite valid, however your whole angle of perception is probably not a common or universal one."}