{"doc_id": "1561", "name": "2012_01_humanities_student_major_583_compsci", "namespace": "we1sv2.0", "metapath": "", "pub": "compsci", "title": "2012-01-humanities-student-major_583_compsci.txt", "pub_date": "2012-01-15T00:00:00Z", "Sentiment": "0.158", "Subjectivity": "0.441", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "253", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_oioio", "Reddit_id": "c3hmo52", "Subreddit_id": "t5_2qhmr", "Commenter": "silverstrike", "length": "1483", "content_scrubbed": "Okay, so as a person who successfully triple majored in Math, CS, and Classics (don't ask) -- I really had to chime in here.\n\nMy advice is a bit off topic, but honestly, the other posters have already covered most of the important bits on actual study skills.\n\nBut, in all seriousness...\n\n**Do not, under any circumstance, load so many \"hard\" classes into the same semester.**\n\nWhile credit count is important to finish on time, you really need some fluff in there to pad out the course work.  At least, I found it incredibly helpful to have that buffer.  \n\nIt[.] not really the volume of work, either.  Most CS classes won't saddle you with a lot of time consuming work, unless you really struggle with the programming assignments  \n\nBut, that course list you gave, while most of those are intro-level classes, they will have a certain rigor to them you may be unaccostomed to coming from the humanities.  \n\nAnd, to be specific, by rigor, I mean the progressive compilation of co-dependent concepts.  \n\nFor example, you don't necessarily need to under stand the Third Punic War to grasp the facts and out comes of the Battle of Waterloo.  \n\nHowever, take Linear for second, you better damn well have a full understanding of row reduction, when you get to QR decomposition.\n\nWhen you have 4-5 classes, all like that running simultaneously, especially when the topics are closely related, it[.] very easy to \"lose the thread\" on one ore two, and you'll quickly find yourself drowning.  "}