{"doc_id": "719", "name": "2012_10_humanities_student_major_361_youshouldknow", "namespace": "we1sv2.0", "metapath": "", "pub": "YouShouldKnow", "title": "2012-10-humanities-student-major_361_YouShouldKnow.txt", "pub_date": "2012-10-09T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.397", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "1041", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6js71y", "Reddit_id": "c6jsg4h", "Subreddit_id": "t5_2r94o", "Commenter": "Ahhuatl", "length": "5970", "content_scrubbed": " Although I'm not exactly sure of your point.\n\nThe point is that to achieve any level of success in many fields of social science, one must have a familiarity with their subject matter that takes years and years of study.  In the case of my field, this involves familiarizing yourself with hundreds of different books across the entire length of scholarly inquiry on the subject, often across many fields.  I am not just a historian, I'm an anthropologist, a geologist, a literary critic and an astronomer too.  You're right: no 40 page paper is easy and when your degree goals revolve around writing papers much longer than 40 pages for the rest of your life, your profession isn't easy either.\n\nSo, if you follow my logic, coming from a philosophy background I can personally attest to the difference in a philosophy (and by extension social science) and STEMs.\n\nI follow it, I just don't think it is particularly sound.  Its akin to someone saying \"Hey, I took some courses in biology and I understand the scientific method! Therefore, as an art historian I know what it is like to work in Bioengineering or Solid Mechanics!\"\n\nIn comparison to my experience in physics, most honours level papers are 50-pages long (maximum) in areas in which there is no literature, couple that with weekly assignments in each subject, prac reports every few weeks (most undergrad reports are 20 pages long, and since most physics undergrads are doing 4 physics subjects, that[.] 20 pages every two weeks, sometimes two due in the same week), multiple mid-semester exams, three lectures per week and 6 hours of tutorials\n\nTo turn your own logic against you, I've worked in the Electrical Engineering department at my University.  I've sorted through the PhD thesis - the bulk of what was there was not writing but rather graphs easily generated en masse.  I spoke with the instructors, I posted class materials on the class webpage, and I know what students had to draw from.  I've seen their easy little true or false scantron tests and have even had the wonderful job of dealing with the students who were too lazy to go to class and insisted everything be recorded so they could watch from the comfort of their home.  Or helped proctor final exams that the quite a few students didn't bother to go to.  To me, the grass looks a lot greener on the other side.  So naturally, its OK for me to extend my personal experiences to.... every field and everyone and tell you personally that you are actually wrong about your own life.\n\nFundamentally though -- and perhaps this is the true source of arrogance from STEMs -- there is no interpretation to the content we learn. There is no guide. We are right, or we are wrong. It turns out it[.] very, very hard to be right since the universe is very, very complicated. \n\nSounds nicer to me.  Working in a field that is covered by clear rules which can be determined through experimentation or simple research; never having to do anything but memorize equations and physical laws.  Everything being interconnected in some causally demonstrable way.  Black and white, true or false.  And better yet because the field is inherently about discovery and investigation, you can declare \"I don't know! The universe is very complicated and you can't expect me to have all the answers!\"\n\n In the humanities there is so much leg room. You only have to convince a mere human being that you are right. In fact, often it doesn't matter what you say as long as you say it well.\n\nConversely, in history, because so much of the past is obscured and therefore inaccessible, fundamental questions essential to the progression of one[.] knowledge can never be answered.  No neat little order of operations that is always appropriate, always correct.  No universally agreed upon methodology that you can adhere to and be seen as respectable in the field.  A skilled person who doesn't agree with you can fail you even though you make perfectly sound arguments based on widely accepted data.  You don't share their interpretation? Too bad. Nothing is accepted as fact, everything is open to criticism and recontextualization and a skilled Historian can make an equally sound alternative interpretation too. Rarely with either interpretation be proven right precisely because so much will never be known. If only it was as simple as it was in the sciences! An electron is an electron, everyone can see it and nobody can get away with doubting it!  And that is only the half of it.  When you're not dueling with other people in the field who know just as much as you do, trying to out compete one another by shifting through mounds of obscure source materials, then you have to deal with the laymen.  People who read Wikipedia and think not only that they know everything about history but also that history requires no energy to be proficient in.  People who conclude that because things are open to debate, their frivolous argument is just as valid as the nuanced position you've spent years refining. Everything about your work must be legitimated in the eyes of people who think it is invalid or a waste of time.  It is a pity I am not a scientist, then I could just announce my expertise and have everyone agree that my field is valid and vastly superior to other modes of inquiry.  I'd be treated like a keeper of real truth (not that phoney-bologna humanities nonsense) and enjoy a position of unquestioned authority and esteem among everyone but the few people who, like me, have pursued a degree in the same area.  \n\nOh yeah and I'd get paid lots of money for doing work that is \"in my experience\" less than what I do now.\n\n I'm saying this coming from an arts background as well\n\nI can tell.  You framed your situation in a very subtle and very manipulative way.  I don't have an arts background, so I wasn't as able to do it as well in my previous two paragraphs.  Hopefully my lack of creativity will make the point I was making nice and visible though. "}