{"doc_id": "755", "name": "2012_10_humanities_student_major_851_lawschool", "namespace": "we1sv2.0", "metapath": "", "pub": "LawSchool", "title": "2012-10-humanities-student-major_851_LawSchool.txt", "pub_date": "2012-10-18T00:00:00Z", "Sentiment": "0.14", "Subjectivity": "0.376", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1252", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11pkjh", "Reddit_id": "c6oiu24", "Subreddit_id": "t5_2rb9g", "Commenter": "[deleted]", "length": "6941", "content_scrubbed": "Hi everyone, I am currently a junior undergraduate and I have my mind set on going to law school upon graduating. I am the first person in my family to go to college (let alone law school) so I decided to turn to reddit for some advice since my family can't really help me with this.\n\nCongratulations!  I took college for granted since it was an expectation and norm with my family.  It seems like you are pretty bright and motivated, so you should be very proud of how this worked out for you.\n\nHere is some more background on myself in case it is needed to answer my questions: I am a philosophy and political science double major with a criminal justice minor. My current cumulative GPA is a 3. 7. About a week ago I took a free practice LSAT and scored a 150 (this is without any LSAT prep). As far as \"experience in the field\" goes, I interned at a local law firm over the summer and next semester I will be studying abroad at the University of Edinburgh and interning with Scottish Parliament. No criminal record. If any other information is needed, please feel free to ask :)\n\nMajors don't matter.  Most of my classmates were some form of liberal_arts majors; however, the GPA is impressive.  Since you only took a practice LSAT without prep, I won't be too harsh, but 150 is not good.  The test is scored from 120-180, with 150 being the absolute middle.  That should come up with study.  \"Experience in the field\" is not relevant, except that it only serves to let you see if law is for you or not.  No advantage in the application process.  Study abroad is a good thing for the resume and for an admissions essay (e. g., it made you learn something about yourself, exposed you to new ideas, etc.).  \n\nSo my questions are: 1. Have you taken an LSAT prep course such as the one Kaplan offers and if so is it worth the investment? How many points did your score improve? (I heard that on average a score goes up about 10 points--any verification?)\n\nI took the Kaplan one.  I was not happy with the program.  I later found out my instructor had not scored all that high on his own LSAT and he was a recent college grad about to ship off to law school.  I don't feel like the program unlocked any secrets to the test or showed me all that much.  It was good to be in a structured environment, but not really sure how much else it helped me.  It was also expensive.  \n\nI found drilling old tests and studying my wrong answers helped me more than anything.  A good prep book can teach you some helpful strategies for pennies on the dollar compared to paying Kaplan.\n\nAre you motivated enough to study on your own and teach yourself?  Do you feel more comfortable with structure?  It comes down to your personal preference.  Prep programs have their place, but it didn't feel right for me.  \n\nHow important are factors such as major/what undergraduate school a law school applicant attends? (I attend a Jesuit university)\n\nI touched on majors above a little bit.  I went to school with math, music, political science, business, and classics majors.  As long as you did well with your studies, it generally doesn't matter *what* you studied.  \n\nAs for schools, not an issue either.  As long as you aren't going to a correspondence school that advertises at 2am on TV, you should be fine.  I didn't get into my university[.] law school, despite going there for undergrad, having family connections, and having an admissions profile well within their 25/75 range.  \n\nIn short, neither matters much as long as you did well.\n\nAny preferred LSAT prep books I should look into buying?\n\nI used Princeton Review or something similar.  It was pretty good.  You can also get someone[.] old Kaplan materials on Craigslist or online, I found their materials helpful (but not the course).\n\nHow important is it to get into a top law school, especially in this economy? I have been told that more people are going to law school now more than ever so finding a job upon graduation is really difficult.\n\nJobs are nonexistent.  Some projections say there will be 2-3 new grads for every new job until 2020.  It[.] more who you know, than where you went.  Granted the top-14 grads have better prospects, but it[.] a squeeze for everyone at the moment.\n\nIf you are totally committed to law school, it[.] probably better to go to the best place you can that offers you the most scholarship money.  You get scholarship money based on your admission[.] profile (GPA + LSAT (with a bump for diversity)).  Get the best LSAT score you can, then shop around and see what schools offer you scholarships.  A full ride from a top-100 is better than sticker price at a top-50, IMO.  Less debt gives you more options to rough it out and navigate the crap market.  \n\nAny other advice as far as applications go?\n\nLSAT and GPA.  That[.] all that matters.  You need to get the best score you can.  Then shop for scholarships.  When determining schools, ask about conditions for maintaining your scholarship.  Sometimes there are significant strings attached.  Weigh all your options.\n\nMy frustration is this: I want to be a lawyer not for the money, but to help people. My plan is to become a defense attorney and eventually work with the innocence project to help people who are wrongly accused get out of jail. I'm aware that a lot of this work will have to be pro bono so in order to do that, I'd need to make a hefty amount of money first. So I feel like I need to get into the top law schools in order to make money in order to then help people. Therefore following this logic, there is A LOT riding on my LSAT score! I lose sleep over this, haha. Please tell me I'm wrong!\n\nLots of good people enter saying the same thing, then get crushed by the reality of this \"profession.\"  You need to be really committed to it to do this.  Even public service jobs are tough to get because people seek those to get their student loans forgiven.  It[.] not going to be easy.\n\nAnother stat to consider, **less than half of the Class of 2011 found full-time law jobs**.  The majority are part-timing or working outside of law.  It[.] a risky proposition to saddle yourself with nondischargeable student loan debt for a chance at a mediocre job with little stability.  Point being, you take out the loans and can't pay them, they are there for life.  I know your parents are proud of you, but don't let your family push you into something without being fully informed.\n\nIf you can get into a decent school, minimize your debt, and get a little lucky, then you can probably succeed.  If you pay full price, amass $150,000 in loans, and get stuck without a job, it[.] bad times.  More debt = less options.  The days of \"more education can never hurt\" are over.  A JD is not a license to print money and public service is definitely not the glamorous crusade that it[.] often portrayed as.\n\nThanks in advance. Any advice is greatly appreciated.\n\nResearch.  Think about it.  Look around.  Best of luck!"}