{"doc_id": "695", "name": "2012_10_humanities_student_major_137_cigars", "namespace": "we1sv2.0", "metapath": "", "pub": "cigars", "title": "2012-10-humanities-student-major_137_cigars.txt", "pub_date": "2012-10-03T00:00:00Z", "Sentiment": "-0.036", "Subjectivity": "0.334", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "410", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_10waz3", "Reddit_id": "c6ha8mi", "Subreddit_id": "t5_2r090", "Commenter": "YUNOtiger", "length": "2132", "content_scrubbed": "Okay, bear with me my story is a little sad at the beginning but it gets better, I promise!\n\nFirst off when I was conceived I was not expected, in any sense of the word. I was the result of a New Years Eve Party involving high levels of consumption of cannabis and alcohol. My dad was 19 and my mom was 20. My mother[.] parents were furious that she was pregnant, as her sister had made the same mistake (twice by this point).\n\nAnyway fast forward a few months and my mom is having big trouble. She is violently ill all of the time and her teeth are rotting away from the acidic vomit. She goes to the doctor and he tells her that her body is essentially rejecting the pregnancy. He says that it will not be fatal for either of us, but that she will suffer greatly and that I would likely be in poor health. He encourages her to terminate, but she refuses.\n\nWhen she comes to term she is in labor for 18 hours (I think, it has been a while since I heard this story). She was unable to give birth by the normal route. What[.] worse is that they notice that the umbilical cord had wrapped around my neck and that I was being choked. They do an emergency C-section and when they delivered me, I was dead. They took me away and began to work on me. My mother cried that she wanted to hold me, but they wouldn't let her. She passed out from the trauma.\n\nA few hours later she wakes up, and they tell her I survived. The doctor warned her that I was clinically dead for 4 minutes, and that I was oxygen deprived. They told her to be prepared to raise a special needs child, because that amount of oxygen deprivation was likely to cause brain damage and mental retardation. \n\nBut, thanks to the skill of the doctors and a little luck, I did the impossible. Not only did I survive, but I am a perfectly healthy and functioning man (albeit a little fat). And not only was I not mentally handicapped, but  I was valedictorian of my high school, I have an Associate[.] Degree from community college, and I am a junior biology major at a liberal_arts college with a 3. 89 GPA overall and I have been accepted into medical school.\n\nI beat the odds.\n"}