{"doc_id": "734", "name": "2012_10_humanities_student_major_570_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2012-10-humanities-student-major_570_GradSchool.txt", "pub_date": "2012-10-13T00:00:00Z", "Sentiment": "0.195", "Subjectivity": "0.403", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "354", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6lj8b2", "Reddit_id": "c6ltpnh", "Subreddit_id": "t5_2r4r8", "Commenter": "earthpresidentnixon", "length": "2033", "content_scrubbed": "Came in to find almost my entire response already here.\n\nBe very conscious of degree equivalents, I suppose the word would be. Like deyounge said, medicine is an undergrad degree; so is law, I think. If you're doing Econ and Linguistics, I don't think this is an issue for you. I imagine getting a foreign degree in Econ would be quite a draw in your future employment, actually... IF you can get into a top school, that people have heard of. Here in the UK/Ireland, Master[.] degrees work quite differently than they do in the States. There is no qualifying transition from a Master[.] to a PhD; they are entirely separate. What[.] more, most Master[.] degrees here are one year long, and they are M. Phils rather than M. As, which Americans don't really seem to understand.\n\nAgain, I agree with deyounge in terms of making connections, but I'd like to add that doing a postdoc in the States will help immensely, especially in English. (I've been told by some uni faculty in Canada that a European degree in the Humanities is considered quite sexy these days.) I've found the most difficult issue is getting used to how things are down here. I go to a well-ranked school for my field, but things are ridiculously inefficient and disorganized here, and I've recently learned that for undergrads, their first two years of classwork don't actually factor into their overall marks (unless they fail). I'm concerned about my students' incentive to do well. The mindset is just... different... here. Not worse (I can certainly appreciate the lack of pressure, which I understand is a huge factor in grad studies in the States) but it[.] taken some getting used to. It[.] forced me to rely on my supervisor a lot more than some of my peers.\n\nJust wanted to add my two cents to the already great advice you've received-- good luck! Strictly anecdotally: going abroad for my Master[.] and PhD was the best decision I ever made. I want to return home for work, but the experience of truly living abroad, rather than just visiting, has been incredible."}