{"doc_id": "612", "name": "2012_02_humanities_student_major_166_ucsc", "namespace": "we1sv2.0", "metapath": "", "pub": "UCSC", "title": "2012-02-humanities-student-major_166_UCSC.txt", "pub_date": "2012-02-05T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.251", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "290", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pc723", "Reddit_id": "c3o75sy", "Subreddit_id": "t5_2r3oq", "Commenter": "jeburke", "length": "1707", "content_scrubbed": "I agree that the quality of education at UC is slipping while students are expected to pay more and more of the bill.\n\nHOWEVER arguments that personnel are paid too much don't really do any good for a few reasons:\n\n1. cutting/capping salaries is a feel good option but does absolutely nothing to actually help the budget crisis. Cutting Blumenthal[.] salary in half only saves $150,000. When our budget deficit is in the hundred[.] of millions.$150,000 is a drop in the bucket compared to what the UC system needs.\n\n2. Many STEM professors (I have no idea about social_sciences/arts/humanities) supplement their salaries with a portion of their outside grant money. This can make up anywhere from 25%-30% of their annual salary.\n\n3. The santa cruz sentinel article fails to differentiate between full time/part_time or months worked (9 months or 11 months). Not to mention that most of the people on the top paid list work as both professors and chancellor/vice chancellor or administrator. \n\n4. The need to have a competitive salary range for professors. Harry Noller (third on the list of highest paid at UCSC) pretty much figured out the structure/function of the ribosome and made major contributions to figuring out that it was a ribozyme. He has made MAJOR contributions to scientific knowledge. His work has been featured on the cover of Science. Having something close to a competitive salary for professors allows UC[.] and UCSC to keep the talent - which actually INCREASES the quality of the education.\n\nI just really hate the argument that lowering the pay for certain people will fix the problem - it wont. Every little bit may count but this won't even make a dent in the real problem of funding."}