{"doc_id": "620", "name": "2012_02_humanities_student_major_209_classicalmusic", "namespace": "we1sv2.0", "metapath": "", "pub": "classicalmusic", "title": "2012-02-humanities-student-major_209_classicalmusic.txt", "pub_date": "2012-02-07T00:00:00Z", "Sentiment": "0.043", "Subjectivity": "0.393", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "272", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3oqma0", "Reddit_id": "c3orz7y", "Subreddit_id": "t5_2qhyq", "Commenter": "sibelioz", "length": "1608", "content_scrubbed": "I'm going to school for composition and this scares the living crap out of me. The problem is classical music refuses to get with the times. I'm not saying that the orchestras should just ignore the classics and just play film music but the industry[.] goal should now be get young people back into the arts. Minimalism has proven to bring a lot of people back because of its simplicity and how it[.] approachable. Beethoven, Mozart etc are amazing composers but they cannot make up the majority of concert programs because it gets old after awhile. \n\nAlso the love of classical music comes mainly from orchestra and arts programs in school which in america are generally pitiful. Kids want to play fun and exciting music which is how groups like the Trans-Siberian Orchestra, and composers like Soon He Newbold have become extremely popular amongst school orchestras and the popularity of composer-celebrities like Eric Whitacre are saving the genre.\n\nBut a lot of people in the industry are snobs to composers like this and denounce them in favor of new music from composers like George Crumb. The animosity between academic and popular music still causes a rift in composers and producers which is why composers of tonal and appealing music find it difficult to get record deals and critical reception despite their music being the kind that needs to get to the people. \n\nThe classical music industry refuses to cater at all to younger generations and refuses to play music that would, preferring to substitute it for the same stuffy repertoire. It needs to get with the times and it[.] only hurting itself. "}