{"doc_id": "772", "name": "2012_10_humanities_student_major_1075_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2012-10-humanities-student-major_1075_funny.txt", "pub_date": "2012-10-21T00:00:00Z", "Sentiment": "0.115", "Subjectivity": "0.337", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "373", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6pz4px", "Reddit_id": "c6pzfmn", "Subreddit_id": "t5_2qh33", "Commenter": "Waxenwings", "length": "2186", "content_scrubbed": "Okay, so we're moving onto defining what it is to live a worthwhile life.  I'm not going to put words in your mouth, but to me life is worthwhile when there are things to do beyond base civil interaction.  Do you plan to have sex literally all the time when not working?  As an obvious proponent of the STEM majors you recognize that people have a refractory period and are not always going to want to have sex?  And we haven't even moved onto the process of finding people to have sex with to begin with.  To me, life as a human being is not purely about finding food, finding mates, and working on infrastructure.  If it is for you, that[.] fine but I seek something more out of the world.  Culture is important.  Culture is beautiful.  You say that liberal_arts education hasn't existed for most of human history but neither has STEM- formally at least.  The university system is a relatively modern invention in the timeline of human history. Before this point, people learned from their elders.  They gathered their understanding of the world through observation, experience, technical knowledge, and stories passed down from generation to generation.  It[.] only because such stories and knowledge were passed down that we were able to build up our infrastructure and our society to the point it is at today.  That[.] what liberal_arts and science education were for most of human history.\n\nI'm not saying STEM majors are somehow less important or inferior to Liberal arts_major.  We need STEM majors to build our society and advance our technology.  However, we are not robots.  We cannot find enjoyment in simply working and basic physical enjoyments only entertain for so long.  Why do you think art and music developed intuitively?  Culture in all its forms contributes to our society.  It makes the world beautiful and makes it worth living in.  We need all kinds to make the world work.  The only thing we do not need are the narrow mindsets of people like you, other Pro-STEM-only posters on Reddit, and even Pro-Liberal-Arts-only posters saying one is better than the other.  They're not.  They contribute to society in different ways so just stop comparing them altogether."}