{"doc_id": "1610", "name": "2012_01_humanities_student_major_1141_iama", "namespace": "we1sv2.0", "metapath": "", "pub": "IAmA", "title": "2012-01-humanities-student-major_1141_IAmA.txt", "pub_date": "2012-01-28T00:00:00Z", "Sentiment": "0.064", "Subjectivity": "0.369", "Score": "18", "Upvotes": "18", "Downvotes": "0", "Wordcount": "359", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3lowc0", "Reddit_id": "c3lq9i4", "Subreddit_id": "t5_2qzb6", "Commenter": "thesoundandthefury", "length": "2038", "content_scrubbed": "Honest answer: I pretty much completely disagree with people who think that following your dreams means making daring or unrealistic choices. I went to a liberal_arts college, and majored in the liberal_arts and got a job working as an assistant at a magazine and then worked as a production editor and did some database management.\n\nI wrote (and edited) at night and on the weekends. There are a lot of hours in a day if you use them wisely: William Carlos Williams was a doctor. Vonnegut worked in public relations for General Electric. There[.] nothing to say you can't write AND do other things. (I still do other things for work besides writing.)\n\nFinding angles using sine of theta is important (I mean, it[.] probably not being presented to you in a way that will help you understand why it[.] beautiful/important, but it is). Education is not like an arbitrary set of hurdles placed in your path so that those of us standing on the sidelines can have the pleasure of seeing you stumble as you try to jump over them. You study what you study because over the last few thousand years, humans have decided that these things matter--and maybe we're wrong in what we've decided, but you have to at least acknowledge that a lot of thought and many generations went into making the decisions to value the academic pursuits we've chosen to prioritize.\n\nSo here is my honest advice: Do your homework. Go to college. Graduate. Get a job. Pursue your passions, but understand that writing music or books is not the only important or interesting work that humans do, and that you're just as likely to figure out why we exist writing code for database software as you are while writing a novel.\n\nThere are many kinds of fulfilling lives on our planet, especially for those of us who are fortunate enough to live in the developed world. Denying yourself a breadth of opportunity by cutting short your education or \"pursuing your dream\" at the expense of other opportunities does a disservice both to you and to your community. That[.] my two cents."}