{"doc_id": "759", "name": "2012_10_humanities_student_major_877_sdsu", "namespace": "we1sv2.0", "metapath": "", "pub": "SDSU", "title": "2012-10-humanities-student-major_877_SDSU.txt", "pub_date": "2012-10-19T00:00:00Z", "Sentiment": "0.052", "Subjectivity": "0.315", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "650", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11qefu", "Reddit_id": "c6oq2x1", "Subreddit_id": "t5_2rxuk", "Commenter": "unbuklethis", "length": "3472", "content_scrubbed": "You are looking at your future the wrong way son. Think about it?\n\nYou asked for advice, and if you want mine, I would suggest you should consider STEM major or anything in the health industry. Not because it is hard, but because it will help you get employed after 4 years. It is only my opinion. I know you didn't ask for one. \n\nYou have to give it all, not a half hearted chance. I am talking about diligence, intention and responsibility. You should want to learn. Teach-ability is one of the most important virtues a man can learn after humility. If you cannot be taught, then you cannot be reasoned with.\n\nI may be partial and opiniated on this one, but there is a lot of wisdom in considering a vocational major such as any of the STEM programs (say Pharmacology, or Engineering or Biochem or Computer science or healthcare etc etc) will always get you hired even while you are in school. When I was doing my UG, I had an internship offer for every year with Big corporations, all of which promised me a good career by the time I was out of school as I have valuable experience. If it helps, Im a minority too, and I wouldn't mind taking some time to speak with you should you need advice in choosing a major.\n\nListen son, College days are the one time in life when you can actually take the time and give it your all, and work hard and try harder and push yourself. -- I say this as someone who[.] been in school until I am 29 since I'm a little kid. You wont get any time later in your life, we all have busy lives, and working life leave very little room for anything else. So now is the chance to study, and study it well, because later you many not get a chance. Plus its not like you're alone while you're in school, there are your other peers also who study the same, to work together and study together, and Professors are not there to destroy you, they are there to educate you. They don't wake up in the morning to come to work, hmm, let me see if I can fail this kid and destroy his life. Their job is to teach and share wisdom. Go see them as often as you can until you get your subject matter down. Interact with them. That is what you are paying for.\n\nFuck! Kids these days.\n\nDo you know how many art, business, psychology and liberal_arts majors I personally know who are waiting tables or ended up pregnant w. a kid or is presently jobless or struggling to get a job in the city or working some dead-end job which adds nothing to their or others lives and barely making it? Their lives is full of struggle and it is sad.  They contribute nothing of worth to this world. I can have you speak to a few if you want to. Look, I am not generalizing, I know there might successful art and business grads out there. If you are good at art, then go for it. But you also got to be real and got to do some self-introspection these days. How many people do you know actually who[.] making a normal living in this city making art? I do know an artist however, but she[.] really good and is well networked. Lives won't turn out rosey that easy to all, unless you're willing to put some work to it. Not in this economy. Not every major lands you a job. I know a woman who has a PhD in underwater archaeology from Oxford, she[.] also a Rhodes scholar. She now sits at home home-schooling her son. \n\nNot sure if it helps, but [here](http://www. reddit. com/r/AskReddit/comments/10anes/reddit_what_is_a_common_misconception_about_your/c6c4zzt) anyway.\n\n'09 MS grad from EE"}