{"doc_id": "1529", "name": "2012_01_humanities_student_major_314_gaming", "namespace": "we1sv2.0", "metapath": "", "pub": "gaming", "title": "2012-01-humanities-student-major_314_gaming.txt", "pub_date": "2012-01-08T00:00:00Z", "Sentiment": "0.079", "Subjectivity": "0.344", "Score": "54", "Upvotes": "54", "Downvotes": "0", "Wordcount": "478", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_o8kq7", "Reddit_id": "c3fb2jy", "Subreddit_id": "t5_2qh03", "Commenter": "[deleted]", "length": "2888", "content_scrubbed": "Hello Reddit! I see that a person has posted about cultural studies, and many of you are getting your smug/indignation/confusion on. A few things that might be helpful to you!\n\n1. The idea of a university is to make well-rounded individuals that are good citizens. Yes, college is too damn expensive to not make sure that you can get a career when done, but that[.] a bad thing. It should be affordable so that people can be more well-rounded. Notice the deficit in smart people? Any college requires a person to take electives though, and that[.] part of that well-rounded thing. Learn some shit you might not have learned otherwise, it[.] good for you!\n\n2. Cultural studies is the discipline that examines things like games, movies, graphic novels, etc. These classes are actually not just \"go in, play a game, and write whatever you want to write about the game! every opinion is right!\" You have to examine these cultural artifacts thoroughly, and make a cogent argument for what the games are trying to say, and why we as a culture gravitate towards them.\n\n3. I'm sure that at least one person will want to respond by telling me how they had a teacher in a cultural studies (or some humanities class) that was shitty. Congrats, you have one data point. That doesn't mean the discipline is bullshit. \"Anecdotes are not good evidence\" -Every scientist ever.\n\n4. Literary theory for a long time had a big elitist issue. Which is a bit ironic because people used to think that novels were trifling things and that the classics (think Homer) were the only masterpieces worth studying. Then they thought that only Austen and Byron and such were worthwhile. You guys that think that Lit majors are pretentious should love the fact that there are people writing [scholarly writing on Batman](http://www. amazon. com/Batman-Unmasked-Analyzing-Cultural-Icon/dp/0826413439). It makes the discipline of critical theory more accessible to people. But, you still have to back your arguments up and understand things like feminist theory, marxist theory, psychoanalytic theory, deconstructionism to be able to write academic criticism. So, it[.] not easy to do, but what you're working with isn't some bullshit ivory tower \"classic.\"\n\n5. It is a worthwhile discipline. People pump billions of dollars every year into video games. Billions of dollars have been spent on Harry Potter. That indicates that our culture very much values these cultural artifacts, and perhaps people should pay attention to why we value them so much. Hey, capitalists, you should love cultural studies because it may help you guys figure out how to get people to buy your shit!\n\nI hope this has been helpful and I look forward to engineering majors frothing at the mouth to tell me how humanities are ruining their psyches by existing. Also, your finest \"hurr starbucks employee\" jokes are welcome. They are cutting edge humor."}