{"doc_id": "1536", "name": "2012_01_humanities_student_major_389_austria", "namespace": "we1sv2.0", "metapath": "", "pub": "Austria", "title": "2012-01-humanities-student-major_389_Austria.txt", "pub_date": "2012-01-10T00:00:00Z", "Sentiment": "0.197", "Subjectivity": "0.329", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "569", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ob79m", "Reddit_id": "c3fwoda", "Subreddit_id": "t5_2qo9i", "Commenter": "What_The_Funk", "length": "3112", "content_scrubbed": "I am from Graz, and I think it is a great city for studying (studied there myself). I was also a host for many international students from all around the world, so I know literally 100s of foreign students who lived and studied in Graz. Everyone loves it. I haven't met one student who didn't like it here. Many tell me that at first they were scepcitcal about going to graz because they thought the city was so small... they come from places like Singapore, Sao Paolo, Helsinki, Paris, Delhi, Tokio... they are used to live in big cities and wonder if there would be enough to do in a small city such as Graz; if they would meet nice people;\nand then they came here and just loved it. Loved how it felt the whole city was a family; that you could walk through the streets and just by chance meet someone you know.\nit[.] a city full of young designers, musicians (Jazz university), international students; also old grumpy people, but the kind that makes you smile, like the two old guys on the balcony from the Muppet show\n\nAnd Graz is sourounded by nature; hills and small mountains; rivers, lakes, woods, everything is so near, easily reachable by bike or train. Down in the south is where they make great wine, and the wineyards are just fabulous to watch; people go there and enjoy a classic \"brettljause\" (google it!) and drink wine.\nEven farther to the south, you are in Slovenia, and soon Croatia, or Italy, and can lie at a beach (a 3 hours drive and you can swim in the sea!).\nTo the north, mountains steadily rise, and within 2 hours, you have great skiing areas, and wonderful mountain lakes to swim in in summer.\n\nSo student life here is pretty great I would say.\n\nyou'll get by with English among your fellow students and friends; and you'll learn enough German to get by in other situations.\n\nFor rent, as a student you can live in dorms, cost is about 200-300 EUR a month. you also get a room in a share flat for around 300 EUR. some international students even connect via facebook to arrange that in advance for their year abroad in Graz.\n\nHistory and Political sciences... hm, to be honest, I haven't heard much about those. All I know is that Austria has some special fields of studies... engineering, medicine, classical music, jazz, drama are particularly good. but the humanities have been neglected in the past years, and many students complain about lectures being crowded with students. I also don't know about courses taught in English, you'd have to look that up, I am sure there are some courses, but I am not sure they'll be in your fields.\n\nthat being said, and having studied abroad myself, I want to give you the advice that you use the time ahead to get to know yourself. and enjoy yourself. 10 years down the road, you'll not think about \"that great history class that I had at this uni in Graz\". You'll think about the people you'll have met, and the times you shared together; and you love those people, because they remind you of who you were back then.\n(and if you still have questions, or settled for Graz and are looking for someone to show you around -- send me a message)"}