{"doc_id": "624", "name": "2012_02_humanities_student_major_233_fitnesscirclejerk", "namespace": "we1sv2.0", "metapath": "", "pub": "fitnesscirclejerk", "title": "2012-02-humanities-student-major_233_fitnesscirclejerk.txt", "pub_date": "2012-02-07T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.346", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "256", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3oxs1y", "Reddit_id": "c3ozh89", "Subreddit_id": "t5_2rybl", "Commenter": "Arthur_Dayne", "length": "1501", "content_scrubbed": "The RIAA/MPAA uses \"theft\" as the term for the same reason that environmentalists say that oil companies \"rape\" the environment.  It gets attention.\n\n I'm all for actual content creators being compensated for their contributions to the arts and sciences, but recording companies and their ilk can get bent.\n\nThis is kind of a Catch-22.  If record labels don't do anything of value, why do artists use them?  It[.] clearly not necessary to get a record deal to record and distribute music anymore.  And if the labels DO contribute something of value, then why do you object to them getting a slice of the pie?\n\nMost people don't realize that in creative industries, publishers effectively acts as insurers for the artists.  For every story of some hit indie band that only earned a few hundred thousand off their multiplatinum album, there are 100 shitty indie bands that were paid a $100k advance to put out a record that flopped (and the record studio ate the loss - the band walked away with their advance, although few royalties).  Same thing happens in books.  Publishers insulate authors from taking a loss on publishing and printing and distributing a run of books.  The majority of books in the US are sold at a loss or at no profit to the publisher (especially because they're sold on consignment).  So really, artists get a pretty good deal from publishers.  It[.] only when they get megafamous (ie: are guaranteed commercial success) that they start to lose out on the deal with record labels."}