{"doc_id": "1608", "name": "2012_01_humanities_student_major_1130_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2012-01-humanities-student-major_1130_AdviceAnimals.txt", "pub_date": "2012-01-28T00:00:00Z", "Sentiment": "0.006", "Subjectivity": "0.377", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "319", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3lojqp", "Reddit_id": "c3lolz0", "Subreddit_id": "t5_2s7tt", "Commenter": "plastic_apollo", "length": "1693", "content_scrubbed": "Why? \n\nI never have a problem with fall semester students - only in the spring. In the fall, students are still respectful, but in the spring, it[.] a whole new ball game.\n\nSo maybe you think that your education is just another product that you're buying. You're pissed that your school is making you take a class you don't want to be in that won't benefit your career - so what, that gives you to the_right to disrespect me and your fellow students who actually show up and turn in a paper on time? \n\nNo. Your degree - that little piece of paper you get - might be the product you think you're buying, but my time is not. I have too many other students I care about - too many other hardworking students who come to office hours, who e-mail me for help, who send me drafts - not even mandatory for my class - because they're putting in effort. I'm not talking about A students, either; I have no problem with A students who want to coast, as long as they do it respectfully.\n\nI'm talking about C students who want to pass the class, who care about doing well, and for them, success isn't \"Great, one step further toward getting out of here and getting a job.\" You want a job, go to trade school. I teach in a humanities department - the only job you're going to get is MINE, and then you can deal with the students who expect to be treated with the same respect I give to students who actually *try* - because success, to them, is doing something better each time they do it.\n\nSo you hate me? That[.] fine. I don't hate my Lazy College Seniors/Juniors/Sophomores/or even Freshman.\n\nI have nothing but indifference for them, and after the semester is over, I make a point to forget their names. "}