{"doc_id": "636", "name": "2012_02_humanities_student_major_406_rutgers", "namespace": "we1sv2.0", "metapath": "", "pub": "rutgers", "title": "2012-02-humanities-student-major_406_rutgers.txt", "pub_date": "2012-02-13T00:00:00Z", "Sentiment": "0.115", "Subjectivity": "0.392", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "691", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pmrmi", "Reddit_id": "c3qppts", "Subreddit_id": "t5_2risk", "Commenter": "TryingToSucceed", "length": "3945", "content_scrubbed": "Though I'm not a physics major, I can tell you the good and bad about Rutgers.\n\n**Good:**\n\nThis is the most diverse school I've ever seen. I legitimately hear at least 3 different languages being spoken on a daily basis when I'm on campus.\n\nNot only is there ethnic diversity, but being the State University of New_Jersey, you're going to see a lot of personality diversity. Your best friends can be majoring in Journalism, Philosophy, or Geology - and we have decent programs in everything we offer. Each campus has it[.] own student center, dining hall (only one for Cook/Douglass), and library\n\nThere[.] a lot of character at this university, because we're unique. Rutgers has 5 campuses, four of which are completely separated from each other. Cook/Douglass are connected, and a lot of the political science, american studies, french, departments make their home there along with SEBS (School of Environmental and Biological Sciences) as well as the agriscience and whatnot departments. It[.] a lot of open space and farmland. Imagine it being the secluded college separated from the rest of the world.\n\nCollege Avenue is where the social scene is. The facilities and buildings are a bit lacking, but most people want to live on this campus. The bars and some good restaurants are on Easton Avenue, and many general clubs/organizations such as RUSA (Student Government) make their homes here. It[.] the faux-urban campus. It[.] where everyone comes together so to speak.\n\nBusch is pretty much the science and tech school. If you're a physics major, I can only imagine that this is where you're going to spend a lot of time. You're in luck, as their dining hall is the second best on campus and they have a lot of variety in their student center. You're also going to spend a good deal of time in the LSM (Library of Science and Medicine). While some of the architecture on Busch is downright depressing, they recently built BEST Hall, which is brand new and amazing\n\nLivingston campus is the furthest from College Ave, and it[.] most likely where you're going to live. In the past 5 years, Livingston went from a shithole to a decent campus to be on. With a brand new student center and amazing dining hall, you're going to spend a lot of time away from the crappy dorms that are still there - The Towers and the Quads. They're... less than ideal, but many people lived there and are completely fine.\n\nThe best part about Rutgers is that there[.] so much you can do here, nobody will care if you do something or not. Interested in activism? Join NJPIRG or RUSA. Interested in Greek Life? Join a fraternity. Not interested? Then don't. People wont care. You're free to do what you want, and because the school is so massive, people wont care.\n\n**Bad:**\n\nRutgers is massive and the campuses are completely separated. You have to take campus buses, which are efficient and run very smoothly, but they can be problematic. If you wake up 30 minutes before class on a different campus, you may very well be SOL. \n\nDuring class transfer times, which vary from campus to campus, you're going to end up being squished on buses to the point where you're going to feel groped.\n\nWeekend buses. In order to have more buses running during class times and facing budget cuts, Rutgers has opted to create a severely less frequent bus system for the weekends. Buses do not come very often and they take long-winded routes. This is bad when you want to go to a meeting on College Ave when you live on Livingston on a Sunday night.\n\nA few blocks off of Cook/Douglass and College Ave brings you to a sketchy town. New Brunswick is definitely not somewhere I'd like to live after I graduate.\n\nAnd finally, ignore the crazy preachers and fake deaf guy.\n\nI actually transferred to Rutgers from a small liberal_arts university because it was stale and expensive. Rutgers has been the best experience of my life so far, and I hope you choose the school that[.] right for you."}