{"doc_id": "749", "name": "2012_10_humanities_student_major_801_fffffffuuuuuuuuuuuu", "namespace": "we1sv2.0", "metapath": "", "pub": "fffffffuuuuuuuuuuuu", "title": "2012-10-humanities-student-major_801_fffffffuuuuuuuuuuuu.txt", "pub_date": "2012-10-17T00:00:00Z", "Sentiment": "0.022", "Subjectivity": "0.362", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "276", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6o2k00", "Reddit_id": "c6o5s9p", "Subreddit_id": "t5_2qqlo", "Commenter": "gwink3", "length": "1544", "content_scrubbed": "I noticed that STEM courses are tested on the I'm going to make you apply your knowledge to new situations. The tests are made hard to challenge the students to go into new places. To push them beyond their limits. Where as classes in the humanities might require new analysis but it isn't normally as complex or as hard. I had one course in reception theory during undergrad and the professor presented new material on the exams and asked us to analyze it in the context we have learned. Basically we had to apply what we knew to a new problem. Also we had to analyze former passages for content and significance. I think my average on the exam and the final were 95 and 98 respectively. \n\nNow that I am in medical school the testing is severly different. There is no curve. The tests are written with very little new material and moderate critical thinking (bare in mind I am comparing it to a liberal_arts science education). It feels like I am regurgitating what I studied instead of analyzing new facts. The average on the final for my first block was a 80. 9 with a standard deviation of 7. It seems more like perfection of information instead of creation of new thought. Keep in mind that during undergrad I only one non-grade adjusting STEM course (my molecular biology capstone) where students were generally scoring in the high 80s and low 90s. Then again we were all the super high achievers...\n\nTL;DR das ramiregr is correct. Schooling for some fields is designed for students to fail tests in order to pass them beyond their limits."}