{"doc_id": "717", "name": "2012_10_humanities_student_major_330_youshouldknow", "namespace": "we1sv2.0", "metapath": "", "pub": "YouShouldKnow", "title": "2012-10-humanities-student-major_330_YouShouldKnow.txt", "pub_date": "2012-10-08T00:00:00Z", "Sentiment": "0.029", "Subjectivity": "0.239", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "552", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_115exu", "Reddit_id": "c6jlll9", "Subreddit_id": "t5_2r94o", "Commenter": "crunkjuicer", "length": "3398", "content_scrubbed": "Going to get long winded (even professorial?) here. Hope it doesn't get buried. \n\nWe used to see non-elites having access to a liberal_arts education as a natural extension of the democratizing power of public education. EVERYONE could, ideally, become cultured, self-aware, and generally Enlightened enough to be the equal of a non-democratic aristocracy and thereby participate in the democratic public. Moreover, your life would be richer for it, regardless of occupation. You might be an assembly line worker, but you'd know enough about labor economics or the cultural signifier of your product or enough about Shakespeare to go home and read him for fun when you got home to have a deeply enriching life both on and off the job. All this goes back to Kant, who attempted to define Enlightenment, on both the individual and cultural level, as the cultivation of a Public Self that could write and communicate about  difficult and scholarly topics for the betterment of himself, his government, and, ultimate, society at large.  \n\nThis list isn't just hard_science vs. everything else. Note that the classical psychical sciences, Chemistry, Biology, and Physics, weren't on that list either. Computer Science and Math don't make the cut either. That[.] because these are all academic subjects, concerned primarily with producing knowledge about the world as both an end in itself and a larger project of Enlightenment. \n\nInstead, every single major on the list, including Engineering ones, are job-training programs. Why? What happened? Well at some point private employers decided that they would take advantage of mass higher education. Why waste time training Enlightened citizens when colleges could be training Employees? This trend of thinking began with local industries, say a steel mill, demanding that the local community college churn out steel mill technicians, but has obviously expanded to more and more colleges and universities offering majors like the ones on this list. What this amounts to is, in effect, a massive coup of the original Enlightening and democratizing aim of mass higher education. By pushing the cost of job training on to universities, who push it onto students in the form of tuition, companies are gaming the system to their benefit.\n\nBut what is truly distressing is that this logic heralds a return of the Liberal Arts education, and the Enlightenment consciousness it offers, as being the sole purview of the elite. After all, the poorest among us will be most logical to hedge their bets and get the degree in \"business administration\" over English (or even Economics!)\n\n And with the rise of online courses (which offer ultimate breadth of access with low-cost efficiency), I believe that we will see a bifurcation between physical universities where the elite can mingle and indulge (in both knowledge and consequence free fun), while the rest take on debt burdens to get online and participate in the route memorization of job related tasks. The elites will be poorer in perspective for having spent 4 years in a bubble, with top schools re-acquiring their status as \"boys club\" networking centers, regardless of major, and the poor will be poorer for having to compete viciously for jobs in order to pay off that debt. \n\n**TL;DR: The turn in higher education from Enlightening to job training screws over both the rich and poor in the long_term.**\n\n"}