{"doc_id": "618", "name": "2012_02_humanities_student_major_205_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2012-02-humanities-student-major_205_GradSchool.txt", "pub_date": "2012-02-07T00:00:00Z", "Sentiment": "0.024", "Subjectivity": "0.132", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "235", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pcqkx", "Reddit_id": "c3oqctl", "Subreddit_id": "t5_2r4r8", "Commenter": "tellbaconiloveit", "length": "1465", "content_scrubbed": "I'm a 7th year grad doctoral student with a 2-year-old. Was it foolish? Nope. Risky? Of course. But having a baby is risky no matter who you are or what you do for a living. I agree with Arabis -- there isn't a firm yes or no answer -- you make a decision that you feel comfortable with. \n\nIf you're anything like me, or any graduate student, you're a planner. Here[.] how the past 7 years looked for me. I'm a humanities doctoral student.\n\n**Year One.** Moved across the country to [Insert ridiculously expensive city here]. Coursework.\n\n**Year Two.** Coursework, conferences, drinking, complaining\n\n**Year Three.** Comprehensive exams, TA-ing, planned a wedding\n[married, honeymoon, lost momentum on diss proposal]\n\n**Year Four.** Teaching, Teaching, diss proposal writing (not finishing), got pregnant\n\n**Year Five.** Defended diss proposal in the Fall, had baby in January, took Spring term unofficially off (I needed the health insurance and pre-arranged with my committee -- this part can be tricky depending on your discipline/department/committee)\n\n**Year Six.** Won a teaching fellowship, hired a nanny (ate up my entire stipend + teaching pay and we lived off my husband[.] salary), teaching, research, taking it a day at a time\n\n**Year Seven.** Out of money. Living off husband[.] salary, staying at home and writing. It[.] working surprisingly well, I work and write during naps and on weekends. Just started Chapter 3.\n\n\nHope this helps.\n\nEdits: Formatting"}