{"doc_id": "646", "name": "2012_02_humanities_student_major_562_madisonwi", "namespace": "we1sv2.0", "metapath": "", "pub": "madisonwi", "title": "2012-02-humanities-student-major_562_madisonwi.txt", "pub_date": "2012-02-17T00:00:00Z", "Sentiment": "0.132", "Subjectivity": "0.305", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "255", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ptqfd", "Reddit_id": "c3s7xzx", "Subreddit_id": "t5_2r8rz", "Commenter": "krusten", "length": "1474", "content_scrubbed": "1) Gain residency  \n2) Starting at MATC, like someone else suggested, is a very cost-effective approach to college. I started at UW-Sheboygan and that probably saved me $10k-$15k in tuition costs. It isn't the best idea if your field is one that requires outside lab experience, research, international experience, etc. People who get started in this stuff early in their undergrad are taken more seriously from what I've seen, though other people might disagree with me on this.  \n3) Are you sure you don't qualify for unsubsidized federal loans? I was in the same boat as you - parents make too much money to qualify for real assistance, but they don't share their money with the kids. My unsub'd loans at least covered my tuition when I transferred to Madison.   \n4) I highly advise against a liberal_arts major, and get as much internship/volunteer/job experience in your field during your undergrad to vamp up your resume, get some references, and some potential offers waiting for you when you graduate. Look into outside sources about the demand for your skills/job; don't listen to the department because they'll come up with all sorts of reasons to justify their department[.] relevancy whether it[.] true or not.   \n5) Work through college to at least pay for all living costs. I didn't work for a year and that set me back quite a bit. Plus I find that I manage my time better when I have my schedule set like that. Do what works for you though.   Good luck, dude. "}