{"doc_id": "1530", "name": "2012_01_humanities_student_major_323_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-01-humanities-student-major_323_AskReddit.txt", "pub_date": "2012-01-08T00:00:00Z", "Sentiment": "0.027", "Subjectivity": "0.338", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "478", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_o8s6h", "Reddit_id": "c3fce7e", "Subreddit_id": "t5_2qh1i", "Commenter": "[deleted]", "length": "2666", "content_scrubbed": "I went to a small, liberal_arts college with a good music program. Over half the student population seemed to be a music major, and music majors had to attend a certain amount of concerts per semester, otherwise it would affect their grade.\n\nI was depressed as shit, and knew I wasn't going to do music anymore. I keep really odd hours, so at 3 in the morning, I got the idea to stage a fake music concert. I created a flyer for a hammer dulcimer concert, with a really cheesy picture of a guy playing a hammer dulcimer (I think he was wearing a hawaiian shirt). I kept the guy[.] real name, because I wanted anyone who searched him to think he was a legitimate performer. I changed everything else, making up fake credentials, like \"featured in Hammer Dulcimer Today 9 times\" and \"world-renowned Christmas in America tour\"... really fake sounding stuff. I put two major professors from the music department[.] names and emails to make it look legitimate. It pretty much did. \n\nI printed out about 200 flyers, plastered them around campus (even got the library to post it under their glass cases for special announcements, that made it look more legitimate... which involved some sweet talking). I got it sent through campus-wide emails and got friends at the student-run radio station to plug it. \n\nBy the time the week was over, music professors started saying they would hand out attendance credit to music majors/minors who attend the concert. It was glorious.\n\nThe day of the concert, one professor mentioned in class that he was looking forward to attending it, but my roommate said that she \"thought it was a prank.\" That didn't matter so much, though. I waited outside the venue the night it was scheduled and watched hoards of people trying to find this concert (as it was obvious that the room was being used for a master class, and not a hammer dulcimer concert). People were walking all over campus, trying to find it. \n\nI staged it to happen the weekend before Thanksgiving break, so if I did get in trouble, by the time a meeting would be scheduled, it might not seem like as big of deal. But, no one found out that semester that it was me. It only started coming out the second semester, and it is still mentioned in certain alumni circles about how great it was. \n\nThe school forwarded an email apologizing for the error, and that they were trying to get a hammer dulcimer player as a replacement in the future, but to my knowledge, they never did.\n\nEdit: I forgot to mention that I ended up as an adjunct at this school about 8 years later. The professor who was told it was a prank ended up being my boss. He remembered the prank and loved the idea. \n\n"}