{"doc_id": "650", "name": "2012_02_humanities_student_major_580_saic", "namespace": "we1sv2.0", "metapath": "", "pub": "saic", "title": "2012-02-humanities-student-major_580_saic.txt", "pub_date": "2012-02-17T00:00:00Z", "Sentiment": "0.164", "Subjectivity": "0.468", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "950", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3sbrl0", "Reddit_id": "c3scnyr", "Subreddit_id": "t5_2sshv", "Commenter": "EdwinStubble", "length": "5382", "content_scrubbed": "I'm in Sound, not ATS, but I've actually taken more classes in ATS than any other department. Plus, our departments are on the same floor, share a couple faculty members, and lots of grads from our departments have a lot of overlap in their practices. Social commingling is common. I'm good friends with a bunch of ATS grads and faculty.\n\nFor the most part, I've really enjoyed my ATS classes. The facilities are awesome, and you really can't beat the resources at the school. You have access to so much that it you won't have any external excuses for not finishing a project. \nFrom my view, this is a really good time to be in ATS and the other tech-related departments (AIADO, FVNMA, Design for Emerging Technologies, etc.) because we got a new president last year (two years ago? don't quite remember) who came from the National Science Foundation and is really passionate about beefing up the school[.] tech cred. I don't know the full story behind this, but he[.] created a new admin position to promote the school to organizations with access to grants, funding, and jobs in tech fields. I sat in on a little meeting with this new lady; what she had to say was really interesting. Basically, part of the drawback for studying tech stuff at an art/design school is that we aren't affiliated with a research institution, so we have limited access to the type of resources that would be expected at a research university. Part of her job is going to be to put the gears in motion to increase SAIC[.] visibility to organizations who may be excited about offering us those resources (sort of, \"look what we're able to do without major science grants, patents, and a massive endowment!\") and to cultivate opportunities for students and alums who are interested in creative work in tech fields. I emphasize that this is all \"in the works\", but it[.] really exciting nonetheless.\n\nAll that being said, SAIC (like any school) is perfect for those students for whom SAIC is perfect. It[.] a wonderful environment for inter-, cross-, multi-, anti-, omni-, whatever-disciplinary practices and for those who value exposure to extremely broad creative work. However, I've seen a number of people struggle and be extremely frustrated with the school because of this macro spirit; it can be difficult to locate \"specific\" things at the school. That[.] sort of an abstract way to put it, but it[.] a tricky thing to put your finger on. I guess I could say that it[.] not exactly the best place to become an expert in one thing; from my experience, an SAIC person is encouraged and expected to be extremely self-reliant and self-sufficient, but these aren't necessarily skills that are \"taught\" to you. I feel that the students who struggle the most there (they have a phenomenally low retention rate for undergrads, for what it[.] worth, but I think it[.] an important point to bring up here) are those who are looking to \"be taught\". Often, I think that this trait is sort of scoffed at and tabooed, and it ends up jarring people and making them feel inadequate or immature or something.\n\nI say all this because, despite how much I've enjoyed my time at the school, how amazing it can be, and how fortunate I feel to have been here, I feel very strongly that it[.] not the_right school for everyone. Further, those for whom it[.] not a good fit tend to really struggle; for whatever reason, it doesn't seem to be a place that one would merely tolerate and float through. Responses to it tend to be quite binary. (I think that this lends itself to explaining a good deal of the low retention rate; if you don't like it, you get out right away.)\n\nAlso, it[.] really, really, really expensive, but do everything you can to talk to people in ATS and the bursar[.] office before turning down an offer to attend the school because of the cost. They can help you wrangle money from strange places if they know you need it. (All Sound grads are guaranteed a TAship every semester they attend. I don't think ATS has the same policy, but for a year, even though I was in Sound I worked as a paid research assistant on a project with ATS people and Locus Sonus in France.)\n\nAll that being said, it[.] an astoundingly supportive and active community of artist-people who are affiliated with the school. Everyone always has stuff going on and it[.] impossible to not get infected with the buzz of the place. It has a huge (and constantly growing) influence on the arts community in Chicago (which is awesome, by the way), and being an alum from there can lend credibility that is hard to come by otherwise. Especially in the tech-ier fields, professors are always looking for assistants on projects or will pass along wonderful opportunities to motivated grads. People come from absolutely every corner of the world to study there and a sociable person can make connections all over the place. ATS in particular has a huge draw of international grad students. Visiting artists come all the time and you get amazing access to them. Chicago is awesome (I lived here beforehand, so I'm biased) and it[.] totally feasible that your time at SAIC could directly establish a career for you in the city.\n\nYeah. That was a lot, sorry lol\n\nAre you looking at other programs? Where are you coming from and have you ever been to Chicago? Have you had a chance to visit the school? Have you met/talked to any faculty or students yet? \n"}