{"doc_id": "1581", "name": "2012_01_humanities_student_major_789_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2012-01-humanities-student-major_789_politics.txt", "pub_date": "2012-01-22T00:00:00Z", "Sentiment": "0.1", "Subjectivity": "0.295", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "783", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3jgz1l", "Reddit_id": "c3jiowf", "Subreddit_id": "t5_2cneq", "Commenter": "Is_that_bad", "length": "5180", "content_scrubbed": "Read the below. Don't skip a single word or sentence. You will get a fair picture of what kind of folks live in South Carolina.\nConsider South Carolina, which has opposed or defied almost every beneficent social and political change in American history. To appease South Carolinian slaveholders, Thomas Jefferson removed language condemning slavery from the Declaration of Independence. Four years later, backcountry loyalists in South Carolina helped the British Army recapture the state in 1780 from the patriots. By 1828, Palmetto State native and vice president John C. Calhoun was agitating for state \"nullification\" of federal powers, generating secessionist calls a full generation before the outbreak of the Civil War.\n\nOn December 20, 1860, South Carolina became the first state to secede; four months later Confederate forces in Charleston fired the opening shots of the Civil War on the Union garrison at Fort Sumter, and South Carolina even threatened to secede from the Confederacy because the other southern states would not agree to reopening the slave trade. Soon after the state[.] chapter of the Ku Klux Klan formed, \"red shirt\" Democratic rifle clubs used physical intimidation and ballot manipulation to alter results of the 1876 election. In the 1890s, Governor Ben \"Pitchfork\" Tillman--who earned his nickname by threatening to stab President Grover Cleveland in the ribs with said implement--served two terms as governor before embarking on a twenty-three-year Senate career during which he defended segregation as vigilantly as his fellow Edgefield County native, Strom Thurmond, later did for most of his career.\n\nWell into the twentieth century, South Carolina[.] black citizens observed the Fourth of July mostly alone because the vast majority of whites refused to, preferring instead to celebrate Confederate Memorial Day, May 10. State politicians repeatedly averted their eyes as textile industry executives employed children and quashed attempts by mill workers to organize for fair wages. In 1920, the South Carolina legislature rejected the proposed women[.] suffrage amendment and took almost a half century finally to ratify it, in 1969. In 1948, the same year the South Carolina legislature declared President Harry Truman[.] new civil rights commission \"un-American,\" Thurmond[.] full-throated advocacy of racial segregation as the States' Rights Democratic Party presidential nominee helped him carry four Deep South states. Six years later, the Clarendon County school district--where per-pupil spending on whites was quadruple that for blacks--was pooled with three other districts in a failed defense of the \"separate but equal\" standard in the landmark Brown v. Board of Education case. And when Congress passed the 1965 Voting Rights Act, the law that finally banned the creative and vicious methods used to disfranchise blacks, South Carolina became the first state to challenge its constitutionality. By 1968 Harry Dent, the most legendary of Thurmond[.] political proteges and a key artchitect of the \"southern strategy,\" was helping Richard Nixon translate racial antagonisms into crucial Republican votes, a victory in South Carolina, and a ticket to the White House.\n\nIf all of this seems like so much ancient history, consider that South Carolinians are still debating the merits of public displays of the Confederate battle flag. Indeed, more than a few pundits believe Republican David Beasley won the 1994 governor[.] race in part because of his pledge to support displaying the Confederate flag over the state capitol--then promptly lost his 1998 reelection bid later after a \"religious epiphany\" caused him to reverse position. After two decades of adverse judicial rulings, in 2000 Bob Jones University, the state[.] largest private liberal_arts college, founded by its anti-Catholic namesake, finally ended its policy of prohibiting interrracial dating. Last year, South Carolina was sued for issuing \"choose life\" vanity plates while refusing the same option to pro-choice citizens, justifying its decision by claiming that the anti-abortion message constitutes protected government speech. Today, more than eight decades after women first won the_right to vote, the South Carolina state legislature is the only one in America where women do not hold at least 10 percent of all seats.\n\nOther Deep South states may stake their own claims, but South Carolina is America[.] most conservative state. From a strictly constitutional-historical standpoint, its legacy of firsts and lasts reads like a rap sheet: first to overturn a provincial government during the revolutionary period; last to abandon the Atlantic slave trade; first to call for nullifying the Constitution[.] federal authority; first to secede from the Union; last to abolish the white primary; first to litigate against the intregration of public schools and challenge the Voting Rights Act. Whenever America finds itself at some social or political crossroad and in need of direction, perhaps the best things to do is ask, \"What would South Carolina do?\" And then do the opposite.\n\n[Source.](http://www. amazon. com/Whistling-Past-Dixie-Democrats-Without/dp/0743290151)"}