{"doc_id": "795", "name": "2012_10_humanities_student_major_1329_eve", "namespace": "we1sv2.0", "metapath": "", "pub": "Eve", "title": "2012-10-humanities-student-major_1329_Eve.txt", "pub_date": "2012-10-26T00:00:00Z", "Sentiment": "0.02", "Subjectivity": "0.289", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1672", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6s5zg9", "Reddit_id": "c6s88ao", "Subreddit_id": "t5_2qil9", "Commenter": "Rolock", "length": "9484", "content_scrubbed": "(Editor[.] Note: The usual disclaimer - alliance updates are intended for internal audiences and are reproduced here with the understanding that the savvy reader understands that they are propaganda rather than literal truth. Perhaps what we should do instead of disclaiming is simply dispense with the disclaimers and ban anyone in comments complaining about /needing/ a disclaimer, because this is getting ridiculous.)\n\nCEO UPDATE: GASSING THE TRENCHES\n\nIn the aftermath of our crushing victory - seizing eleven stations in one op - NCdot[.] primary AU TZ commander, Dark Razer, had this to say. A vow of no more structure shots or repping ops, an era of goodfights and happiness and I'm not sure what: perhaps he is fantasizing that we will leave NCdot alone now and that they can get involved against Solar without a care in the world. And no, you're not hallucinating; that soundcloud ends with NCdot praising Makalu as 'a good fc'.\n\nLast night, Vee rage-SBU'd a constellation in Vale of the Silent. Despite Dark Razer[.] vow of an end to structure shots and abandoning sov, NCdot and their allies stayed up until the ass-crack of dawn shooting SBUs with a handful of Nagas. It took hours with so few people, and Illuminati spent the evening cackling like hyenas in a particularly unsubtle Disney movie as they watched.\n\nBut I'm getting ahead of myself - the fun knife-twisting bits of watching your foe break before you and cede regions while hoping against hope for a better tomorrow. We need to take a step back and discuss the war we've had - how it happened, how we won, and where it[.] taken us as an alliance and as a coalition.\n\nACTUAL WAR: IT'S ABOUT GODDAMNED TIME\n\nWar is a force that gives us meaning, heroin-addicted war correspondents tell us. And who are we to disagree? The sad fact is that, as a war machine, we have not been tested in any real way since the Battle of VFK, more than a year ago. One could argue that before they caved in like a rotted pumpkin, IT Alliance put up something of a fight in Fountain, but that was also years ago. White Noise and Raiden didn't survive the \"purge moons, siege and punt\" phase, and the Southern Coalition was so utterly laughable we just shifted directly to mop-up mode after Vee devoured a few Loki fleets.\n\nAll of this success breeds complacency; we have been allowed by the incompetence of our enemies to win repeatedly without actually improving much. A contested sov war provides a continual test of your weaknesses as an organization, and you must rapidly adapt your tactics and strategy to deal with adversity - something that Evolution never seemed to do, despite their name.\n\nReal sov war does not last for one week; real sov war lasts for months. We have raised almost three generations of newbie goons under a banner of easy victories against incompetent enemies, and the hoary, bitter veterans of the Great War are rightfully concerned about our ability to prosecute the kind of war that Goonswarm used to be infamous for: the meatgrinding war of attrition.\n\nGreat: we're happy to have enemies that haven't completely rolled over and died at the threat of a CFC invasion. What have we actually gotten from this?\n\nTRENCH WARFARE AND OTHER PLAYGROUND AMUSEMENTS: A BRIEF HISTORY\n\nThis war was one we predicted for months: NCdot made it obvious that Wicked Princess and Supertwinkey were barely under control in US TZ by their nominal leader, Vince Draken, himself not known for abiding by treaties. After the Raiden/Tenal purge we had a 'bonus round' and took all but five of NCdot[.] Venal techs, then settled in to muck about in D/Q/PB. The actual beginning of this war was Supertwinkey dropping a group of blap dreads on an FCON tech moon which Black Legion had reinforced; they lost the blap dreads, the CFC saved the moon, and we were off to the races at last.\n\nThe CFC vs NCdot/BL/Ev0ke/Nulli war that ensued followed a pattern. The CFC would purge forward with our tried and tested pattern and, because the enemy didn't simply collapse, we began to run into snags that would slow or halt our progress until we solved the problem. The first major snag was significant, and involved two separate org failures simultaneously. Our Sky Marshal resigned and we tried to create a 'Sky Team' without a single point of responsibility, which failed - ops were called but FCs were not wrangled, resulting in FCs slapfighting instead of making war. At the same time, Black Legion spearheaded the use of T3 sniping fleets as a counter to our Alphafleet, which proved that our doctrine (pushing 2+ years, perhaps one of the oldest extant doctrines in Eve) was laughably outdated. During this time - about a week and a half - we lost command and control and effectively got nothing done in US TZ.\n\nHowever, we fixed our doctrines, re-unfucked the Sky Team by bringing Rydis back but setting her up with assistants so the org had responsibility, and we went back to having proper op-calling with Rokhs in Alphafleets and Tornadofleets and shit pretty much went back to normal for us, where 'normal' means gobbling up NCdot[.] tech moons with impunity, taking sov in EU TZ, and losing the odd retarded supercarrier to ganks in UMI.\n\nThere was a lapse in command and control after September 11th that lasted about two weeks. During this time, the directorate was basically wiped out to one degree or another. The enemy also had begun to realize that timing for EU TZ resulted in inevitable loss, so NCdot began timing for their strongest timezone relative to us: AU TZ. Due to the lack of command and control (this is jargon for 'no one is in charge of anything, shit is just happening, oh god') FCs were allowed to alarm-clock and shed fleets to the NCdot AU TZ, and soon the enemy developed a swagger. Meanwhile, because of the command breakdown, we stopped our siegework, meaning that the enemy AU TZ was getting ~gudfights~ (Drakefleets handed to them on a platter, more like) without having to slog through structures. This was our second major seize-up as a coalition at war.\n\nAfter pulling ourselves back together, order and strategy was restored: FCs were not allowed to feed fleets in AU TZ and a massive siege campaign was initiated, which turned the world of the NCdot AU TZ from 'ha ha this owns my k/d ratio' into a hellish realm of blueballs and frantic structure repair broken up only by the joyous experience of shooting endless SBUs. Structures stopped being repped fully, or repped at all, and soon we began making progress through the hostile AU TZ by breaking their will to log in.\n\nAround this time, the pressure we applied may have helped accelerate the inevitable Wicked Princess/Vince Draken/Elo Knight drama. Despite our initial propaganda about Black Legion, what turned the tide in this was was the relentless siegework in US/EU drowning the NCdot AU TZ in timers and demoralizing them, rather than the soap opera (which was almost entirely centered in US TZ, which we control anyway).\n\nCOME BACK HERE AND TRY TO HIT US AGAIN, DAMN IT\n\nNCdot seems to have ceded Tribute in hopes that we will simply leave them alone in Vale - but we are not done with this war.\n\nAs the course of the war began to turn, NCdot began to cede US and EU TZ, taking their fleets during these timezones to the east to fight Solar Fleet in Geminate while leaving their AU TZ to defend and clean up our mess. This has enraged our US/EU FCs, who hunger for revenge for their aching balls.\n\nWe have also begun on developing our frankly anemic AU TZ. When we first brought Convicted into the coalition, they were primarily an AU TZ force, but have developed in recent years into an EU TZ alliance; their participation metrics are actually quite good, but we cannot rely on them to hold a TZ they mostly don't live in. This is why we have created 'Asshole Squad', and if we are to develop our AU TZ capabilities further by training FCs in the arts of guerilla warfare (being douchebags with dictors, bombers, and sniping fleets, to wit) we cannot afford a lazy peace.\n\nSO: WHAT'S IN VALE, ANYWAY?\n\nNCdot has about ~25 tech moons left in a drama-wracked shell of an alliance. Per capita, that makes them one of the richest alliances in the game if we leave them in peace. By contrast, Goonswarm is actually the poorest alliance in the Clusterfuck on a tech-per-capita level. As you can tell from the Soundcloud linked at the top of this thread, the line members in NCdot are sick unto death of sov warfare and dealing with structures; they also do not expect us to go for Vale.\n\nIn Vale we will not be attacking Evoke or Ewoks space. They have been solid members of OTEC and we enjoy having enemies who we can make reliable deals with. Everything else, however, is up for grabs. The CFC needs the space - some of our people are still living in Pure Blind, for god[.] sakes - and we need the war. We were just getting started in Tribute, our AU TZ development project hasn't really gotten off the ground, and Mister Vee is almost insensible with rage to the point that he[.] in a structure-purging frenzy.\n\nI DON'T CARE ABOUT HISTORY OR WARTIME EFFECTIVENESS, GIVE ME THE TLDR ALREADY\n\nWe're chasing NCdot to Vale and purging them. Also their techs in lowsec. Fuck'em.\n\nYou don't even need to restage your subcaps, because we now have bridges to the edge of Vale. Ops will be forming out of UMI but launching out of 15W-, which I warn you has a kickout station. If you die due to that, you've been warned, and we'll mock your death."}