{"doc_id": "798", "name": "2012_10_humanities_student_major_1352_cscareerquestions", "namespace": "we1sv2.0", "metapath": "", "pub": "cscareerquestions", "title": "2012-10-humanities-student-major_1352_cscareerquestions.txt", "pub_date": "2012-10-26T00:00:00Z", "Sentiment": "0.111", "Subjectivity": "0.366", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "254", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_125rs2", "Reddit_id": "c6sebx8", "Subreddit_id": "t5_2sdpm", "Commenter": "jpstevans", "length": "1574", "content_scrubbed": "As a current college student:\n1) Take AP (or IB HL or A-levels or whatever your college-equivalency tests are) classes and take the exams, participate in whatever dual-enrollment options are available to you, etc. Doing well on college-equivalency exams for classes in the liberal_arts, especially science and math classes, will give you a lot more freedom when you get to college to take upper-level courses that actually interest you.\n\n2) Figure out where you want to go to school. Be realistically ambitious: there isn't any reason NOT to apply to MIT if you have the GPA and background, but as a sophomore realize that you should spend the next two years really making yourself stand out.\n\n3) Figure out ways to make yourself stand out. Go be president/chairperson/captain of one or three things. Pick things you can be passionate about. Consider starting your own club: research-wise, you might try getting a science teacher at your school to sponsor a research journal club, where interested students can come together to discuss a research article once a month, potentially for extra credit. \n\n4) It[.] not too early for you to start thinking about your passions. While it won't count for credit, [Coursera](http://www. coursera. com) and [Udacity](http://www. udacity. com) both offer courses taught by real university professors. Try taking at least the first few weeks of a course over winter or summer break.\n\nIt[.] good that you're thinking about these things now. You've already got a leg up on upperclassmen who are only just beginning to think about their futures. "}