{"doc_id": "704", "name": "2012_10_humanities_student_major_221_christianity", "namespace": "we1sv2.0", "metapath": "", "pub": "Christianity", "title": "2012-10-humanities-student-major_221_Christianity.txt", "pub_date": "2012-10-05T00:00:00Z", "Sentiment": "0.158", "Subjectivity": "0.464", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "365", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6i7ic1", "Reddit_id": "c6id49j", "Subreddit_id": "t5_2qh6c", "Commenter": "achingchangchong", "length": "2041", "content_scrubbed": "Sure. \n\n* Calvin is actually pretty diverse. It[.] around 10% international students, which if I recall correctly is one of the highest ratios of any liberal_arts school in America. (I grew up in Singapore, making me an international myself.) Most are from Korea, Ghana, or Nigeria. I guess God has blessed us with good word-of-mouth in those places.\n\n* Another thing is how easy it is to form deep, meaningful relationships with your professors. In my experience, Calvin professors were more than happy to make themselves available and mentor me. My history advisor in particular helped me get through some pretty hard_times one year when I had issues with depression.\n\n* It[.] easy to get by at Calvin, but really hard to excel. This isn't an accident. Neal Plantinga, who used to be president of the Seminary, once said it[.] basically ingrained into the mission of the college. You have to work your butt off to get an A. I once got a B+ in *American Music* (seriously!) because I turned in my final essay late. It was incredibly frustrating.  \n\n* The dining hall hours have now changed to a more reasonable schedule.\n\n* If you like indie music, you'll like Calvin. I'm still amazed at the quality of the music acts we got every year. Bands love Calvin. We take being a good audience seriously.\n\n* A lot of people study abroad. For most majors, there[.] a well-established semester abroad program. For history majors, most people either went to York or Budapest. I went on two study abroad trips during the January interim, one to Kenya, one to Italy.\n\n* Bad: the weather isn't great. The winters aren't that cold or windy, but it gets pretty dreary during January in West Michigan.\n\n* Grand Rapids is a pretty neat city to live in and has all the \"city things\" - downtown area, ethnic restaurants, nightlife - but you'll need a car. Otherwise it[.] kind of inconvenient to get around.\n\nIt[.] never been a better time to go to Calvin, in my opinion. I think the Holy Spirit has big things in store for the student body in the next year or two."}