{"doc_id": "747", "name": "2012_10_humanities_student_major_713_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2012-10-humanities-student-major_713_funny.txt", "pub_date": "2012-10-17T00:00:00Z", "Sentiment": "0.07", "Subjectivity": "0.313", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "287", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6nqyr1", "Reddit_id": "c6nr9ab", "Subreddit_id": "t5_2qh33", "Commenter": "beager", "length": "1578", "content_scrubbed": "I've been saying this a lot recently, but your major in college is a fair bit less important than your ability to finish a 4 year undergrad program.  I work in high tech with plenty of folks who are doing very well for themselves, and they've got educations in \"lightweight\" disciplines such as psychology, history, the humanities, etc.  They work hard to get that first job in an industry, and then they work their way up from there.\n\nNow, a lot of people in those softer disciplines need to do intense amounts of interning, or need to get a masters degree in a relevant field (an MBA is relevant to any business, really) to break through, but it can be done.\n\nI work in software, and I've seen people who actually have gone through 6+ years of computer science, earning MSes in comp sci, and they suck at their jobs.  And it[.] not from their education, it[.] from the fact that when they get out of school, they assume they're done learning, and won't ever have to learn again.\n\nNews flash compadre, the learning REALLY starts when you get to the workplace.\n\nI think a lot of the pervasive mentality around here centers on the idea that if you embrace an education in science, engineering, or business, you'll have somehow outsmarted all the plebs, and can coast by for the rest of your life.  Sure, science, engineering, or business are a little more vocational, and can get you to those jobs more easily, but you have to work your ass off just as hard as anyone else to move up and stay relevant in the workforce.\n\nHey look, here[.] me being serious in /r/funny, what a waste!"}