{"doc_id": "785", "name": "2012_10_humanities_student_major_1245_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-10-humanities-student-major_1245_AskReddit.txt", "pub_date": "2012-10-25T00:00:00Z", "Sentiment": "-0.117", "Subjectivity": "0.339", "Score": "186", "Upvotes": "186", "Downvotes": "0", "Wordcount": "275", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1222ra", "Reddit_id": "c6rj6ve", "Subreddit_id": "t5_2qh1i", "Commenter": "98thRedBalloon", "length": "1448", "content_scrubbed": "When I was 14, I was asked, along with twenty or so other students, to perform in a little informal concert that was scheduled to run during my school[.] open evening, where parents of prospective students would come in for a while, see the music talent of the school being showcased, and be able to walk out again. \n\nI was really excited and practiced two pieces to perform on the piano on the night. When the night rolled round, I arrived, and asked my teacher where I was on the schedule, and he waved me aside, clearly busy. \"Fair enough,\" I thought, \"it must be a busy job running this. I'll wait until he calls me up\". So I take my seat with the other performers and the evening gets underway.\n\nI watched them all in turn get up, perform, sit back down, and I waited to be called up. I sat there for hours waiting for my moment, until the crowds of parents coming in and out of the hall dwindled, and the end of the evening came. I had sat there watching all these kids get their opportunity to play for parents and students. Everyone left, and my parents came to pick me up and take me home.\n\nI was never told that I had been dropped from the schedule, and they all let me sit there like an idiot. That night, and the music department of at school, killed any passion I had for learning and playing music. That, combined with the brutal favouritism shown by all the music teachers, taught me that the arts are cruel and unfair. Fuck you, Ian."}