{"doc_id": "1568", "name": "2012_01_humanities_student_major_647_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-01-humanities-student-major_647_AskReddit.txt", "pub_date": "2012-01-17T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.459", "Score": "1098", "Upvotes": "1098", "Downvotes": "0", "Wordcount": "683", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3i4hfe", "Reddit_id": "c3i73kg", "Subreddit_id": "t5_2qh1i", "Commenter": "lawstudent2", "length": "4121", "content_scrubbed": "As a lawyer with a degree in physics and math, I'd say it is about 50/50 between the two of you.\n\nFirst off, law is technical. You do need to understand how law works in order to legislate effectively. However, the technicality of law is not hard to learn, especially in comparison to any of the physical sciences. So, while this is a factor, it is a rather small one.\n\nThe reason that scientists and engineers don't go into politics something like what you said, 'that they have trouble adopting a political mindset,' but let me rephrase it for you: **S&Es find it, deeply frustrating to deal with people who are lying, know they are lying, and do not give a shit.** Further, they find it deeply, deeply frustrating to work in a field that does not rely upon evidenced based thinking, but relies upon emotional persuasion and the systematic abuse of the irrational behaviorism of the crowds. \n\nTo make a counterpoint to you, lawyers 100% do **not** think that law is truth. They actively know that law has nothing to do with truth **and simply do not give a fuck,** because they are not rewarded for being right, **they are rewarded for convincing a jury of 12 idiots.** This is a skill set that much, much more directly **translates into getting elected** -- convincing a bunch of people who know virtually nothing about the underlying subject matter using the arts of persuasion and rhetoric -- than it has to do with the scientific process, which concerns persuading highly trained experts with rigorous, reproducible experimentation and objectively verifiable data.\n\n**tl;dr Law and politics reward the same skillsets. Politics, on the other hand, actively hinders the scientific mindset, and people who are scientifically inclined become deeply disenchanted when they see their factually correct arguments fail to specious arguments made from emotional appeals.**\n\nedit: By 'technicalities of law' I do not mean every nuance of law or the substantive content of different bodies of law, such as criminal law or intellectual property law. That is often challenging and takes a lot of specialized education. What I mean is the basics of how the american court system is structured, how the legislative process works and other things of that nature. I. e., say, the curriculum of a good college level Intro to US Government course. Also, I do not mean to imply that all lawyers are scumbags. I know many that are highly devoted and ethical. Those ones, however, are not particularly attracted to politics.\n\nedit: Everyone should read [Rayiner[.]](http://www. reddit. com/r/AskReddit/comments/ol4sn/in_western_countries_why_the_fuck_do_we_keep/c3i9gmw) response below. Highly thoughtful and contributes nicely, though I do not necessarily agree that the two skillsets are orthogonal to the good/evil axis. For instance, I think that it is pretty much impossible to argue in favor of a lie using evidenced based reasoning, whereas purely emotional and persuasive argumentation can be used to argue for any point at all. Therefore, I find the latter to be substantially more prone to abuse than the former.\n\nedit: I am getting a lot of flak from other attorneys. I'm fine with that. They are horrified that my attitude toward the jury system is so cynical. For the record, I honestly believe, and know from experience, most lawyers are deeply ethical. And that less than 1% of cases go to verdict, so most 'wins' happen in the brinksmanship of settlement. I am all too aware. I admit fully to boiling down the situation and putting a cynical spin on it. I stand by it, however, because so much of the process of law is directly structured around convincing other lawyers in a very particular context: the whole process is colored very explicitly not by what is 'right' but by what you can *prove*. The distinction is night and day. Your job, as a lawyer, is to represent your client zealously, even and especially if you know he is 100% wrong. This has nothing to do with science. Additionally, it lends itself precisely to the political mindset. And, for the record, for all you ethical attorneys: keep up the good work."}