{"doc_id": "705", "name": "2012_10_humanities_student_major_227_worldnews", "namespace": "we1sv2.0", "metapath": "", "pub": "worldnews", "title": "2012-10-humanities-student-major_227_worldnews.txt", "pub_date": "2012-10-06T00:00:00Z", "Sentiment": "0.008", "Subjectivity": "0.452", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "545", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6ieu72", "Reddit_id": "c6ifb4a", "Subreddit_id": "t5_2qh13", "Commenter": "HansGrub3r", "length": "2984", "content_scrubbed": "I'm using my college loans to double major in Mathematics and Computer Science, and currently I've got a 4. 0 (might go to 3. 9 at the end of this semester :/ )\n\nNot all of us are wasting that money, but bitching about those that are making dumb decisions and getting degrees with high cost and low market value... doesn't fix the problem.  I can full well take the loan debt, because my degree is WORTH it.  If people want to be stupid, and get a degree in a field that has not market, and take on debt to do so, they're going to hear it dozens of times over before and during their time earning the degree.  I've never met an English major who has thought their job outlook was great.\n\nThey voluntarily take on that debt, and many choose to become teachers, something we are in short supply of quality applicants.  Becoming a teacher actually benefits them in that much of their loans can now be cancelled out through either through a number of years of on time payments and/or a loan forgiveness for working as a teacher, working in the public sector, etc.\n\nWhat we SHOULD be doing is educating kids in high school on finances and debt, and the dangers of it.  Showing them average salary projections in many industries, especially trade skills where we need them desperately.  Stop making them think college is required and that technical schools are a dirty thing (or any job for that matter).\n\nIf they've gotten to college, and haven't learned yet the cost of the loan and seen the jobs outlook for their field, then the school has failed, high school has failed, and their parents have failed.  Oh, and laws have been broken due to lending acts that require a fairly extensive truth in lending process before they can sign for that loan.  It[.] not complex really, but it requires you to read all the regulations etc, section by section, and then answer some multiple choice questions about your loans and grants, how they are funded, when they'll need to be paid, how much they'll cost, how you can (and mostly can't) discharge them, etc.  You have to get them all right, and see the answers why, before you can move on to the next section.  This is one of the many forms of loan information I was hammered with when I accepted them, and I still receive updates every six months.\n\nTL;DR - If a person accepts those loans with no job potential in this day and age, they've done so against a hell of a lot of information in their face about the dangers and costs.  The fact that they can is simply us allowing them the opportunity and not dictating what they have to study.  I'd like to see less negativity towards trade skills and any job that doesn't need a college degree, but it doesn't negate that I'll also stand up for anyone who wants to get a liberal_arts degree and take on that debt willingly.  If it[.] what they want, and their loans CANNOT be discharged, who am I to deny them?  They'll have options, and at worst they're going to teach, which is a very important job."}