{"doc_id": "1574", "name": "2012_01_humanities_student_major_719_srsdiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "SRSDiscussion", "title": "2012-01-humanities-student-major_719_SRSDiscussion.txt", "pub_date": "2012-01-20T00:00:00Z", "Sentiment": "0.14", "Subjectivity": "0.404", "Score": "30", "Upvotes": "30", "Downvotes": "0", "Wordcount": "318", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_oojca", "Reddit_id": "c3ititg", "Subreddit_id": "t5_2t5sa", "Commenter": "Kirkaine", "length": "1868", "content_scrubbed": "I like being intellectual and having intellectual hobbies. I like having intellectual conversations with friends that care deeply for things other than beer, titties, computers, Apple products, and Call of Duty. I like being able to identify the artist of many paintings by simply looking at them. I like choosing to vacation in Damascus rather than Disneyland. I like disliking the underlying assumptions and power institutions of society.\n\nI think you just answered your own question.  The problem is this (if your post is anything to go by, accurate) idea that hipsters think they have the sole claim to the word \"intellectual\".  At the risk of lowering myself to this level of self-aggrandisement, my bookshelf is also stocked with a Qur'an, a Bible (a few, actually) and a Baghadivad Gita; philosophy books going all the way back to Plato; a hefty portion of the western canon; a decent helping of British poetry; topped off with the Homerian epics (I'm slowly teaching myself ancient Greek in order to read them as written) amongst others.  All thoroughly earmarked and filled with my notes.  I'm hardly a Marxian, but I can almost guarantee you I've read more of Marx[.] writing than you have.\n\nThat being said, I'm also a theoretical physics/economics double major, and an athlete to boot.  The fact that I can solve an equation doesn't mean I can't read Joyce, and the fact that I can run a marathon doesn't mean I've never seen the inside of an art gallery.  The problems I have with hipster culture (as so well exemplified by you just above) are these assumptions you would make about people like me just because we don't choose to major in liberal_arts.  The mark of a genuinely intelligent person is one who is able to recognise the importance of ideas beyond their own sphere of expertise, rather than simply dismissing that which is outside their bubble."}