{"doc_id": "706", "name": "2012_10_humanities_student_major_237_worldnews", "namespace": "we1sv2.0", "metapath": "", "pub": "worldnews", "title": "2012-10-humanities-student-major_237_worldnews.txt", "pub_date": "2012-10-06T00:00:00Z", "Sentiment": "0.108", "Subjectivity": "0.333", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "284", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6iedub", "Reddit_id": "c6ijbb0", "Subreddit_id": "t5_2qh13", "Commenter": "[deleted]", "length": "1498", "content_scrubbed": "It[.] arguable that there is some natural selection going on here.  If you are willing to saddle yourself with 150k of debt in this job climate seeing that the class ahead of you can't get a job, you may be educated but you have no common sense.  Parents are even worse off for falling into the trap.  \n\nTake that money and start a small business.  In the US there are about 25 million small business.  If you own the business no one is going to give a shit if you went to college or not.  You are the one doing the hiring!\n\nMost jobs you do for other people are going to be shitty.  It[.] just a fact of life.  There is a lot of work to be done that no one wants to do.  If you have the same middle of the road skill set as everyone else you are going to get those jobs.  That[.] why there are so many liberal_arts degree graduates in shitty jobs.  Diploma mill colleges are cranking them out.\n\nYou have some control over your own fate though.  If you are self motivated and can learn a skill that people need, you will be ok.  Learn the shit out of what you are interested in and promote yourself.  It[.] the recipe for success in almost all fields. \n\nHere[.] the thing that most students in the US don't understand.  40 years ago few people went to college.  Going to college DID allow you to get a higher paid position.  There uses to be a pejorative term for it.  \"College Boy\". Now everyone goes to college.  So everyone is on a similar education level.  College students aren't \"special\" anymore."}