{"doc_id": "625", "name": "2012_02_humanities_student_major_296_byu", "namespace": "we1sv2.0", "metapath": "", "pub": "byu", "title": "2012-02-humanities-student-major_296_byu.txt", "pub_date": "2012-02-09T00:00:00Z", "Sentiment": "0.077", "Subjectivity": "0.425", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "433", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_phlrq", "Reddit_id": "c3pjnnz", "Subreddit_id": "t5_2qncw", "Commenter": "nocoolnametom", "length": "2524", "content_scrubbed": "I suppose if we really want the mods to be representative of the current makeup of the BYU student body we need to first ensure that over half of them are female.  That might be hard to do on Reddit (but not impossible, of course).  We'll need to make sure that 95% of them are white Americans.  Not all of them should be living in Utah; we'll need some good representation from California, Idaho, Arizona, New_York, etc.\n\nAlso, perhaps we should look at each individual school[.] statistics of how many are pursuing degrees in their various fields and make sure that the mods are not totally composed of Mathematics or Engineering graduates.  We should probably throw in some Humanities grads, too.\n\nAnd when it comes to religion, not everyone at BYU is Mormon.  There are a handful of Muslims, Traditional Christians, and even some Buddhists, so for fairness sake we should probably have at least one never-mormon as a mod.\n\nSo, we'll probably need a total of about twenty or so mods to start getting some good representation going.\n\nI know this is mean (reductio ad absurdum is never kind), and for the meanness I do apologize.  But frankly, the point of a mod is to keep the perspective and culture of a subreddit aligned with the aims and intents of the subreddit as a whole.  Since this is the BYU subreddit and since the current mods are current students and alumni I think they're in a great position to ensure that this subreddit is reflective of the average campus experience.  I'd start to worry if too many stories appear about antiwar protests, beer parties, fraternities, or other things that are absent (usually) from BYU.  But when it comes to critical (both positive and negative) discussions of BYU policies, classes, religious culture, and even leaders then that[.] not at all dissimilar from my old BYU experience.  I think this should only be an issue if the subreddit begins to trend in a way that doesn't match with what you'd expect to find around a possible table within the Wilk at lunch.\n\nThe best way to get things better, if they are bad at all right now, is to get more BYU students involved.  Currently, [/r/lds](/r/lds) has only a handful of redditors compared to [/r/exmormon](/r/exmormon) (and since they're slowly abandoning Reddit for the more strictly-maintained ZionList the disparity is just growing), so I'm not surprised that both mods of [/r/byu](/r/byu) are exmormon.  But that just a question of numbers.  Spread the word on campus and the perspectives of the mods will matter less."}