{"doc_id": "656", "name": "2012_02_humanities_student_major_649_coloradoschoolofmines", "namespace": "we1sv2.0", "metapath": "", "pub": "ColoradoSchoolOfMines", "title": "2012-02-humanities-student-major_649_ColoradoSchoolOfMines.txt", "pub_date": "2012-02-20T00:00:00Z", "Sentiment": "-0.004", "Subjectivity": "0.399", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "310", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pxh6m", "Reddit_id": "c3t1a3q", "Subreddit_id": "t5_2spd5", "Commenter": "[deleted]", "length": "1785", "content_scrubbed": "There are very few women on campus.  The ratio is approximately 1 to 4.  There are some frats, but I try to ignore them.  They're nothing but a bunch of houses that exist for the sole purpose of drinking and attempting to cheat on take-home exams.\n\nHumanities exist only to the extent required by ABET (the accreditation board).  They offer so few humanities that you can't register for any of them before your senior year.  The humanities available are the most ridiculously boring ones imaginable.  They offer no photography or film classes whatsoever.\n\nThe dorms are pretty standard college dorms.  The new \"maple hall\" is nicer and more expensive, but you don't get any increase in room size, they're all identical.\n\nI don't know about ED/EA, I assume they're treated the same as any other university.\n\nI really like the small size of the university.  You can show up at your professor[.] office hours and actually talk to them.  Most (but not all) lectures are given by the actual professor and not a TA or grad student.\n\nI hate the small size of the university.  There[.] no interesting humanities courses, there[.] very few women, there[.] almost nothing to do on campus.\n\nDouble major?  Good luck.  You'd better be dedicated to obtaining one.  Some years ago ABET got upset because CSM required an excessive number of credits to graduate with a bachelor[.] degree.  CSM solved this problem by making all labs worth zero credits.  You still have to complete the same amount of work, you just get less credit for it.  Double majoring will be insane.\n\nThe average time for a single major is 4. 5 years.  CSM tells you that you can complete a degree in 4 years.  This is only true if you take 18 credit hours per semester.  18 credit hours per semester is not possible for most students."}