{"doc_id": "1588", "name": "2012_01_humanities_student_major_876_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2012-01-humanities-student-major_876_philosophy.txt", "pub_date": "2012-01-24T00:00:00Z", "Sentiment": "0.039", "Subjectivity": "0.128", "Score": "38", "Upvotes": "38", "Downvotes": "0", "Wordcount": "570", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_outab", "Reddit_id": "c3kb5ee", "Subreddit_id": "t5_2qh5b", "Commenter": "Apollo_is_Dead", "length": "4032", "content_scrubbed": "Forgive the length, but this might be slightly less biased (note that I've bracketed most texts from the 20th and 21st century): \n\n**Classical Greek Philosophy**\n\n* **Aristotle**: Categories; Eudemian Ethics; Nicomachean Ethics; On Interpretation; On Memory and Recollection; On the Movement of Animals; On the Soul; Politics; Prior and Posterior Analytics; Rhetoric; Sophistical Refutations; Topics.\n* **Plato**: Apology; Crito; Euthyphro; Gorgias; Laches; Laws; Meno; Phaedrus; Republic; Sophist; Symposium; Timaeus. \n\n**Hellenistic Philosophy**\n\n* **Cicero**: On Duties; On Ends; Tusculan Disputations.\n\n**Roman Philosophy**\n\n* **Diogenes Laertius**: Lives of Eminent Philosophers.\n* **Epictetus**: Discourses; Handbook.\n* **Marcus Aurelius**: Meditations.\n* **Seneca**: Moral Epistles; On Anger; On Benefits; On the Firmness of the Wise Person; On the Happy Life; On the Shortness of Life; On Tranquility of Mind.\n* **Plotinus**: The Enneads. \n* **Plutarch**: Matters Relating to Customs and Mores.\n\n**Medieval Theology**\n\n* **Augustine**: City of God; Confessions. \n* **Aquinas**: Summa of Theology.\n* **Boethius**: Consolation of Philosophy.\n* **Ockham**: On the Connection of the Virtues; Summa of Logic.\n\n**Renaissance Philosophy**\n\n* **Erasmus**: In Praise of Folly.\n* **Machiavelli**: Discourses on Livy; The Prince.\n* **Montaigne**: Essays.\n* **Petrarch**: Of Solitude; Remedies for Good and Bad Fortune.\n\n**Modern Philosophy**\n\n* **Berkeley**: Principles of Human Knowledge.\n* **Cudworth**: A Treatise Concerning Eternal and Immutable Morality; A Treatise of Freewill.\n* **Descartes**: Discourse on Method; Meditations on First Philosophy; Passions of the Soul.\n* **Fichte**: Foundations of Natural Right; Foundations of the Entire Science of Knowledge; The System of Ethics.\n* **Hegel**: Elements of the Philosophy of Right; Encyclopedia of the Philosophical Sciences; Lectures on the Philosophy of History; Phenomenology of Spirit; Science of Logic. \n* **Hobbes**: Leviathan; Treatise on Human Nature.\n* **Hume**: A Treatise of Human Nature; Dialogues Concerning Natural Religion.\n* **John Dewey**: Art as Experience; Experience and Education; Experience and Nature; How We Think; Human Nature and Conduct; Reconstruction in Philosophy. \n* **Kant**: Critique of Judgment; Critique of Practical Reason; Critique of Pure Reason; Groundwork of the Metaphysics of Morals; Idea for a Universal History with a Cosmopolitan Purpose; Metaphysics of Morals; Perpetual Peace; Prolegomena to any Future Metaphysics; What is Enlightenment?\n* **Kierkegaard**: Concluding Unscientific Postscript; Either/Or; Fear and Trembling; Philosophical Fragments; Repetition; Stages on Life[.] Way; The Concept of Anxiety; The Sickness Unto Death; Upbuilding Discourses, 1843-1844; Works of Love.\n* **Leibniz**: Monadology; Theodicy.\n* **Marx**: Capital, Vol. I-III; Grundrisse; The German Ideology; Theses on Feuerbach.\n* **Mill*: On Liberty.\n* **Nietzsche**: Beyond Good and Evil; Ecce Homo; On the Genealogy of Morality; On Truth and Lies in a Nonmoral Sense; The Birth of Tragedy; The Gay Science; Thus Spoke Zarathustra; Untimely Meditations.\n* **Pascal**: Pensees.\n* **Reid**: An Inquiry into the Human Mind on the Principles of Common Sense; Essays on the Active Powers of Man; Essays on the Intellectual Powers of Man.\n* **Rousseau**: Discourse on the Arts and Sciences; Discourse on the Origin and Basis of Inequality Among Men; Emile: or, on Education; Reveries of a Solitary Walker; The Confessions; The Social Contract.\n* **Schelling**: Ideas for a Philosophy of Nature; System of Transcendental Idealism.\n* **Schleiermacher**: Dialectic, or, The Art of Doing Philosophy; Hermeneutics and Criticism; Lectures on Philosophical Ethics; On the Highest Good; On the Worth of Life.\n* **Schopenhauer**: On the Fourfold Root of the Principle of Sufficient Reason; On the Will in Nature; The World as Will and Representation.\n* **Smith**: Theory of Moral Sentiments; Wealth of Nations.\n* **Spinoza**: Ethics; Tractatus Theologico-Politicus."}