{"doc_id": "1547", "name": "2012_01_humanities_student_major_503_frat", "namespace": "we1sv2.0", "metapath": "", "pub": "Frat", "title": "2012-01-humanities-student-major_503_Frat.txt", "pub_date": "2012-01-13T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.214", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "302", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_oesj9", "Reddit_id": "c3gvmxy", "Subreddit_id": "t5_2s0mx", "Commenter": "Doctorlastname", "length": "1746", "content_scrubbed": "Visibility. It[.] all you need.\n\nMy fraternity used to dress to the pin on a weekly basis. It used to be every Tuesday, then was on a random day each week. My fraternity also used to have everyone wear our letter shirts on the same day too. Believe it or not, people noticed. Because of this, I came to know pretty much all of the members before I ended up rushing.\n\nLikewise, we all sit together in our school[.] cafeteria. We have either the largest or second largest fraternity at my school, and seeing ten tables connected together with 30 brothers (plus girlfriends and whatnot) squished together is a pretty powerful image. Especially when we're all dressed up or wearing letter shirts\n\nOf course, mileage may vary. I go to a small liberal_arts college with a student population of 1,400, with only five fraternities and an average size of high-20s/low-30s. I get the vibe you're at a larger school with a more robust Greek system, so that might not work. Still, when you're doing events, try to be somewhat uniform. If everyone does a philanthropy event in their letters, you'll be remembered\n\nIn addition, use the media. Doing a philanthropic event? Write up a press release and send it out to campus/area media. You never know, it might be a slow news day/week/whatever and you'll get a newspaper reporter or a TV reporter to come and cover. If they don't? Take a picture, write up a blurb, send it to them. Win some awards from your headquarters? Press release. Have some of your members go to a fraternity-sponsored leadership conference? Press release. Anything positive? Press release. After working in both college and professional media, I know the press eats up things like this when they're short on content. It[.] free advertising."}