{"doc_id": "1590", "name": "2012_01_humanities_student_major_887_engineeringstudents", "namespace": "we1sv2.0", "metapath": "", "pub": "EngineeringStudents", "title": "2012-01-humanities-student-major_887_EngineeringStudents.txt", "pub_date": "2012-01-24T00:00:00Z", "Sentiment": "0.103", "Subjectivity": "0.431", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "524", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3kc3au", "Reddit_id": "c3kd6xa", "Subreddit_id": "t5_2sh0b", "Commenter": "grusk", "length": "3028", "content_scrubbed": "Thanks for the response. I'd like to preface my ranty response with the note that I am not your typical engineering major. I love the soft sciences, humanities, philosophy, politics, religion, languages, literature, music, art, etc. I started out as a biomedical engineering major in college, found out that I didn't care for cell biology, organic chemistry, and biochemistry, so I switched over to electrical engineering. Nice thing about it is that I no longer have to wear goggles or get that weird burning smell on me after lab. And I like EE, very broad, versatile, and naturally interdisciplinary. I'm having fun with programming in C and designing stuff in lab. You might say engineering is a bad fit for me because I'm so passionate about liberal_arts. My answer is that I do care about the energy crisis, the environment, and human issues. \n\nMy college is specialized in engineering, and apart from general studies requirements freshman year, we never have to take another English or humanities class. The idea of not having to write another paper sounds nice, but I happen to suck less at English and history and I actually enjoy reading and writing. I had a good time in high school, and finished with a 3. 6 cum GPA. I've been doing okay in college, though I've been distracted and loafting lately. I went to the college that I attend mostly because of scholarships. The trimester system goes fast. We don't get time in my classes to go in-depth and I don't have much time to pursue personal projects. The professors aren't wow-y. The worst teacher I had in high school has been better than almost every professor I've had, which is a bad sign, although I did go to a private rich-white-boy high school. I went to an all-male Roman Catholic high school, and I'm now at an engineering college with 20% girls, though even that is misleading, cause the girls here are all either in nursing, business, or biomedical/biomolecular engineering and they tend to stay inside their respective departments, so you never see them in the wild. There are only like three or four girls in electrical engineering in my class. I wish I majored in engineering at a liberal_arts university so I could have a richer course selection. I looked into transferring out to one of my other choices, but the transfer scholarship was substantially less than the offer I got when I was coming out of high school. Plus, translating credits from a trimester system to a semester-based system is always tricky, and the loss of credits due to not transferring would likely delay my graduation which means an extra year[.] worth of tuition. I'm trying to nurture my own education by reading various books on my own, and also watching free MIT OCW lectures and researching stuff on my own time. I'm considering studying abroad program junior year in Lubeck, Germany, which is scary and exciting to me at the same time, but I think I could grow as a person and will likely never again have an opportunity for an extended immersion into foreign cultures. "}