{"doc_id": "783", "name": "2012_10_humanities_student_major_1218_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2012-10-humanities-student-major_1218_RPI.txt", "pub_date": "2012-10-24T00:00:00Z", "Sentiment": "0.238", "Subjectivity": "0.406", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "359", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_12035j", "Reddit_id": "c6r0ckq", "Subreddit_id": "t5_2rg3u", "Commenter": "jmalc", "length": "2126", "content_scrubbed": "As an RPI Mech E and a huge Cake fan, this seemed pretty awesome. Text below in case the page changes:\n\n\"Question:\n\nDear CAKE,\n\nI am currently a third year undergraduate mechanical engineering student. I enjoy my field of study, but I don't necessarily feel like it[.] my passion. Engineering at times feels like a soulless pursuit. I long to be an artist of some sort, but I don't know what my medium would be. I envy people who can write books or music or create pieces of art that evoke a powerful response within the reader, listener or viewer. Certainly, my talents as an artist are slim at best, but to me, the pinnacle of achievement would be to create something that could leave an impression upon someone the way artists have left impressions upon me. Can you, as professional artists, give me any suggestions for ways to express myself artistically while pursuing a professional career in a totally unrelated field?\n\nThanks,\n\nPaul\n\nAnswer:\n\nDear Paul,\n\nWhen the Pythagoreans invented math in the 6th century B. C., their creativity was way off the charts! To realize, in retrospect, the immense inspiration they must have experienced in order to create something so advanced and important for the advancement of human civilization, is difficult. As a message to the latent genius inside of you, please consider that from ancient times all the way through to the Middle Ages, bursts of mathematical creativity were often followed by centuries of stagnation. Were you were experiencing a lapse of inspiration when you wrote your letter to us? With experience and a hard-won shift of perspective, you will gain ingenuity and creativity that will generously integrate with the technical knowledge you have worked so hard to acquire.\n\nInnovative technologies will continue to leave an impression on people to a much greater degree than a book or piece of music most often does. Keep on top of learning the basics. You will integrate your love of the arts with your mastery of science. Logic will serve your imagination. You will find that the field of mechanical engineering holds a great deal of allure.\n\nGood Luck,\n\nCAKE\""}