{"doc_id": "1566", "name": "2012_01_humanities_student_major_641_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2012-01-humanities-student-major_641_GradSchool.txt", "pub_date": "2012-01-17T00:00:00Z", "Sentiment": "-0.074", "Subjectivity": "0.329", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "395", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_okz2n", "Reddit_id": "c3i4vlx", "Subreddit_id": "t5_2r4r8", "Commenter": "Behavioral", "length": "2517", "content_scrubbed": "I left my high-salary job as a marketing consultant to go back for my PhD, but I'm at a business school with a very generous fellowship ($32,500 + $1,500 in research funds), so it wasn't like going into poverty. I hated the constant traveling being a consultant, and the work I did felt very uninspired. As an undergrad, I was actually heavily involved in research (got a publication, a conference proceeding, and a good number of paper/poster presentations in psychology, economics, and epidemiology), and knew I would eventually go back to get my PhD to be a professor, but I didn't expect to want to leave my job in consulting after less than a year.\n\nThe lifestyle you live depends on what field you go into (business, engineering, and hard_sciences pay better stipends than social_sciences/humanities) and how much money you saved up before matriculating. Luckily for me, I paid off my undergrad loans within a year of starting my job, invested in and bought a house (now have a property manager renting out the house since I'm 2000 miles away), and saved some money so I could have at least some luxuries while in grad school.\n\nPost-doctoral salary also depends on your discipline. Business academics are among the highest-projected in terms of salary since business schools are still booming in the bad economy and new business schools are opening up and outpacing the graduation rates of current PhD students. Because of this, mean starting salaries of new business professors is still well over $100,000 and placement rates (at least in marketing) are still over 90% (so that even someone graduating from an unknown school gets a direct placement into an assistant professorship). Marketing placement data can be found [here for 2011 results](http://docsig. org/WWW2011Final. pdf) and [here for past years' job markets](http://docsig. org/).\n\nSpeaking from psychology (where I probably would have ended up had I not discovered business academia), the placement rates into post-doctoral fellowships is atrocious, and the placement rates from those post-docs to TT professorships is even worse; because of the oversupply of new psychology PhDs, new psychology professors make between $30k-$70k/year -- a far cry from the average $95k-$205k/year in marketing.\n\nOther disciplines are varied. Hard sciences are also having trouble getting academic placements, but many find positions in industry pretty easily. Same with engineering. Humanities/social_sciences (besides Econ) are having trouble finding jobs--period."}