{"doc_id": "666", "name": "2012_02_humanities_student_major_727_harrypotter", "namespace": "we1sv2.0", "metapath": "", "pub": "harrypotter", "title": "2012-02-humanities-student-major_727_harrypotter.txt", "pub_date": "2012-02-21T00:00:00Z", "Sentiment": "0.088", "Subjectivity": "0.378", "Score": "18", "Upvotes": "18", "Downvotes": "0", "Wordcount": "345", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pzyr5", "Reddit_id": "c3tmohr", "Subreddit_id": "t5_2qiqi", "Commenter": "doxy_", "length": "1966", "content_scrubbed": "Wizards don't need to know complex maths skills for application in everyday life as magic defies the laws of physics and gravity - buildings that would normally collapse due to bad design are able to stand for this very reason. Take The Burrow for example, Harry makes a comment in CoS that it is [.]everal stories high and so crooked it looked as though it was held up with magic.' Architecture was not a factor in this case. Humans need to use equations and different techniques to produce things such as water, all it takes is a wave of the wand for Wizards. They are able to make objects Vanish, fly, move, change shape and all sorts of things - humans need complicated systems to achieve this or may not be able to - so I believe a detailed knowledge of maths is not needed.\n\nI imagine that basic maths skills are taught to children by their parents (Muggleborns would attend school and learn it this way - perhaps in Half-Blood families a Muggle parent might want them to attend school leading up to their Hogwarts education) as Wizards are capable of managing their money system (17 Sickles to a Galleon and 29 Knuts to a Sickle). They also know about measurements and weighing due to classes like Potions. Like GamblingDementor said, Arithmany also uses maths, however I get the impression that it is a class that your smarter student would take - Harry and Ron seem to be a good representation of your average student and they don't take it.\n\nI'd say that science is covered at Hogwarts albeit differently to the Muggle world - Herbology and Care of Magical Creatures (Biology), Potions (Chemistry) as well as Astronomy.   \n\nEssays are used for assessments and coursework in nearly every subject so students must also be taught English skills by their parents as well. I'd imagine History of Magic would cover Humanities - they'd need to research the views of different historians etc. just like we do at school. Perhaps they compare texts in Muggle Studies."}