{"doc_id": "748", "name": "2012_10_humanities_student_major_790_bartenders", "namespace": "we1sv2.0", "metapath": "", "pub": "bartenders", "title": "2012-10-humanities-student-major_790_bartenders.txt", "pub_date": "2012-10-17T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.39", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "1333", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11lj97", "Reddit_id": "c6o259f", "Subreddit_id": "t5_2smw0", "Commenter": "real_nice_guy", "length": "7191", "content_scrubbed": "Okay, time for some tough love. \n\nI got a bartending job without prior bar experience because the person liked me (or so they said) and thought I had the_right personality to be a bartender. The *best* way is to work into it, from being a bus boy, server, bar back, bartender etc so you learn every part of the job. When I applied for the very starter jobs (bus boy, host, bar back,) no one would actually hire me because they thought it weird for me to apply for these jobs (their words, not mine, I was 20 at the time) so they insisted on starting me out as a server, and that was all good and fine. I got tired of serving though, I didn't much like it, and I felt my passion for bartending was much stronger. I served for maybe a month or two, then I decided to move on. People will tell you all day you have to start from the bottom, to those people, I say \"that[.] great if you're 17 or 18, but if you're 20 or 21, there isn't a lot of time for that,\" so skip it if you can or want. But here are some things you should keep in mind in doing so:\n\n1) If you get a bartending job without having to go through the pile of shit that is bar backing, serving, hosting, or bus boying, you must not, and I emphasis *must not* be an asshole about it. You can not start being a premadona just because you pulled off this maneuver. Be modest, don't gloat, it isn't nice. \n\n2) Learn your drinks back to front, upside down and every other way. There[.] no excuse for you to not know how to make a good Sidecar, or a Long_Island Ice Tea, Tom Collins or any other popular drink. \n\nThat isn't to say you should know *every* drink, that is impossible. \n\nAnd if someone says \"ugh, that isn't how you make that,\" that[.] fine, there are many ways to make every drink. Take the martini for instance, vodka or gin? Okay, let[.] go with vodka. Dry vermouth in there or not? Let[.] go with yes, just a splash then throw it out, or leave half an ounce in there? Okay, leave it in the mix. Shake or stir it? With vodka, I like to shake it with my dry vermouth to form some ice crystals on top of the drink as I strain it into a cocktail glass. Some will get angry with me and say \"no, it[.] gin, and only gin, no vermouth. Pour the gin into a glass with ice, stir it, and pour.\" Well, to each his own, you'll find your own way to make these drinks, as long as they're within the general recipe. \n\n3) Be personable and friendly. Know something about everything. On my iPad, I have an ap that takes news from technology, politics, the arts and fashion, business, sports, I know what[.] going on that day in the world. If someone comes in and starts talking about something, I'll likely know what they're talking about. \n\n4) Know something about some of the drinks you make. Things like the long island ice tea are interesting because it came out of the prohibition era where alcohol was illegal, but people still made alcohol, but in order to get away with drinking it, they mixed it with tea to mask the smell. Hence the Tea part in the name. Now it[.] gin, tequila, vodka, rum, triple sec, lime juice and a splash of coke on top, but that[.] just the modern version, the original was made with just tea and whatever alcohol they could get their hands on. The Bloody Mary you say? Well, that is posited to have come out of Paris during the time Hemingway was there, his wife wouldn't allow him to drink, so he switched over to vodka as you can't smell it on a person[.] breath, so the bartender mixed it with some tomato juice, bam, Bloody Mary, and it allowed Hemingway to stay drinking and write his awesome pros. Maybe I embellished that last part, but the rest of that is one theory for the drink. Be *interesting* to your customer.\n\n5) Listen to your customer. Some of them will like to talk to you, just listen. You're their listening therapist tonight. I use that word, therapist, loosely, you're obviously not licensed, but just be nice to people, everyone is fighting some kind of battle. \n\nMany people do this, I was a liberal_arts major, recent graduate from college, and my knowledge of alcohol was just a little better than the average person (liberal_arts people drink a lot.)\n\nMy problem is that the city i live in has very vew new opportunities for someone with my skills set.\n\nI'm about to drop some knowledge on you - what you just did there was defeat yourself before you even began to look for a bartending job, and I don't want a bartender like that. \"Oh, I was only a system administrator.\" holy shit, do you know how great that is? You make decent money, and you can talk about technology!  Here[.] what you do: Play your strengths:\n\nIf you are good at that job, you likely have an eye for detail right? That[.] an essential skill for being a bartender.\n\nWithin your job, you'd say you have to be a quick learner to roll with the new types of technology being released right? Well, you have to be a quick learner when it comes to learning new drinks, sure there[.] a rum and coke, but I want a god damn Cuba Libre, so put a lime on that bitch, bam , Cuba Libre. But will you learn that? Will you remember it? You sure will, because you were a system admin for 10 years and you do that every day.\n\nBeing a system admin means having to communicate with other people in various departments concisely, this is key if you're a bartender. You have to be able to talk to management, servers, and your bar back, tell them things nicely, but quickly, without screwing up. Need more limes? Ask. Hey manager, we need to cut this guy off, he[.] drunk and we need to get him a taxi. Excellent, you got 3 skills already that are good for being a bartender. \n\nI don't even know what a system admis *is* but I just bullshitted you into using it to get yourself a job. I've seen people who are chemical engineers, lawyers etc get jobs as bartenders for these reasons\n\nDo you make drinks for yourself and others at home using your home bar? Hell yes you do. A little White Russian with vodka, Kahlua and half and half here, an Old Fashioned with the sugar cube, splash of water, bitters, orange zest and bourbon over ice there. Hell, it may not be as busy as a normal bar, but you've got *some* experience.\n\nLearn the beers in your area. learn wine basics, red vs white etc.\n\nHere are the basic drinks you need to know like the back of your hand walking into a job. You can learn them on the job, but it[.] better to just know them.:\n\nMartini (Vodka, Gin, and sometimes dirty) \n\nCosmo \n\nGimlet (Vodka or Gin) \n\nMoscow Mule\n\n Cape Codder\n\n Grey Hound\n\n Bay Breeze\n\n Bloody Mary\n\n White Russian\n\n Espresso Martini\n\nKamikaze \n\nVespers\n\n Aviation\n\n Gibson\n\nTom Collins \n\nSouthside\n\n Negroni \n\nFrench 75 \n\nSingapore sling \n\nMargarita \n\nTommy[.] Margarita \n\nMojito\n\n Daiquiri \n\nHemmingway Daiquiri\n\n Dark and Stormy \n\nCuba Libre \n\nQueens Park Swizzle \n\nOld Fashioned (Bourbon, Rum or whatever else you like)\n\n Gold Rush \n\nWhiskey Sour\n\n Mint Julep\n\n Manhattan \nPerfect Manhattan\nRob Roy \n\nSazarac\n\n Irish Coffee \n\nSidecar\n\nHot Toddy\n\nKir Royale\n\n Americano \n\nPims Cup \n\nPisco Sour \n\nCaiprihina \n\nAperol Spritz \n\nMimosa\n\n Belini\n\nOkay, that[.] it for the night, if you have any questions, just reply below and I'll get back to you. "}