{"doc_id": "766", "name": "2012_10_humanities_student_major_990_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2012-10-humanities-student-major_990_funny.txt", "pub_date": "2012-10-21T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.519", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "266", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6psdvn", "Reddit_id": "c6psmds", "Subreddit_id": "t5_2qh33", "Commenter": "Swallows", "length": "1548", "content_scrubbed": "You're really over-simplifying this. Did anyone make the tough decision to support their family? What about the liberal_arts major who decided to pursue his passion and give up his chance at a family or a high paying job to do what he wanted? Why are you making the judgement call here, and saying their decision was easy or ill-thought?\nLiberal art colleges also tend to do just as well at establishing successful students who transition into work. \nWe need to stop treating this as a battle between engineers v. everyone else. Just acknowledge this is about passion and rigor more than anything else. Engineers chose to have that passion and rigor in the class setting; we all know your courses are tough and its not easy to make it through school. But respect that others choose not to do this. There are people who major in sociology, classics, and art that do make a difference in this world; they work just as hard as any engineering student does and they succeed. It[.] the sociology graduate who didn't apply themselves or coasted through class that has a hard time making it. And unfortunately the rigor wasn't there for them in class the same way it exists in engineering, where it[.] entrenched.\nHumanities let you apply yourself on your own terms in a way engineering doesn't if you don't then that[.] your decision. The professor doesn't have an obligation to make you successful. Respect them, they respect you. The superiority complex everyone gets from a receipt that they finished school is a little silly.\n-Neuroscience and Art major"}