{"doc_id": "782", "name": "2012_10_humanities_student_major_1188_violinist", "namespace": "we1sv2.0", "metapath": "", "pub": "violinist", "title": "2012-10-humanities-student-major_1188_violinist.txt", "pub_date": "2012-10-23T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.438", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "414", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11ylru", "Reddit_id": "c6qp3g0", "Subreddit_id": "t5_2sbn3", "Commenter": "grandplans", "length": "2373", "content_scrubbed": "Oh shit, I thought this was /r/Classical, sorry for the wordy post.  I'm only a beginner violinist.\n\nManhattan School of Music graduate.  \n\nMy experience may be slightly different because I'm a vocalist who entered the school at 17.\n\nAs a very young male singer, you're up against some pretty tough odds.  I was never able to perform in a mainstage opera while I was there because there were 30+ year old grad students filling those roles. \n\nThat said, I found a home performing for the composers.  I got on the mainstage a few times, and TONS of other small performances.  Still, it[.] rough to essentially not be able to compete in what is a very competitive environment.   I imagine instrumentalists had to deal with that to some extent as well, but one thing my instrumentalist friends never seemed to understand is there are actual physical differences between a 30 year old voice and a 17 year old voice... LOTS of differences.\n\nI loved my classes for the most part, but I also would have liked it if MSM had had a program where I could take a class or 2 at another school.  Something in the sciences or world history.  \n\nI came in at the beginning of their unified curriculum, and it was fucking awesome.  We were learning medieval and renaissance history, reading the poetry and other writings from the time period, studying the paintings and the politics all while also studying the music and the theory... that continued up through the 20th century which concluded the 2 year unified curriculum.  Then you were free to take the other classes.  \n\nDr. Peter Noon taught some REALLY cool shit, he had a class just on the year 1924, a class just on Venice, and maybe one on Paris as well.  There was a teacher there Named Eisenbach who taught a class on the 1960[.] and counter culture and the music that went along with it.  \n\nThe thing that sucked is that they required a certain amount of \"humanities\", but they refused to build out their humanities curriculum, so it sucked.  You could take certain classes at Barnard, but it was limited, a pain in the ass, and I heard from friends that sometimes they would even end up not honoring the credits.\n\nThe last year was intense.  Learned MASSIVE amounts of vocal lit across multiple languages, readied a couple of recitals along with helping friends out with their recitals.  Also working a full time job... it was nuts.  "}