{"doc_id": "678", "name": "2012_02_humanities_student_major_903_gastate", "namespace": "we1sv2.0", "metapath": "", "pub": "GaState", "title": "2012-02-humanities-student-major_903_GaState.txt", "pub_date": "2012-02-26T00:00:00Z", "Sentiment": "0.148", "Subjectivity": "0.555", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "415", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_q7n3c", "Reddit_id": "c3veeke", "Subreddit_id": "t5_2s6ds", "Commenter": "MangerDesCravates", "length": "2295", "content_scrubbed": "I actually just talked with a friend about this same topic. For me, State is awesome because it[.] right in the middle of downtown Atl. With that being said, there will always be SOMETHING going on, be it good or bad. A large variety of venues and restaurants are nearby, but they can all get pretty pricey. Fortunately, it doesn't take too long to figure out where the good places are that are still affordable. The music and film scene is very strong, so if you're into that there you go. The professors overall are pretty cool, though of course there are some that should be avoided if at all possible. The library is probably the best I've ever seen, and that may be one reason that it is almost always filled to compacity as far as computers go. The bureaucracy of GSU is especially terrible, but I've heard horror stories about almost every school in GA having that problem. Alot of people go to GSU, so that means lots of opportunities for new friends! There is no shortage of parties, given you know the_right sorts of people of course. If that doesn't suit you, the intellectual crowd is very prominent as the school is quite well-respected for its liberal_arts studies and they are always ready to welcome new people who share their respective interests (and the party crowd and intellectual crowd can very easily go hand-in-hand, believe me!). The city is just a cool place to be since there[.] so much to see and do. But city-life isn't for everyone, and the homeless people are quite abundant and will definitely approach you to ask for money. If you don't stand around where they usually are and walk like you have a purpose, that[.] usually all that[.] needed to deter them. Also, probably a no-brainer, but walking by yourself at night on the streets is not the smartest thing to do, so if you can avoid that you should do so. \n\nOverall, GSU is pretty great and I'm glad I came here. Like I said, the city is pretty cool and there are plenty of things to do. The school is extremely well-respected in some of its fields, and compared to other high-level institutions, its tuition is not that high (but the student fees are getting ridiculously up there). As long as the negative aspects can be mostly avoided or at least tolerated, you should be fine should you decide to transfer :)"}