{"doc_id": "1617", "name": "2012_01_humanities_student_major_1219_atheism", "namespace": "we1sv2.0", "metapath": "", "pub": "atheism", "title": "2012-01-humanities-student-major_1219_atheism.txt", "pub_date": "2012-01-31T00:00:00Z", "Sentiment": "0.161", "Subjectivity": "0.492", "Score": "108", "Upvotes": "108", "Downvotes": "0", "Wordcount": "475", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p4hgx", "Reddit_id": "c3mfpzv", "Subreddit_id": "t5_2qh2p", "Commenter": "wonderfuldog", "length": "3657", "content_scrubbed": "\"keirbear\" wrote:\n\nI'm an honors engineering student\n\n[reposting]  [fourth time today]  [okay this is starting to get creepy] \n\n\nIt[.] very interesting that there seems to be a substantial overlap between \n\n\"Being an engineer\" and \"Accepting hardcore religious explanations.\"\n\nOriginal study is a pdf - http://www. nuff. ox. ac. uk/users/gambetta/Engineers%20of%20Jihad. pdf -\n\n**engineers turn out to be by far the most religious group of all academics**\n\n\\- http://marginalrevolution. com/marginalrevolution/2007/11/why-are-so-many. html -  \n\nThe study attributes this to\n\nthe 'engineering mindset,' which they define as 'a mindset that inclines them to take more extreme conservative and religious positions.' \n\n\\- http://it. slashdot. org/story/08/01/29/1614206/engineers-have-a-terrorist-mindset -\n\n**This phenomenon is so prevalent that users of talk. origins have come up with the Salem Hypothesis, which predicts that any creationist claiming scientific expertise or advanced degrees is likely to be an engineer.[1] This does not mean that engineers are likely to be creationists, of course.**\n\n\\- **http://rationalwiki. org/wiki/Engineers_and_woo** - \n\nMore discussion - http://www. nytimes. com/2010/09/12/magazine/12FOB-IdeaLab-t. html - \n\n\\-------\n\nThe sociology paper ... uses illustrative statistics and qualitative data to conclude that there is a strong relationship between an engineering background and involvement in a variety of Islamic terrorist groups. \n\nThe authors have found that graduates in subjects such as science, engineering, and medicine are strongly overrepresented among Islamist movements in the Muslim world. The authors also note that engineers, alone, are strongly over-represented among graduates who gravitate to violent groups. \n\nHowever, contrary to popular speculation, it[.] not technical skills that make engineers attractive recruits to radical groups. Rather, the authors pose the hypothesis that \"engineers have a 'mindset' that makes them a particularly good match for Islamism,\" which becomes explosive when fused by the repression and vigorous radicalization triggered by the social conditions they endured in Islamic countries. \n\nBut what is the engineer[.] mindset? \n\nThe authors call it a mindset that inclines them to take more extreme conservative and religious positions. \n\nA past survey in the U_S has already shown that the proportion of engineers who declare themselves to be on the_right of the political spectrum is greater than any other disciplinary groups--such as economists, doctors, scientists, and those in the humanities and social_sciences. \n\nThe authors note that the mindset is universal. \n\nWhether American, Canadian or Islamic, they pointed out that a disproportionate share of engineers seem to have a mindset that makes them open to the quintessential right-wing features of \"monism\" (why argue where there is one best solution) and by \"simplism\" (if only people were rational, remedies would be simple).\n\n\\- http://www. eetimes. com/showArticle. jhtml;jsessionid=AZVY01NKDPUFWQSNDLPCKHSCJUNN2JVN?articleID=205920319 - \n\na new Oxford study tries to explain why so many violent Islamic radicals are ... engineers. The authors gathered data on 404 militants from 31 countries, and among the 178 whose principal academic focus could be determined, engineering was by far the most popular subject. \n\n\\- http://www. theatlantic. com/magazine/archive/2008/01/primary-sources/6559/2/ -\n\n\\- The original paper in pdf - http://www. nuff. ox. ac. uk/users/gambetta/Engineers%20of%20Jihad. pdf -  \n\n\\- More Googlehits - http://www. google. co. uk/search?q=%22Engineers+of+Jihad%22 - \n\nMake of this what you will.\n"}