{"doc_id": "1601", "name": "2012_01_humanities_student_major_1054_atheism", "namespace": "we1sv2.0", "metapath": "", "pub": "atheism", "title": "2012-01-humanities-student-major_1054_atheism.txt", "pub_date": "2012-01-27T00:00:00Z", "Sentiment": "0.048", "Subjectivity": "0.341", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "350", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3ld2li", "Reddit_id": "c3ldb7s", "Subreddit_id": "t5_2qh2p", "Commenter": "luiginut", "length": "2076", "content_scrubbed": "I was really enjoying your quality post, until this:\n\n And no, vocational training would be largely prepping someone for a job market which is fading fast, the modern world has a lot of knowledge to impart to children before they can really survive in this changing world and current educational purposes are heavily slowed and ruined by various cultural beliefs about someone \"not getting math\" and another person \"not really being a writer\" and yet another person \"not being good at memorizing 'boring' things.\" Until society stops accepting excuses...\n\nThis is untrue and reeks of coming from a bigoted white, upper-middle class, straight-A student.\n\n\"I don't get math\" is not an \"excuse\". Just because *you* are good at math do does not mean everyone has to conform to your standards. Sure, everyone should get through at least basic algebra, for calculating finances and such, but that[.] taught in middle school or early high school, so almost everyone *does* get that far. I was really good at algebra, geometry, and trig, but when I got to calculus I hit a wall (mostly because I need to visualize things in my head and calc is too damn abstract). I'm currently studying Air Traffic Control, and I find your implication that I need calc (which is low-level college math) laughably moronic.\n\nThis applies to the other \"excuses\" as well. The entire fucking purpose of majors is to do something you're good at, not to be forced to learn a bunch of shit you don't need and are not particularly wired for.\n\nAs for vocational school, you simply missed the fact that \"vocational\" subjects will evolve into the computer age; and those jobs you mentioned that are replacing traditional blue-collar work don't need much college education.\n\nI'm a staunch supporter of the Gen Ed / Essential Studies programs at liberal_arts colleges, so don't misunderstand me. I want people to be well-rounded. But your insistence on forcing everyone to do even more rigorous coursework that *does not in any way benefit them* (as Gen Eds do) is absurd.\n\nEDIT: minor grammar fix for clarification"}