{"doc_id": "1565", "name": "2012_01_humanities_student_major_621_filmmaking", "namespace": "we1sv2.0", "metapath": "", "pub": "filmmaking", "title": "2012-01-humanities-student-major_621_filmmaking.txt", "pub_date": "2012-01-17T00:00:00Z", "Sentiment": "0.076", "Subjectivity": "0.351", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "590", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ok7zq", "Reddit_id": "c3i0ptv", "Subreddit_id": "t5_2qrk2", "Commenter": "RinglingDiFilmGrad", "length": "3350", "content_scrubbed": "It depends on the film school, but it seems like the dominant approach among the better film schools is to get you exposure to everything and then let you move into specialization as you approach senior year.\n\nI personally went to Ringling College of Art + Design and was part of the first graduating class (of which we were rated one of the top film programs in the country). Basically, we spent our first year taking what the school calls the CORE classes (general art classes that teach you 2D design, 3D design, drawing, color and conceptualization), liberal_arts (a pretty damn vast range of courses that could range from Literature of Sci-fi, Fantasy and Horror to Islam to Math for 3D Design), our first film classes (which focus on film basics, probably pretty similar to what most programs do) and, as it stands now, you are also required to work on upperclassmen projects (what[.] nice is they were only required to assist on a few projects, but there[.] no limit to how many or what year you want to work on). As you go through the next few years you'll take classes on all the major positions along the filmmaking process.\n\nRingling itself functions on an all digital workflow (hence why it[.] called the Digital Film Program). The underclassmen use Sony and Canons (though they've probably upgraded by this point) and the upperclassmen use the RED One and EPIC. Basically, the department heads saw that film was on its way out and low and behold how right they were.\n\nThe production facilities and equipment have pretty much everything you need (and beyond, compared to pretty much any other program I've seen except for the big ones like Tisch, USC, UCLA, etc.)\n\nPlus, our Film Labs had us working first-hand with filmmakers like Werner Herzog. So that[.] the little edge that Ringling has cultivated along with a class on the business of film that is unlike anything else offered in the industry.\n\nThat being said, I'm not a whore for film school or my Alma Mater. You don't need film school to become a filmmaker or a storyteller. It helps though if you don't come from a place where you'll naturally have connections. If you don't want to go to school in Florida (or pay the amount of Ringling asks for, it[.] brutal, but worth it IMHO) then you can't go wrong with LA (New_York if you have to, but you should know you're going for what is arguably the most competitive TV market in the world). Going to school or just working in LA is the fastest way to find out whether you can actually make it in film/television, which is really what you need to find out fast.\n\nThe business (everyone makes fun of people who call it that and then one fucking day it[.] just rolling off your tongue) is about hard, sometimes brutal, work. However, it[.] one of the few industries where socialization is built in and the camaraderie that film and television offers is like no other. If you love drama, film and television are for you. If you find it contemptible, you're probably in the wrong business. Everyone[.] an artist and everyone[.] a businessperson. It[.] a living contradiction that simultaneously sucks and is awesome (and not in the overused burnout \"awesome dude\" kind of way, certain productions will literally inspire 'awe' when they go right).\n\nBut overall, if you decide to stick with it, it is the greatest goddamn business on this planet."}