{"doc_id": "1518", "name": "2012_01_humanities_student_major_143_atheism", "namespace": "we1sv2.0", "metapath": "", "pub": "atheism", "title": "2012-01-humanities-student-major_143_atheism.txt", "pub_date": "2012-01-05T00:00:00Z", "Sentiment": "0.092", "Subjectivity": "0.324", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "293", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3e4csu", "Reddit_id": "c3e4ye4", "Subreddit_id": "t5_2qh2p", "Commenter": "autopsi", "length": "1894", "content_scrubbed": "I whole-hearty agree, *interpreting* any kind of literature is a practice of the humanities, not the sciences. I took LIT 3374 Bible as Literature and found it to be an [amazing class](http://www. dl. usf. edu/Courses/syllabus/lit3374. htm)! \n\nis the Bible the one thing where personal interpretation (or even common sense) is not allowed? \n\nThis is where our paths separate. If the bible was used to direct the personal lives of Christians, personal interpretation and/or even common sense, cafeteria Christianity, etc would be perfectly acceptable practices.\n\nInstead, we are met with attempts to insert biblical accounts into our education system (earth, the universe, and everything = 6k years old,) biblical laws and commandments into our legal system (gays marry, lol no,) and presidential candidates that were instructed by the judeo-chrsitiain-muslim deity to run for office. ಠ\\_ಠ\n\nIf a scientific claims and realistic authenticity are made on the bible it must be held to said standard. If the bible says X it has to mean X; otherwise, nothing it says can be taken serious. Talking snakes, men living in whales, and water to wine either means what they say or they don't. \n\nOne cannot just dismiss, some obviously ridiculous part of the bible then, in the same breath, claim another passage be exactly literal only. If the \"talking snake\" is a dick, lying with mankind, as with womankind is a business relationships.\n\nTake [Luke 4](http://www. biblegateway. com/passage/?search=Luke+4&version=NIV) Jesus, himself, supports the literal use of the bible.\n\nMoreover, when we, humans, become the arbiters of what parts of the bible are literal and which aren't we elevate ourselves above the author (and god). A person could say Satan transformed into a legged snake and told the only female to eat fruit and another could say \"the snake was Adam[.] dick.\" Who is correct?"}