{"doc_id": "1514", "name": "2012_01_humanities_student_major_107_physics", "namespace": "we1sv2.0", "metapath": "", "pub": "Physics", "title": "2012-01-humanities-student-major_107_Physics.txt", "pub_date": "2012-01-04T00:00:00Z", "Sentiment": "0.147", "Subjectivity": "0.387", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "420", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3dpmvp", "Reddit_id": "c3dsdjd", "Subreddit_id": "t5_2qhi6", "Commenter": "808140", "length": "2432", "content_scrubbed": "The academic STEM fields (Physics, Chemistry, Biology, Math, etc) typically aren't much more attractive to employers than a lot of the liberal_arts majors, at least with an undergraduate degree and no work experience. The stereotype is that if you majored in one of these you're smarter than say, a business major -- but the business major is more likely to have learned things in college that will actually help him or her in an entry level position than you did. To make matters worse, a smart employee can actually be a bit of a liability at this level, since much of what you're likely to do is grunt work and intelligent people typically burn out fast on that. So it[.] kind of a wash.\n\nThis frustrating state of affairs gets better with time. Once you have a few years of work experience under your belt, anything that the business major may have learned in school you've learned on the job, and because (unlike in entry level positions) jobs at this stage in your life typically involve some thought and problem solving, employers are attracted to your \"smart\" degree.\n\nThe vocational STEM fields (Engineering, applied CS) require, strictly speaking, much less brainpower than the academic fields, but they also learn concretely useful skills while in university. That makes them employable right out of the box, but the flip-side is that in their early 20s they're already specialized -- if you did ME and after a few years realize that it[.] not for you, you'll have much less flexibility. Overall it[.] still not terrible, since engineers are also seen as smart. But I know a lot of HR folks feel like someone with a specific engineering degree is less flexible.\n\nBasically, if you see university as a way to surround yourself with smart people and do interesting problems and think about interesting things, then degrees in Physics, Math, Philosophy etc are a great choice. If you see university as a very expensive vocational training program and are mostly concerned about how much money you'll make immediately after graduating (as opposed to 20 years down the road), major in Business, Finance, Economics, Engineering, or applied Java.\n\nYou can probably tell from my tone which choice I made. I'm in my mid-30s and I'm making a good living now with an advanced degree in Math, but in my 20s I wasn't rolling in dough the way my EE-major friends were. Their salaries topped off early, though. So like I said, it[.] a wash."}