{"doc_id": "670", "name": "2012_02_humanities_student_major_825_montreal", "namespace": "we1sv2.0", "metapath": "", "pub": "montreal", "title": "2012-02-humanities-student-major_825_montreal.txt", "pub_date": "2012-02-24T00:00:00Z", "Sentiment": "0.093", "Subjectivity": "0.271", "Score": "37", "Upvotes": "37", "Downvotes": "0", "Wordcount": "307", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_q43cv", "Reddit_id": "c3ulu8o", "Subreddit_id": "t5_2qnmr", "Commenter": "NWmba", "length": "1794", "content_scrubbed": "I'm a business student and I also sit on one of the student organizations involved. A strange position indeed given that many business students would be willing to pay more for schooling if it led to better facilities.  But then, Business is a more directly market-applicable degree than, say, humanities or pure math. Also, getting students to pay more just restructures the education funding slightly and doesn't lead to better facilities or professors.\n\nThe argument that I found the most compelling for the freezing of tuitions is that education should be a public service meant for the betterment of society as a whole, not a consumer service that students should bear increasing burdens for.  Given that a bachelor[.] degree carries the same weight as a high school degree used to, it should be heavily publicly funded and as accessible as possible.\n\nIn principle, however I don't think education should be completely free like it is in parts of europe. We value what we pay for, and fronting even a token amount gives students a stake in their education. Compare the seriousness of kids in CEGEP vs. High School.\n\nI personally think that student strikes are a symptom of a deeper problem that[.] hard to put into words. By and large the education system is not meeting the needs of students or the larger society that supports them. The issue at hand is education reform, and the whole system from elementary to post-doc is so established and in-grown that it[.] difficult to do. But what needs to be asked is \"what are the goals of the system? What should they be? What are the needs of students and society? How can we structure the system to meet those needs?\"\n\nFrom the mob[.] perspective, they will speak to where it hurts - rising fees, lower prospective opportunities. Hence strikes.\n"}