{"doc_id": "1596", "name": "2012_01_humanities_student_major_999_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2012-01-humanities-student-major_999_funny.txt", "pub_date": "2012-01-27T00:00:00Z", "Sentiment": "0.123", "Subjectivity": "0.56", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "278", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3l2x5t", "Reddit_id": "c3l5d0p", "Subreddit_id": "t5_2qh33", "Commenter": "headwithawindow", "length": "1704", "content_scrubbed": "Posted this to a different reply but thought I'd shift it to you.\n\nYou may not like the athletics of FSU but have no doubt that a school of that size produces some exceptional programs.  The Florida State University has one of the most comprehensive and spectacular Arts and Sciences (especially Arts) programs in the country. Doubt? Look into their film, music (jazz, classical, and therapy), writing, and especially any of their graduate programs in the Arts. Extremely selective, and offer a higher rate of post-graduation employment than almost any other school in the country. Don't forget about the National High Magnetic Field Laboratory, the physics dept in general, and the most published suicide research program in the country (the Psych Dept in general is pretty phenomenal).  They have the country[.] #1 Criminology Program (oh how I hate the irony but that[.] an academic award, not one related to the school[.] crime rate). Oh, then there[.] the nation[.] top Golf Management Program (don't think that[.] special? think again, it[.] a multibillion dollar industry), and a Hospitality Management program that leads the country (again, not impressed? tell that to Disney, Marriot, Hilton, and the other multibillion dollar companies that fawn over FSU HM graduates post graduation). FSU is polluted with fluff majors and douchebags for sure, but they support some of the most productive and specialized programs the country has to offer. Any school that has 40K+ students has the intellectual resources to produce spectacular programs, and though you may not be a fan of their athletics (which are awesome), you will be glad when you take yourself or your family to any place run by an FSU alumnus."}