{"doc_id": "1512", "name": "2012_01_humanities_student_major_74_debateanatheist", "namespace": "we1sv2.0", "metapath": "", "pub": "DebateAnAtheist", "title": "2012-01-humanities-student-major_74_DebateAnAtheist.txt", "pub_date": "2012-01-02T00:00:00Z", "Sentiment": "0.052", "Subjectivity": "0.42", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "384", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_o01gf", "Reddit_id": "c3dgmpw", "Subreddit_id": "t5_2ryfy", "Commenter": "JonoLith", "length": "2133", "content_scrubbed": "Here is my defense of the Bible. \n\n It is, at the very least, the most important cultural document of our society. Even as we begin to reread it and go through it and see the distortions that have happened to it, we need to remember that this story began a revolution of love in the Roman Empire. Regardless of whether Jesus was a real person or not, the Philosophy of Christianity represented an extremely major shift in how people treated one another, and how people perceived one another. \n\n Infusing stories with magic is not uncommon, especially in the day of Jesus. People did it all the time, and people still do it. Take the natural and make it supernatural. It makes it important and elevates it to a status above the normal lives of humans. These people had no understanding of the \"Mind\" and had no understanding of Freud or anything. This is how they understood that the people we're talking about are a big deal. \n\n The Bible existed in a time of extreme brutality and thoughtlessness. It was standard practice for people to be Crucified. Roman Soldiers would go into villages and have the strongest men crucified as a greeting. It was legal for a man to rape a woman if he had the coin for it. Children were used as sex slaves, and men would have their genitals removed to be put into slavery. It was a time of extreme horror and repression that still stands as a symbol of humanities ability to create a perfect hell. \n\n And out of that Hell came Christianity. It condemned the violence and horrific regime of the Romans. In a scant three hundred years, a blink of an eye in ancient terms, the practice of Crucifixion was Abolished, and slavery was no longer permitted. It became illegal for a man to own a person because of the Philosophy and Story of Christianity. \n\n It[.] a massively important document. One that needs to be read by everyone as a treatise on why Violence, Oppression, and Torture are wrong. We take that for granted, and yet we bomb the world. \n\n We are the Romans. Read that Bible and tell me it isn't relevant today. Read the words of the Bible and tell me that it[.] wisdom isn't relevant today. "}