{"doc_id": "1525", "name": "2012_01_humanities_student_major_266_trueaskreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueAskReddit", "title": "2012-01-humanities-student-major_266_TrueAskReddit.txt", "pub_date": "2012-01-07T00:00:00Z", "Sentiment": "0.073", "Subjectivity": "0.345", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "421", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_o63xx", "Reddit_id": "c3ex5yq", "Subreddit_id": "t5_2s91q", "Commenter": "Uncle_Erik", "length": "2384", "content_scrubbed": "First, knock off the Tragic Hero routine.  You are isolated and haven't been exposed to a wide slice of humanity.  When you do, you're going to find a whole lot of people with crosses to bear.  I do and so do thousands of people I've met.  I'm not special, the people I know aren't special, and you are not special.\n\nMy approach is to STFU and get on with it.  I don't make excuses and I don't talk about it.  The majority of people I know who have problems find alternatives and get on with life.  There are some who spend an awful lot of time looking at their navels, but they don't amount to much.\n\nHow many popular books are there about people who have a setback and spend their life in self-examination?  No one reads that.  It[.] a dead end.  As for huge, game-changing new approaches to education, well, there are tens of thousands of those.  I'd bet a few hundred others have said the same things.  And look where that got them.\n\nAs for higher ed, do it online if that[.] what you want.  There are lots of programs.  There[.] nothing wrong with tightly-focused education.  That[.] the reason you go to school.  If you want to get into the humanities and other stuff, do it on your own.  It[.] not like it[.] illegal to read Aristotle while enrolled in an engineering program.  Do what you want.\n\nSince you're unable or unwilling to work with others, pursue a solitary path.  No, not writing books about yourself.  That will get you nowhere and more self-examination after that will keep you in nowhere.\n\nI think you're bright and have an obsessive focus on detail.  You'd do well in a workshop building specialty items.  Maybe furniture or machine work, or any number of things.  Good craftsmen have waiting lists for their products and do quite well.  It'd let you live anywhere and not have direct contact with others.\n\nIf you want to do something that outlives you, then maybe build excellent furniture.  The good stuff is kept for centuries and people truly enjoy it.  Unlike writing about yourself and navel-gazing.  You can turn out thousands of pages of manuscripts.  Most likely, they will never be published and put into the recycling when you die.  That would be a wasted life.  Turn out a nice dinner table and it'll probably still be around 300 years on.\n\nDon't waste your life.  Rumination only leads to misery.  Instead, develop your skills and make valuable things.  "}