{"doc_id": "756", "name": "2012_10_humanities_student_major_855_mensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "MensRights", "title": "2012-10-humanities-student-major_855_MensRights.txt", "pub_date": "2012-10-18T00:00:00Z", "Sentiment": "0.098", "Subjectivity": "0.336", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "638", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11ovo9", "Reddit_id": "c6ojdrb", "Subreddit_id": "t5_2qhk3", "Commenter": "[deleted]", "length": "4038", "content_scrubbed": "I'm going to have to disagree with this, at least insofar as my experiences with these departments go.  \n\nAt the university I go to, the Gender Studies department has always been fairly open to discussion and evidence-based. The head of the department is a man, there are a number of male majors and minors, and the discussion of masculinity is always encouraged (there are multiple discussion groups for masculinity, mostly run by men, and I've always found a warm reception in feminist reading groups and discussions on-campus). When I took my required gender studies elective (this is a liberal_arts school; to fulfill the requirement, many departments do a gendered look at their focus, so for me it was a gendered look at agriculture and ecology). Several of my friends are minors or majors in the department, and my discussions with them, as well as with the professors, have always been calm, rational, and heavily dependent on citing evidence for claims. \n\nAs for west-bashing, anti-white, and anti-capitalist: None of these are strongly emphasized in their curriculum, as far as I can tell. The professors tend to regard the west as a place where great progress towards gender equality has been made (albeit with work still to be done towards equality for both sexes). I don't know the whole story of their opinion on the non-western world, but there[.] a panel discussion and debate on whether or not the niqab oppresses Muslim women soon (a bit of an overplayed topic, IMO- there are so many other gender issues to discuss- but most students don't discuss gender as much as I do)- that[.] a debate, not some one-sided declaration. As for anti-white: Racism is acknowledged in these classes as in other classes (I study environmental science and policy, so my classes naturally include topics such as the frequent placement of polluting facilities in poor and black/hispanic/Native American communities), but I've never heard a professor bash 'white people' as a group or imply guilt and responsibility on the part of all white people. Anti-capitalist doesn't even come close. I, being an actual socialist, know how to recognize anti-capitalism- and frankly, the curriculum the gender studies department teaches doesn't even come close. I mean, if they're decrying the lack of female CEOs, instead of advocating the abolition of the position of CEO, I'd have a hard time calling them 'anti-capitalist'. Liberal reformist, more like it. \n\nThe other departments on identity, likewise, don't conform to this stereotype. We have the French, Spanish, and German Studies departments, which focus on the culture, language, and literature of these cultures (much as English focuses on our own). We also have the ever-so-scary 'minority studies' departments- Asian Studies and Latin American Studies. Neither of them is about 'victim mentality'. The Asian Studies department basically focuses on teaching people how to do business in Asia- courses in Mandarin, Cantonese, and Japanese, courses on Asian history, etiquette, culture, business practices, economics, and politics. The Latin American Studies department is basically the same- how to thrive in Latin America. These majors are almost always paired with a major in Communications, Management, Political Science, Business, or Economics. \n\nThe stereotypical scary 'eevil liberal' major we have is Peace Studies (oh, how the College Republicans make fun of it!). But, the thing is, that[.] *also* exactly what it says on the tin- they study conflict resolution, international diplomacy, the sources of conflict, and questions relating to ethics and violence. Now, that includes studying ideas about structural violence and oppression, but again, largely as they relate to conflict and how to resolve those conflicts- so, basically, the central point of the whole major. \n\nNow, obviously, my experiences are my own, and not everyone else[.]- but I will note that in my experience, this narrative of the victim-mentality, irrational west-bashing gender studies department is inaccurate. "}