{"doc_id": "741", "name": "2012_10_humanities_student_major_665_circlebroke", "namespace": "we1sv2.0", "metapath": "", "pub": "circlebroke", "title": "2012-10-humanities-student-major_665_circlebroke.txt", "pub_date": "2012-10-15T00:00:00Z", "Sentiment": "0.065", "Subjectivity": "0.332", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "337", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6n4kcl", "Reddit_id": "c6n5o9p", "Subreddit_id": "t5_2tnz9", "Commenter": "altrocks", "length": "2108", "content_scrubbed": "This is where [multiple intelligence theory](http://en. wikipedia. org/wiki/Multiple_intelligence) comes in. Not everyone buys into it, and it[.] extremely hard to test at the moment, but it also seems to be the way people actually work. from the linked Wikipedia entry:\n\nGardner believes that eight abilities meet these criteria:[3]\nSpatial\nLinguistic\nLogical-mathematical\nBodily-kinesthetic\nMusical\nInterpersonal\nIntrapersonal\nNaturalistic\n\nHow many STEM people are good at learning multiple languages? Not computer languages, actual human languages. How many are good at inter- or intra-personal matters? Most people are decent in the majority of these areas, but have specific weaknesses and strengths in a couple areas. Some people who rank as a genius on traditional IQ tests are only Logic-Math and/or Spatial geniuses, since that is primarily what is tested (as well as understanding of cultural norms, colloquial expressions, and the ability to communicate well). However, we also acknowledge there are musical geniuses who have separate abilities from math and spatial reasoning. There are naturalistic geniuses who can, inherently it seems, deal easily with wildlife, both flora and fauna, or can find their way with minimal directions in a new place.\n\nI avoided art classes in school because that is just not my thing. I have no natural musical ability, either. Everything else was fair game, and I took advantage of the opportunities I had to improve in areas I was not as strong in. And I think that[.] what a lot of these situations are failing to do. Don't charge in to the stuff you know you're bad at, improve what you're mediocre at while also working on what you're already good at. I've studied Calculus and Statistics, Astronomy, Biology, Chemistry and Physics, Philosophy, Literature, Economics, Criminal Justice and Psychology, as well as Karate, Judo and Tai Chi. You can be broadly educated and still suck at the arts, but if you just stick to the things you're good at, something a lot of STEM people do, you're gonna miss out on a lot and get the kind of one-sided outlook seen above."}