{"doc_id": "626", "name": "2012_02_humanities_student_major_319_uwmadison", "namespace": "we1sv2.0", "metapath": "", "pub": "UWMadison", "title": "2012-02-humanities-student-major_319_UWMadison.txt", "pub_date": "2012-02-09T00:00:00Z", "Sentiment": "0.113", "Subjectivity": "0.414", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "339", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3pqhj5", "Reddit_id": "c3pr23d", "Subreddit_id": "t5_2s97q", "Commenter": "aHarmacist", "length": "2003", "content_scrubbed": "I'll assume that this post got downvoted because of the bit about foreign TAs at the end.  It[.] not racist, it[.] a legitimate grievance for college students everywhere, not just at Madison.  I'm certain nobody doubts their knowledge of the material, but expecting the learning experience between someone who has English as a first language to be comparable to those who took it as a second (or even third!) language is totally unrealistic.\n\n\nThat aside, I'll address the OP.\nWhat is there to do in Madison?\n\nShit, what *isn't* there to do in Madison?  As cliche as it sounds, you can find a little bit of everything within spitting distance of campus.  State street has every type of cuisine imaginable, plus any drinking establishment that suits your fancy.  There[.] more student orgs and clubs on campus that some colleges have classes, I can 100% guarantee you'll find your niche quickly and easily.  Sports, music, culture, gaming - whichever your fancy, you'll never be bored.\n\n\nWhat do you love about UW?\n\nEveryone[.] a Badger.  Most everyone attending UW has a mutual respect and understanding for each other, and as a consequence we're (generally) all friendly and look out for one another - even random strangers.  Take a walk around the streets on a Friday or Saturday night - everyone you'll run into will be the happiest person alive.  That aside, beautiful campus, beautiful people, great college experience.\n\nIs the campus as awesome as it advertises?\n\nAbsolutely.  When you come to visit campus, do not hesitate at all in taking the campus tour.  They'll take you through some of the coolest places buildings on campus - Union South, The Discovery Center, Bascom Hill - all of them stay beautiful year-round.  Some people say the Humanities building is hideous, but I actually quite like it.  It seems like a good half of the buildings on campus were renovated or built entirely new in the past 5 years, and it shows well.\n\nCouldn't tell you much about the physics program, but good luck!\n"}