{"doc_id": "1516", "name": "2012_01_humanities_student_major_123_boulder", "namespace": "we1sv2.0", "metapath": "", "pub": "boulder", "title": "2012-01-humanities-student-major_123_boulder.txt", "pub_date": "2012-01-04T00:00:00Z", "Sentiment": "0.264", "Subjectivity": "0.49", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "378", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_o2vna", "Reddit_id": "c3dzd7e", "Subreddit_id": "t5_2qyl3", "Commenter": "FrozenBananaStand", "length": "2147", "content_scrubbed": "There is a ton of information I could give you about Boulder (been here 6 years, lived in Denver for 8 before that), so if you have any more specific questions let me know. \n\n-Outdoorsy, love music and the arts. Awesome, climbing is HUGE in Boulder, we have 6 legitimate rock gyms, plus tons of bouldering on Flagstaff, and sport and trad climbing in Eldorado (people call it Eldo). Besides climbing, biking and skiing are probably the two biggest sports. There isn't a huge \"traditional\" sport scene out here, but it is available. Lots of awesome hiking (it took me about 2 years to hike all of the Chautauqua trails). The music scene in Boulder has transitioned to be very heavy on electronic music. Jam bands and bluegrass are probably the runners up. There are two main venues *in* Boulder: boulder theatre and the fox theatre. Fox is smaller, catered to college students. Boulder is bigger, still catered to college students, but located right on our walking mall/bar promenade Pearl St. Arts - I don't know as much here, but CU just built an awesome new visual arts complex, and the creek fairs always offer a lot of local artistry. \n\n-It is pretty awesome. You can commute entirely by bike if you choose to. The bus system is good as well. As others have mentioned, rent can be pretty high, but the food scene is incredible. I believe we have the most startups and microbreweries per capita and were recently rated the \"foodiest\" city in America (a lot of local restaurants).\n\n-Job market is OK, but don't count on it being easy to get a job, one of you should probably find one first. Everyone I've ever lived with has had a job, though I'm guessing that is a rarity. \n\n-Considerations: I would say this to anyone moving anywhere, think about renting with roommates for the first 6months. It will be cheaper and you'll get introduced to people, even if you end up hating it. Rent cycles are in line with the college cycle, so leases are august-august typically, and decent places in Boulder start preleasing in february/march. The summers here are super relaxed as 1/2 the town leaves, but it is definitely a college town.\n\nHappy hunting. "}