{"doc_id": "1551", "name": "2012_01_humanities_student_major_521_adelaide", "namespace": "we1sv2.0", "metapath": "", "pub": "Adelaide", "title": "2012-01-humanities-student-major_521_Adelaide.txt", "pub_date": "2012-01-13T00:00:00Z", "Sentiment": "0.098", "Subjectivity": "0.434", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "413", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ofokm", "Reddit_id": "c3h1ebh", "Subreddit_id": "t5_2r1ca", "Commenter": "scarlettblythe", "length": "2220", "content_scrubbed": "March is definitely the best month to be in Adelaide. There are heaps of music festivals on, from WOMAD (world music) to house, rock, pretty much any style you can think of. There[.] also Fringe, which is great for Comedians, and the Festival of the Arts, which is great for dance and theatre. The city comes alive like no other time of year.\n\nLoads of people say Adelaide is boring and if you're used to a big city you may well find it to be so. Even though it[.] not small population wise (over 1 million people) it has a reeeeally low population density, so everything is really spread out. You will have to take the bus. Everywhere.\n\nIf you're in a residential college you'll be in North Adelaide, which is a gorgeous, wealthy semi-suburb just outside of the CBD. There are heaps of pubs, fish and chip shops, etc, and gorgeous parks really near by, it[.] a good place to be. People even keep horses in the northern parklands. Plus it[.] walking distance from the city, which has the only decent nightlife. \n\nWe've had a pretty mild summer so far, only one 'heat wave' and that really wasn't that bad, mostly just high 30s. With luck, the heat won't hit in February, when that happens Summer often stretches well into March, it[.] not unheard of to have 40 degree days as late as that. But if you're lucky, it'll just be sunny, mid-30s and gorgeous.\n\nEven so, if you're from a cooler part of the states, you may struggle with the strength of the sun and the glare. When I was in Spain, 40 degrees there was totally different to 40 degrees here. If you're a redhead, you'll burn in 10 minutes on a hot day. Wear sunscreen. Australians are full of shit on a lot of stuff, but sunscreen is not one of them. Wear it. All the time.\n\nAlso, prices are higher here. It[.] much cheaper in Adelaide to other parts of Australia, but don't be surprised to see prices at double what you're used to. We get paid a craptonne, so prices are high. Sorry.\n\nEdit: Australian unis are structured very differently to US ones. Very few Australians live in the colleges, for a start. Most students go to uni in their own city, and so live at home and only go to uni for class. This means there may be much less 'campus life' than you're used to."}