{"doc_id": "627", "name": "2012_02_humanities_student_major_333_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-02-humanities-student-major_333_AskReddit.txt", "pub_date": "2012-02-10T00:00:00Z", "Sentiment": "0.036", "Subjectivity": "0.251", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "771", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pjmwf", "Reddit_id": "c3pxmo1", "Subreddit_id": "t5_2qh1i", "Commenter": "AmericanDerp", "length": "4281", "content_scrubbed": "$300,000,000 winning ticket. This is all assuming I can't dump it into an LLC as a secret millionaire. \n\nCash payout is probably lump of, let[.] say, $150,000,000. You may get, what? $102,000,000 after taxes. I'd set aside 5% right off to charity. So I start with assume $96,900,000. \n\nI'm going to assume I want to live off of $1,000,000 a year in baseline interest. Let[.] say I go for ONLY safe investments for this--5% return sound reasonable? For $1,000,000 in annual income, I'm guessing I'd need to sock away $20,000,000 in safe investments. Bonds and shit, to get a reliable, lazy $1,000,000 back annually there. Let[.] say I give 5% a year to charity again and take home 80% a year under taxes. That[.] $760,000 a year. $14,615 a WEEK, with no major capital expenses like a house payment. I'm set for life already at this point.\n\nI'm down to $76,000,000. I'll round down the $900,000 here for financial planning, college fund for kid, laughing at a house/car loan pay off, quitting my job, paying my lawyers and financial planners, and buying a REALLY BIG TV.\n\nI'll say $6,000,000 goes in various forms to immediate family/friends in need, but structured in ways that it[.] not a flood, like trust funds. I'm not sure if they'll be pissed or what, but I'd rather them be secretly annoyed at me for a year than outright fucked in a year from poor planning. This would be a small pool of people, all things considered. They'd all also be gaining interest on it, this way, in a controlled fashion. Long term help, not short term (aside from helping on crushing debt).\n\nDown to $70,000,000. I've already helped family and closest friends, done some charity, done some stupid shit. Set aside another $5,000,000 in a trust for the kid. Let[.] say $50,000 lump at 18, 25, and 30. $50,000 a year above and beyond that. College was already set up to take him to a doctorate if he wants. That[.] a lot of cheddar, for life. 97 years, assuming no interest or anything. I'd probably add additional bonus years. 35, 40, 45? Stuff like that. 50 years of cover, maybe 60, for him. After taxes he[.] essentially getting a free $3400 or so a month of income, above and beyond whatever else he earns, plus constant gifts, bonuses, and a probable career if he wants it at a business I'll have started later. And that[.] if I go low, to make him live a little to learn some responsibility.\n\nDown to $65,000,000. I can give to politics from my $1,000,000 a year dividend income. Now comes the question of what do I do with my time? I could invest another $20,000,000 to safely take my annual income to $2,000,000 a year. Or all of it, basically, to take me to $4,000,000 a year, or maybe an after tax/charity take home annualized income of $58,460 a week from some safe bond-type investments. \n\nWe could easily live off of, oh, two months' take home salary ($467,680 or about $8500 a WEEK take home); donate 2 months any given year to various good local causes ($460k for most established local charities and the arts? Huge); 2 months to politics ($460k a year goes a LONG way), and I'm still here at only having used 50% of my annual take home income. **I have another $1,403,040 a year *after taxes* and all the rest of that... LEFT OVER**. PER YEAR. \n\nThink about what you could do with that much bread a year. \n\n* Year 1: buy the wife the house and kitchen she deserves\n* Year 2: start a local business\n* Year 3: start another business/expand the original\n* Years 4-5: having the free flow of extra income means I can relax more as the business builds, making failure less likely (assuming the business doesn't suck)\n* Year 5-10: wash, rinse repeat\n* All years: I'd have enough money left over most years (trivially) to be able to help out close friends/family time to time\n* One year: all the \"Guys\" are flying first class to the fucking Super Bowl, front line seats.\n* One summer, 3-4 months: Europe\n* Boat\n\nAnd so on... or I could gamble bigger when I'm at $65 million left, and invest large. Maybe in a start up. But that[.] a bigger risk, but with a potentially bigger reward. Do I want to be making $1-$5 million a year for life? Or $5-10 million a year? \n\nI think knowing my own personality, I'd prefer the former, for the more relaxed life. \n\ntl;dr [some stuff](http://i. imgur. com/3ESyY. jpg)"}