{"doc_id": "1598", "name": "2012_01_humanities_student_major_1007_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2012-01-humanities-student-major_1007_politics.txt", "pub_date": "2012-01-27T00:00:00Z", "Sentiment": "0.098", "Subjectivity": "0.494", "Score": "23", "Upvotes": "23", "Downvotes": "0", "Wordcount": "262", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3l7n61", "Reddit_id": "c3l8cdl", "Subreddit_id": "t5_2cneq", "Commenter": "misnamed", "length": "1477", "content_scrubbed": " Is most of it going straight into research?\n\nNo, in fact, a lot of expensive schools (e. g. private liberal_arts colleges) don't do much if anything by way of research - they are almost entirely for-education facilities. But they have crazy-impressive professor/student and admin/student ratios, beautifully up-kept buildings, a range of facilities and supplemental programs and activities and unbelievable services, etc...  in short: they just have more and more and more and more things on offer so they can compete with other schools. I'm not saying this is a good thing - many of us would trade lower tuition to get rid of the stuff we aren't going to use, of course - but that[.] just how things have evolved.\n\n Can someone explain to me how come US universities are so expensive?\n\nThink of it a bit like a luxury resort - at a nice school, you get great on-campus meal options, lovely rooms, lots of professors and support staff, safe and beautiful grounds, etc... now run the math on it (VERY roughly, just to illustrate): if you pay, say, 36,5K/year you're getting all of that stuff for just 100 dollars a day - cheaper than a hotel room in most cities, and as much as I'd expect to pay per day for a month at a semi-fancy retreat (never having been, I dunno, but 3K sounds like a starting point anyway). And of course that doesn't even count what endowments add to their mix (because even schools that cost that much, well, your tuition only counts for so much of it). "}