{"doc_id": "638", "name": "2012_02_humanities_student_major_419_mensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "MensRights", "title": "2012-02-humanities-student-major_419_MensRights.txt", "pub_date": "2012-02-13T00:00:00Z", "Sentiment": "0.055", "Subjectivity": "0.353", "Score": "26", "Upvotes": "26", "Downvotes": "0", "Wordcount": "360", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3qq0zl", "Reddit_id": "c3qs1um", "Subreddit_id": "t5_2qhk3", "Commenter": "LeeHyori", "length": "2278", "content_scrubbed": "This is largely correct, except for one thing: It[.] not \"hard_sciences\"; it[.] professions. The natural sciences are, for the most part, just as \"useless\" as the liberal_arts, given that natural science is just the new name we've placed on natural philosophy (hence the name \"Philosophiæ Naturalis Principia Mathematica\" for Newton[.] most famous work). The pursuit of the natural sciences—though the hard_sciences do often have applications—is not extrinsic; its goal is simply the pursuit of knowledge and truth through rigorous empirical methods. For instance, studying the origin and nature of the universe has very little application in real life, but astronomy and the astrophysics are definitely part of the natural sciences. Physics has many applications in engineering, but physics **is not engineering**. If it were, it would just be engineering. \n\nLikewise, unless you intend on pursuing a profession in medicine or pharmaceuticals, fields like biology are equally useless. And, as it turns out, data shows (PayScale) that biology majors are perhaps some of the lowest paid, even though biology is definitely a natural science. What people need to understand is that there is a **huge difference between a profession and the hard_sciences**, because if we delineate it along hard_science/soft science lines, you will find that economics majors (which is a social science) basically fuck everyone up in terms of how much they earn. You could argue that it has many applications in business (which it definitely does), but a lot of economics does not care about business or business practices. And, again, if it were business, why not study, um, *business*? Likewise, the natural science/arts dichotomy finds difficulty with professions like Law, which you could handily classify as an applied humanities (in my opinion, the practice of law can be largely deemed \"applied philosophy,\" to the same effect that you could see engineering as applied physics). \n\nEdit: I'm primarily talking about the difference between the liberal_arts and the natural sciences. For things like theater, etc., I think those fall under the category of professions as well; they are just professions with bad pay, provided their aim does not concern *truth* like natural science or philosophy. "}