{"doc_id": "614", "name": "2012_02_humanities_student_major_188_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2012-02-humanities-student-major_188_RPI.txt", "pub_date": "2012-02-06T00:00:00Z", "Sentiment": "0.052", "Subjectivity": "0.388", "Score": "22", "Upvotes": "22", "Downvotes": "0", "Wordcount": "331", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3ofnky", "Reddit_id": "c3ofwrk", "Subreddit_id": "t5_2rg3u", "Commenter": "nextweeks", "length": "1881", "content_scrubbed": "I'm not sure if you're serious, but just in case you are I'll give you a current undergraduate[.] view on the new facilities \"we've\" been given.\n\n* EMPAC\n\nSupposedly constructed to widen the educational opportunities available to RPI students beyond primarily math/science based courses. Then a year later, the arts and music departments took big cuts. It is hardly ever used by students, even clubs that it would make sense to be able to use it like our bands and dance team. It is mostly used by Shirley to show off to prospective/new students and to host events, and the occasional outside performance brought in.\n\n* ECAV\n\nConstructed to give our athletic teams new fields and courts and to give the varsity athletes a new weight room to reduce crowding in the Mueller Center. The ECAV weight room is only big enough for one team at a time, so most of them still use the Mueller Center. Also, no offense meant to our other sports teams but this is a hockey school, and the Field House could use a little work too.\n\n* Biotech\n\nTo call Biotech the best of the three buildings constructed under Shirley[.] regime would be like calling someone the smartest kid with down syndrome. My biggest problem with it is that I feel like the amount of use that undergraduates will get from it in their time here is grossly exaggerated during the tours. Only a few handfuls of students every semester work in it helping professors and graduate students with their work\n\nAll three of these buildings were put up while most of our academic buildings could use serious renovations and professors are lecturing using 20-30 year old equipment. I feel like the last 11 years the administration has been short-sighted and mismanaged the Institute in order to boost the image of the school while letting the quality of the school slip away along with the legacy and tradition as a top college in the US."}