{"doc_id": "768", "name": "2012_10_humanities_student_major_1021_ladiesofscience", "namespace": "we1sv2.0", "metapath": "", "pub": "LadiesofScience", "title": "2012-10-humanities-student-major_1021_LadiesofScience.txt", "pub_date": "2012-10-21T00:00:00Z", "Sentiment": "0.148", "Subjectivity": "0.475", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "758", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6psopq", "Reddit_id": "c6pua3m", "Subreddit_id": "t5_2sg5m", "Commenter": "[deleted]", "length": "4059", "content_scrubbed": "In the interest of full disclosure, I was in a very similar situation to you when I started my PhD.  I was the oldest student in my lab (older than even the 6th year student), older than most of the people in the whole program.  I moved to a city I found dead boring single as can be, whereas I felt most of the students were either in the wild-and-crazy post-college hook-up phase, or settled with their partners.\n\nI was also in a prestigious lab, in a prestigious program, and in a prestigious school where I felt everyone had amazing academic pedigrees to being doing biology, whereas all I had was decaying 7-year-old bachelors in Anthropology from an almost invisibly small liberal_arts college and a quickie cash-cow MS in biology from a school that seemed like the University of Phoenix compared to where my colleagues came from.  In addition to all this, I was the first female student that my 60+ year old advisor had ever had. The lab was about 10 guys, and I was once told right to my face that I was not allowed to socialize with them because one of them just didn't like having women along.  The topper was the little boy phenom who entered in my lab with me and advisor seemed to adore him and ignore me (or try to humiliate me in lab meetings).\n\nI felt isolated from the other students who seemed to be partying and loving the life, and I didn't know my place.\n\nAll this to say, I feel ya gal, I know it[.] tough.\n\nYears later, though, I came to understand that it was not all that it seemed and I had let my own insecurities (see no biology bachelors or good pedigree, above) really get in the way.  It turned out that a lot of the students (with whom I became great friends, later) gave me a wide birth in the beginning because they found me intimidating.  I was older, and a lot more professional about my graduate work than they were.  Plus I was, for lack of a better term, a real adult by then and they were mystified by my relatively sophisticated tastes in food, booze, and clothing.  Someone actually pulled me aside one day to ask, \"hey, what[.] with the boots?\" -- I was in the habit of wearing a skirt and high boots with little heels most days in the fall, which really distinguished me from my jeans and sneakers colleagues, apparently.  Also, as I indicated in the first post here, it seems everyone was feeling stupid, and behind, and out of place when we got there.  And almost everyone had major issues with their advisor.\n\nI also came to understand, through my own experiences mentoring and actually talking to my advisor, that he mostly \"ignored\" me because I was doing a good job and didn't seem like I needed the help.  He was just the kind of guy who felt you only talk to your students when you feel he/she is doing something wrong.  Now this is not entirely true, he had plenty of favorites in the lab and they were seen shooting the shit quite often, but I did want to go my own way more than they did, and I paid the price of not being his favorite.  Strangely, I ended up being the favorite of another professor who, ironically, was the advisor of the only other woman in the whole department studying genetics and he did not treat her well.  But he gave me some great advice, as did all the other professors that I adopted over the years to sort of co-advise me, and in the end he even chaired my qualifying exam instead of my actual advisor.\n\nOne great thing that came out of all this was that I started a grad student women in science group at the school and it was a great success and went even farther toward helping me feel less isolated.\n\nYou are so early in the process, do no freak out.  Give yourself two years, or however long it takes you to advance to candidacy, then assess what is going on.  I think I can guarantee you that, by then, you will be well and truly established in the department academically and socially.  You may also find that academic science isn't for you and you want to do something else, but you will leave satisfied and on your own terms.\n\nGood luck sister, we have all been there!"}