{"doc_id": "1586", "name": "2012_01_humanities_student_major_849_truereddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueReddit", "title": "2012-01-humanities-student-major_849_TrueReddit.txt", "pub_date": "2012-01-24T00:00:00Z", "Sentiment": "0.061", "Subjectivity": "0.369", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "553", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_oucgy", "Reddit_id": "c3k4o9a", "Subreddit_id": "t5_2qyt6", "Commenter": "ravia", "length": "3680", "content_scrubbed": "Best practices in the US, [restorative justice and victim offender mediation](http://www. google. com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&ved=0CCgQFjAA&url=http%3A%2F%2Fen. wikipedia. org%2Fwiki%2FRestorative_justice&ei=UMMeT99GyeLRAZ__zAY&usg=AFQjCNEX8O2r4xYYasbYHOgeHswfZBIVqQ&sig2=kLV1me5hUvXOLi49bMcUtw), leaving aside drug war victims, are not developed due to the dominance not simply of the profit motives in the CJ system, but the dominace of the Other Wall Street, the basic logics and concomitant epistemology of retributive justice: the brutal smackdown, the logic of maiming for offenses, the dream of creating a good world by punishing the bad and wrong. The epistemology (or way of knowing) that goes along with this is one that keeps the mind in the suspension of disbelief that is thereby prepared to receive the Truth that coercion produces true goodness, that crocodile tears are real tears of remorse, that getting what \"one deserves\" is real justice, rather than the true accomplishment of what penitence, or thoughtfulness, ultimately aims for: the attainment of genuine equity and maintenance in the original condition out of which the non-harm or non-destructiveness of the non-criminal generally operates as being \"law abiding\". \n\nBut this massive industry ties in to the general moral underpinnings that permeate both the Right and Left: a logic and sensibility of retribution upon which the culture gorges itself, leading to the Other Obesity Epidemic, one that is hidden from view. This obesity is rife with as many problems as physical obesity, but is less visible than the numbers of, say, the 1 percent, and the numbers are, in this regard, quite reversed: the obese in question are the 99 percent. This other Wall Street is the way in which The People, the Vast Majority are themselves obese with logics of retribution. \n\nWhile critiques of materialist culture abound, we are sent the message that our advertising culture promotes a world in which the highest things are the attainment of material wealth. As if that were the case, and strikingly, this is, in the contexts in which this obviously false account is believed, in due form, according to aforesaid epistemology. For the fact is that the culture is not at all simply dominated by the commercial culture of materialism. Look for yourself: the airwaves and news media are glutted with the logics of retribution, from crime dramas, news stories, tabloid treatments, investigative journalism, morally charged music lyrics and Warholesque pop culture referentiality and subtextualities that are driven by moral tycoons that get stinking rich off of this other product: morality in the churning machine not of material wealth but existential benefit derived from a profoundly simplistic logic of maiming retribution. \n\nThe stories about this prison atrocity are just another aspect of what is in fact as stable and intractable a problem as physical obesity and monetary obesity as well. The arts that may counter this are not, in the first instance, at least, especially appealing, especially for those who are so oriented to continual consumption of this \"product\": the uninterrupted coitus with the criminal justice system. \n\nYet for those who are capable of thought, there is a richness that that eclipses the bright, eclipsing light of this product. And thought is what is most radically disruptive to this silent killer. You can follow your trail of french fries to the great McDonalds of retributive justice or stop eating their fat coated \"goodness\" and start thinking in ways that are unwelcome to this churning machine. The choice is up to you."}