{"doc_id": "692", "name": "2012_10_humanities_student_major_93_gatech", "namespace": "we1sv2.0", "metapath": "", "pub": "gatech", "title": "2012-10-humanities-student-major_93_gatech.txt", "pub_date": "2012-10-02T00:00:00Z", "Sentiment": "0.094", "Subjectivity": "0.316", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "375", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6gryes", "Reddit_id": "c6gucuz", "Subreddit_id": "t5_2r8t2", "Commenter": "db0606", "length": "2108", "content_scrubbed": "The ratio of lesbians to straight women at ASC is probably no different than anywhere else. The difference is that ASC provides a community where young women get to be authentically themselves. So the ones that want to be butch lesbians, will go all out, the ones that want to have bleached blonde hair, wear pink and go to Tech frat parties, will do so too. Basically, you can be whoever you want to be and nobody will judge you for it, which makes students that choose to live a non-standard lifestyle stand out more than they would be in a repressive culture like the frat houses that are UGA and Georgia Tech. \nI'm sure if you visited ASC you would find that very few people would really consider themselves as being defined by their sexuality. It[.] just such a non-issue there... \n\nThe majority of students don't major in women[.] studies and don't want to overthrow the patriarchy... they just don't like it when you call their college a girl[.] school and will call you out on it. They don't want to be told that they can't do something because they are female. Yes, you will have women majoring in fields that a GT grad would consider useless, but it IS a liberal_arts college. That is the point! Saying that an ASC degree won't get you a job is total BS. I have many friend who are ASC grads and most of them are gainfully employed. The majority of ASC graduates have jobs or graduate/professional school lined up when they graduate. \n\nHere[.] an example from the class of 2010: http://legacy. agnesscott. edu/Media/Website%20Resources/pdf/ir/data/senior-survey-2010. pdf\n\nTechnically, you can even get a dual degree from ASC and GT. You get your BA at ASC and a BS in Engineering from Tech (or CS degree from Emory) in a 5 year program that lets you bypass all the 500 student introductory sequences at Tech.\n\nI think that GT students really resent that ASC students don't put out as much as the GT students would like, so the whole \"ASC is full of lesbians\" stereo-type. Most of them are straight, some of them bi, and some of them gay. Most of them just don't go for the frat guy/unbathed nerd GT type."}