{"doc_id": "640", "name": "2012_02_humanities_student_major_506_guns", "namespace": "we1sv2.0", "metapath": "", "pub": "guns", "title": "2012-02-humanities-student-major_506_guns.txt", "pub_date": "2012-02-14T00:00:00Z", "Sentiment": "0.007", "Subjectivity": "0.376", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "601", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ppyjb", "Reddit_id": "c3relzb", "Subreddit_id": "t5_2qhc8", "Commenter": "ChunkyJungle", "length": "3314", "content_scrubbed": "I'm going to finally vent on this issue as it has been bothering me for awhile.\n\nI was at the business building studying for an accounting test when the shooting at UT happened, I went to Texas Tech University, and there were other groups around me discussing it. The main argument that has been used in all of these \"guns are bad, CCW holders are stupid\" is this hypothetical situation where someone starts shooting and the law abiding citizen puts the shooter down, then somehow he is mistaken as the shooter and he gets put down, and so on. Then the police show up and put el ultimo hombre down. Followed by the anti-gun rebuttal to any defense given to explain the situation better; the students aren't trained to handle situations like that and I don't trust them.\n\nSo here we go: \n1. People carry all the time around you and you will not even know it because it is there responsibility to make sure of this.\n2. Getting your CCW opens you up to more ways you could be held legally responsible for stuff. The carriers aren't as stupid as you make them out to be.\n3. Comparing training of a CCW holder and law enforcement looks like this in that argument.  If the CCW students were ignorant and untrained, leading to them killing each other, and the Police/SWAT come busting in and killing the last one. That would put the Police/SWAT on that ignorant untrained level.\n4. A more realistic approach would be something like this: a student disagrees with people in the class discussion and he thinks about just killing them for disagreeing with him. He leaves this class and stews about it for awhile. Upon his return he is now brandishing a gun and is intent on killing people and possibly himself. Wether or not he has been identified yet, once he shoots people are going to be trained on him and it is at this point he will be put down. At that point the shooting stops and people start trying to figure out what happened and who is alright. Once law enforcement shows up the person(s) who shot the shooter will not be brandishing their weapons and would identify themselves so that police could take over.\nThat[.] how a disagreement would go, not \"I don't like this guys way of thinking, he[.] a dumbass, I'm just gonna pull my gun and shoot him because I am carrying and he doesn't know.\" In any case the unfortunate decisions of nut jobs to shoot people (on a campus) aren't going to disappear with the_right to carry. \n5. Just because you might be able to CCW on campus doesn't mean everyone will do it. There are age requirements and not to mention the costs. Out of everyone I knew while at Tech I am the only one with a CHL. And factoring in friends and family, my parents, brother, a friends grandad, and me are the only people I know that are licensed.\n\nBottom line, if these bills passed there wouldn't be a single issue (on the CCW law abiding citizen side). And if someone had the mindset for a shooting spree at school they wouldn't get very far. Unless they chose the arts building or some other liberal subject building. But then it would be turned into having the CCW[.] somehow responsible for not being there or acting. And not to mention any administration involvement that could occur, fast and furious cough... cough...\n\nMy ambien kicked in about half way through so I'm hoping it[.] coherent."}