{"doc_id": "738", "name": "2012_10_humanities_student_major_626_christianity", "namespace": "we1sv2.0", "metapath": "", "pub": "Christianity", "title": "2012-10-humanities-student-major_626_Christianity.txt", "pub_date": "2012-10-14T00:00:00Z", "Sentiment": "0.046", "Subjectivity": "0.348", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "262", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6mkbky", "Reddit_id": "c6mls2b", "Subreddit_id": "t5_2qh6c", "Commenter": "missssghost", "length": "1449", "content_scrubbed": "As an atheist I don't have to go around continuously telling myself there is no greater power. When I go about my life, I have no experiences revealing that a god of any kind exists, and I have come across no evidence to believe in one, let alone to believe in your specific version. So my conclusion, to choose to live as though I don't believe in any gods, seems obvious and rational to me. \n\nI don't know what you mean exactly when you say that everything came by 'chance', I don't feel like I can justly respond to that part of your comment. I've also never been much of a student of science so I'm not qualified to talk in depth about cosmology, abiogenesis and evolution~\n\nAs for whether or not anything I accomplish will last? Well I don't know what I will accomplish in life, nor how those accomplishments will resound with other people. I work in the arts, so certainly I have hopes that my work will touch people at least within my contemporary surroundings/time, but I can't tell you whether I'll be remembered. I hope I'll be but I could never tell you that I deserve to be remembered for eternity. \n\nI can't just believe in an afterlife because I don't want to face that perhaps I'll be forgotten someday. \n\nI'm pretty okay with that. \n\nWhich beliefs feel natural to you, do not feel natural to everyone. \n\nI hope I came across concisely and that you might understand a little something more about one atheist[.] perspective, at least.  "}