{"doc_id": "597", "name": "2012_02_humanities_student_major_12_ronpaul", "namespace": "we1sv2.0", "metapath": "", "pub": "ronpaul", "title": "2012-02-humanities-student-major_12_ronpaul.txt", "pub_date": "2012-01-31T00:00:00Z", "Sentiment": "0.025", "Subjectivity": "0.254", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "391", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3mprsq", "Reddit_id": "c3mpzvu", "Subreddit_id": "t5_2qh0r", "Commenter": "Barrack_LL_bomb_ya", "length": "2222", "content_scrubbed": "First off Ron Paul is pro civil liberties, so negative argument that Paul is against same sex marriage is irrelevant. He doesn't endorse it but he sure all hell isn't going to keep anyone from doing what they want as long as it doesn't hurt anyone else. Do a little more research and I'm sure you will understand because you are a smart individual.\n\nNow on to your government education creating obama thing.\n\nStarting at age 6, Obama attended a Catholic school in Indonesia. At age 8, he attended a public school in Indonesia, nominally a Muslim school, which is where the \"Muslim\" tempest in a teapot comes form. \nAt age 10, he left his mother and Muslim stepfather behind in Indonesia, moving to Honolulu to live with his Mom[.] parents. His grandmother was a Vice President for the Bank of Hawaii and was able to afford to send him to the prestigious private college preparatory Punahou Academy, still considered the finest school in Hawaii. He attended there from 5th grade, and graduated from high school there in 1979. \nObama then attended Occidental College, a fine liberal_arts college in los_angeles from 1979 to 1981. He admittedly was a bit of a party animal there. He apparently got a bit more serious his sophomore year and transferred to Columbia University in New_York City for his junior and senior years, graduating from Columbia in 1983. \nFrom 1988 to 1991 Obama attended Harvard Law School, graduating magna cum laude and was editor of the Law review.\n\nI see no American Public Schools here. \n\nPaul did attend public high school, but that was like 50 years ago huge difference in education since then, no federal standards or any of that crap. How are you comparing RON PAUL to the current youth? They have nothing in common. I don't see a shit ton of intellectually superior high school students walking around. Just a large number of frustrated unfocused uneducated young people. WAKE UP I WANT TO HELP YOU! WE CAN SAVE THE WORLD TOGETHER! ME AND YOU BRO! YOU ARE MOTIVATED JUST GET BEHIND THE RIGHT CAUSE! CIVIL LIBERTIES AND FREEDOM! IT IS WHAT AMERICA WAS FOUNDED ON! IT WASN'T FOUNDED ON OPPRESSION AND WELFARE! I WOULD NEVER FORCE YOU TO DO SOMETHING YOU DIDN'T WANT TO DO! RON PAUL MAN! RON PAUL!"}