{"doc_id": "598", "name": "2012_02_humanities_student_major_46_needadvice", "namespace": "we1sv2.0", "metapath": "", "pub": "needadvice", "title": "2012-02-humanities-student-major_46_needadvice.txt", "pub_date": "2012-02-01T00:00:00Z", "Sentiment": "0.065", "Subjectivity": "0.335", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "270", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p6tya", "Reddit_id": "c3n3t6e", "Subreddit_id": "t5_2r367", "Commenter": "[deleted]", "length": "1473", "content_scrubbed": "This isn't the advice you deserve, but it[.] the advice you need right now.\n\nDo not go $22k in debt for a sociology degree.\n\nI'm not saying you can't major in it. I have an English degree with a philosophy minor - not exactly an engineer. But I didn't go into debt to get my unprofitable degree. If you're going to go the humanities route, get your undergrad degree at the cheapest public college in your state, take your time and pay as you go. Even if you just want to teach sociology, about the only reliable thing you can do with the degree, you're going to need grad school. No point blowing your budget on something that will be a footnote.\n\nOut of high school, I went to the boring state university to save money, while my friends got took out loans theater degrees from out-of-state private colleges. Ten years later, I was able to quit my job to focus on standup comedy, and they're stuck working in mattress stores and customer service - because the loan payments mean they can't afford to quit.\n\nSelf-fulfillment is a perfectly valid educational goal, but if you go into debt to do it, you're trading four years of self-discovery for 30 years of indentured servitude.\n\nMajor in sociology and go to a cheaper school, or go to the expensive one, and major in something with greater profit potential. I'm not telling you not to follow your dreams - but you have to be practical about it, or you won't get to follow them in your 20s and 30s, when it really matters.\n\n"}