{"doc_id": "1606", "name": "2012_01_humanities_student_major_1114_chemistry", "namespace": "we1sv2.0", "metapath": "", "pub": "chemistry", "title": "2012-01-humanities-student-major_1114_chemistry.txt", "pub_date": "2012-01-28T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.196", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "273", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p0ki7", "Reddit_id": "c3lkmzd", "Subreddit_id": "t5_2qhf9", "Commenter": "potionsmaster", "length": "1613", "content_scrubbed": "OH MAN. This would be so much fun! I am jealous! As khemist mentions, the Juniata (Reingold) text would certainly be an approachable one for high school students.\n\nMore fun (though admittedly way more work) would be devising your own curriculum! I would make this a hands-on experience. You say the plan is for a year-long class. The first semester could be 50/50 lecture and lab. Don't worry about breadth, make it fun and allow the students to a fair amount of freedom regarding the lab experience, learning and using equipment, etc.\n\nThen... the second semester.... BAM! make it a self-directed learning experience. 80+% of the time in the lab. Devise a list of targets for the students to synthesize. Obviously, they will need to be do-able, not only in terms of the chemistry they will have learned but also with the reagents you have/will be able to afford. They spend a few weeks researching the molecule and devising possible synthetic approaches including proposed isolation and characterization methods based on the chemistry covered the semester before (and maybe even using some of the chemistry they used in the previous semester. Then let 'em get in there. Have them keep a detailed lab notebook and write up the results in an end-of-the-year report.\n\nI suppose much of this depends on your organic background.\n\nOh man. Now I want to do this!\n\nI'm a chemistry prof at a small liberal_arts college in the Philadelphia region... if by some small sliver of a chance you happen to be in the area too, I'd really enjoy discussing the possibilities.\n\nBah. Now I have to finish writing this grant application."}