{"doc_id": "1594", "name": "2012_01_humanities_student_major_979_cmu", "namespace": "we1sv2.0", "metapath": "", "pub": "cmu", "title": "2012-01-humanities-student-major_979_cmu.txt", "pub_date": "2012-01-26T00:00:00Z", "Sentiment": "0.16", "Subjectivity": "0.369", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "524", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_oy835", "Reddit_id": "c3l0gak", "Subreddit_id": "t5_2r87b", "Commenter": "tumbling_after", "length": "3029", "content_scrubbed": "In my opinion, the review (that you linked to) is entirely correct. Pittsburgh has some iffy weather, the work is hard, and the kids are nerdy. That being said, I wouldn't want to be anywhere else.\n\nPittsburgh: It rains. A lot. But it is SUCH a cool city. It[.] really turned around from its days as a steel empire, and has recently experienced a huge cultural and technological boom. There are major tech companies with sectors here (like Google) and the strip district has every type of museum, theater, cultural thingamabobs that you can think of. It[.] hard to find yourself at a loss of things to do.\n\nThe work: CMU works its students more than anything. Every major (even the 'easy' ones) just piles on the information. At first I was very overwhelmed but once you acclimate to the culture, it[.] not bad at all. Everyone has as much work as you do, so it[.] understandable to say, 'no, I can't, I have homework'. The end result is that you not only learn an awesome amount by the time you graduate, but you develop a strong work ethic. Employers look for cmu students because they know that the students will work their butts off. There[.] also a great amount of support on campus. Academic services has tutoring sessions, TA[.], excel (study) groups galore. And all professors have office hours and are always ready to help you understand the material. I think people are often worried before they come here about the time commitment, but honestly, I live with computer science majors and am friends with engineers (I'm in the humanities). I see their workload and the things they are a part of and all I can say is, trust me, there[.] time. Everyone is in at least two clubs or activities and still manages to have time to party. Just know that you will be surrounded by people who like to work hard. Slacking is not an option.\n\nThe students:... are the best part! Everyone here is their own special brand of nerd. What I love about the campus is the way that everyone has their own interest/passion/obsession, but everything comes together. Take buggy, for example (if you don't know what that is, go to youtube NOW!) Buggy teams are made up of engineers, art students, football players, english_major and everything in between. It[.] really a blend of personalities that you won't find anywhere else. Together, they work to design, build, and race in carnival. This happens every year, and every year I am shocked by how this unique composite of students puts together something so seamlessly. \n\nOverall, the diversity of the student body makes it a fascinating place. We just had our biannual activities fair and there were representatives from sports teams, theater groups, tech groups, ems, knitting clubs, photography clubs, etc. Basically, everyone here is nerdy but manages to find a niche.\n\nIf you want any specific information, feel free to message me. For what it[.] worth, I would recommend the school to anyone, so long as they liked learning and wanted to be in a stimulating, nerdy, unique, passionate environment."}