{"doc_id": "1562", "name": "2012_01_humanities_student_major_587_treeconnoisseurs", "namespace": "we1sv2.0", "metapath": "", "pub": "TreeConnoisseurs", "title": "2012-01-humanities-student-major_587_TreeConnoisseurs.txt", "pub_date": "2012-01-15T00:00:00Z", "Sentiment": "0.167", "Subjectivity": "0.306", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "366", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_oih15", "Reddit_id": "c3hnz4s", "Subreddit_id": "t5_2td1x", "Commenter": "cymbalxirie290", "length": "2031", "content_scrubbed": "Firstly, I have to say that this sort of a subreddit has been long overdue in relation to trees and I'm glad it getting a great start. It[.] gone from 30-something readers to nearly 400 readers in little more than a day. It just sort of blows my mind, I guess.\n\nBut, onto the questions.\n\n*  What makes you feel that you will be a good mod?\n\nWell, as a college student, I have a surprisingly large amount of free time, and all I ever do   then is browse r/trees. I'll gladly divert my time making sure this subreddit is an overall great experience. \n\n* Do you have any ideas for the subreddit and do you see it going in any specific direction?\n\nI'd been thinking about starting a discussion-based tree subreddit for some time, and now that it[.] come about, I believe I have a lot of great ideas I can bring to the metaphorical table. I think r/treeconnoisseurs' should be a place for anyone wanting intelligent and open-minded conversations on anything, really. Not to say that paintings, music, and literature are to be completely shunned, we all can appreciate the arts, but if you didn't personally make it, put it in a self. post. That way, we can eradicate any potential karma whoring, which, along with memes and the like, cannot be tolerated for a thriving mature subreddit.\n\nAlso, I just glanced at the reader count over yonder --.\n\nWhat if it said \"[#] gEnts and Lady gEnts\"? That'd be sweet, I think.\n\n* Do you have any experience with design/CSS?\n\nNot in coding, no. But I have always had an eye for graphic design, if I do say so myself.\n\n* Are you a mod on any other subreddit[.]?\n\nNope. Never had the chance.\n\n* What makes you stand above the rest, why should we pick you over the other applicants?\n\nIMO, I have the drive, desire, and vision to make this subreddit great. Of course, that[.] just my opinion. But I do want to see this subreddit become a place where everyone is welcome to come for thought-provoking articles, inviting reddiquette, art, music, and the hope to generate intelligent discussion on the topics.\n"}