{"doc_id": "1526", "name": "2012_01_humanities_student_major_286_mensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "MensRights", "title": "2012-01-humanities-student-major_286_MensRights.txt", "pub_date": "2012-01-08T00:00:00Z", "Sentiment": "0.05", "Subjectivity": "0.363", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "496", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3f0kzv", "Reddit_id": "c3f2xl1", "Subreddit_id": "t5_2qhk3", "Commenter": "[deleted]", "length": "2793", "content_scrubbed": "I don't so much fear women as I fear the power women have--I don't pursue any romantic relationships even though I'm in college, where sex is supposed to be freewheeling and fun.  First week of classes, *first day* (night, really) there was a Take Back the Night rally that we were required to attend (living in the dorms), and we were told over and over during Orientation Week how *any alcohol whatsoever* nullified consent; how no matter what you think, women don't want any sexual attention from men, and that they've created \"safe spaces\" simply to avoid that sexual attention; that those \"safe spaces\" extend to the dorms, so you can't even bring girls back to your room in a dorm because it[.] too sexually charged; that your very presence in the dorm is disruptive, and whenever you walk onto a girls' floor or down the girls' side of a dorm, you should loudly announce \"man on the hall!\" or get one of the RAs to do it for you; that if the female bathrooms are overfull, women have the_right to kick men out of bathrooms on men[.] floors in order to keep their \"safe space\" intact; and that if there is any allegation of impropriety, you cannot gain help from an attorney (the student judiciary is not a court of law) even though you can be charged with criminal misconduct (the student judiciary is a court of *university* law).\n\nI have been told from the very first night I was here on campus, through placards, posters, and pamphlets, that not only are all men potential rapists, but that I may be a rapist and not even know it; I have to go to class every other day in a hall surrounded by such placards showing women being beaten and men being beaters and told that my very presence is proof positive that I'm a part and a product and a privileged member of a violent system, even though I've never been violent (never even been in a fight) and have hardly even had sexual relations to speak of.  I don't drink, don't live on campus (anymore, yeesh), and I keep my head down.  Every class I attend is almost entirely female, with only one or two male members (Humanities... woot?); my professors are also almost entirely female, with shared faculty between English and Gender Studies, so the entire faculty follows the doctrines underpinning feminism.  Every class I've taken has reinforced these doctrines through consistent application of gendered readings of texts and use of feminist, marxist, and other \"critical\" theory, and I am sometimes forced to write papers essentially regurgitating facts I know to be untrue and theories I can easily see are based on fallacious ideas and malicious misandry.  \n\nI try to maintain my sense of self in all this, and I only partially succeed most of the time.  I'm simply trying to survive in what is truly a woman[.] world here on campus."}