{"doc_id": "1552", "name": "2012_01_humanities_student_major_523_umass", "namespace": "we1sv2.0", "metapath": "", "pub": "umass", "title": "2012-01-humanities-student-major_523_umass.txt", "pub_date": "2012-01-13T00:00:00Z", "Sentiment": "0.153", "Subjectivity": "0.373", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "334", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3h155i", "Reddit_id": "c3h1l7n", "Subreddit_id": "t5_2qowg", "Commenter": "saranghaeyo", "length": "1964", "content_scrubbed": "Southwest is kinda loaded with the bros and hos. Van Meter (my dorm) just got renovated this summer and I absolutely love it. It[.] on top of the hill in Central and I call it High Central - mostly because it smells like pot everywhere every weekend and often on the weekdays. The people there are mostly the artsy type and are pretty chill in general. So: new, chill, party and non-party, awesome basement, right next to O-Hill and the road to Amherst center. The lounge areas are amazing, laundry[.] awesome, kitchen[.] top notch, and it[.] the place if you play music. I don't drink/do drugs but I still like it there. \n\nO-Hill: big rooms, clear room division, lots of desk space, nice people, cool closet setup (you get your own little corner). I would definitely like to live here for my next few years on campus.\n\nRoommates are pretty much random. I found my roommate through the UMass 2015 page on facebook. Originally we wanted to like in Northeast... Pft. If you're like me, you'll barely spend any time in your room. If you're like some people I know, people will always be in YOUR room. Make sure you go over: temperatures you're comfortable living in, cleanliness level, music tastes/habits, any large objects you're bringing, and sleeping habits. \n\n[AP credits](http://www. umass. edu/newstudent/downloads/APSheetFall2010. pdf). You get credit and most likely GenEd credits. Senior year I signed up for AP human geography on a whim, barely read the AP book (skimmed first 100 pages and went to sleep), got a 3. That covered 2 gened categories, basically. If you have the time/money, take some easy geneds-covering APs (cough APHG cough) because it saves you an entire semester[.] work.\n\nYou declare a major whenever you want, basically. Do you have any idea as to what you'd like to major in? If you're in any way interested in any major, feel free to ask! I know a lot about the colleges of sciences/humanities/engineering if you're into any of those fields."}