{"doc_id": "1511", "name": "2012_01_humanities_student_major_67_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2012-01-humanities-student-major_67_politics.txt", "pub_date": "2012-01-02T00:00:00Z", "Sentiment": "0.185", "Subjectivity": "0.519", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "282", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3dfiij", "Reddit_id": "c3dfn2v", "Subreddit_id": "t5_2cneq", "Commenter": "fdtm", "length": "1706", "content_scrubbed": " I never placed STEM as second-class. \n\nMaybe I phrased it incorrectly.\n\nAdvanced mathematics should be *the* most important thing any student in any intellectual profession should learn. Math is NOT an equal, but MORE important than all else - including engineering, humanities etc. - with the possible exception of philosophy. I believe philosophy and math are intimately related.\n\n I've seen engineering students that can barely put together a coherent paragraph. \n\nI've seen some pretty dumb engineering students for sure. But only in non-engineering/science is it apparently the \"cool\" thing to be ignorant of higher mathematics. This is not, in fact, cool.\n\nIt[.] just as bad as saying \"lol I can't read.\" Being mathematically or scientifically illiterate is NOT okay. (Again, this is said by Neil Tyson, and I am just loosely quoting him.)\n\nYou have to understand, when people like you argue that higher mathematics should NOT be the \"best and most wonderful discipline\" in education, it only shows your ignorance of having not learned it.\n\nMe arguing this with you is like me arguing with a creationist or anti-education extremist and trying to convince them that higher academics are important. If you don't learn it, your mind will never be opened to how profoundly important it is for everyone to learn. Until you learn advanced math, you have no idea what I'm talking about.\n\nThis is a big problem, and it makes me sad to see arguments against math formed out of ignorance like this. Cultures today that value high mathematical proficiency will leave the USA in the dust if we do not fix this. Once again, refer to writings/interviews of Neil deGrasse Tyson for a very good explanation of this. "}