{"doc_id": "639", "name": "2012_02_humanities_student_major_422_mensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "MensRights", "title": "2012-02-humanities-student-major_422_MensRights.txt", "pub_date": "2012-02-13T00:00:00Z", "Sentiment": "0.008", "Subjectivity": "0.345", "Score": "28", "Upvotes": "28", "Downvotes": "0", "Wordcount": "553", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3qrq0y", "Reddit_id": "c3qsbva", "Subreddit_id": "t5_2qhk3", "Commenter": "LeeHyori", "length": "3429", "content_scrubbed": "Maybe your medical science degree did, but not every degree does. Every stupid program likes to lay claim to \"critical thinking,\" but they teach absolutely nothing of the sort. It[.] just a catchphrase that shitty universities like to employ. \n\nFor example, the amount of critical thinking that appears on a daily basis in a biology program is much less than the amount of critical thinking that may occur in a rigorous philosophy program. But, look, there[.] nothing inherently wrong with that; that[.] not the meaning or scope of biology. It[.] just what they study, and students of biology can pick up their critical thinking skills separately, or by reflecting on the material themselves. What we mean by the liberal_arts stimulating critical thinking is more precisely that the material itself is closely tied to the products of critical thinking (e. g., thought experiments, branches of philosophy like epistemology, formal logic, etc.). \n\nI'm still frequently baffled at how narrowly I've thought about some things, even though I consider myself a reasonably critical person. Think about these introduction level questions, for instance: What[.] the nature of the law? What constitutes knowledge? What comprises \"liberty\"? Is there a \"right\" and a \"wrong\"? Should we be principled or effective, or do consequences bring about good principles, or do good principles bring about good consequences? Why should we even tolerate other views? What about the more difficult questions, like whether or not faultless disagreement is possible with our intuitive understanding of binary logic? What is the nature of mathematics, and what do mathematical objects represent? \n\nNow, try to think about them without any of the assumptions you might have never realized were merely assumptions or axioms in your worldview-logic. Using the law question, we might say \"laws are there to protect people from harming each other\" (a kind of Millian no-harm interpretation) or are \"an expression of coercion.\" But, there are laws out there that do not subscribe to this rule and are completely arbitrary, like which side we stipulate driving on the road. You could make an argument for organization and safety, but the nature of having chosen right or left remains arbitrary, and worse, that[.] only if you firstly assume that organization and preserving life are good things. And, \"to protect people\"? Which people? You mean, individuals? Who are individuals? How do we define \"the individual\"? Our sense of individuality and the boundaries of our person can be completely lost when the_left side of our brain is turned off or hemorrhaging. And, more importantly, why do we put the \"individual\" on a pedestal anyway? Individualism, as an idea, is a fairly new concept, and possibly as artificial as anything else. So, how do we escape the classical liberal paradigm, and can we logically justify our laws more universally? Conversely, if we entertain collectivist notions, can we divorce collectivist morality from utilitarianism? What implications does this have on the way we view the law? Heck, is judicial review anti-democratic? Wait, is democracy even a good thing?!\n\nSince you did medical science, let me ask you a fun question, one I like to pose to people who claim that philosophy is useless because it'll never cure cancer (not that you think that, since you seem to hold philosophy in a higher regard).\n\n*Why should we even cure cancer?* "}