{"doc_id": "696", "name": "2012_10_humanities_student_major_148_circlebroke", "namespace": "we1sv2.0", "metapath": "", "pub": "circlebroke", "title": "2012-10-humanities-student-major_148_circlebroke.txt", "pub_date": "2012-10-04T00:00:00Z", "Sentiment": "-0.137", "Subjectivity": "0.492", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "318", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6hedgs", "Reddit_id": "c6hfq1a", "Subreddit_id": "t5_2tnz9", "Commenter": "[deleted]", "length": "1871", "content_scrubbed": "The fad-antifad pair spontaneously regenerates itself, almost fractally.\n\nYou have, in one sentence, managed to convey why I've wearied of the term 'circlejerk', and it all started with that stupid fucking xkcd strip.  The one at the bottom of the page.\n\nIt[.] a worthless infinite regress of an argument.  Not every opinion held en masse can immediately be dismissed by calling it a circlejerk.  If you're an asshole and a hundred people call you on it, it doesn't mean they're giving each other high fives for holding a contrary opinion - it means you're a fucking asshole.  Everyone hates Romney this week, it[.] the \"Romney-hate circlejerk\".  People start calling others out on the Romney-hate circlejerk, suddenly they're guilty of the anti-Romney-hate circlejerk, then some douchebag posts that xkcd comic.  It[.] all such a complete waste of time.\n\nMan, I hate the way people fawn over xkcd.  Guy writes down some vaguely philosophical thoughts and draws a shitty stick figure, producing the equivalent of a goddamn bumper sticker and apparently he[.] a fucking genius.  And you know what really burns me up about it?  If he was a liberal_arts major, everyone would be leaping to decry it as worthless art from a pretentious snob who couldn't draw.  But because he[.] a mathematician, it[.] totally okay.  Fuck you.\n\nThing is, Randall Munroe even acknowledges how recursive the argument is in the alt-text, so at least he[.] aware of how stupid the strip is.  That[.] not much of an excuse though.\n\nIt[.] so tiring, an entire website of people who just refuse to engage on any definitive ground whatsoever, just an endless fucking dance around every real interesting issue there could be to the tune of the same twenty jokes repeated over and over and over again.  NOT EVERYTHING HAS TO BE A JOKE OR CAN BE MADE INTO A JOKE ESPECIALLY IF IT'S A BAD ONE.\n\nAnyway, good post."}