{"doc_id": "804", "name": "2012_10_humanities_student_major_1386_martialarts", "namespace": "we1sv2.0", "metapath": "", "pub": "martialarts", "title": "2012-10-humanities-student-major_1386_martialarts.txt", "pub_date": "2012-10-28T00:00:00Z", "Sentiment": "0.056", "Subjectivity": "0.234", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "317", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_127u4q", "Reddit_id": "c6svong", "Subreddit_id": "t5_2qkt4", "Commenter": "quicknote", "length": "1827", "content_scrubbed": "They may be a legitimate Hawaian Kempo school (admittedly it[.] not a style I'm particularly aware of) but their MMA classes are incredibly suspect. It appears that they are trying to Cash In on the popularity of Mixed Martial Arts, without having anyone qualified to actually teach any of the things that make up Mixed Martial Arts. (this may NOT be the case, but they've managed to make it look that way on the site).\n\nTheir head instructor, whilst a black-belt in his style, doesn't really tell you anything about his Brazilian Jiujitsu background other than the fact that he has attended a bunch of seminars to boost his credentials (\"I've trained under A MILLION NAMES!\") without actually telling you what his credentials ARE.\n\nHe says he is RANKED in Gracie Jiujitsu under Royce Gracie, but being a no stripe white belt who attended one class is still classed as being ranked... Not disclosing what your rank is, or properly discussing your lineage in the arts appropriate for MMA is a HUGE red flag. \n\nIt[.] also incredibly concerning that two of his assistant instructors are children... That certainly is not something you'd usually find in a legitimate MMA school. \n\n\nI highly suggest you call him and ask a fair few additional questions: \n\nA) What is his rank in Brazilian Jiujitsu, when did he get it, and how long has he been practicing BJJ. (Also, ask him the same about the other MMA appropriate \"styles\" he has \"ranks\" in). \n\nB) What is his amateur or professional MMA record? . \n\nC) Do his students regularly compete in BJJ, MMA, Judo, Sambo, or any of the other arts listed? If so, what is their competition record? \n\n\nHe may well run a legit school, with a legit background, but if he DOES, he really needs to update his website with his actual ranks, and probably not have children advertised as teachers.... "}