{"doc_id": "1559", "name": "2012_01_humanities_student_major_580_technology", "namespace": "we1sv2.0", "metapath": "", "pub": "technology", "title": "2012-01-humanities-student-major_580_technology.txt", "pub_date": "2012-01-15T00:00:00Z", "Sentiment": "0.023", "Subjectivity": "0.254", "Score": "16", "Upvotes": "16", "Downvotes": "0", "Wordcount": "489", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3hk4ge", "Reddit_id": "c3hl4c4", "Subreddit_id": "t5_2qh16", "Commenter": "duffmanhb", "length": "2892", "content_scrubbed": "Yep! This is my biggest irritation when talking with freshman liberal_arts majors. They don't understand economies and their long_term growth.\n\nMany people talk about how terrible children working and making so little money. Many of these people would be surprised to hear that many of these African countries that employ this type of labor are actually begging for factories to come to their rural towns. Why?:  \n\nFirst, without these factories there aren't many jobs nor is there much money to facilitate a healthy economy. Without these \"low pay\" jobs, these people aren't at the bottom of the economic ladder, their on the floor, no where near the ladder, miserably stuck in poverty for the rest of their life. The outlook is depressing.\n\nSo what happens? A factory moves in, and people living in these farms walk miles and miles, barefooted to their low paying job. Why? People aren't forced to do this, they choose to do this because they have determined it[.] worth the blusterous walk. \n\nSo, now they have a job! And they are making money! And what do you know, people start saving up and starting small businesses around the villages. Now there is money when there wasn't any before. People are now buying and selling, fueling the economy. Months later, no one is any longer walking to work, they bought a bike to bike to work! And as any economist will tell you, mass transportation availability is one of the most crucial aspects to developing an economy. Now, people are importing and exporting their goods to surrounding communities.\n\nNow, while being paid very little, a whole economy has sprouted. People have transportation, can buy mosquito nets to protect them, and afford medication when the previously couldn't. Come the next generation, kids are now going to school and getting educated. Granted, by now, most of these factories are gone to other cheap labor, but their job is done, they've planted a seed leaving behind a community now on the economic ladder that is now self sustaining. They have transportation, they are getting more educated, and new jobs are emerging every week...\n\nChild labor looks bad from a first world perspective, but sometimes people have to take a step back and realize every industrialized nation went through this phase. We are no exception.\n\nEDIT: Due to some controversy, I will quote Jeffery Sachs who is the leader on this subject and is held in extremely high regards. Also makes for a great **TL;DR**\n\n When countries get their foot on the ladder of development, they are generally able to continue the upward climb. All good things tend to move together at each rising rung: higher capital stock, greater specialization, more advanced technology, and lower fertility. If a country is trapped below the ladder, with the first rung too high off the ground, the climb does not even get started\n\n- Jeffery Sachs, The End of Poverty, 2005"}