{"doc_id": "596", "name": "2012_02_humanities_student_major_9_rva", "namespace": "we1sv2.0", "metapath": "", "pub": "rva", "title": "2012-02-humanities-student-major_9_rva.txt", "pub_date": "2012-01-31T00:00:00Z", "Sentiment": "0.149", "Subjectivity": "0.382", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "611", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p2xca", "Reddit_id": "c3mpj4i", "Subreddit_id": "t5_2qpvj", "Commenter": "k_k_dawg", "length": "3792", "content_scrubbed": "Foreign affairs major here. I don't want to say you're shit outta luck but... the NoVa/DC area is really a better place for IR-type jobs/internships. There[.] just more companies and opportunities there. That said, definitely try:\n\n[USA JOBS](http://www. usajobs. gov/)- Federal jobs - Not sure if they update on the regular but sometimes you get lucky and find an opening near RVA\n\n[VA Employment Commission](http://www. vec. virginia. gov/vecportal//index. cfm) - Pretty good, have tons of resources for job hunting. \n\n[Commonwealth of VA Job Site](http://jobs. virginia. gov/) - If you're looking for local gov't type jobs. They update pretty regularly. I found an amazing part_time gig on here that I absolutely love. \n\n[Indeed. com](http://www. indeed. com/jobs?q=&l=Richmond%2C+VA) - Love this site. It doesn't have the same volume of listings as good ol' Craigslist, but they're going to be less scammy. A pretty good overview of what kind of companies are going to be hiring. \n\n[Craigslist](http://richmond. craigslist. org/) - Yes, it[.] fucking sketchy. Are you going to get spammed within an inch of your life? Are people in Nigeria going to attempt to steal your identity? Will you feel like curling up into a ball and crying when after applying to 50 postings you still haven't gotten any response? Are you going to get bored, give up, and start perusing the 'Casual Encounters' after an hour? Yes, yes, yes, YES. The trick is be smart and be persistent. If it sounds too good to be true it probably is ($500 dollars a week to mail packages for a busy exec who[.] always out of town - keep fucking dreaming...). Never give out any crucial info on CL, if you're sending out resumes, include your real phone number, make a new e-mail address just for job apps, don't sign up for any online credit checks, DO NOT give out your social, yadda yadda yadda. I'm assuming you're familiar with the internets, just trust your instincts. \n\nThe reason I say this is because the two legit real world full time professional jobs I've had since graduating from college I've found on CL. Salary, benefits, 401k, the real deal. But boy, was it a lot of work and bullshit. In my most recent search this fall/winter I think I applied to about 100-125 jobs total, got a few legit phone calls back, went on like 10 interviews, wound up with one part_time job and one full time job, against all odds. \n\nYou know the saying - treat the job search like it[.] your job. Talk to friends in the area, network, look up companies you may want to work for and get in touch with them... it[.] true that a lot of positions AREN'T going to be advertised. You're the one that has to search for them. \n\nMan this is getting lengthy. Before I go, have some more links!\n\n[Top 50 Employers in RVA 2011](http://www2. timesdispatch. com/business/local/companies/top-50-employers-2011/) - This should help get you started if you're pretty open to what you want to do. Big ones are going to be in finance, insurance, hospitals, VCU/MCV. \n\nAlso, temp agencies - some assignments you may get will be just that... temporary, but some have the potential to turn full time. It can't hurt, if you don't mind menial office work for a while. The ones that seem most legit to me are [RemX](http://www. remx. com/) (got me A LOT of interviews, and are really good about keeping in touch with you), [Kelly Services](http://www. kellyservices. com/web/global/services/en/pages/index. html) (but they mostly staff research/science jobs), and [Today[.] Office Professionals](http://www. todays. com/home. jsp) . \n\nI hope that helps. To anyone else reading this and looking for jobs, good luck! If you need any more info/encouragement/advice PM me, I'm a liberal_arts major (art/foreign affairs) who[.] been through the job hunt meat grinder, I know. Don't give up. "}