{"doc_id": "758", "name": "2012_10_humanities_student_major_867_astrophysics", "namespace": "we1sv2.0", "metapath": "", "pub": "astrophysics", "title": "2012-10-humanities-student-major_867_astrophysics.txt", "pub_date": "2012-10-18T00:00:00Z", "Sentiment": "0.17", "Subjectivity": "0.279", "Score": "19", "Upvotes": "19", "Downvotes": "0", "Wordcount": "425", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11q57q", "Reddit_id": "c6omsrq", "Subreddit_id": "t5_2rg22", "Commenter": "DrPhilipBishop", "length": "2438", "content_scrubbed": "To begin, you must realize you'll need to get a LOT more schooling to accomplish this. B. S. in physics, M. S. and Ph. D. That is a minimum of 9 years (less if you are some super-driven individual). \n\nNow that we have that understood, your best bet is to take the highest level science and math courses your school offers ... all of them. In addition, you want to dual enroll at your local community college and take all the physics and math classes they offer ... preferably before you finish high school. Use your summers wisely by taking summer courses without overloading yourself. Talk to your guidance councilors ... if they aren't helpful, talk to your school administrators. Work it out so you can overload in science.\n\nNext, you need to study for the SAT / ACT and do VERY WELL on the math section and as well as you can on the verbal section. This is hugely important. Score as well as you can on the PSAT as well and it makes everything easier. Do what you can to apply for as many scholarships as apply to you (even if you don't need them - its for the prestige). The more national or global the scholarship, the better.\n\nNow you need to be selective in your schools that you apply to. You want a school heavy on science, particularly astro-physics. Obvious candidates are M. I. T. and Cal-Tech, but this isn't my area so do your homework.\n\nObviously, you'll need a high GPA, but you also need to demonstrate an interest in research so look for any sort of scientific research even remotely related to astro-physics in your area. Offer to sweep floors, clean equipment, whatever they will allow you to do to prove you are a hard_worker. Be thorough, be diligent, be GOOD at what you do. Get a letter of recommendation from the researcher. Send it with your application.\n\nOnce you are at a top notch University, you'll want to focus your attention on Physics and Math, but don't forget the humanities. They are not merely required courses; they'll aid you in critical thinking and open-mindedness necessary to be a good scientist. \n\nAll along the way, I'd advise using [Khan Academy](http://www. khanacademy. org/) to get math/science under your belt before you take it for credit. Start reading Scientific America and Discover every month. Try to find out what interests you the most. Begin reading scientific papers on those phenomenon as soon as you have the required background in those fields to comprehend what they are saying. "}