{"doc_id": "647", "name": "2012_02_humanities_student_major_567_unt", "namespace": "we1sv2.0", "metapath": "", "pub": "unt", "title": "2012-02-humanities-student-major_567_unt.txt", "pub_date": "2012-02-17T00:00:00Z", "Sentiment": "0.097", "Subjectivity": "0.417", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "687", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3s8jmj", "Reddit_id": "c3s9gqs", "Subreddit_id": "t5_2s5gf", "Commenter": "tallasse", "length": "3846", "content_scrubbed": "The problem isn't with the basic logic, the problem is that you're being pretty hypocritical. You basically are mad that they're not focusing on what you want, while pointing out things that benefit other people as wasteful.\n\nI realize that graduate research is important. I make websites for hard-earned grants every day - but I was pointing out that it doesn't directly benefit undergraduates. By your logic, they shouldn't have to pay for it. You're mad that Business got a new building - even though it benefits all the students of the College of Business, you complain that it[.] wasteful because you're not a business student. The Rec Center was soundly rejected by the students at the time it was funded, because they weren't going to be able to use it during their time at UNT - but you think it was a good idea because you use it.\n\nYour perspective is entirely based around your needs and wants, and is totally unrelated to whether the policies benefit the university as a whole. Do I think that UNT goes for some boondoggles? Sure. Do I think that tuition and fees are rising too quickly? Fuck yeah, I have a not-inconsiderable pile of student debt I'm paying off. But I also recognize that 1) You're not going to find a magic university that doesn't raise fees whenever it can. The whole system could use an overhaul, but that[.] not likely to happen. And 2) alumni support is huge to the prestige and endowment of a university (and the funding of a large number of scholarships) - and to build up alumni support, you have to build a long_term support network. UNT has been a commuter school for decades, and for the great majority of people, graduation was the end of it. They didn't look back, they didn't care about the university, it was just a place to get a degree. It wasn't an institution in their lives.\n\nAll this building and branding and ad campaigns and giveaways spend a lot of money and effort to change that, to build student involvement with the university community. Things like a student union, athletic programs, better dorm experiences, expensive dining halls, and the like are key to building that sort of spirit. When I started at UNT, no one gave a shit about school spirit or about being proud of UNT. We thought the Rec Center was a waste of money, we thought new dorms were a waste of money,we thought the stadium was a waste of money. We thought all the rah-rah shit was a big joke, didn't they know we were a music and liberal_arts school? But over time, new students came in that didn't realize that it was a big joke. At first we thought it was funny, but it wasn't a joke to them; and over time, it stopped *being* a joke. Over the last decade, these programs have started to pay off; people are actually proud to go here, you see a ton of green on Fridays, and people actually attend sports games in the new stadium. Since 2000, UNT has formed the College of Engineering, the College of Information, bought the Research Park, built Chemistry, Life Sciences, and the BLB, renovated all over the place, and UNT is starting to appear on best-of lists. It[.] attracting better students, and it[.] been able to raise entrance standards. It[.] not just a \"backup\" or \"last resort\" school anymore.\n\nI used to agree with you, that it was all wasted money that could be spend on academics and arts. Even though I graduated in Computer Science I still think that our arts and performance programs need a serious funding boost. But overall I've been able to watch it work, both from inside and from out, and things like the stadium and increasing student services through a Union designed to serve 40000 students instead of 15000 will help build those \"university experiences\" and increase the alumni network. Yeah, you won't benefit from it in your time here. It[.] a decades-long strategy - but it seems to be working."}