{"doc_id": "752", "name": "2012_10_humanities_student_major_810_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2012-10-humanities-student-major_810_TwoXChromosomes.txt", "pub_date": "2012-10-17T00:00:00Z", "Sentiment": "0.028", "Subjectivity": "0.292", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "571", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6o1ml2", "Reddit_id": "c6o77bw", "Subreddit_id": "t5_2r2jt", "Commenter": "NeverxSummer", "length": "3130", "content_scrubbed": "Amherst pretty darn right_wing as far as liberal_arts institutions go. This is where the rich people send their jock son, Williams is where the smart guy goes, and Bennington is where that daughter we don't talk about goes (these are all traditional stereotypes that reflect old versions of the schools, not really true now). They were also a men[.] college, so perhaps there is still some ingrained (ugh) \"patriarchy\" issues. \n\nOn the flip side of things, the same shit happened at Bennington which is known to be the most Gay Friendly college in the country (bullshit, I was closeted as a bisexual because people are incredibly close-minded). So it should supposedly be forward thinking and progressive about women[.] issues on campus. Wrong. I went through hell trying to get an ex who was harassing/threatening after having previously STABBED MY STUFF over the summer me to not be allowed in my house at school or initially to just stop bothering me. \n\nI was told much like the girl in the post that I was overreacting, and surely it could be handled civilly. I was afraid to go visit one of my besties in her dorm because he was relocated to live there. He was told that he shouldn't have communication with me, he cornered me multiple times *in my house* and threatened other housemates, being a general shitbag. I was told that it wasn't a big deal. He graduated in the fall and was not permitted back on campus. I went to Italy for the winter semester. Got a few salty emails before I left, creepy but whatever. \n\nThen, I get one that[.] pretty much a death threat, fear for my life even though I'm on the other side of the ocean... email the dean of students (small college, direct bureaucracy) who I had been talking to about this, telling her I feared for my safety upon my return. She forwards the email to the new director of campus safety. He[.] like LOL NOT A BIG DEAL, but let us know if anything else happens. \n\nApparently, he had been on campus a few times early in the spring semester, I was perpetually scared shitless as he knew where to find me. I don't hear from him for a few months, figure that last email was him letting off steam and he[.] over it now--wrong, almost 6 months after the fact get this CREEPY fucking postcard, which was the happy toned manic version of the email. Did I mention it was a post card?! It[.] after business hours when I picked up the letter, so I head over to the campus safety booth to get a hold of the director. One of the older guys who worked there was like what[.] up? Took a look at the letter and was like, \"you should get a restraining order.\" **It had never occurred to me before then to get a real restraining order** because they didn't present it as an option, because they didn't want campus rape/assault numbers to go up. It would have been much more useful back in the fall before that. Then I went through court proceedings 5 times because they couldn't find him to serve him the papers, I think his dad tipped him to ditch. \n\nTL;DR: Not just a problem with Amherst, other schools do this too—even ones that are supposed to be bastions of liberal women[.] education."}