{"doc_id": "807", "name": "2012_10_humanities_student_major_1421_cork", "namespace": "we1sv2.0", "metapath": "", "pub": "cork", "title": "2012-10-humanities-student-major_1421_cork.txt", "pub_date": "2012-10-29T00:00:00Z", "Sentiment": "0.168", "Subjectivity": "0.4", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "376", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_129ep9", "Reddit_id": "c6tbx8p", "Subreddit_id": "t5_2rl9n", "Commenter": "DumbMattress", "length": "2071", "content_scrubbed": "UCC is a fine university, but if you're asking about the quality of education it depends on what you're studying. The Med school is great, so are a lot of the bio-sciences and Law is pretty good too. I graduated a history major, and the humanities departments aren't the best. They're not bad by any means (in terms of college rankings they'd be miles off, say, Columbia in NYC) but nationally would be secondary to Trinity College up in Dublin. \n\nRe: foreign students in Cork? I have many ex-pat friends and they all seem to love the place - though I can't understand why with the kind of weather we have.\n\nIn terms of costs, you'll save yourself a fortune on tuition as you already know. The cost of living in Ireland (while high compared to the European average) is probably similar to New_York (some things will be cheaper, some more expensive), I'd guess a student[.] living expenses would be significantly less here than in NY. \n\nMy advice would be to spend time finding a good house share on daft. ie\nYou probably want something within 15-20mins walking distance from college, but trust me, if you value living in a nice environment, you don't want to live next door to college or in any of the big student apartments complexes - they are all crappy and if you spend some proper time searching you'll be able to find a nice house share in a decent location.\n\nRe: cheap places to shop, this stuff is self evident in Cork. You'll be a student and thus limited to the city center, going off to the retail outlets in the suburbs would be a bit inconvenient. My advice: Tk Maxx do cheap discounted clothes, you just might have to spend an hour or two in there to find what you want. Don't ever shop for clothes in Penny[.] if you value your self-respect, it[.] a horrible hole that half of Cork uses to dress themselves. Lidl/Aldi is cheapest, Tesco is cheapish. But honestly, if you're buying food, go to a local butcher for meat and veg. If you're living in the city center, you'll be totally spoilt for choice in the English Market. \n\nHappy hunting!\n\nP. S. Buy rain gear."}