{"doc_id": "764", "name": "2012_10_humanities_student_major_943_askscience", "namespace": "we1sv2.0", "metapath": "", "pub": "askscience", "title": "2012-10-humanities-student-major_943_askscience.txt", "pub_date": "2012-10-20T00:00:00Z", "Sentiment": "0.013", "Subjectivity": "0.303", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "304", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11tmmc", "Reddit_id": "c6ph700", "Subreddit_id": "t5_2qm4e", "Commenter": "internet_sage", "length": "1725", "content_scrubbed": "There is a major difference between these things: \n\n1) Doing Science\n\n2) Publishing Scientific Research\n\n3) Making a living as a Scientist \n\nI guess the first question is how you are defining scientist. If it[.] anyone who does science, than obviously no degree is needed. Children do science all the time. Anyone who works with their hands does. Anyone who cooks or bakes does. Design an experiment, execute it, observe the results, and take them into account when you do it next time. Learn from what you see. \n\nPublishing scientific research is a different story. It is very hard to get published with no reputation, and no laboratory or research group to back you up. Without such a peer group, you don't have anyone to guide you through the writing and submission process. Is it possible to do it alone? Sure. But it[.] damn hard. Thus you're more likely to be able to publish if you're attached to a research group or laboratory. And if you're attached to one of those, you're probably already got a degree, or you're working on one. Also, a lot of liberal_arts colleges give out BAs for science degrees. Doesn't make sense, I know. But there are plenty of Biology and Chemistry BAs running around doing science and publishing stuff. \n\nTo make a living as a scientist, you definitely don't need a degree. There are a lot people involved in science, from all walks of life. It[.] harder to get an interview, let alone a job in the sciences without a degree in the field, or something related. However, it[.] definitely possible. I know plenty of IT people who are the foundation research groups are built on, and who get their names on every publication because of that. Some have a BS, some other degrees, some no degrees. "}