{"doc_id": "693", "name": "2012_10_humanities_student_major_108_personalfinance", "namespace": "we1sv2.0", "metapath": "", "pub": "personalfinance", "title": "2012-10-humanities-student-major_108_personalfinance.txt", "pub_date": "2012-10-03T00:00:00Z", "Sentiment": "0.13", "Subjectivity": "0.427", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "318", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_10ul5n", "Reddit_id": "c6gyhta", "Subreddit_id": "t5_2qstm", "Commenter": "[deleted]", "length": "1860", "content_scrubbed": "Shop colleges with cost in mind, but also quality of education. Do **NOT** base your decision on US News & World Reports or \"schools that everyone says are good.\" A lot of private universities are riding on reputations of decades past - I'm not saying they're not good; just that they're not $150,000 better than a solid state university. \n\nSo whatever you want to major in, find out what makes a good university. For example, if you have a passion for nuclear physics, there are universities that have active reactors for experimentation. If you like aerospace engineering there are schools that have their own wind tunnels (plural). If your passion is the liberal_arts, many schools have a McDonald[.] on campus...\n\nPay no attention to \"number of publications by professors\" - it[.] irrelevant, and time spent writing for journals is time not spent teaching. \n\nLook at class sizes, availability of professors, availability of courses. See what you can find out about trends - is the major you're interested in well-funded and thriving? Or anemic? For various upper level courses are there several sections? Waiting lists? Or are courses often cancelled because not enough students registered? \n\nYou're shopping for a service, and the service is teaching you a subject. Choosing a good school that won't bleed your parents dry but gives you a good education is your first step  - you learn more, save money, and learn how to research a major purchase. \n\nThen ask your parents to set aside the money they save because you didn't go to $ReallyExpensiveSchool - put it into a trust for you (other PF folks will have better advice on how to handle this part). \n\nFinally, start now - take that $2,000 and put $200 into an investment/savings account. Get used to putting 10% in there when you get any kind of income. Put more if you can, but always at least 10%. "}