{"doc_id": "787", "name": "2012_10_humanities_student_major_1272_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-10-humanities-student-major_1272_AskReddit.txt", "pub_date": "2012-10-25T00:00:00Z", "Sentiment": "0.054", "Subjectivity": "0.244", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "310", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_12336o", "Reddit_id": "c6rqljq", "Subreddit_id": "t5_2qh1i", "Commenter": "Duncreek", "length": "1839", "content_scrubbed": "Zoos probably hire zoologists... anyway, while these might not have as much available work, it is possible to make a career out of any of those listed things. \n\nSecond languages, like French? Translation is a big deal, and for all that electronic means of doing so exist, they are clumsy for real time and still need to be double checked when used for a document.\n\nAdmittedly English and History tend to lead to teaching English and History, but there is still something to be said for museums and archaeology for history. english_major should in theory have the requisite skills to work at editing manuscripts and other documents before they are published.\n\nAfrican Studies is interdisciplinary, and related to Africa... so, while again there aren't many jobs, and there[.] probably strict competition for them, work with various organizations that either have business or non-profit work in Africa should be an option. It[.] called the \"developing\" world, and it doesn't develop without someone putting it under an academic eye.\n\nThe arts? There[.] a lot of broken dreams on this one, with success being so difficult to find, but society continues to enjoy and consume art and entertainment. A few of these people will make out well in this field for the education they received. And the rest still contribute... well, art. Like it or not, that element of culture is important.\n\nAnd the real kicker here? Browse the jobs section of your local paper, or on Craigslist. Look for \"ONLY STEM DEGREES NEED APPLY SERIOUSLY\"... and you won't find it outside of specialized tech fields. Many others, even within the tech industry, will accept any four year degree. It[.] why you can have a tech company where one guy has twenty+ years experience and no college, one has a tech degree, another has an economics degree, and two have English degrees. "}