{"doc_id": "600", "name": "2012_02_humanities_student_major_53_foodforthought", "namespace": "we1sv2.0", "metapath": "", "pub": "Foodforthought", "title": "2012-02-humanities-student-major_53_Foodforthought.txt", "pub_date": "2012-02-02T00:00:00Z", "Sentiment": "0.056", "Subjectivity": "0.292", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "909", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3n4y7n", "Reddit_id": "c3n54jz", "Subreddit_id": "t5_2rete", "Commenter": "HeadphoneWarrior", "length": "5292", "content_scrubbed": " Philosophy and political science are often used as pre-law degrees. Even if you don't pass the bar, an education rooted in the idea of ethics and governance opens up positions in the corporate world, especially in ethics, compliance, and human resources offices. Students trained in language arts can find work doing journalism or public relations. art_major can learn graphic design skills, and there[.] a lot of demand for good graphic design. Conversely, astronomy is a very hard and very competitive science with limited employment opportunity.\n\nThat is genuinely insightful (at least I missed this part completely), so thank you for that!\n\nIn India, people enter law school as you would enter Philosophy or Political Science degrees - straight out of school - and they get the ethics, oratory, rhetoric etc education in the specific schools. I can attest that students apply to both Engg and Law schools at the same time, and there are competitive exams for these that you must clear.\n\nA bigger issue, one that the author fails to identify, is choice.\n\nExample from nearly a decade ago: In one entrance exam for a university I did not join, I was ranked ~1400. I was ranked in the top 100 for Chemistry, top 800 for Maths, but bottom half (I think ~3000) for Physics. There was a day specified when all ranked students entered the University, and the students who chose to attend, *in order of rank*, were allowed *to pick the engineering stream they would want to do.* At rank 1400, the seats for Computer Science, Information Technology, Electronics, Chemical, and Electrical Engineering were already gone. I did not want to pick Mech, Chem or Civil, so I simply left at the end of the day.\n\nThis is what **KIDS** across the country do. Pick their vocations (if it is law or specific stream of engineering) *on day ~~one~~ zero*. With few exceptions, you can not change after a year or so. You have to attempt the entrance exams *again*, and repeat the entire first few years *again*.\n\nGoing forward, there are few, if any schools with elective subjects. Everything on the curriculum is compulsory. The syllabus is non-negotiable.\n\nA lot of this is down to the fact that the high demand for technical courses means a lot of private colleges affiliate themselves to larger public/private universities. These colleges have small campuses and limited funds. These limits discourage electives because the ROI is small for many subjects. You can not keep a class of just 5 students because it wastes the limited time available out of faculty.\n\nThis also means that very few schools are capable of having research facilities/labs. This is where the author[.] assertion\n\n In this high-stress setting, students want to study whatever will land them a job, creating a college experience much more akin to \"technical training\" rather than intellectual exploration.\n\nis most valid.\n\nHowever, there are two things.\n\n1. I studied in one of these schools. I learned that if you want to learn something, lack of formal opportunity **can not stop you**. I learned programming while studying Electrical Engineering (our university[.] original curriculum did not have C++ for EEs). By the time (3rd year) the university[.] syllabus changed to include programming, I was studying computer networking. In the 4th year, I petitioned the school to get us at least one elective - something that the University syllabus allows for in the final year - and our class was able to study computer networking. However, there was no additional trained staff that could teach us, and the quick fix teacher was not up to the mark. I think I got more out of my own investigations each time than I did in the class room (which served only to narrow my focus to the syllabus handed to us by the University.)\n2. The lack of choice is a more pressing concern because the cultural reason is *vital*. Let[.] live backwards in time for a bit. You're a recently retired, rich and successful man. Your kids are amazing. Go back twenty years. You're rising through the ranks quicker than your peers because you had started your job at a position high enough to be recognized early for your contribution. Your wife is hot, yet a talented, intelligent home maker who makes your family happy and you don't have social headaches. Go back five years. You've got an amazing job because you were at a top college. Go back four years. Age 18, you score 99% in your school exams and ranked 27 in engineering entrances. You can go get a degree from a top, top school that doesn't have a clear job at the end of it but has a liberal_arts component (the 99% cutoff \"New Delhi\" university that the author mentions), or an engineering school (you ranked 27, so you can pick anything) which has a strict syllabus but the only way Facebook will hire you at $90k/yr *IN INDIA* where average salary for an engineer from a tier-2 school would be $6k/yr.\n\nInstead of any analysis on the reasons that allow an allegedly poorer educational environment to *thrive* where students flock to, or suggesting solutions to those symptoms (or the underlying causes), the author is simply expressing a wish - that STEM students in India read more Plato.\n\nIMO that isn't food for thought. That[.] wishful thinking.\n\nTL;DR: If I had a summary I would give it to you."}