{"doc_id": "660", "name": "2012_02_humanities_student_major_667_mensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "MensRights", "title": "2012-02-humanities-student-major_667_MensRights.txt", "pub_date": "2012-02-20T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.294", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "503", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_py22x", "Reddit_id": "c3t9zfc", "Subreddit_id": "t5_2qhk3", "Commenter": "ENTP", "length": "3064", "content_scrubbed": "Here[.] the beef I have with \"patriarchy\".\n\nThe use of the word patriarchy by feminists in a Western, industrialized context downplays and marginalizes ACTUAL patriarchies that exist in countries like Saudi Arabia, Pakistan, and much of the 3rd world.\n\nWomen in Western cultures enjoy an extraordinary amount of privilege, and by privilege, I don't mean some sort of shadowy, abstract concept that cannot be shown or proven (which they also have), I mean the *actual* definition of \"privilege\" which comes from the Latin for \"private law\".\n\nFor instance, almost every state has a \"Council on the Status of Women\" and official police doctrine is based on the \"Duluth Model\" which is a feminist built model in which men are accused (without evidence) of enjoying patriarchal privilege, and therefore not subject to due process. In addition, women have a whole set of assault laws that applies only to them, and actively harms male victims of domestic violence (VAWA).\n\nA quick browsing of incarceration statistics, and the fact that men are given much longer sentences for the same crimes as women, also gives a strong indicator of who the truly \"privileged\" gender is.\n\nFeminism enjoys a privileged position in Universities, and even in other fields, that are not wholly gender related, such as sociology, in which the biased feminist viewpoint is taught as canon. Don't believe me? Check out your Uni[.] class schedule, and look up \"Feminist Sociology\" and \"Women[.]/Gender Studies\". Most of the other liberal_arts courses at University are also taught and graded by feminists, who usually push their unsubstantiated viewpoints as dogma (a film class I just took was a great example of this, I got an A, because I knew what she wanted to hear, as much as it pained me to write it). \n\nFeminist doctrine paints the average man as powerful and privileged by illogically making the assumption that since there is an exceedingly small, powerful portion of society that happens to be composed largely of men (with more and more women joining their ranks) that somehow, magically, this benefits the average man.\n\nThen, using the faulty reasoning I outlined in the previous paragraph, they use this \"privilege\" as an excuse to ignore\n\n* Homelessness, a demographic composed mostly of men.\n\n* Suicide, an awful tragedy in which the primarily effected persons, the victims of suicide, are mostly of men. \n\n* MGM, an awful, strange phenomenon that affects almost exclusively men (in Western cultures, obviously FGM is still a huge issue in the 3rd world).\n\nUsually, a feminist will pipe up at this point with claims of \"benevolent sexism\", which when you think about it... is nothing but a form of victim blaming, really. Men are the victims of these issues, yet somehow it is still the fault of men.\n\nSo, in a country where \"**femin**ism\" is the official doctrine of law enforcement, legislation, the judicial system, the executive branch (joe biden) and the educational system, it[.] a little difficult to take claims of \"patriarchy\" and \"pervasive male privilege\" seriously.\n\n"}