{"doc_id": "676", "name": "2012_02_humanities_student_major_892_science", "namespace": "we1sv2.0", "metapath": "", "pub": "science", "title": "2012-02-humanities-student-major_892_science.txt", "pub_date": "2012-02-26T00:00:00Z", "Sentiment": "0.184", "Subjectivity": "0.462", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "303", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3vc12u", "Reddit_id": "c3vciby", "Subreddit_id": "t5_mouw", "Commenter": "Omnitank_3", "length": "1724", "content_scrubbed": "Darkie, i think there may be a different problem at hand.\nFor example, no matter how open an engineering school is, it gets far more male applicants than female applicants. If it accepts the top X%, then there will still be proportionately more guys than girls. Which is weird considering more girls go to college in the U_S than guys. My college also gives out 50 full ride scholarships, 25 to girls and 25 to guys. Now, with a 3:7 ratio girls to guys (both in applicants and accepted students), the scholarships are then actually in favor of girls (less applicants means each girl applicant has a higher chance of getting the scholarship than a guy applicant).\n\nPut another way, if a science job receives 3 applications from males for every 1 application from a female, and the employer was supposed to pick the most qualified (regardless of sex, race, etc), than its not hard to believe that there[.] a better chance of a guy getting the job than a girl.\n\nThe problem is that we have a culture that encourages women to study in different areas (making super broad assumptions here, forgive me). From the most subtlest hints and cues in childhood, girls become focused on certain areas while men focus in others. \n\nIf a girl is encouraged to pursue her passion for English much more enthusiastically than the praise she gets for excelling in math, she'd more likely than not be inclined to pursue an english_major It[.] not that people still tell women they can't do certain things. It[.] that we unconsciously as a culture still give girls more praise for pursuing the liberal_arts than for pursuing science.\n\nI wish I remembered the articles I had read on this, but there are definitely some papers out there the subject."}