{"doc_id": "1560", "name": "2012_01_humanities_student_major_581_academicphilosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "AcademicPhilosophy", "title": "2012-01-humanities-student-major_581_AcademicPhilosophy.txt", "pub_date": "2012-01-15T00:00:00Z", "Sentiment": "0.069", "Subjectivity": "0.318", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "492", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_oim98", "Reddit_id": "c3hlcd4", "Subreddit_id": "t5_2r7v0", "Commenter": "QFlux", "length": "3097", "content_scrubbed": "First, I want to second robersa3[.] recommendation - at least, how I interpreted, in that you should double major in philosophy and a secondary, practical major such as computer science.\n\nSecond, I should disclaim that I am an undergraduate Junior at the moment who will be applying to graduate school next semester. That said, my end goal has been graduate school since before I began looking for an undergraduate university, and I've conducted myself ever since with that in mind.\n\nIt is on that note, in which I want to give you advice: If you are serious about this, then you can't accept any excuses from yourself. Educate yourself as much as possible.\n\nOn the specific note of applying to graduate schools: Stay in the loop by visiting sites such as [Leiter Reports](http://leiterreports. typepad. com/) and [New Apps Blog](http://www. newappsblog. com/). You may find the postings there tangentially related from a philosophy perspective, but often times posts and discussions regarding graduate school will pop up; either way, the posters are professors so they know what[.] going on in the philosophy industry. Monitor the [Philosophy Who Got In](http://who-got-in. livejournal. com/) forums for this year, and read the archives of past years. These forums follow students as they go through the admissions process until the very last acceptances and rejections are given out. A lot of important information can be gleaned from there. Also, read through [this professor[.]](http://schwitzsplinters. blogspot. com/2007/09/applying-to-philosophy-phd-programs. html) blog postings about the admissions process.\n\nAs for undergraduate universities to look at... my advice is not to go to a small private liberal art college, but to the best philosophy department you can. The cons are that it will be more difficult to make contact with professors, but the education and letters and opportunities given to you will be much better pros. That said, a liberal_arts college won't hold you back. You may just have to get an MA first. For a ranking of departments, look [here](http://www. philosophicalgourmet. com/overall. asp). [Yes, there are a lot of things wrong with the Gourmet Report even for what it is, much less as advice for people looking for an undergraduate university to attend - but this is probably the best advice one can reasonably expect to give in an online post. If pressed I can give my rationale.]\n\nAlso, because someone will probably eventually come by and tell you not to do this: he[.] right. Don't do it. Graduate school is competitive as hell, and the job market so much more so. Brilliant undergraduates who graduate summa cum laude from prestigious departments, who win Fullbrights/Marshall scholarships, receive great letters of recommendations, perform great on the GRE, and are a perfect fit for a department are getting rejections from graduate school. Do this only if you're insane enough to face the odds.\n\nI don't know why I typed all this up. I'm an asshole and I told you above to not make any excuses for yourself (AKA, do all the work yourself). But anyways, there you go."}