{"doc_id": "664", "name": "2012_02_humanities_student_major_714_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2012-02-humanities-student-major_714_funny.txt", "pub_date": "2012-02-21T00:00:00Z", "Sentiment": "-0.025", "Subjectivity": "0.486", "Score": "23", "Upvotes": "23", "Downvotes": "0", "Wordcount": "413", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3tf9e8", "Reddit_id": "c3tkne4", "Subreddit_id": "t5_2qh33", "Commenter": "ironic_racism", "length": "2533", "content_scrubbed": "Reddit. com is a sweltering hole of pig shit and unfunny memes. Its user base consists of Liberal God-less faggots and cynical neck-bearded BETA males who have spent their entire lives being rejected by members of the opposite sex. All of this had led to the formation of an online cesspool full of bitter nerds and socially retarded manboys. The Liberal Butthurt Syndrome exhibited by Redditors is so well-defined that some of them have even tried to edit this article in order cut out all of the nasty bits about Liberals... only to find out that their butthurt edits are easily reverted by the undo button.\n\nDiscussion on reddit usually consists of one party expressing a leftist viewpoint, the next person agreeing with that viewpoint and a third person making a pun out of the original post. After this point, we hit tldr where it dissolves into a massive circlejerk and an orgy of confirmation bias and self-reaffirmation. To receive karma on Reddit, one must have the political views of an angst-riddled pseudo-socialist college teenager who regularly visits Infowars. com and discusses the perils of corporatism over coffee at Starbucks. Or, if politics isn't your thing and you have a vagina, you can simply post tits. Its politics section serves as an echo chamber for dejected Liberal arts_major who think that socialism is a trendy alternative to capitalism. Its gaming section is littered with nostalgic posts about popular games from the 90s and complaints about Call of Duty being too accepted by the unwashed masses. Its worldnews section is a place where self-loathing Americans, Islamophiles and Jew-hating conspiracy theorists can get together and express their unwavering support for Iran and Hamas. Its atheism section acts as a platform for smug 19-year-olds who want to sit on their high-horses and post Facebook screenshots of themselves arguing with family members that have had the nerve to openly express their Christian beliefs.\n\nTo this day, Reddit users still view their website as a secret online community for counter-cultural warriors and intellectuals, even though the site sees millions of unique visitors and is littered with inane pictures of cats and other painfully unfunny memes. The online consensus states unanimously that users on Reddit seek only to further pervert the \"Advice Animals\" meme (which was, for the record, never lulzy). If you've ever used the phrase \"meta-discourse\" and don't have the balls to get your memes from 4chan the way God intended it, Reddit is the place for you!!"}