{"doc_id": "724", "name": "2012_10_humanities_student_major_457_objectivism", "namespace": "we1sv2.0", "metapath": "", "pub": "Objectivism", "title": "2012-10-humanities-student-major_457_Objectivism.txt", "pub_date": "2012-10-10T00:00:00Z", "Sentiment": "0.072", "Subjectivity": "0.371", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "245", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6k9m5h", "Reddit_id": "c6kfzop", "Subreddit_id": "t5_2qjr6", "Commenter": "UltimatePhilosopher", "length": "1600", "content_scrubbed": "Try talking to humanities_major in places which are in non-south-east-Asia and non-far-east. They are total nut-cases. Most of them are post modern to some degree. That is they believe that science is just another social narrative like voodoo, or mere manipulation of symbols to help delude ourselves.\n\nThis may apply to non-philosophy humanities_major (lit-crit-type fields seem to be the worst and attract the intellectual dregs), but in philosophy there[.] too little tolerance for bullshit.\n\nI wouldn't worry about the philosophy departments being hostile or indifferent-to-neglectful of Objectivism for long.  It[.] really a matter of getting Rand[.] ideas presented in a more academic-friendly format; the main reason she gets dismissed in the phil. departments is due to her non-academic, concise, popular style with the sweeping pronouncements that her long-time students \"get\" but can appear strange to outsiders.  Peikoff[.] recently-published lecture series *Understanding Objectivism* plus some so-far-published academic books provide some much-needed indepth detail that Rand didn't get into because she essentialized so concisely and apparently expected her readers to grasp it as readily as she did (even though there[.] years - decades - of thought-context that she had that many of them do not).\n\nIn any event, the major sign of health in the philosophy profession is how well Aristotle is received, and he[.] been making a comeback in a big way, of which there were barely any signs happening during Rand[.] heyday.  Anscombe, Foot, MacIntyre and many others have helped make it happen.\n"}