{"doc_id": "1587", "name": "2012_01_humanities_student_major_864_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2012-01-humanities-student-major_864_explainlikeimfive.txt", "pub_date": "2012-01-24T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.366", "Score": "20", "Upvotes": "20", "Downvotes": "0", "Wordcount": "462", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3k8dfe", "Reddit_id": "c3k8hvo", "Subreddit_id": "t5_2sokd", "Commenter": "They_Call_Me_Eggbert", "length": "2852", "content_scrubbed": "~~Short answer, yes, there was definitely some interaction. Long answer I will edit in once i write it all in a minute.~~\n\n***tl;dr***, Considering the theory that they peacefully coexisted until Neanderthal died off (or was assimilated, which is highly unlikely), yes, they would be able to communicate, but no, they did/would not have developed into a new half and half species.\n\n\nMultiple factors here. First, it depends on which evolutionary theory you're going off of, the Multiregional Theory or the Out Of Africa theory. The first theorizes that Neanderthals segued into moderns humans directly, so this really puts forth the idea of a close bond and interconnection between the two. The other theory, on the other hand, the Out Of Africa hypothesis, (which is generally more accepted, and more recent) is that modern humans, the species Homo sapiens sapiens evolved in Africa and then dispersed, taking over from Neanderthal populations. \n\nWe're going to look at the Out Of Africa model for this one. (If we were to look at the old model, the answer would clearly be yes, since one is the other and the other is the one.) Essentially, given this theory, Homo sapiens sapiens, the anatomically modern human, AKA Cro Magnon not only interacted with Neanderthal but replaced them. Now there are some more theories to explain this. \n\nAnthropologists love making as many theories as they can. Bear with me here.\n\nThe simplest theory is that Cro Magnon was smarter, faster, and stronger and just over-performed Neanderthal in competition for resources. \n\nAnother more controversial one is that modern human literally and purposefully eradicated Neanderthal. There is archaeological evidence of wounds inflicted on Neanderthal bones by stone tools, so there might be some evidence to this, although we clearly have no evidence of the intent. \n\nThe last theory, and the one that pertains directly to your question is that both species interacted cohesively, and nonviolently. Neanderthal and Homo sapiens sapiens could most likely if not definitely communicate. Supporters of this theory also think that they probably interbred, although we co not know if this is physically possible at all. Essentially, genetic research has determined that Neanderthal is a dead-end cousin of Modern humans, and even if small amounts of interbreeding occurred, they can not be considered a significant ancestor of modern humans.\n\nI feel as though I should put a disclaimer. All of this general knowledge comes from lectures I've attended and class I've taken, I am a STUDENT, not a researcher or a professor. Granted, I know my shit, but I am not an authority. I've attempted to keep my answers as scholarly as possible, but, I mean, I guess a 5yo could understand this? I'm terrible pedantic as well. I apologize. It comes with the liberal_arts/humanitarian degree\n\n"}