{"doc_id": "1544", "name": "2012_01_humanities_student_major_481_oney", "namespace": "we1sv2.0", "metapath": "", "pub": "OneY", "title": "2012-01-humanities-student-major_481_OneY.txt", "pub_date": "2012-01-12T00:00:00Z", "Sentiment": "0.1", "Subjectivity": "0.39", "Score": "22", "Upvotes": "22", "Downvotes": "0", "Wordcount": "1204", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_oe21x", "Reddit_id": "c3gqt3e", "Subreddit_id": "t5_2s5ni", "Commenter": "GeorgeOlduvai", "length": "7101", "content_scrubbed": "For those who do not wish to give jezebel traffic:\n\nHe Wants to Jizz on Your Face, but Not Why You Think\n\"Facials are degrading — and that[.] why they're so hot.\" So says America[.] leading sex columnist Dan Savage about the act of ejaculating semen on to someone[.] face. But the appeal of the facial can't be summed up with that single term. Rather, this act that[.] become the standard coda in porn is about much more than the longing to dominate or humiliate a sex partner. Understanding what makes it such a ubiquitous trope in adult movies (and in people[.] private sexual lives) means understanding a particularly male longing for acceptance.\nAnti-pornography activists like Gail Dines and Robert Jensen agree with at least Savage[.] first three words; in recent works, both have cited the growing popularity of the \"facial\" as proof of the misogyny of mainstream pornography. On the other end of the ideological spectrum, sex-positive feminist Clarisse Thorn wrote for Jezebel in May that \"facials feel really degrading to me.\" Despite their divergent politics, Savage, Dines, Jensen and Thorn all use the same word — \"degrading\" –- for facials, providing a strikingly rare example of consensus in contemporary sex writing.\n\nThe facial has a relatively recent history. In an interview, sex educator Charlie Glickman told me that early stag movies never showed ejaculation; if men ejaculated at all, they did so inside women[.] bodies. (It[.] remarkable that the porn that still features ejaculation in the vagina is now a relatively small niche known as \"creampie.\") That changed in the 1970s, when porn movies became longer, scripted features with bigger budgets. Since there would be more than one sex romp in the film, external ejaculation was the mark that a specific scene had ended. Porn historian Linda Williams compares this to the way that songs were spaced out in Hollywood musicals, with kitschy dialogue in between the showcase numbers that were the centerpieces of the films. But in the '70s and '80s, most of these ejaculations were onto backs, butts, or breasts — hardly ever onto faces.\n\nGlickman suggests that the AIDS crisis and the concern with safer sex was what made the facial popular. \"Cum on me, not in me\" was a popular sex educator slogan as far back as the late 1980s. Ejaculating on a woman[.] stomach, however, usually meant that the camera wouldn't let the audience see the actress' expression. But if the male actor came on her face, the viewer could see two things at once: evidence of male pleasure (symbolized by the ejaculation) and the equally important sign that a woman[.] reaction to that pleasure mattered. With sex now so dangerous — and HIV particularly likely to be spread through semen — facials were relatively \"safe.\" But in the era of AIDS, they were also compelling visual evidence that a woman wasn't threatened by a man[.] semen. In that sense facials were, almost from the start, more about women[.] acceptance of men[.] bodies than about women[.] degradation.\n\nThe sheer amount of porn featuring facial cumshots is so vast that it[.] impossible to imagine an exhaustive analysis of all of it. But two things seem clear. First, as Megan Andelloux (founder and director of Center for Sexual Pleasure and Health) noted in an interview with me, questions from college students about facials have risen dramatically in recent years. This isn't something people are just watching porn stars do; it[.] something a lot of young men (and some young women) want to try themselves. Second, as Glickman — a former adult film reviewer —pointed out, a lot more straight porn features women happily accepting facials than reacting with disgust and evident humiliation. That acceptance may be feigned, but it suggests that the primary turn-on about facials for men isn't the desire to degrade women. (Glickman further suggested that the fact that facials are also so common in gay male pornography – where the sexual politics are radically different – argues against the assumption that coming on someone[.] face is rooted in men[.] misogyny.)\n\n\nA few years ago, in a humanities course on the body, my class was discussing one of the most famous selections from the now-iconic Vagina Monologues, \"Because He Liked to Look at It\". The monologue tells the story of a woman who thought her vagina was \"incredibly ugly\" until she meets a man named Bob, who loves to stare at —and taste — her vulva with delight and wonder. Bob[.] embrace of her body is the key to her self-acceptance. During our discussion of the monologue, a male student noted bravely that he thought many men felt the same way about their penises. Perhaps, he suggested, the intense appeal of facials in porn (and real life) was about men[.] desire for that same experience of being validated as desirable, as good, as \"not dirty.\" For a young man raised with the sense that his body – and especially his penis – is \"disgusting\", a woman[.] willingness to accept a facial is an intensely powerful source of affirmation.\n\nIn my conversations with Glickman and Andelloux, I shared this anecdote. Both agreed that rather than seeing the facial as rooted in the impulse to denigrate, it might indeed be better to view it as longing for approval. Andelloux pointed out that in her experience, many women (often with good reason) have a difficult time believing that degradation isn't at the root of straight men[.] fascination with facials. In any case, humiliation and affirmation aren't incompatible reactions to the same act; a feeling of indignity when your partner ejaculates on your face isn't contingent on his intending to demean you. No one should be obligated to endure humiliation for the sake of someone else[.] longing for validation.\n\nAt the same time (as perhaps with anal sex), many people struggle to believe that receiving a facial is something a woman could enjoy. Andelloux told me a story about a seminar she ran recently on a college campus during which a young woman shared that she experienced her first orgasm when her boyfriend came on her face. \"Nothing else that was said that day shocked the audience so much. I could tell a lot of people didn't believe her. But I did.\" Andelloux remarked that some other women reacted with hostility, \"as if by admitting a liking for facials, she was committing an act of violence against other women.\" In the era of porn wars, perhaps not even anal sex is as politicized as the question of where the ejaculate lands.\n\nThat classroom discussion about facials and the Vagina Monologues had an unforgettable finish. A female student turned to the guy who'd brought up the topic of semen and validation and asked him, \"So you're saying that when a man comes on a woman[.] face, it[.] not about making her dirty — it[.] about making him feel clean?\" The young man blushed, the class tittered. \"Yes,\" he said, \"that[.] it. And that[.] what makes it so hot.\"\n\nHugo Schwyzer is a professor of gender studies and history at Pasadena City College and a nationally-known speaker on sex, relationships, and masculinity. You can see more of his work at his eponymous site."}