{"doc_id": "645", "name": "2012_02_humanities_student_major_561_education", "namespace": "we1sv2.0", "metapath": "", "pub": "education", "title": "2012-02-humanities-student-major_561_education.txt", "pub_date": "2012-02-17T00:00:00Z", "Sentiment": "0.163", "Subjectivity": "0.324", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "509", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pt42i", "Reddit_id": "c3s6a4w", "Subreddit_id": "t5_2qhlm", "Commenter": "[deleted]", "length": "3021", "content_scrubbed": "I teach in the arts, music specifically. One of the comments at the bottom of the page says something to the effect that, \"Art teachers need to do a better job of selling their brand to administrators...\" or something along those lines. The commenter goes on to talk about investment and gains. \n\nWell, we do that. Every time our students leave the classroom with their brains creatively charged, revved up for thinking in all different directions, primed for the academic rigor of math, science, and language arts, we're contributing to the learning outcomes of students in other classes. \n\nSome teachers probably think some of their students are just more enthusiastic about the subject when, really, the student is just more enthusiastic about learning. Many administrators, to their credit, may not have the luxury of seeing this effect on students. \n\nAfter all, they're inundated with paperwork and the administrative duties of the school. When your job depends on how well students perform on tests, the initial panic that sets in is that students need more time with the subjects being tested. Administrators are stuck between a rock and a hard place, to either sacrifice the student experience for the sake of grades or to jeopardize their job and ignore the ill-advised, poorly-conceived \"reform\" initiatives of billionaires. \n\nThe whole reason I teach music is to deliver \"the experience.\" That[.] the gig. It[.] about success in performance, experienced in real time live, out in the open for all to see. This is joy. And while I sympathize with what administrators are facing in this period of education reform, I'd appreciate a few of them developing a thicker backbone and standing up to the reforms. After all, the administrators should be the ones calling the shots and having the final say in what happens at the school, and so far, the only people calling the shots seem to be the people with money and political influence. \n\nSo as an art educator, it[.] pretty pompous to assume we aren't \"selling our brand\" to administrators. First, it[.] apparently not the administrators who need to be sold, as many of them appear to have lost their way in identifying what education means to young people. Education is not solely about what students have learned, it[.] about THE EXPERIENCE OF LEARNING. \n\nAs teachers, if we're going to collectively dedicate over 50% of our class time to testing and assessment, we have to take a step back and ask ourselves, \"Is this the most important experience of learning that we want young people to remember about education, taking tests?\" It may not be our intention, but that[.] the mark we're leaving in the minds of so many young people. Arts education does a LOT more for schools than many seem to believe. It just strikes me as grotesque that I need to do a better job of \"branding\" my subject for administrators. Here, how about creativity? God forbid we graduate a single student from school who can, GASP, think for themselves because they developed a joy of learning. "}