{"doc_id": "799", "name": "2012_10_humanities_student_major_1358_firstimpression", "namespace": "we1sv2.0", "metapath": "", "pub": "firstimpression", "title": "2012-10-humanities-student-major_1358_firstimpression.txt", "pub_date": "2012-10-27T00:00:00Z", "Sentiment": "0.125", "Subjectivity": "0.34", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "278", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_125xfg", "Reddit_id": "c6sge57", "Subreddit_id": "t5_2sg6k", "Commenter": "Box-Monkey", "length": "1525", "content_scrubbed": "I'm going to say you're university aged, obviously euro background, i'm going to guess british and german. You seem kind, and maternal. Though, I wouldn't put it past you to have a really quirky, and sometimes even strange, sense of humor. I'm going to guess that you're not satisfied with your body and can think of at least 3 places you wish were different or \"better\" than they currently are.\n\nYou seem like you might be timid at first, but probably loud once you get to know people. You tend to be in long_term relationships rather than flings, but that[.] not to say you're sexually inexperienced or a prude. Quite the contrary, I'd say you have a deeply sexual side that you keep private and most people don't know about.\n\nI'm going to guess you play(ed) soccer, maybe strum some guitar (folk-style) and may have gotten a fair ways in piano. If I had to pick a major, I'd say... something in the arts domain.. let[.] say music or english. Psychology? I'm guessing.\n\nTaste in music: Indie\n\nWhere are you from: the midwest\n\nMovies: you don't seem the type to be into rom coms, but probably like general comedies, maybe mind fuck movies, and the occasional horror (very sparingly)\n\nYou're probably liberal, I'll guess you're a daddy[.] girl, but you are likely pretty damn close with your mom as well. I could see you being into baking, as well.\n\nSince I can't see it, I'm going to guess you have a curvy figure, as well. The more I look at you, the more attractive I find you. I apologize if that[.] out of line.\n\nHow'd I do?"}