{"doc_id": "793", "name": "2012_10_humanities_student_major_1326_todayilearned", "namespace": "we1sv2.0", "metapath": "", "pub": "todayilearned", "title": "2012-10-humanities-student-major_1326_todayilearned.txt", "pub_date": "2012-10-26T00:00:00Z", "Sentiment": "0.047", "Subjectivity": "0.476", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "938", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6s58ug", "Reddit_id": "c6s6aon", "Subreddit_id": "t5_2qqjc", "Commenter": "[deleted]", "length": "5545", "content_scrubbed": "haha, you sound bitter, funny.\n\nWhat exactly do you think was bitter about my reply?\n\nI'm not the one trying to defend his major in an unreasonable fashion because he thinks his self-worth depends on it. I'm simply here to tell you how it is.\n\nIn engineering, at least you guys are held back by the laws of physics, in economics, there are really no such laws. \n\nYou have never studied engineering, have you? I mean, seriously, if anything economists are \"held back by physics\" much more than engineers. If you believe humans are hard to predict, try studying quantum physics and throw up due to frustration. \n\nYou literally have to start from scratch whenever you begin figuring out a new economic model, you can make presumptions on certain facts\n\nYes, you can also easily make shit up and get a degree for it. The amount of shit degrees in econ/bsns is amazing and I think you know that yourself. \n\nGuess what: You literally have to start from scratch whenever you begin figuring out a new model in engineering. Not only that you have to figure out your formal description of the system... you then also have to create your own system that is able to accomodate your models to demonstrate it works. So, the hardest part for an economist to do... is where only half of the job of an engineer is done. \n\nYou also seem to have no idea about modelling or how to build systems.                                  \nI mean, the level of ignorance about the reality of engineering is mind-boggling to me.\n\nBuilding a robot from scratch that is capable of making a single step forward without falling is more complicated than *anything* I have ever seen economists do.                   \n\nYou should understand that when it comes to mathematics what your job as an economist is is the same as that of an engineer only that you are allowed to generalize much *much* more and have to actually understand and find out much less. \n\nWe can discuss this all you want but I think it[.] very simple to demonstrate: How do you define \"complicated\"? What is the most complicated thing you can think of that you ever had to do or understand to get your degree? What was the hardest thing for you to grasp? How long did you have to study for it? How much do you think has the average student have to invest to grasp it?\n\n\n\n\nyou can make presumptions on certain facts, like all consumers are constantly seeking the cheapest price for a good, or behave rationally in market situations, not always true, so you are constantly refining and perfecting economic models, difficult, to say the least.\n\nOnce again: Having to deal with many variables in your functions doesn't make the mathematics behind it any harder.\n\nAnd if you believe that you have to deal with many variables then you never dealt with the simulation of cognitive processes.                    \nI mean, seriously, the most complicated thing I can think of in economics is genetic algorithms and that[.] rather simple considering what some engineers have to deal with.\n\nAnd if you believe that *uncertainty* plays a significant role in economics you have *no idea* about physics and research. :D                    \nI mean, that is just actually funny.\n\nIf you believe supply and demand are uncertain to predict, try to deal with quantum physics and throw up in anger.\n\nYou just made a list of things you have to take into consideration when making an economic model:\n\nI really don't know how well you can imagine this... but can you imagine a robot walking in unknown terrain? For me it[.] very easy to understand the significance of this, but please just try to imagine what it actually takes to teach a robot to make decisions about an unknown environment.\n\n**Please just think about the significance of the following statements:**                        \nThe next two things are both based on mathematics and computation.                     \nBanks are able to successfully predict behaviours of markets and can make informed decisions through algorithmic assessment of information by a computer, you can literally automate investment processes and in the long_term it[.] basically only vulnerable to freak-events.                     \nRobots still can't even find a door, open it, and walk through it.\n\nHonestly, this is the problem with engineers or any stem types getting involved in economics, you have no idea how the system works, or the implications of how vast and complicated the financial and economic system is.\n\nYou see, that[.] the problem with some economists. You actually believe what you do is complicated. ;)\n\nYou know... there[.] a reason why economists churn out model after model and can provide actual results, while engineers can't even make a robot that can walk in a straight line (or only yet begin to be able to do so without being able to implement any interesting function). You really don't seem to realize what it takes and think that just because humans are hard to predict it makes your job complicated. \n\nWell, have fun believing what you want. However, what you do is just so much easier and less complicated than what engineers do. \n\nHere is an example of applications of mathematics on the derivatives markets, not really easy.\n\nNobody said your job was easy. However, shall I really point to the dissertation of my cybernetics tutor? \n\nI think I have made my point and invested much more time into this than I should. I stay by my statement: Pretending any liberal_arts/social science degree is just as hard to get as a degree in engineering or hard_science is hybris."}