{"doc_id": "1557", "name": "2012_01_humanities_student_major_569_eldertrees", "namespace": "we1sv2.0", "metapath": "", "pub": "eldertrees", "title": "2012-01-humanities-student-major_569_eldertrees.txt", "pub_date": "2012-01-15T00:00:00Z", "Sentiment": "0.053", "Subjectivity": "0.391", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "379", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_oebgw", "Reddit_id": "c3hhgyf", "Subreddit_id": "t5_2tclf", "Commenter": "[deleted]", "length": "2133", "content_scrubbed": "I'm only 20, probably one of the youngest Ents on here. Been smoking on and off since sophomore year of high school. Recently had Lung surgery to fix a collapsed lung (which was spontaneous and not weed-related at all). Currently in recovery waiting until I can safely vape and eventually smoke again (not much smoking though). I love learning about the marijuana culture and meeting new people who smoke because there is usually an instant connection and similar sense of humor shared between two smokers. Also, I've probably seen the majority of Strongly-recommended and factually- based Documentaries on the subject of marijuana (haven't really kept count, but well over 15) and enjoy learning more and more as life goes on. I go to a very hard school (4th rigorous in the nation in terms of Liberal Arts schools), made Dean[.] List this past semester, and smoked every single day, proving the \"weed smoker\" stereotype wrong once again. I frequently wear my Trees Pineapple shirt to class and another shirt I have that says \"Say No Pot\" that my parents bought in Bar Harbor ME as a joke. My professors all know I smoke and don't think any less of me or expect any less of me because of it. I'm a young environmentalist and an aspiring writer (Environmental Studies & Creative Writing Joint Major). I wrote a novel my senior year of high school and finished it this past winter break (Jan 2011). I have been looking to get it published and plan to by this summer. I've encountered a lot of people who think negatively of me because I smoke and I try to show them that I'm really a better person when I'm high; more caring, more friendly, happier, more sociable, and all of my friends at school agree with me. They even posted this on a Facebook Group we have:\n\nhttp://imgur. com/ikzIn\n\nand tagged me in it. I enjoy the spiritual and medicinal effects of marijuana and use it to help me sleep, destress, and relax. I also enjoy smoking socially with friends and rarely smoke alone if I can invite someone over instead. I hope this wasn't too much text. I tend to get carried away as a writer =/. \nToke on, Brother and Sister Ents!"}