{"doc_id": "773", "name": "2012_10_humanities_student_major_1100_biology", "namespace": "we1sv2.0", "metapath": "", "pub": "biology", "title": "2012-10-humanities-student-major_1100_biology.txt", "pub_date": "2012-10-21T00:00:00Z", "Sentiment": "0.219", "Subjectivity": "0.364", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "305", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11vpf1", "Reddit_id": "c6q0tu2", "Subreddit_id": "t5_2qhn7", "Commenter": "[deleted]", "length": "1811", "content_scrubbed": "You're in high school.  Have fun and learn about anything and whatever you want, you won't have time for all of that later, trust me!  Start looking into what colleges you want to go to, weigh the pros and cons of small liberal_arts versus large state schools, and ask questions to the schools.  Ask them about their general education requirements, what majors they offer, and what research opportunities are like for undergrads.  If you look into small liberal_arts schools, I highly recommend choosing one that is affiliated with a larger research institution.  That is what I did and it was a wonderful mix of college cultures.\n\nDuring your first year of college, take a lot of gen ed courses to see what interests you most.  Also, please DO think about career objectives!  I know when I was a freshmen I was really into jazz and science, and ultimately chose science because while people complain about the lack of job prospects there sure are more than being a musician.  If you find science passionate and engaging, but are still interested in more social science or arts oriented subjects I highly recommend minoring, you will never have a better chance to do such a thing again.\n\nThen, sometime in your first year, perhaps your second semester, perhaps before the first semester of your second year, start contacting professors at either your own university or the research university associated with your school.  Read their articles, start with just the abstracts and discussion, and send them emails expressing how you find their research interesting (say what and why!) and that you would like to have a meeting to discuss the possibility of joining their lab.  Then, spend 10-20 hours/week in their lab for the duration of your undergraduate education.\n\nGood luck, and first and foremost, have fun!"}