{"doc_id": "1563", "name": "2012_01_humanities_student_major_597_theoryofreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TheoryOfReddit", "title": "2012-01-humanities-student-major_597_TheoryOfReddit.txt", "pub_date": "2012-01-16T00:00:00Z", "Sentiment": "0.04", "Subjectivity": "0.323", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "1112", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3hsdhh", "Reddit_id": "c3ht7ta", "Subreddit_id": "t5_2rtff", "Commenter": "[deleted]", "length": "6616", "content_scrubbed": "SRS itself is supposed to be a circlejerk. Says in the rules several times. \nThere are other places/subs for discussion, but most of the time, the SRS users are sick of talking to privileged people who, well, are blind to their privilege.\n\nAnyways, the purpose of that sub is to post as if privilege were reversed, (yes, 'reverse-sexism' & 'reverse-racism', & etc.), and laugh at butthurt redditors. It is actually pretty funny to watch, for example, someone who causally says: \"Fucking nigger faggot stole that wallet, I bet\" get all huffy and defensive with \"It was just a joke! Like Dave Chapelle!\" when someone posts the crying cracker emote.\n\nBreaking the circlejerk there results in a ban pretty quickly. In other subs where SRS holds sway, debate & questions won't necessarily lead to a ban, but the focus is still on providing a community where users can expect not to have to deal with [.]hit posts' & [.]hit posters'. So that trans people can talk openly without being called horrid abominations, so that people who don't fulfil normal gender roles, such as bronies, can talk to others without self-censorship or being called fags, and homosexual people can expect not to have homosexuality used as an insult, (Different scales of intensity used there on purpose, not meant to equivocate the hatred directed at bronies with the homophobia & hatred directed at homosexual & transexual people) . \n\nIt may seem like people are simply being butthurt, but, would you read and hang out at a place where you were constantly being insulted? Would you hang out with friends who constantly call you a liar, a thief, an idiot, an abomination? Nah, you'd just leave. For privileged people, reddit doesn't seem to be that place, STEM cisgendered heterosexual males are rarely made fun of, and often backed up, because they make up the majority of redditors. That is privilege. And having that privilege taken away upsets a lot of people, as if you took away a right of theirs. Privilege is kinda important here, so let me give a couple of illuminating examples; a guy gets uncomfortable watching homosexual interactions in a movie and complains about it: He[.] upset that his privilege of being a heterosexual male is being taken away, that his demographic is not being catered to. A white guy gets upset when someone posts a picture of a silly looking white kid, and pokes fun of him. The white guy protests with stuff like 'didn't you do silly stuff as a kid?', 'Have you no empathy?', etc. etc., but defends a joke about 'niggers & KFC' with 'lighten up, it[.] only a joke'. Again, his privilege of never being made fun of, (because most of the people who post are white males, and why would they make fun of themselves?), is being taken away, and somehow, it[.] his right not to be made fun of, but other people have no such right.  I'm only touching on the idea of privilege, but now you have a better idea of what I'm talking about, right?\n\nBack on course: reddit being what it is, it is possible to construct your own subreddit with your own rules, where you don't have to put up with people who call you an idiot.  But it either remains very small, or you have to moderate it, or you get the same mix of users you get anywhere else. Given those same mix of users were calling you an idiot, and given that you don't often want a small subreddit, the choice is heavy moderation. \n\n\nNow I can address the question, 'Why are questions & debates so often quashed?'\n\nI think it is most comparable to quack & woo science. Most, by which I mean 99. 999999999999%, of the questions/debates given by non-SRSers are based on objectively false ideas, like 'fat people don't have willpower', 'being gay is a choice', 'asexuals all have serious hormonal problems', 'black people steal because it[.] in their genetics', 'paedophilia is perfectly okay and natural', 'I like jailbait because 16 is the ripest age for breeding', 'transexuals have serious psychological problems', 'asians are better at math', 'females are only out to marry and divorce you for half your stuff', 'The liberal_arts are useless and don't expand human knowledge or humanity[.] well-being', 'Only STEM majors are smart people', etc. etc. etc. etc. etc. etc. etc.\n\n\nThese are statements/ideas/questions not unlike: 'Vaccines cause autism', 'How do you know ghosts don't exist?', 'My uncle got cured through homeopathy', 'Acupuncture never hurt anyone', 'Astrology really tells me about peoples personalities!', 'Deepak Chopra is so sensible!', 'Magnets are magical cure-alls!', 'Tide goes in, tide goes out. Can't explain that!' etc. etc., a lot of etc.[.].\n\nAnd our reactions are moreorless the same: These questions/ideas/statements, while possibly holding some grain of truth, are for the most part useless, and people who advance them should be ignored. We see no reason to indulge in people who are too lazy to research or read, or simply want to advance their own ideas while ignoring & belittling everyone else. While it is possible to educate these people, we don't welcome it on our own turf, much like [/r/skeptic](/r/skeptic) the community wouldn't tolerate someone like Deepak Chopra coming on, posting a lot, and accusing them of not being open-minded.\n\n\nHowever, while most redditors think somewhat like the fine people over in r/skeptic, not many people think the same way as SRSers. While we can depend on self-moderation in [/r/skeptic](/r/skeptic) through up and down votes fairly well, if SRS or related subreddits were allowed to be self-moderated, the majority of users would eventually be a mix similar to that of the rest of reddit, and the people who the community was formed for would be downvoted, marginalized, and chased away. \n\nThe proof of that is as simple as looking at the linked/screenshotted posts in SRS, and seeing how many redditors upvote racist/sexist/paedophiliac apologist/etc. posts. \n\n\nSo, to maintain the quality of a community of people who think unlike the majority of reddit, heavy banning is *required*. This doesn't only apply to reddit; Anywhere on the internet, even private forums, the same care will need to be applied. The same heavy handed moderation.\nAnd if that doesn't hurt enough, the people that this community is made for are often groups which are specifically hunted down by hate groups. \n\n\n\nWith all that said and done, there are many SRSers who are willing to educate and debate, just as there are many skeptics who are willing to debate people who believe in woo & quack. You may have guessed that I'm one of them.\n\nAnything you'd like to talk about?"}