{"doc_id": "700", "name": "2012_10_humanities_student_major_176_saltlakecity", "namespace": "we1sv2.0", "metapath": "", "pub": "SaltLakeCity", "title": "2012-10-humanities-student-major_176_SaltLakeCity.txt", "pub_date": "2012-10-04T00:00:00Z", "Sentiment": "0.095", "Subjectivity": "0.448", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "1165", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_10xtq8", "Reddit_id": "c6hpjih", "Subreddit_id": "t5_2r7ac", "Commenter": "omgwtfbbq0_0", "length": "6420", "content_scrubbed": "Welcome to Utah! Or almost. I moved here when I was 13 from Florida, so the first thing I'll warn you about is that the dry air is really, really different from high humidity (fun fact: Utah is the second driest state in the country. The only state drier is Nevada. themoreyouknow. jpg) There are definitely upsides to how dry it is (for example: if you're a girl, you'll notice how much faster your hair will dry, which is awesome. But you'll also probably notice how much less volume you'll have. That kinda sucks) Both my dad and I had a really big problem with the skin around our fingers, thumbs in particular, cracking and peeling. Basically you're just going to want to invest in a lot of high-quality moisturizers. You're also probably going to find yourself short of breath quite a bit at first, especially since you're coming in the winter. That sucks, but it[.] normal and you'll get used to it by the end of the season. The good news is when it[.] 100 degrees out (as it often is in the middle of summer in SLC) it won't feel anything like 100 degrees in the south. In fact, all temperatures are going to feel different, but in my opinion it[.] a better adjustment. They don't feel as extreme, I guess. And you'll sweat less. I like that part, too. \n\n\nSo I think you've mostly been briefed on the law differences, which are mostly just liquor laws. One thing I didn't know until recently, however, is that local beer in grocery stores is actually around 4% instead of 3. 2%, so that[.] kinda nice. It[.] still bullshit, but the local brews are pretty great actually, so it[.] nice that there[.] a little more alcohol. And you CAN buy beer on Sundays at convenience stores in almost all counties. I know Utah county is an exception, but fuck Utah county. Seriously, just stay away. One good thing though is that Utah doesn't have any dry counties, so that[.] kinda nice. But you should be aware that a lot of liquor stores are only open until 7. I know the ones in Park City and I think the ones in Salt Lake are open until 10, but I'd check first. Also,  [Salt Lake City and Park City are only a handful of cities that have more than 1 liquor store](http://abc. utah. gov/stores/index. html), so be aware of that if you end up in suburb.\n\n\nI also want to reiterate how important it is to learn how to drive in the snow. No one else does, but you'll want to know. Black ice (I didn't know what that meant when I first came out, so if you don't either, it just refers to a thin layer of ice on roads that[.] virtually impossible to see) is a HUGE problem and as good as Utah is at salting the roads, you still need to learn what to do. I spun out twice last winter, and it[.] pretty terrifying. But if you know what to do, you'll be fine, assuming no one hits you from behind. Actually, that[.] another thing, leave a lot of space between you and the person in front of you when it[.] snowing out in case something like that happens. \n\n\nIf you don't already have an all-wheel/four-wheel drive car, you may want to consider trading in for one. An overwhelming majority of cars I see stuck in a ditch are two-wheel drive cars. Don't be one of those people. But if you must, go with front-wheel. Rear-wheel is the kiss of death. \n\n\nOne thing I love about Utah is that the traffic is minimal compared to most other states. Unfortunately, Utah is in constant construction mode (I'd like to say you get used to it, but you don't. I've been here for the better part of 11 years and it[.] no less annoying now than it was then), so most of the traffic you'll deal with is a direct cause of that. There[.] the normal rush hour (although I think it[.] probably shorter than what you're used to), but in the evening it really only seems to effect south-bound traffic (so I'm assuming in the morning it[.] worse for north-bound). At least from what I notice. I live in Park City, so I don't deal with it on a daily basis. \n\n\nOkay so must see things. Well, I'm a little biased, but I definitely recommend checking out Park City. There[.] more to do than just skiing and snowboarding and I actually think there[.] a better nightlife here than in SLC, which surprised me at first. [There[.] also a great sledding mountain that I definitely recommend.](http://www. gorgoza. com/gorgoza). Oh, and snowmobiling! If you can afford it (it[.] a little pricey), definitely do that. You'll see some beautiful scenery and it[.] super fun. There are also a bunch of museums. Personally, I really like the Leonardo which is a new technology museum downtown. Oh and Utah is really big into music and the arts so [here[.] a pretty useful website to see what events are going on and where](http://www. nowplayingutah. com/). And Lagoon is actually a pretty damn good amusement park. Protip: Thursdays and Sundays are the least crowded. \n\n\nThat actually reminds me: Sundays. Always, always, ALWAYS check to see if something is going to be opened on Sundays because a lot of places aren't, especially in Utah County. That whole area turns into a ghost town. It[.] creepy. Anyway, even in Salt Lake (where it[.] much more balanced) you'll still want to check. Cherry Creek Mall, for example, is closed on Sundays. The whole mall. That[.] so strange to me. But for things that are open and where you don't want crowds, Sundays are often your best bet. \n\n\nI also would eventually check out Moab and Zions Canyon. Heh, and if you're a Shakespeare fan, the Shakespeare Festival in Cedar City is *amazing*. Those are all about a 4 hour drive I think, but they're worth if you're into that stuff. Vegas is only 6 hours away, but the nearest casino is only about a 2 hour drive away in Wendover. \n\n\nI think that[.] all I've got right now. Sorry if I rambled and/or repeated stuff people have already said. I probably should have read all the comments first. I'm pretty high. OH! That[.] another thing, if you're 420 friendly, there[.] some AWESOME shit to be found here. \n\n\nI really like Utah. Yeah, the fact the the church basically runs the state is a gigantic pain in the ass, and I guess if you're not a Republican you're probably going to hate that aspect (although SLC, and Park City actually, are pretty liberal), but all in all this is a pretty great state. There[.] a very low cost of living and people are pretty friendly. Can't complain :)\n\n\nPS Sorry if there are any weird errors, my cat rolled over my keyboard and I'm not sure I caught all the mistakes that caused. *sigh* "}