{"doc_id": "708", "name": "2012_10_humanities_student_major_280_telos", "namespace": "we1sv2.0", "metapath": "", "pub": "TELOS", "title": "2012-10-humanities-student-major_280_TELOS.txt", "pub_date": "2012-10-07T00:00:00Z", "Sentiment": "0.151", "Subjectivity": "0.44", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "403", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6j0ejo", "Reddit_id": "c6j4q5x", "Subreddit_id": "t5_2u6b3", "Commenter": "marisawright", "length": "2193", "content_scrubbed": "I agree with your conclusions 100%. I think FCAT was such a waste of time. The teacher practices giving a prompt and the children regurgitate a 5 paragraph essay that is identical for each and every one of them across the grade level. Also, I just have to put my 2c in about standardized testing in general. That, by far, is what universities look at and take into account the most when accepting freshman students. I knew so many kids in my grade that wouldn't do anything in class, wouldn't ever do their homework, and did poorly on tests yet they got into really good universities because they were really good or knew how to succeed on standardized tests. I don't believe they are the best way to judge a student by any means. I know this is not the only aspect that universities take into account. However, I know several students going to really good state universities, when honestly, I don't believe they will succeed. This emphasis on passing the tests and getting a certain high score is another problem in our education system because so many teachers do teach for a test. I think if our teachers went on a route of allowing students to internalize information and apply what they learn to real life situations or issues happening in the world today, that we would be getting somewhere. That was part of the reason I struggled so much with my high school chemistry class. I was never able to internalize the information I was taught. Even if I followed the directions in a lab, and experienced it with my own senses, I still had no idea why I was doing it. It serves a child no good to be hand fed a formula, use it to plug numbers in and get an answer, without knowing why that formula is used. This may sound strange, but I honestly feel as though I learn more in our Arts and Humanities class because I don't have to cram facts and thoeries into my short term memory in order to do well on an exam. Also, when Dr. Bishop mentioned the effects off having a ureddit discussion board for every class, I have to agree. Students would be able to interact with the material much more and teach other students. This is just a couple changes I think would help our poor education system."}