{"doc_id": "648", "name": "2012_02_humanities_student_major_570_sysadmin", "namespace": "we1sv2.0", "metapath": "", "pub": "sysadmin", "title": "2012-02-humanities-student-major_570_sysadmin.txt", "pub_date": "2012-02-17T00:00:00Z", "Sentiment": "0.14", "Subjectivity": "0.42", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "614", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_ptwfo", "Reddit_id": "c3saejw", "Subreddit_id": "t5_2qnp7", "Commenter": "matt314159", "length": "3531", "content_scrubbed": "I'm loving working in an educational institution. Perhaps it[.] because of my low position on the totem pole, I'll get to that in a minute. \n\nSpecifically, I work at a small, midwestern, private, christian liberal_arts college.  about 1300 students, 150 faculty, and 200 staff. \n\nPros: \n\n- Awesome work environment.  Partly because it[.] a private institution I think, but the atmosphere is really great, family-oriented;  my coworkers often bring their kids into the office if their schools have a late start on a snowy day, that kind of thing;  if I need to run downtown in the middle of the day for some errands, I can either do it on my lunchbreak (which I can take whenever) or simply go awol and make up the time later.  \n\n- I'm particularly lucky, I think, because my coworkers are truly  motivated to do a great job, they're consummate professionals for the most part who all know their stuff and do their jobs well.  We have a small department, though, so I'm learning all kinds of things I'd never get to learn otherwise.  I'm just the campus PC technician but I've always got my hands in other projects--I'm constantly being stretched just outside my comfort zone and growing in all kinds of awesome ways.  \n\n- You get all kinds of perks working for a college:  free access to campus resources like an awesome gym, weightroom, sports areas, etc... free tickets to college events that range from sports to fine-arts, being relatively young at 28, I still enjoy going to a lot of the concerts they have for the students and that kind of thing.   Not to mention you can audit, or take for credit, classes for free.  I am not even kidding when I say that when I have kids of college-age, I will seriously think about taking a staff position at a college for a few years to pay for their education--at least here, you, as well as your wife and kids, can take classes for free.  and at $500+ per unit, it[.] nothing to sneeze at.  \n\n- Working around a college, you don't typically encounter illiterate dumbasses. Don't get me wrong, they're still dumbasses and break stuff all the time, but at least they can write well and are well-spoken.  \n\n- There[.] something to be said about being around young people all the time.  I don't even mean that in a pervey way, I just mean it kind of keeps you feeling young, it[.] a vibrant atmosphere.  \n\n- There is a certain cyclicality/seasonality that keeps work from becoming too monotonous.  Work during the summer is different from fall, is different from spring;  when students go on break for christmas or spring break, it[.] the oddest feeling--like you[.] on vacation at work.  Wonderful feeling!   Hours can be different during summer--we have a benefit called summer flex hours--the hours are 8-4:30 with a 30 minute lunchbreak M-Th, then friday is 7:30-1:30 and done. You put in 37. 5 hrs, get paid for 40.   \n\n\nCons\n \n- Department politics are different, you have to know who to cater to, everyone has varying interests and different levels of institutional clout, and they're not afraid to use it. Egos are sometimes large.  \n\n- The pay is peanuts.  \n\n- Because budgets can be constrained there is always a sort of constant kaisan pressure to do more with less.  This is a double-edged sword.  You are stretched in ways that sort of force you realize more of your full potential, but if the pressure is too much, it can come crumbling down around you.  Thankfully, though, I've never felt like this was the case for our institution.  \n\n\n*edited to clarify formatting and add a point*"}