{"doc_id": "603", "name": "2012_02_humanities_student_major_70_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2012-02-humanities-student-major_70_Economics.txt", "pub_date": "2012-02-02T00:00:00Z", "Sentiment": "0.123", "Subjectivity": "0.39", "Score": "20", "Upvotes": "20", "Downvotes": "0", "Wordcount": "860", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3n7cvm", "Reddit_id": "c3n7si0", "Subreddit_id": "t5_2qh1s", "Commenter": "[deleted]", "length": "5104", "content_scrubbed": "Take all the standard left-wing beliefs about how consumerism is bad, corporations are turning us into mindless zombies through advertisement, how materialism destroys the higher, spiritual, and community values of life, that part is clear, right?\n\nNow add to this mixture a right-wing aspect. I. e. the position that higher values of life - as opposed to consumerism - coming from traditional christianity, from family values, from community spirit through nationalism, from national and religious and conservative traditions, from traditional living instead of individualism. These all seens as bulwarks of defense against consumerist corruption of the soul, hence corporations must see them as their enemy, hence supporting all those things conservatives traditionally see as detrimental to the traditional way of life: gays, drugs, abortion, whatever.\n\nFor extra points, say add a person like George Soros: a culturally-socially obviously very liberal person supporting very liberal goals (Open Society Foundation etc.), yet a wealthy financier, a speculator. (What my countrymen don't know is that Soros is a big exception, in the US wealthy financiers tend to be culturally-socially conservative, and social-cultural liberals tend to be humanities professors, not wealthy financiers. Soros being a big and very rare exception.)\n\n**This thing is on its own is  a perfectly logically consistent way of seeing the world.** (I grew up it in and didn't know for a long time that in the West \"right-wing\" often means not a nationalist but an individualist-classical-liberal.) \n\nIn fact some aspects in the West are less consistent. Take how British tabloids tend to be conservative. How can a conservative person support that kind of vulgar modern mass culture these tabloids represent? A real conservative is supposed to be a gentleman, reading Shakespeare and Burke by the fire right? I still don't know why it is so with the tabloids. Maybe the British Left got angry that when the tabloids report a crime they love to dwell on the ethnic / immigrant status of the criminal and slammed them and they said well fuck you we will support the Tories then? But it still does not make sense at all. I mean I am a conserative and hopefully in the good sense. But I would never waste my time not pollute my taste with The Sun. I would go read Salisbury Review instead.\n\nSimilarly from this point of view the Western Left looks similarly unconsistent. You hate consumerism and greed right but what else you want when you are pretty much against the source of all higher values (tradition, religion, classical art, national community spirit), and the kind of cultural values you support like drugs and sexual hedonism (see abortion, gays, whatever) are not higher at all? Yes, I sort of understand the argument that what the Western Left really supports isn't really these things but simply empathy, but it does not help with being or at least looking very, very inconsistent at all. It still looks very much so they look down on the consumption or acquisition addict but not on the sex or drug or whatever addict.\n\nSo it is difficult to explain it to you, but it would be just as difficult to explain in Hungary just how could the average Republican call himself a conservative: they just look too much like \"worshipping Mammon, not God\" kind of people from that point of view. And I could similarly difficult to explain there that the \"liberal\" in America generally does not like the current kind of global capitalism much. They would think as a liberal is for freedom, freedom to satisfy your wishes, right, for sex, for entertainment, for whatever so why would they be against the satisfaction of the desire for money? Or a bit like what Rob Dreher said that Democrats became the party of lust, Republicans the party of greed, just as sinful both of them and neither conservative. That sort of thinking would resonate well in my country I think.\n\n(Just to point out where I am coming from, I am a \"Western type conservative\" i. e. traditionalist but also individualist and very moderate on the nationalist stuff (love your country and be thankful to her but don't look at everything from an us vs. them point of view). There are some of us, but we are a minority on the Hungarian Right and kind of distrusted. I still support the current government nevertheless, they are not even 10% as nationalist as their most vocal fans. Anyway. I still love my folks. And I still think many brands of conservatism have very good ideas. I just hope they would choose the more individualistic and less nationalistic brands.)\n\nAnyway long post. The point I want to make I think this neither-left-nor-right way of thinking is getting popular around the world. It is in its own way very, very consistent which does not make it right, but popular you can be that it is popular. Or getting. This is pretty much a very tempting philosophy for an Egyptian or Syrian university student. Especially that they don't tend to like Jews very much so they just find yet another reason to see f. e. Soros as the manipulator behind it all."}