{"doc_id": "711", "name": "2012_10_humanities_student_major_287_askphilosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "askphilosophy", "title": "2012-10-humanities-student-major_287_askphilosophy.txt", "pub_date": "2012-10-07T00:00:00Z", "Sentiment": "0.045", "Subjectivity": "0.354", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "666", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_113uwx", "Reddit_id": "c6j7cmv", "Subreddit_id": "t5_2sc5r", "Commenter": "InfiniteJest001", "length": "3992", "content_scrubbed": "I'm an undergraduate at a small liberal_arts college, so, as others have said, it often varies on the school. The philosophy department at my school is also entirely analytic. A lot of students come intending to study continental philosophy and switch to something else with disappointment, concurrently, many people in the mathematics department (in my case and many others) end up switching or doing an interdisciplinary major in philosophy (School requires two senior thesis' for a double major so few people ever do it) because they had never been exposed to analytic philosophy before and enjoyed it.\n\nAnyways, off to the classes. For the introductory classes, there[.] logic, and other courses. Logic is just teaching the deductive logic necessary for philosophy (I believe, I actually never took this course because I took mathematical logic and the department was okay with that). It[.] rather straightforward problem solving/proofs I imagine with logic rather than any sort of discussion or much reading.\n\nThe other introductory classes tend to be a clusterfuck of mostly non-philosophy majors filling in requirements. My school is really small so the maximum class size is 24 students and the classes are usually supposed to be readings for homework and then a discussion fostered by the professor in class. However, since most students tend to sway away from analytic arguments and think about things in what I call a \"social science or lit theory\" manner it often results in the professor lecturing on and clarifying the specific arguments that we read for homework. Part of that is also dependent on the professor, most of them are rather ruthless and will not hesitate to tear you a new asshole if you give some half-assed argument for something. Depending on how willing the professor is to do this, the discussion will either just be the professor going in detail on a topic some student misunderstood or an actual discussion. There[.] usually a paper or two on whatever topic the student chooses, as well as regular summaries of the arguments of the provided readings in these courses.\n\nThe upper-levels are seminars that are more discussion-based, with the professors focusing on also refining the students argumentative ability. More papers are also due, the topic is usually up to the student as long as it[.] relevant to the course.\n\nThen the even higher-level special topics classes tend to be discussion with several papers of the students choice of topic due throughout. Students here often do independent studies as well (overlooked by a member of the department). And a thesis is required the senior year which is determined with whomever you decide to ask to be your thesis adviser.\n\nThe requirements are very little for the major here, just 1 course in logic, 1 in ethics, 1 in metaphysics, 1 in epistemology and 3 other philosophy courses. This is the primary reason I chose philosophy as a major since my primary interest at the graduate level is computational biology. The major allows me to take the neuroscience classes I want (in the psych department--no neuroscience major) and the relevant math/comp. sci classes (only a pure math department, no applied math, one theoretical computer scientist in the department).\n\nI can't speak to jobs, I've never been worried because I imagine with my side-projects and the fact that I've taken as many math courses as half the math majors here I'd have no significant trouble finding a programming job. Though my overarching goal is graduate school. You can find a plethora of jobs with a philosophy degree, but it'll be more difficult than majoring in something job-oriented.\n\nIt[.] improved my ability to argue and debate. It[.] made me relate less to others though, but not as badly as being a math major did. Oh well. I enjoy it.\n\nTo be clear, philosophy the way it is at my school will probably only be that way at other small liberal_arts colleges, so if that[.] not your interest, ignore pretty much everything I said."}