{"doc_id": "665", "name": "2012_02_humanities_student_major_723_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2012-02-humanities-student-major_723_canada.txt", "pub_date": "2012-02-21T00:00:00Z", "Sentiment": "0.071", "Subjectivity": "0.405", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "529", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3tl1y2", "Reddit_id": "c3tm3xh", "Subreddit_id": "t5_2qh68", "Commenter": "[deleted]", "length": "3101", "content_scrubbed": "First of all as to your douche-y little edit, I did't downvote your comment and I am terribly sorry that someone has injured you by doing so. Second what part of \"If you want more spaces for doctors to be trained..\" which you specifically quoted did you not understand to mean capacity for training. \n\nYou are talking about robbing Peter to pay Paul. It is not a solution, and it is grossly more unfair than the current system by leaps and bounds. Your main and original point had little to do with spaces and everything to do with complaining that arts depts that are are already underfunded and arts students that are already overburdened need to pay for Med students education. I call that horse shit.\n\nThe current structure of funding at University, due to the regulated nature of Arts degrees as I mentioned before, means that unregulated programs tuition is increased to off set any funding shortfalls. That means currently the Arts programs being funded by other faculties, but I guess that is ok as far as you're concerned.\n\nWhy does it mean that? Arts is the largest faculty in many Universities, but conversely, often has the lowest budget. Most faculties are awarded budgets based upon their enrolment because 3/4-4/5 of all budgets are spent on salaries for professors. Show me a statistic that shows other faculties are subsidizing arts, because I sincerely doubt you will find one. I certainly couldn't.\n\n Last I checked there are still many communities that are underserviced by Doctors, but I guess that it is far more important to have large crops of Philosophy and Art_history_major. Yes Doctors make a lot of money, you keep gravitating to that fact, no one is denying that. How though does their after graduation income change the very limited amount of openings within the school? If you do not let in more students you will not get out more doctors.\n\nThis is a problem with funding of faculty, period, and forcing arts students to subsidize it is not the answer. Every faculty across the country is feeling the pinch from a reduction in funding, and Medicine is no exception.\n\nI have just suggested that like any other luxury arts degrees should be provided at fair market value not an artificially lowered rate.\n\nArts degrees are not luxuries. Even though they are not professional degrees, they are extremely valuable because without one many avenues of employment are simply closed to people. Now maybe they don't offer as much utility to society as medicine, but then again, they also don't receive nearly the funding per student that medicine recieves. \n\nIn addition, if we for a moment accept that we should charge \"fair market value\" for university degrees in general (rather than, as you seem so obsessed with doing, picking on the Arts), then Medicine needs to go up substantially as well. The average yearly tuition for Med in Canada was around $12,000 last I checked.  That[.] hardly fair market value if you compare costs in other jurisdictions. And if they doubled or tripled tuition then they would definitely have enough money to open more spaces, wouldn't they?\n\n"}