{"doc_id": "689", "name": "2012_10_humanities_student_major_20_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2012-10-humanities-student-major_20_AskAcademia.txt", "pub_date": "2012-10-01T00:00:00Z", "Sentiment": "0.085", "Subjectivity": "0.246", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "293", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_10r54b", "Reddit_id": "c6g049y", "Subreddit_id": "t5_2sakj", "Commenter": "[deleted]", "length": "1701", "content_scrubbed": "First:\n\n* What kind of college are you at? Williams/Amherst/HYPS-level, mid-level, or unknown-tier? This affects how your grades are perceived. HY is notorious for grade inflation; Chicago for the reverse (or.. used to be).\n\n* What kind of program are you hoping to get into? A highly competitive one? A mid-level one? Why do you want to go to graduate school? Are you hoping to make a career in academic/research-type work, or clinical practice (Excuse me if this is obvious in your OP; I'm not in the medical sciences.)?\n\nSecond:\n\n* Why has your GPA dropped? Can you identify concrete reasons, or is it simple laziness/lack of drive? Can you cite extenuating circumstances?\n\n* You have one year to graduate. Can you take an overload of courses in both semesters (or all three quarters) and ensure that you get As or A-s in all of them?\n\n* Were the courses you got shit grades in central to your major, fluff courses, or very high-level courses? This matters enormously.\n\nThird:\n\n* I don't know admissions scenario for your field, but I can say that in the humanities, nobody will get into a top graduate program with that GPA unless they can cite extenuating circumstances *and* demonstrate real commitment to the field through conference presentations, publications, or other work related to the field.\n\n* Your best shot will be to take some years off and engage in building experiences. Try to get into labs or other assisting positions. Try to do internships. Try to work with someone on a paper, perhaps. And for fuck[.] sake, build relationships.\n\n\nYou may have a competitive chance at it if you absolutely knock everything out of the water for the next 2-3 years or so. But don't hope for much. "}