{"doc_id": "1508", "name": "2012_01_humanities_student_major_45_japan", "namespace": "we1sv2.0", "metapath": "", "pub": "japan", "title": "2012-01-humanities-student-major_45_japan.txt", "pub_date": "2012-01-02T00:00:00Z", "Sentiment": "0.062", "Subjectivity": "0.427", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "482", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_nyn3q", "Reddit_id": "c3d7qpq", "Subreddit_id": "t5_2qh2u", "Commenter": "[deleted]", "length": "2728", "content_scrubbed": "Everyone here is right, but they're ignoring your situation. You're not a renewing student or a JET-type.\n\nYou'll need a change of status work visa, and you'll need a sponsor that guarantees they pay you enough money for you to live off of. This is not negotiable - you NEED the sponsor. Even marriage isn't a viable option, as you usually have to be married a certain period of time before being able to apply for a spouse visa (in which, your sig. other is your sponsor).\n\nTechnically, you were supposed to tell the immigration office when you quit your job, so the whole \"I'm working a bunch of jobs and have money\" thing is a non-issue, as you're working illegally - the question you're depending on is \"will they care?\" This'll depend on your immigration worker, but I wouldn't go around advertising to the office that you've quit and you're working odd jobs now. Most people who quit, quit with work visas and find another work visa sponsor, so the immigration office, if they notice, don't really care. The people who stick to the letter of the law recognize that after you quit your job and no longer have a sponsor, you have a set period of time (I think 90 days) to switch to a tourist-type visa, which then gives you about 90 days before you're required to leave the country, and forbids you from working.\n\nYou weren't authorized for that purpose, though. The entire purpose of them issuing visas is to encourage what they view as beneficial foreigners to come and work here, and to ensure that random people working odd jobs aren't here, as, according to Immigration, they don't add to Japanese society. They outright tell people this when they apply for Permanent Residency (the visa that lets you be your own sponsor, or be sponsorless). If you get a not-so-nice immigration officer, you'll likely find yourself on a plane home.\n\nIt[.] also likely they won't check if you quit your humanities job/whatever it was, and so if you don't say you're quitting that job, they won't care - however, when I dropped my work visa to switch statuses, they demanded a certificate of having left work... which may screw you.\n\nIn many ways, your best course of action will be to find a company that[.] willing to sponsor you, leave the country, and then have them get you the Certificate of Eligibility that allows you to get a visa upon country entry. This avoids the reality that you've been chilling here working, depending on the view of the officer, illegally.\n\nTL;DR: Find a company willing to sponsor your work visa, and find them soon. The paperwork can take a month or more, and you must have the little \"applied\" stamp in your passport before your visa expires. Without a sponsor, you're very likely going to be sent home."}