{"doc_id": "716", "name": "2012_10_humanities_student_major_327_youshouldknow", "namespace": "we1sv2.0", "metapath": "", "pub": "YouShouldKnow", "title": "2012-10-humanities-student-major_327_YouShouldKnow.txt", "pub_date": "2012-10-08T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.239", "Score": "136", "Upvotes": "136", "Downvotes": "0", "Wordcount": "359", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6jhz5f", "Reddit_id": "c6jkukr", "Subreddit_id": "t5_2r94o", "Commenter": "FoamingBBQ", "length": "2203", "content_scrubbed": "These people tend to miss something important, not purposefully, but as a result of their educations. They frequently think something like this; \"I was an Engineering major. What do I do for a job? Oh, Engineering! You majored in English Literature? What? You're a fool. You can't get paid to go read English Literature.\"\n\nWhich is true. But it misses the point of a good liberal or cultural education. What you'll learn to do with that degree is think critically and write well. *Someone* needs to write all of these research grants. *Someone* needs to administer programs. Jobs in HR, adult training programs, executive assistants, program administrators. Many of these need someone who can write, think, and be knowledgeable about certain aspects of culture.\n\nSay you study Religious Studies. You're not just prancing around studying people while they worship god(s). You're learning about something very important culturally. If you study Islam, you're going to find your cultural knowledge very valuable to quite a few international corporations and government programs.\n\nIf you study East_Asian history, well, you're particularly suited to finding a place in international business. The US is sending tons of people overseas for various reasons, and many of these people need to learn to be at least marginally culturally literate first. You could work in an Engineering department at a University! Someone has to coordinate all of those J-1 students.\n\nWhat about women[.] or African-American studies? Well, you might find that it helps you in HR.\n\nEnglish? Actually, there[.] a lot you can do with this. All administrator jobs require writing skills, and you'll be able to prove you've got great ones before you walk in the door. It[.] a huge stumbling block for many people and organizations.\n\nThe idea that learning about culture or language or general soft skills isn't very useful is wrong. There are tons of things that one can do with any liberal_arts degree. I think one of the problems may be that people with these degrees don't know how to market such things. But there are more administrators, assistants, coordinators, and managers than there are engineers. And they're just as valuable."}