{"doc_id": "775", "name": "2012_10_humanities_student_major_1146_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2012-10-humanities-student-major_1146_Economics.txt", "pub_date": "2012-10-22T00:00:00Z", "Sentiment": "0.116", "Subjectivity": "0.314", "Score": "26", "Upvotes": "26", "Downvotes": "0", "Wordcount": "245", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6q8skd", "Reddit_id": "c6q99fn", "Subreddit_id": "t5_2qh1s", "Commenter": "MELBOT87", "length": "1494", "content_scrubbed": "Two points.\n\nFirst, you are disregarding the risk of default when calculating the societal benefit of the loans (you only consider the risk of default in regards to the banks' calculations). You can't just focus on one side of the equation. If \"society\" values education more highly and this leads to lower interest rates but also higher risks of default - then it could lead to a net loss. The marginal benefits of \"education\" still needs to be greater than the marginal costs. If a college degree cost 5x what is does now, we wouldn't say that the marginal benefits outweigh the marginal costs because education is a positive externality. \n\nSecond, education is not a homogeneous concept. All education is not the same. By artificially holding down interest rates on student loans, you deny individuals the ability to make better decisions about the benefits and costs of studying certain subjects. So private lenders might offer better rates to individuals who invest their time in engineering, computer science or hard_sciences. On the margin, this would encourage more people to enter into these fields and it would discourage people from entering certain humanities because it would be less likely that they could afford the loan payments.\n\nSo in conclusion, subsidizing student loans could very well contribute to a net loss on society both because of an increasing debt burden it puts on students and because it distorts market signals away from more optimal majors and professions. \n\n "}