{"doc_id": "1618", "name": "2012_01_humanities_student_major_1227_assistance", "namespace": "we1sv2.0", "metapath": "", "pub": "Assistance", "title": "2012-01-humanities-student-major_1227_Assistance.txt", "pub_date": "2012-01-31T00:00:00Z", "Sentiment": "0.18", "Subjectivity": "0.376", "Score": "16", "Upvotes": "16", "Downvotes": "0", "Wordcount": "677", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p4uk4", "Reddit_id": "c3mih1o", "Subreddit_id": "t5_2s25d", "Commenter": "jsrjsr", "length": "3969", "content_scrubbed": "**We are accepting donations through the end of March. So if you are reading this and are interested, please donate! I will continue to visit this post frequently to thank donors, respond to questions, and provide updates.**\n\n**[Donation link](http://cmef. org/jsr75)**\n\n**Edit:** At the time of this post, we had previously raised **$3,000** towards our goal of **$13,000**.\n\n* After one hour on Reddit, our total was up to **$3,250**.\n* After one day, we are at **$3,680**.\n* After one week, we are at **$4,495**!\n\nHi! Here[.] some additional information for you:\n\n**Proof:** The pictures have my username in them if you look closely. And CMEF is a registered 501(c)(3) nonprofit with EIN #20-1903954.\n\n**Me:** I am a Teach For America corps member. I teach Calculus and Precalculus at a high school in Oakland, CA. I am 22 years old. I love math, teaching, and wasting time on Reddit.\n\n**My school:** We're in a rough neighborhood – there have been a number of muggings and assaults on our street, and we've been on lockdown before due to gunshots 50 feet away. But we have wonderful administrators who are laser-focused on developing an awesome school culture. 100% of our students are of color (mostly Black and Latino), and 93% qualify for free or reduced price lunch.\n\n**My students:** Driven. Smart. Hilarious. Inspiring. I can't say enough about them... I smile every morning when I get out of bed because I'm so excited to teach them. They've overcome massive obstacles to get to where they are. They're among the top students in our school and are role models for their peers. Many will be the first in their families to go to college, and some have a legit shot at the best colleges in America. But right now, they lack perspective on the opportunities that great colleges can provide them. We meet twice a week after school to study for the SAT and learn about the college process, but nothing inspires a student like an actual visit to a great college. They are going to be blown away.\n\n**Why Boston?** There are more than 50 colleges in the Boston metropolitan area alone, many of which are easily accessible by public transportation. There[.] also a ton of variety – public and private, large and small, liberal_arts and special-focus. I want my students to see many different kinds of schools so that they can make an informed choice when the time comes. Because of the density and variety of colleges in the area, Boston offers the most bang for the buck in that regard. Also, exposure to a new part of the country will be a meaningful experience for them – many have never seen anything besides California.\n\n**Our financial situation:** We have raised $3,000 so far, primarily through donations from friends and family and some creative sales by my students. But we will need another $10,000 to make the trip possible, and it[.] coming up soon.\n\n**To make a donation:** [It[.] super easy! Just click here.](http://cmef. org/jsr75) We are accepting donations through the Corps Member Education Foundation (CMEF), a 501(c)(3) nonprofit that processes donations for programs started by Teach For America corps members. (It[.] sort of like Donors Choose, but for TFA teachers only.) Of course, all donations are tax-deductible. Best of all, there are no processing fees of any kind, so 100% of your donation will go directly to our program.\n\n**Where will your donation go?**\n\n* **Any amount** would be tremendously helpful and so appreciated! Even $5 will go a long way.\n* **$20** would pay for a student[.] transportation within the Boston area\n* **$50** would pay for a student[.] health and travel insurance\n* **$100** would cover the cost of a student[.] meals for the trip\n* **$250** would cover a student[.] accommodations for the trip\n* **$1,000** would \"adopt a student\" by covering all expenses for that student\n\n**Thank you so much for reading this.** Please feel free to ask me any questions. I can be here for the next several hours if there is interest.\n"}