{"doc_id": "642", "name": "2012_02_humanities_student_major_535_srsivorytower", "namespace": "we1sv2.0", "metapath": "", "pub": "SRSIvoryTower", "title": "2012-02-humanities-student-major_535_SRSIvoryTower.txt", "pub_date": "2012-02-16T00:00:00Z", "Sentiment": "0.04", "Subjectivity": "0.332", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "661", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3rsd41", "Reddit_id": "c3ruin0", "Subreddit_id": "t5_2tiqt", "Commenter": "[deleted]", "length": "4085", "content_scrubbed": "All I'm gonna say is that writing even seemingly meaningless statements \"asldfhaposidhf\" can be considered as a philosophy. Philosophical writings should be intelligible, if (and only if) it is for an audience. \n\nWell it[.] interesting to see that you agree with the author of this article.\n\n I am not saying that the seemingly random typing on can be understood by me, but it can be a personal meditation. And as such it can involve thinking, and that is all philosophy can be really.\n\nIn your definition there is nothing that separates any rigorous Academic  pursuit from pure mysticism, the person speaking in tongues at a MegaChurch is just as meaningful as the historian/philosopher/anthropologist. Do you know of anybody who sits down and writes random non-sensical numbers, parentheses, operators, and declares \"AH YES........... MATHS\"?\n\nYou don't believe there are any outsiders in philosophy? Seriously? Seriously? Go fuck yourself. How many minorities, women, or transgendered people are in philosophy? Then compare that to the number of white cis-gendered men. If you don't believe that is a problem in philosophy then go fuck yourself. If you do believe that is a problem, then you must agree that it is a problem of a outside groups in philosophy.\n\nI think we are talking about two different things. You seem to be referring to social outside groups (Non-SAWCSM), and I wouldn't deny that there are problems involving such groups and high-level academia, but that is another topic. I was referring more to 'Philosophical' outsiders, groups who still cling positions that have been rejected by the Philosophical community for a variety of reasons, Objectivists are what I had in mind.\n\n\nI'm not gonna sit here and argue why I think Logic is a exercise in white cis-gendered bourgeois thinking. Why I think truth and rigor are the same exercise in promoting the same power structures. I suppose you wouldn't believe that Anti-Racism Math has any validity?\n\nI didn't even know we were talking about Anti-Racist Math, which if I recall correctly, has more to do with pedagogy then mathematics itself. In fact, I am not even really sure what you are going on about for most  of this post. If you have an idea of what this non-bourgeoisie system of logic would look like, I am interested.\n\nIn fact, I'm not enforcing anything. I want to make the door wide open for philosophy. I don't want any standards. I want people coming up with you would probably call terrible ideas with terrible reasons. I want Philosophers to be free to choose how their argument is supported with whatever language they feel best expresses their thought. This is not something you get to control over.\n\nHuh?\nI won't pretend that academic philosophy is perfect, but it exists, and does so for good reason. It isn't like the institution itself is above criticism, philosophers have always sparred on the nature and role of the academy. Technically either of us could submit a paper to an academic journal, but don't expect much. The reason these standards exist is that there are people who have devoted a large portion of their lives to philosophy, and they come to expect a certain degree of professionalism insightfulness, and rigor. \n\nFor example:\n\nI don't want intellectual enforcement at all! I don't want \"productive\" philosophy. That is just the idea of capitalism making us so willing to accept that everything must be profitable, and that everything must be productive. That type of philosophy just seems slimy. A type of assembly-line philosophy forcing graduate students into non-thinkers. Industrial philosophy! How wretched!\n\nSubmit that to the most Marxist, Continentally-minded, Left-Wing, Theory Journal and see how far you get.\n\nI love what my professor what on \"analytic philosophy\": \"Most analytic philosophy represents the most boring, incestuous, inscrutable and navel-gazing work in philosophy. This fact is often concealed under the label 'rigor'.\" Glorious!\n\nIs this a professor of philosophy, or any of the humanities? Because this is a pretty ludicrous statement.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}