{"doc_id": "651", "name": "2012_02_humanities_student_major_582_harveymudd", "namespace": "we1sv2.0", "metapath": "", "pub": "harveymudd", "title": "2012-02-humanities-student-major_582_harveymudd.txt", "pub_date": "2012-02-17T00:00:00Z", "Sentiment": "0.224", "Subjectivity": "0.428", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "801", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pucde", "Reddit_id": "c3sd2ff", "Subreddit_id": "t5_2spc6", "Commenter": "jtbandes", "length": "4811", "content_scrubbed": "Congrats to your cousin! (Don't worry — \"Mudder\" is indeed the appropriate term!) I'm a sophomore CS/Math major, currently studying abroad in Hungary at [AIT-Budapest](http://www. ait-budapest. com/). Here are some of my thoughts:\n\nI chose HMC for its great professors and opportunities, non-competitive atmosphere, honor code, and the ability to take classes at the nearby colleges. I've had 3 semesters at Mudd which were all great fun. The vast majority of professors are great, happy to talk with students one-on-one (they all hold office hours), and excited about their material. Because of the students' honor code they know they can trust us; many exams, even midterms and finals, are take-home. Even the president and deans of students and faculty have shown that they're open to student feedback regarding the workings of the college. The core curriculum covers lots of technical fields and has interesting and interconnected material. But it will definitely be challenging! (There are great resources on campus such as (student-lead) tutoring programs for each subject, a writing center, and more. Please take advantage of these (there *will* be times when you need help, and don't be ashamed of it!), and even consider working for those programs later on! General counseling services are also available for the Claremont colleges as a whole, and of course we have our own supportive staff members.)\n\nFreshman roommate matching is done very well, and I was easily able to make friends with other students in my dorm and elsewhere. Even though I'm generally a quiet person, I've found people who I really connect well with. Since it[.] a tech school lots of people have common (nerdy) interests, but also share an appreciation for the humanities, culture and whatnot. One of my first nights at Mudd was spent watching math videos on YouTube with a handful of other freshmen. I also quickly connected with other students who play music (by the way, Scripps College across the street is a great place to take instrumental or voice lessons, join choir or orchestra, etc.). And I know many who are interested in gaming (board and video), many in politics, sports, and more... my point is, don't worry about fitting in!\n\nAs I said I'm studying CS/Math (the [joint major](https://www. cs. hmc. edu/program/csmath-major)). I came to Mudd with considerable CS experience so I've moved ahead a bit fast in the normal requirements for the major. That[.] why I was able to study abroad this semester (most people who study abroad do it their junior year). One thing I should mention is that thanks to Mudd (and the Career Services office), I got an internship at Apple last summer, and I'll be at Microsoft next summer. There are lots of tech companies who love Mudders and there[.] a career fair every semester where you can meet some recruiters and hopefully get some interviews. (It[.] dominated by CS-related opportunities, which isn't so great for the other fields, but hopefully your cousin will enjoy.) Also most companies tend to prefer sophomores and above for internships, but that[.] not to say there aren't opportunities to be had for freshmen. There are also great summer research opportunities on campus. Also of note is the [clinic program](https://www. cs. hmc. edu/clinic/) which is required for the major and will provide some real-world experience in software development.\n\n(By the way, you've probably heard this, but don't be afraid if you decide you want to switch majors. It[.] normal. Even though I didn't do it, I had friends who didn't decide on their major for a while. You don't actually have to declare your major until the end of sophomore year, and even then you can still switch if you need to.)\n\nLife is always exciting and there are lots of fun events going on. Mudd is rumored to throw the best parties of the 5Cs. On Wednesday evenings we have random/entertaining events and free donuts. There are plenty of extracurriculars to be had as well. And occasionally Mudders can even be found having fun doing homework! However, be prepared to be *very* busy, *all the time*. This also usually comes with some sleep-deprivation. You may have occasional breaks, but free time in general is scarce (this was frustrating for me because I haven't had much time to work on the personal projects I might have worked on otherwise). This also depends on your time management skills; personally I think mine improved a lot after my first year, so I was a little more relaxed last semester, but this won't necessarily be the case for you. I hear that many people are feeling the heat this semester in terms of workload. It can definitely be overwhelming at times, but you'll have support and other people to commiserate with — and it'll all be worth it!\n\n(welp, that ended up being longer than I planned on)"}