{"doc_id": "621", "name": "2012_02_humanities_student_major_213_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2012-02-humanities-student-major_213_AskAcademia.txt", "pub_date": "2012-02-07T00:00:00Z", "Sentiment": "0.2", "Subjectivity": "0.456", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "499", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pewg3", "Reddit_id": "c3ouet2", "Subreddit_id": "t5_2sakj", "Commenter": "PsiWavefunction", "length": "2799", "content_scrubbed": "I'm actually in a similar situation as you, although with a big advantage of 5 years of in-lab research experience out of my undergrad and being in a small field where enthusiasts are rare and therefore somewhat valued. I would find a lab I'm really excited about and meet personally with the PI, if possible (be sure to emphasise your interest in research and their particular topic above all else). Take advantage of seminars at a local university -- a great way to meet people from around the country/continent without doing the traveling yourself. It[.] much easier to sell yourself in person than on paper in a situation like yours.\n\nIt also helps to aim for more powerful labs; oddly enough, your chances of getting in at top notch labs might well be higher than getting in some obscure, small place (unless the university itself is small and obscure) -- powerful PIs have more of a say in bringing in students they want than their less-influential colleagues at the same department. It shouldn't be that way -- a lot of those small modest labs are great places to learn science and do quality work, with great PIs -- but it is.\n\nTry to overwhelm your GPA with work experience, but even then it can still be quite a barrier. Assuming you're in North_America somewhere, Canadian schools place much less emphasis on the GPA if the PI really wants you, as the funding tends to come more from the lab than the department. In US schools, the departments have more of a say (since they have to support you, and your potential failure), so your GPA becomes a lot more important. Also, US graduate programs are substantially more course-heavy, so they do have a legitimate concern there. Lastly, the biology MSc is largely extinct here (aside from small liberal_arts type schools -- also a potentially good option, btw), whereas it is still a valid and acceptable degree in Canada -- so I may suggest looking up some labs in Canada and see if anything appeals to you there. There[.] some good science up there, and the funding situation is, oddly enough, actually a bit better than it is in the states currently.\n\nIf you're really struggling, maybe look into some schools in Europe -- there[.] quite a bewildering array of diversity there and you may well find some decent programs that barely look at your GPA and instead would want references or interviews a lot more; in fact, some of their graduate postings look more like job descriptions, and in some cases the department has hardly any say at all -- it[.] all about the PI.\n\nI'm currently reapplying to grad school -- rejected last year but came here anyway as a research assistant. If this * knock on wood * works out, then you _can_ still do science in a top notch department after a GPA of 2. 1! ;-) Hang in there! You only need _one_ acceptance!"}