{"doc_id": "661", "name": "2012_02_humanities_student_major_684_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-02-humanities-student-major_684_AskReddit.txt", "pub_date": "2012-02-21T00:00:00Z", "Sentiment": "-0.083", "Subjectivity": "0.215", "Score": "62", "Upvotes": "62", "Downvotes": "0", "Wordcount": "715", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pz6s4", "Reddit_id": "c3te7cl", "Subreddit_id": "t5_2qh1i", "Commenter": "MrJMaxted0291", "length": "3795", "content_scrubbed": "I've had many particularly vivid, nasty dreams, but one of them has stuck with me for better or for worse, and that[.] the Beeman.\n\nI was in my old secondary school in the middle of the night with a bunch of other students, and we were looking for a way out of the school. \n\nWe decided to split up into groups of 2 and went our separate ways searching for the exit. My partner and me, let[.] call him Michael, decided to search the library for a fire exit.\n\nAs we arrived at the library, we heard a blood curdling scream coming from the nearby science block and for some insane reason decided to investigate. We burst into Ms. Leman[.] old science class to find one of the students, or what was left of her, torn to shreds and painted up the walls. \n\nWe decided it would be safer to stick with the others, but one by one we find all of them have been brutally murdered by this monster.\n\nIn the end, it[.] just me and Michael left. We decide to make one last ditch effort to find the exit and scramble for the Humanities department.\n\nAs were passing my old history class, a chill runs up my spine. Something is behind that wall to my right. I just know it! Acting on my instincts, I grab a nearby lead pipe and skewer it through the wall, impaling something on the other side. A raspy growl emanates from beyond the wall, so we run as fast as we can, only stopping to hide under the toilet stalls in the PE changing rooms. It[.] coming for us now. I can hear it scuttling along the showers, searching for us.\n\nIn time, the sounds stop and I marshall what courage I have and emerge from my hiding place. \"It[.] gone, Michael.\" I whisper, He doesnt respond. \"Michael?\". Cautiously, I approach Michael[.] cubicle. Kicking it it open, I find that he[.] disappeared. The monster got him too.\n\nIt[.] just me left, but I wont give up. I'm not going to die in this school, I tell myself. That would be too pathetic. I double back to the humanities department, intent on finding the exit.\n\nI reach humanities, and begin to search for the way out of this twisted school. Shuffling through the history block, I see a door in the distance. It[.] the exit! I found it! As I stride past the IT room, racing to my freedom I hear a grating, raspy voice through the door and freeze in my tracks. \"Where is he!?\" It hisses. Someone else responds, It[.] Michael!\n\nThe exit is in sight, but I cant leave my bro Michael behind. I poke my head round the door to size up the monster, to find a bald, apparently yellow skinned man in a wheelchair, with his back to me, interrogating my comrade. Michael notices me and glances in my direction. sensing something behind him, the yellow man circles around, allowing me to see why he was disabled.\n\nFrom the waist down, he had no legs. Instead, he had a huge beestinger, and beared more than a passing resemblence to Frank Miller[.] yellow bastard from the waist up. \"YOU!\" He yells at me as he points with a boney finger. Wracking my brain for something witty to say, I mumble \"uhhh... Hi\" before bolting for a nearby history class. He rumbles after me in his chair, stinger primed. I maneuvre a table between us, taking advantage of his limited mobility. \"I'M GONNA RIP YOUR FUCKING TONGUE OUT!\"  the beeman snarls, \"COME 'ERE!\".\n\n\"I've got him stuck Michael! Run!\" I yell, and Michael breaks for the exit with no argument. The beeman[.] chases me around the table for a minute or so before I see my chance. I dart for the exit, slamming the history door behind me to slow him down. Reaching the exit, I turn the handle and pull. It wont open! Why wont it open!? WHY!? At that moment, I feel a thud in my leg. I turn to see the beeman has sunk his stinger into my leg, and I scream.\n\nTL;DR, I had a fucked up scooby doo nightmare set in my old school, and everyone died a grisly death."}