{"doc_id": "1615", "name": "2012_01_humanities_student_major_1185_grammar", "namespace": "we1sv2.0", "metapath": "", "pub": "grammar", "title": "2012-01-humanities-student-major_1185_grammar.txt", "pub_date": "2012-01-30T00:00:00Z", "Sentiment": "0.045", "Subjectivity": "0.365", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "1033", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p2cdb", "Reddit_id": "c3m1be1", "Subreddit_id": "t5_2qhwy", "Commenter": "just_say_no_to_tldr", "length": "7723", "content_scrubbed": "\"Language is an ever-changing and developing expression of human personality, and does not grow well under rigorous direction.\" — C. L. Wrenn, The English Language\n\n\"There is no such thing as good and bad (or correct and incorrect, grammatical and ungrammatical, right and wrong) in language. ... A dictionary or grammar is not as good an authority for your speech as the way you yourself speak.\" - Robert J. Hall\n\n\"I love the rabid grammarians. You are the Jehovah[.] Witnesses of grocery labels. For them, the written and the spoken language are a constant torment of misplaced commas, swallowed vowels, and \"uns\" usurping \"ins\". Oh, the bliss of them. They are utterly redundant. The grammarians' ire and fury count for naught. They make not the slightest scintilla of difference to the flow of the great torrent of language; they can't change a single syllable in anyone[.] mouth, or reunite the simplest infinitive. I love them, because they so utterly miss the point, comma, semicolon, exclamation mark.\" - AA Gill\n\n\"[...] I think many rightly criticize prescriptivism because it is one of the last socially acceptable ways to discriminate against people, [...]\" [Alan H.](http://linguistics. stackexchange. com/a/156)\n\n\"What is correct and what is not correct is ultimately only a matter of what is accepted by society, for language is a matter of conventions within society.\"  - Frank Palmer\n\n\"Prescriptivists aren't linguists. That[.] what[.] wrong with them.\" - [redditor Kinbesha](http://www. reddit. com/r/linguistics/comments/kppil/what_is_wrong_with_prescriptivism/c2m82k5)\n\n\"A prescribed academic language isn't an affront to the natural progression of real language, rather it[.] a necessary compliment which helps people access and produce information in a somewhat universal manner. It[.] all about context.\" - [redditor Junipero](http://www. reddit. com/r/grammar/comments/p2cdb/how_do_you_people_cope_with_the_fact_that_as/c3ly7qi)\n\n\n----------------------\n\nI'm a big fan of psychology.  It[.] an enormous, complicated, *fascinating* field of science with a dizzying number of sub-disciplines.  From wikipedia:\n\n* Psychologists explore such concepts as perception, cognition, attention, emotion, phenomenology, motivation, brain functioning, personality, behavior, and interpersonal relationships. Psychologists of widely-varied stripes also consider the unconscious mind.[7] Psychologists employ empirical methods to infer causal and correlational relationships between psychosocial variables. In addition, or in opposition, to employing empirical and deductive methods, some--especially clinical and counseling psychologists--at times rely upon symbolic interpretation and other inductive techniques. Psychology incorporates research from the social_sciences, natural sciences, and humanities, such as philosophy.\n\nBut the field of psychology is not limited to the description and scientific understanding of the human mind.  If I ask someone what a psychologist does, what would most individuals say?  An unscientific questionaire on Facebook reveals the following quote:\n\n* \"A psychologist uses scientific methods to study human behavior in an attempt to understand **and sometimes correct it.**\" [Facebook friend | Emphasis mine]\n\nThere are few who would dismiss a clinical psychologist for helping better a patient; a conservationist for saving the rainforest; a lawyer for practicing law. (Well.)\n\nRarely do we see a clinical psychologist dismiss a behavioral or cognitive scientist.  Biologists do not commonly write passionate essays on the evils of conservationism.  Social scientists do not condemn and villify practicing lawyers. (Well.)\n\nSo why do descriptivists so actively and derisively criticize prescriptivism?\n\n------------------\n**Definitions**\n\nFrom the wikipedia article on [descriptive linguistics](http://en. wikipedia. org/wiki/Descriptive_linguistics):\n\n* In the study of language, **description**, or **descriptive linguistics**, is the work of objectively analyzing and describing how language is spoken (or how it was spoken in the past) by a group of people in a speech community.\n\nFrom the wikipedia article on [Linguistic prescription](http://en. wikipedia. org/wiki/Linguistic_prescription):\n\n* In linguistics, prescription denotes normative practices on such aspects of language use as spelling, grammar, pronunciation, and syntax.\n\nFrom my perspective, those are complimentary fields of study, not the two sides of a hotly contested battlefield.  They are the two proverbial sides of the language coin; two of the many faces on the Great D20 of Words.  Prescriptivism and descriptivism are deeply related sciences (yes, **science**).  Each offers a unique and complimentary perspective of language.\n\nDescriptivism describes language.  That[.] important.  Studying the evolution of  language is a vital technique in the proper study of sociocultural evolution.  The vast array of applied (descriptive) linguistics has proven the importance of descriptivism as a branch of scientific inquiry.\n\nBut that doesn't necessitate that prescriptivism is wrong.  Prescriptivism, at its core, is the *codification*, *pedagogy*, and **description**,  of specific dialect usage.   What[.] more, prescriptivism informs _effective_ usage, a fact that is often ignored by descriptivist linguists.  For this reason alone, prescriptivism should be a core component of [second-language acquisition](http://en. wikipedia. org/wiki/Second-language_acquisition) studies.\n\nBut descriptivists see it differently.\n\n* \"Prescriptivism isn't science.\"\n* \"Prescriptivism hinders the natural evolution of language.\"  \n* \"Prescriptivism is racist!  Antequated!  Unnecessary!  Unhelpful!\"\n\nAnd they're not entirely wrong.\n\n\n----------------------\n**The problems with prescriptivism**\n\nPrescriptivism has been around a long time; afterall, it was the only ascribed method of describing language for hundreds of years.  Prescriptivism has always been slow to actual language change--(uninformed) prescriptivists still decry the split infinitive, the preposition which so foolishly ends a sentence.  Historically, prescriptivists have been resistant and hostile to any change of language.\n\nPrescriptivism is also a key player in social justice issues.  After all, the most commonly prescribed language (Standard American English) is the language of the priveleged.  Traditional prescriptivism and its proponents are often racist, classist, or privileged in some manner.  Brilliant descriptivist-linguist CaitieCat talks about this in great depth in this wonderful article: [clicky!](http://shakespearessister. blogspot. com/2010/04/prescriptivism-classism-racism-three. html)\n\nOftentimes, prescriptivists are just big ole fuddyduddies, and many of them *aren't* proper linguists.  Linguistic theory, as a whole, has barely made a dent in the vast majority of prescriptivist literature.  Prescriptivists who decry, for example, AAVE as \"wrong\" or \"stupid\" or \"lacking of grammar\" are being **racist**, even if they fail to understand why.  Every grammarian with a mind towards social justice should call them out (politely).  Downvote.  Post longwinded replies.  *Do something.*  To do otherwise is to ignore a real issue and gives cannon fodder to every bitter, disenfranchised descriptivist out there.\n\nPrescriptivists have had a bad wrap for a long time, and much of it is rightly deserved.  However, the central question should not be if prescriptivists are wrong (they often are).  The real question asks *if __prescriptivism__ is wrong?*\n\nAnd that[.] a far more complicated question than either side is willing to admit.\n\n--------------------------\nPart 2 to come (hopefully) tomorrow.\n\n---------------------------\n**tl;dr**"}