{"doc_id": "1607", "name": "2012_01_humanities_student_major_1125_therepublicofreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "therepublicofreddit", "title": "2012-01-humanities-student-major_1125_therepublicofreddit.txt", "pub_date": "2012-01-28T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.344", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "616", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p0ynj", "Reddit_id": "c3lnk6q", "Subreddit_id": "t5_2tggk", "Commenter": "1369ic", "length": "3626", "content_scrubbed": "People of the Republic of Reddit, I salute you.\n\nI come before you today to solicit your support for my application to represent you at the constitutional convention of our budding Republic. It is an awesome responsibility, and if selected I shall execute my duties with the diligence and vigor you have a right to expect from your representatives.\n\nTo prove my fitness for this duty I will dispense with further puffery and answer your questions.\n\n**Why do you want to be involved in this project:** I am a student in the liberal_arts with an emphasis on communication and leadership. Writing a constitution is clearly unique exercise in these very subjects. I have also seen the influence online communities can have on real life events, and I am father to 10-year-old. You never know.\n\n**Please introduce yourself. Information pertaining to your education and experiences is the most meaningful. How will this help you as a member of the assembly:** I am a retired enlisted soldier, a father, a government employee, public affairs practitioner and student. The educational highlights of my life so far have been recognizing that I had finished my high school studies more than a full year before my scheduled graduation and being an honor graduate at the U_S Army Signal School. I have also earned a bachelor[.] degree is in liberal_arts, a master[.] degree in journalism, and I am now pursuing a doctorate (not a PhD) in those same liberal_arts. I was also an instructor of Public Affairs for the Department of Defense, as well as being the sergeant major of that same school (roughly the equivalent of the vice principal in charge of kicking the students *and* the instructors).\n\nFurther, I bring some expertise in the areas of communication and leadership, having been a reporter, editor and sergeant major in the Army. I also have experience writing policies and procedures designed to codify the governance of organizations.\n\nMy experience centers on the aforementioned time in the Army, which included extensive overseas duty: three tours in Germany, three tours Korea, a tour in Panama, a brief but occasionally exciting few months in Saudi Arabia and visits to quite a few other countries, almost always unarmed. I believe this international experience will serve the community well, as I have a keen interest in international relations and have spent a lot of time defending -- and failing to defend -- the culture, politics and actions of my country (the U_S).\n\nFurthermore, I was raised in a large Catholic family that was forced to rely on government assistance because of, among other things, the negative effects of World War II on my father. I now firmly agnostic, have only one child and make in excess of $noneofyourbusiness annually, thereby proving I can learn.\n\n**Which historical figure is your favorite, why, and how were they influential:** Abraham Lincoln: soldier, scholar, pragmatist, vampire hunter and a damn fine writer to boot. He also fired quite a few generals and took such bold action it inspired enough hatred to get him shot. You have to respect that.\n\n**Given the option to pick only three words, which three are key to describing you:** Pragmatist, realist, fugly.\n\nI feel it only fair to note that I have a spare Tassimo and a subscription for espresso pods I can bring to the party, but if I make anything that includes cow[.] milk it[.] best to seat yourself near a window. Also, I've been known to eat a lot of celery, so if that bugs you, you know, tough titties.\n\nLastly, it[.] clear my username makes me the perfect choice to chair this convention.\n\nThank you, thank you very much."}