{"doc_id": "602", "name": "2012_02_humanities_student_major_66_gatech", "namespace": "we1sv2.0", "metapath": "", "pub": "gatech", "title": "2012-02-humanities-student-major_66_gatech.txt", "pub_date": "2012-02-02T00:00:00Z", "Sentiment": "0.063", "Subjectivity": "0.375", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "543", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_p7hm3", "Reddit_id": "c3n6r32", "Subreddit_id": "t5_2r8t2", "Commenter": "BigPeteB", "length": "3006", "content_scrubbed": "I chose Tech *because* I knew it would be ball-busting hard. At all the other colleges I visited, when I asked the tour guide about Computer Science, they would say, \"Yeah, they spend so much time on their computers, we like them to diversify and take lots of humanities and CompE and other stuff.\"\n\nGeorgia Tech was the only school that said, \"We think it[.] awesome that students want to dive in as deep as they can in to their field.\" And they were right... by the time I'd finished, I'd taken courses on processors, operating systems, compilers, languages, and lots of other really deep, challenging stuff.\n\nI also like that they wean you off of spoonfed directions. When I got to 3rd and 4th year undergrad classes, projects would sometimes consist of just a couple of paragraphs of description, and it would be up to me to decide how to design my project and how to test it to prove that it did what it was supposed to in order to gain full marks. You can't just blindly follow your prof[.] directions; you have to actually understand what the point of the assignment is as a teaching tool. (As a TA for undergrad and grad students, I found that—no offense—international students were *terrible* at interpreting projects that way, particular the ones from the India and China.) (Hope my description makes sense.)\n\nAs a grad student, I had an unusual experience. I came back for a PhD because I really wanted to teach, but didn't really understand what I was getting in to. After about 3 years I realized I had made a mistake and should have gone to a different school, because grad life at GT is all about research, not teaching. (I ended up switching to Masters and going to industry; that was about a year ago.)\n\nTech offers a lot of extracurricular things to keep students happy and/or productive. Lots of clubs (music, theater, sports, common interests) and options classes (dancing, pottery, etc.). Lots of nice perks on campus (awesome gym/recreation center, lots of cool stuff in the student union, etc.). Laundry machines in dorms are electronic so you can get a text message notifying you that your laundry[.] done. Displays at the bus stop tell you when the next campus bus will arrive. The library is open 24/7, has a coffee shop, has a lot of meeting spaces for working with groups, and a lot of technology so you can sit at a computer and get any kind of work done.\n\nThe problem is that a lot of Tech students are socially stunted, and never take advantage of any of this. Plenty of students have never set foot in the gym. Plenty of students have no idea that our choir and orchestra concerts are usually free. And the ones who do participate in clubs find out that their classload doesn't leave a lot of free time in the week for club activities, so it[.] a constant juggling act. (Think: Okay, I've got a test this Friday, 2 tests next Wednesday, a project due next Friday, I'm supposed to play in a soccer game on Saturday, and oh look the sun is rising and I haven't gone to sleep yet.)"}