{"doc_id": "1576", "name": "2012_01_humanities_student_major_724_ladiesofscience", "namespace": "we1sv2.0", "metapath": "", "pub": "LadiesofScience", "title": "2012-01-humanities-student-major_724_LadiesofScience.txt", "pub_date": "2012-01-20T00:00:00Z", "Sentiment": "0.154", "Subjectivity": "0.372", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "472", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3itzfe", "Reddit_id": "c3iv8jf", "Subreddit_id": "t5_2sg5m", "Commenter": "itsalldark", "length": "2635", "content_scrubbed": "Another plug for the geosciences. My school doesn't offer Geological Engineering so I'm straight Geology but I absolutely *love* the earth sciences. I've often said an art class should be required for our major because of all the sketching we have to do. I like it because it[.] still very science-y but not so much of the staying-up-all-night-cramming type of science that can burn you out really quickly. I was Physics before and man, all that time indoors, with my face in a book just didn't mesh well with me. Geology gets me outdoors all the time and keeps me in awe of the science I'm learning. But I still get lots of lab time and math time, particularly because I'm interested in hydrology which has a good amount of chemistry and fluid dynamics. It[.] combines all of the sciences really well. I went to a science high school and Geology never really occurred to me, so I recommend you definitely look into it at least. Look into a geo class or see if you can go on a field trip in college, it just might convert you like it converted me :)\n\nI second other people[.] suggestions to keep your interest in the arts. If for no other reason, it[.] a good balance when you're taking semesters filled with math and physics and just want to use another part of your brain.\n\nLastly, someone below mentioned the misogyny in STEM fields. I live in a *very* conservative, backwards area (Mormon capital of the world) so it[.] pretty bad here. Sometimes it feels like I've stepped back in time fifty years and the only acceptable careers for women are teaching, nursing, and being a housewife (not that there[.] anything wrong with pursuing any of those, just that it[.] like the *only* thing women can do here). I have a friend in a chemistry class last semester whose teacher would say things like \"now if you're in nursing, [quick glance at the five women in the corner] this might go over your head\" or the whole \"you're bad at this, therefore women suck at it\" that xkcd exemplifies in [this](http://xkcd. com/385/) comic. I've had guys tell me the reason there aren't so many women in STEM fields is because they're just not biologically predisposed for logic. But I'm active in a feminist group on campus and Geology tends to attract a lot of granolas *coughfuckinghippies*, so I've found a safe haven. \n\nAnyway, that[.] my ramble. I wish you the best of luck in your endeavors, and definitely keep up on the AP classes! Getting to college with calc and physics out of the way will definitely help a lot and it'll give you time to explore and figure out what science you want to do. Keep the geosciences in mind, we're totally awesome :) \n\n"}