{"doc_id": "1535", "name": "2012_01_humanities_student_major_388_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2012-01-humanities-student-major_388_AdviceAnimals.txt", "pub_date": "2012-01-10T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.286", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "434", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3fufcr", "Reddit_id": "c3fwmra", "Subreddit_id": "t5_2s7tt", "Commenter": "redditor888", "length": "2483", "content_scrubbed": "Seriously?... Guess I need to give you the engineers side of the story\n\nWriting is a USEFUL skill! I don't understand where you are getting that assumption \"that all engineers hate writing\" from. Honestly, most of the engineers you'll encounter (if you're ever that lucky) write alot of their living; after all we're making things for the general population (non-technical audience to use). And we deal with lawyers... enough said. The reason we're pissed/annoyed about writing courses is we would rather have that time to write up our damn lab reports or write that group proposal that needs to be handed in tomorrow.\n\nLogic is taught in math and science, not just in philosophy. Logic is so tied to math that you can't escape it. Last I checked, when I was designing/testing the avionics of an aircraft, I didn't use the following skills: critical analysis, logic, formation and development of an argument(input/outputs, states) and the ability to convey ideas through writing (test manuals/certification plans) </sarcasm. The fact is, science and engineering already assume you know how to think. I have a friend in philosophy who I respect a lot, but he always keeps saying \"My degree teaches me how to think\". I let it slide and let him have his pride. Engineering and science doesn't just teach you how to think (in fact teaching how to think is contradictory, you either know how to think or you don't, I am not convinced you can teach it), it goes beyond that. And some of the best philosophers I find are physicists. The idea that we all come from star-dust is so profound, that it changes you.\n\nAs for qualifications, yes and no. A lot of jobs require that one have accreditation, even the legal profession. That is why an English Major might have difficulties when it comes to finding a job. There are other degrees that can do something similar. Hell I wrote technology articles on the slide for a weekly publication.\n\nP. S. I don't mean to hate on humanities. I love English as a major; and I would've actually done that as major, but I loved Aerospace more (and wanting to fly also may have something to do with it). I still enjoy the occasional Jane Austin, Charlotte Brontte or George Orwell novel (if I ever found time to read them...) And in all honestly, I envied all my English friends who got to read and write about their favourite books while I did dry Navier Stokes Equations or Thermodynamics. So really, fuck you guys for having all the fun stuff to do :)"}