{"doc_id": "791", "name": "2012_10_humanities_student_major_1299_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2012-10-humanities-student-major_1299_TwoXChromosomes.txt", "pub_date": "2012-10-25T00:00:00Z", "Sentiment": "0.111", "Subjectivity": "0.4", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "351", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_123dmj", "Reddit_id": "c6rx5jr", "Subreddit_id": "t5_2r2jt", "Commenter": "CinCrisis", "length": "1963", "content_scrubbed": "You're not alone. My parents didn't pay my entire way, but they helped a lot. And I didn't make it easy for them. I transferred universities/programs twice in my undergrad, and then went through grad school only to leave feeling more confused than ever. I managed to land a job drafting admin procedures at a post-secondary institution. It is also not my calling. So, now I'm kind of back where you're at, but many years later.\n\nWhat working at a higher ed institution has taught me, however, is that DEGREES are not the only things that land you jobs. Look into continuing ed and diploma programs. There is no reason you need to go to uni for another 4 years. Cont. ed. programs are often practical/career-driven and will give you quicker insight into potential career paths (also, volunteering, as another commenter mentioned).\n\nI'm going to start a 4 month fast-track program in web design in January. I can't wait. I (informally) designed webpages years ago and loved it. Maybe it won't be the ultimate answer, but at least it won't be another 2 years gone.\n\nTHAT SAID (and this is important) - people like to tease us humanities_major for having \"useless\" degrees. Drives me crazy. No, I don't want to be an historian (my major), but I'm still proud of my degrees and of how hard I worked, and am pleased to walk away from the experience having had my mind blown by brilliant professors time and again. I know I see the world differently than I used to and I'm better for it - I'm more mature, thoughtful, and open-minded than I was before my first year of undergrad. I may have grown into this person either way, but I think it would have taken a lot longer to get there. Be proud of your accomplishments, and no matter what you do next, never let anyone (including yourself) convince you that your english degree was a waste of time. Your skills will come in handy in unexpected (if sometimes subtle) ways. I wholeheartedly believe this. And good luck! :)"}