{"doc_id": "761", "name": "2012_10_humanities_student_major_891_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2012-10-humanities-student-major_891_funny.txt", "pub_date": "2012-10-19T00:00:00Z", "Sentiment": "0.023", "Subjectivity": "0.367", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "618", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_11q8eh", "Reddit_id": "c6ou62u", "Subreddit_id": "t5_2qh33", "Commenter": "coomersan", "length": "3813", "content_scrubbed": "I have noticed a trend in college.\n\nPeople from scientific backgrounds (particularly engineering) think they have an intellectual \"leg up\" over other disciplines because their field has an extensive, unfamiliar vocabulary to most people.  Consequently, the nature of their field restricts the scope of understanding.  It is analogous to a group of children who create secret, unfamiliar gestures to signify certain things, and eventually end up seeing themselves as \"better\" because they understand the signs and others don't.  Only people who major in computer science or invest their own time in computer science can understand the language of computer science, and thus it becomes an exclusive club that is populated by people pointing their fingers and laughing at those who haven't learned their vocabulary.  Anyone can learn the concepts of engineering should they decide to learn it; it isn't a natural gift that is present only in certain people.  The same is true for fields in the humanities; anyone can learn it should they choose.  However, I get a general impression from students within the field of engineering that is extremely offensive.  This impression is that it is ridiculous, even inconceivable, that one would pursue a humanities degree that relies less on computation and \"right-or-wrong\" answers, but instead requires more creative, critical analysis.\n    \nLiterature is deceptive this way.  Anyone who speaks English can understand the words written on the pages; the words' connotative, everyday use is cognitively processed by a speaker of the language.  But not everyone can truly appreciate and understand the breadth of the work itself, the subtle implications (intended or not), the psychological effects that descriptive phrases, like our blue curtains, can have on a reader[.] mind.  It takes time to learn how to interpret literature this way, just like it takes time and practice to understand Java.\n\nAs for all the talk about authorial intent and the meaning \"behind\" passages, the only universal rule that can be applied to literature is to avoid, at all costs, universal rules.  Some parts of some books written by some authors have a meaning those authors wanted the readers to understand.  Put in other words, certain themes within works are inescapable.  They cannot be said to mean something else.  The Turn of the Screw can be interpreted into eternity, but one cannot say that James didn't want the reader to feel insecure and anxious in the work.  Likewise, Faulkner[.] works are bottomless pits of analysis, but one cannot say that Faulkner didn't intend the works to be distinctly Southern in time and place.\n \nThen there are those certain themes and passages in works that are left entirely up to the reader.  The color of curtains is most likely one of them.  Yes, blue is a color, and it could be left at that.  But for the careful reader, the color blue might mean something beyond a description, something unique and particular to a reader that no author could have intended.  Perhaps a particular reader vividly remembers the blue curtains of the hospital where his mother died.  Perhaps the reader is color blind from birth.  Who can tell, save the reader himself or herself?  Many people listen to the same song, but the song, whose creation was independent of any particular listener, means many different things to many different people.\n  \nLiterature is slowly dying because too many people laugh and dismiss it in the same way that literature is being dismissed in this thread.  To eschew something as valuable as literature away is doing a disservice to your own self, just as it would be nothing but harmful to purposefully prevent myself from learning things about engineering.  Nothing should ever be shut out intentionally.  What would be the point?\n"}