{"doc_id": "609", "name": "2012_02_humanities_student_major_155_academicphilosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "AcademicPhilosophy", "title": "2012-02-humanities-student-major_155_AcademicPhilosophy.txt", "pub_date": "2012-02-04T00:00:00Z", "Sentiment": "0.154", "Subjectivity": "0.343", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "389", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_pbf2q", "Reddit_id": "c3o0ha6", "Subreddit_id": "t5_2r7v0", "Commenter": "critropolitan", "length": "2427", "content_scrubbed": "I've completed an MA in philosophy, here is my advice:\n\nI assume I will have to buy filing cabinets? \n\nThat seems totally unnecessary to me *unless* you are only comfortable reading things in hard copy.  The *overwhelming* majority of philosophy journals are available in electronic format (jstor for example).  \n\nYou will want a bookshelf though...\n\n How does one keep their research organized as they accumulate hundreds of papers/articles; how can I keep this information organized? \n\nIt is easiest to just keep electronic copies of all of the articles for your papers and thesis and courses.  I have a folder (on my hard drive) for each semester, with subfolders for each course/class, and within those sub folders I have folders for all of the assigned readings, and folders for all of the articles that were not assigned but that I found relevant.  \n\nWhen you write papers, if you use microsoft word, you can keep bibliographic information for everything you are citing which you can use in more than one paper.  It will automatically format your footnotes in the standard humanities citation formats and for your bibliography.  \n\nIf you keep everything electronically it will be easier for you to keep it organized since you can just search for things on your computer.  It might be good to have a desktop organizer tray on your desk to though for the occasional handouts in class you get and for scanned copies of books you can't take out of the library.  \n\nFor library books, you can use sticky notes to save notes (and most universities let their grad students take out books for a long length of time.)\n\nWhat can I do to prepare for the MA program, as someone who lacks a broad philosophy education? \n\nThis advice might sound really random, but I honestly think the best (free) introductory material for someone starting in philosophy is the Stanford Encyclopedia of Philosophy online ( http://plato. stanford. edu/ ) it offers excellent summaries by leading philosophers of most important philosophical topics and the articles are sufficiently short that reading them is not a terrible investment.  They are also frequently updated so most articles have current information.  \n\nIf you want some quick fun reads, personally I love the graphic-novel \"for beginners\" books which, despite being a little silly in presentation, have serious content.  \n\nhttp://www. forbeginnersbooks. com/\n\nMany philosophers are covered.  \n\n"}