{"doc_id": "617", "name": "2012_02_humanities_student_major_196_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-02-humanities-student-major_196_AskReddit.txt", "pub_date": "2012-02-06T00:00:00Z", "Sentiment": "0.002", "Subjectivity": "0.461", "Score": "162", "Upvotes": "162", "Downvotes": "0", "Wordcount": "325", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3oh4xe", "Reddit_id": "c3oicc0", "Subreddit_id": "t5_2qh1i", "Commenter": "scrotingers_balls", "length": "1737", "content_scrubbed": "I had a similar experience. It was the last assignment of my final semester before graduating. I had to write a 10-12 page paper for a humanities class that I had to take to meet the general institute requirements. In my earlier years, I could knock out an essay in an evening/all-nighter. Unfortunately, after 4 years of Engineering courses, I was now highly skilled in writing _concise_ reports. My BS-ing skills were severely lacking. \n\nThe entire evening, things seemed to be going well. I had a strong outline, I was cranking out the paragraphs. Then 2 am hit. I finished saying everything that I had to say, but the length was only 6 or 7 pages. Shit. The paper was due in class later that morning - at 9 am. I had been a Lazy College Senior in that class the entire semester, so I needed to do reasonably well on this paper to get a B. I ended up working all night, skipping class to sleep a few hours, then working on it for the rest of the day. I emailed the professor and my TA at around 8pm (well after the deadline, and after not saying a word to either about needing an extension) with the finished paper, saying I know it was late and that they had said no extensions would be given, I was wiling to take whatever grade penalties they wanted to give me, and that I would rather turn in a well-written paper late than turn in an incomplete paper on time. Then I freaked out about possibly not graduating, went out drinking, and fell asleep in a panic. \n\nI woke up the next morning to an email from my professor. He said he understood that sometimes these things happen, he admired my work-ethic, and that he would accept the paper with no late penalty. I can't even describe the feeling of relief that I felt in that moment."}