{"doc_id": "805", "name": "2012_10_humanities_student_major_1400_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2012-10-humanities-student-major_1400_AskReddit.txt", "pub_date": "2012-10-28T00:00:00Z", "Sentiment": "0.08", "Subjectivity": "0.205", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "557", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_128efe", "Reddit_id": "c6t30pp", "Subreddit_id": "t5_2qh1i", "Commenter": "lilrummager", "length": "3216", "content_scrubbed": "I build a business empire--based in the U_S to fund people in country, based off of completely renewable resources that I eventually fund. A self feeding machine of high quality goods the world hasn't known it[.] needed yet. I spend. I spend. I spend. I pay my workers well. They spend. Once that[.] rolling over properly, I make art to stimulate the people[.] sense of culture. Things that have never been made before. Things that make young artists, and non-alike, think \"holy shit! That[.] amazing! I'm damned sure can do better, though\". Once that[.] filtered into the public I start writing--what I understand to use so the reader can understand themselves, and of course others, to a much deeper level than they may realise. To build the people[.] knowledge of the action/reaction misunderstanding. To understand it is all as one, in one continuous motion. That the patterns of the future are theirs for the making. That there are no set limitations. \n\nOnce that[.] filtered into the populace, I start to fund art programs. I fund teaching programs based off of what the child *wants* to learn--not what they're force-fed. We build scores of scientists, vets, explorers, spacemen, race car drivers, actors, princesses, pirates, teachers, and anything else they may want. They will learn that there are people who will never have the same chances, they will grow knowing they are there to build the future--without the ego of being \"the future\". In twenty years, and after I'm dead, they will do the same. \n\nI begin to build libraries, and have students of the arts have time and funding to build the things they want. Things that they understand must be for what they would consider the greater good. I build a network of mentors only to show a person how to think. Not to do it for them, to coddle them, or deride them--just to teach them how to design and think as they are most efficient. To build within themselves to build out here.\n\nI eventually fund medical research. Beginning with 3-d printing technology as a start, up to genetic engineering. We are sciencefiction.\n\nI fund soup kitchens, medical clinics, proper healthful diet programs tailored for children and adults alike, based on their needs. Not on a set amount of \"supposed to\" rules. \n\nI develop a method of teaching based around what the child wants to learn--*not what the older generation thinks they need.* The prior generation, by a youth[.] age of ten, is already obsolete. They just take a while to realise. Many never do. \n\nI fund farms, and new agricultural developments. Especially water, and air-based purity and extension programs. I buy swathes of land to let these people work, strive, and save. \n\nI save. I save. I save.\n\nI raise my children to know that if they are not working for the greater good, they are wasting their lives--without the weight of knowing that is what they must do. That because they are so lucky, they are required to work for someone else. To make their lives worthwhile--they must show other[.] how it can be. They must build. \n\n\nI teach the world to work tirelessly for one another. I show them how to build. I pay them to learn how. I give minds, sharp and dull, a chance to shine and create. \n\nI innovate. "}