{"doc_id": "751", "name": "2012_10_humanities_student_major_809_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2012-10-humanities-student-major_809_TwoXChromosomes.txt", "pub_date": "2012-10-17T00:00:00Z", "Sentiment": "0.132", "Subjectivity": "0.399", "Score": "17", "Upvotes": "17", "Downvotes": "0", "Wordcount": "239", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6o2dw4", "Reddit_id": "c6o75xg", "Subreddit_id": "t5_2r2jt", "Commenter": "essequamvideri20", "length": "1452", "content_scrubbed": "I think it[.] important to remember that this is a problem in many institutions - we shouldn't limit ourselves by thinking \"oh, Amherst is truly terrible,\" because while this is absolutely horrifying, unfair, and deplorable situation, it isn't restricted to Amherst College alone.  Yes, Amherst needs to work on their policies and methods regarding sexual assault, misogyny, etc. ASAP.  But at the same time, we shouldn't be speaking in ways that put down the entire student body.  Amherst is full of wonderful people and, from what I've seen, currents students are really banding together to speak up about this.  Alums are joining in, and the administration is moving quickly.  \n\nThere is a sexist rape culture present at Amherst, but this is also a larger problem.  I've encountered it when I studied abroad in the UK and when I go to other schools in the US, both public universities and liberal_arts colleges.\n\nI am another Five College student, meaning I go to another college in a consortium (Amherst College, Hampshire College, Mount Holyoke College, Smith College, UMASS-Amherst) about fifteen minutes away.  I don't think my friends at Amherst should be labeled as rape-promoters or rapists.  Let[.] all work on our language here to make sure that we are indeed working TOGETHER, not attacking one another.  We all have the same goals in mind after all, and should stand in solidarity with the brave woman responsible for this powerful article."}