{"doc_id": "713", "name": "2012_10_humanities_student_major_304_personalfinance", "namespace": "we1sv2.0", "metapath": "", "pub": "personalfinance", "title": "2012-10-humanities-student-major_304_personalfinance.txt", "pub_date": "2012-10-08T00:00:00Z", "Sentiment": "0.077", "Subjectivity": "0.462", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "365", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6jd027", "Reddit_id": "c6jd95w", "Subreddit_id": "t5_2qstm", "Commenter": "verik", "length": "2140", "content_scrubbed": " There is nothing wrong with majoring in Political Science, Music, or English.\n\nI didn't say there was.  Political science especially has potential for practical uses.\n\n bitching they deserve a job\n\nCompletely agree regardless of what degree they achieve.  One thing most people have forgotten and just blame on the \"economic crisis\" is that it used to be normal to have to relocate to find entry level work in a specific degree.  This generation doesn't understand how to get a job unfortunately and its far too easy of a scapegoat to just blame it on the economy.  Just a note, this opinion is coming from someone who graduated <2 years ago and have too many friends who can't comprehend this.\n\n But I'm my opinion, your major, like anything in life, is what you make of it\n\nOnly to an extent.  There are certain degrees that have limited practical use in the job market by themselves.... Most biology degrees have limited opportunity by themselves.  It[.] almost a necessity to pursue post graduate education (med school or phd in biology) to justify it.  Most jobs requiring just a BS in Biology are lab tech jobs paying 25k a year with very limited upside potential (these jobs have become intended to be glide year jobs in between graduating and post grad).  Many of the pure science majors require dedication (and work ethic) to pursue into post grad to make them practical in the market.  That[.] why they are known very commonly as academia majors. \n\nOn the other hand, even an average 2. 5 gpa mechanical engineer can have fairly good chance of finding work that has upside potential. \n\nThe point where there is no direct line of potential job market is when you start getting into the vast number of arbitrary liberal_arts degrees.  When you start having schools offering \"creative writing\" majors for $30k/year... even as a 4. 0 student there are very limited (if any) jobs out there that are specifically hiring a creative writing major.  You have such a niche degree that is virtually nonexistent on the job market and its requiring the same debt level as degrees that have much higher pay grade and graduation placement rates."}