{"doc_id": "608", "name": "2012_02_humanities_student_major_144_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2012-02-humanities-student-major_144_funny.txt", "pub_date": "2012-02-04T00:00:00Z", "Sentiment": "0.126", "Subjectivity": "0.426", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "263", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3nxm5o", "Reddit_id": "c3nxq58", "Subreddit_id": "t5_2qh33", "Commenter": "[deleted]", "length": "1517", "content_scrubbed": "I doubt many get into history without expecting to either teach, research, or write.  The problem is many that get into the major do not know how to translate their knowledge into practical knowledge that gives us profound insights into the present.  You understand some important things about Rome?  Great!  But what does that mean for us *today*.  History should be called something else.  It should be called Present, because anyone studying history to only understand a time in the past are doing it wrong.  A serious historian studies the past to better understand the present.  \n\nIf someone goes into history thinking they will get a job solely based on having a degree that person is going to find the job market unforgiving.\n\nIf someone goes into history to learn about present problems and their relation to the past and sheds new light on modern problems will more than likely find a lucrative career in either teaching, writing or politics.  \n\nIn the liberal_arts its *all* about one[.] thesis.  If you have only decent grades and write a thesis that has practical answers to questions big wigs are trying to solve everyday doors will instantly be opened to you.  I suppose you do not even need to solve problems, but rather give a new perspective on a subject that will entice those with money to get you a position somewhere.  If you get great grades and write a thesis that is instantly going to be forgotten you will find yourself obtaining a job that you could have gotten with almost any other degree."}