{"doc_id": "800", "name": "2012_10_humanities_student_major_1360_physics", "namespace": "we1sv2.0", "metapath": "", "pub": "Physics", "title": "2012-10-humanities-student-major_1360_Physics.txt", "pub_date": "2012-10-27T00:00:00Z", "Sentiment": "0.128", "Subjectivity": "0.44", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "761", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_125mbc", "Reddit_id": "c6simfw", "Subreddit_id": "t5_2qhi6", "Commenter": "tankschmidt", "length": "4265", "content_scrubbed": "First off, my experience relates to the U_S.  The European system is remarkably different with regard to both education and career possibilities.\n\nA meaningful life in physics requires a PhD, and a career in academia or at a national laboratory requires postdoctoral experience as well.  A PhD will take five to eight years to complete, and two to four years of postdoc work at one or two different institutions is typical.  During the vast majority of this period you will be doing research, and that research will take place within the group of an established scientist.  If you want to know what it is like to be a physicist, join a group at your university this summer and find out if you like research and if you could be good at it.  My opinion is that your second year of college is not too early to start working in a lab, although many professors unfortunately still disagree on this point.  You may have to ask many members of your department before receiving an invitation to join a group.  If you attend a small, liberal_arts school with a small or no PhD program, you will have an easier time.\n\n\"Busting one[.] ass\" to get through school, as you put it, is definitely the easy part.  Postdocs work longer and harder than graduate students, who in turn work longer and hard than undergraduates.  Assistant professors work even longer and harder.  It is natural to be irritated when business majors spend much less time in the library than you do, but that will not change if you choose to continue along this path.\n\nIn physics, the hours are long, and the pay is modest.  Any research or reaching/teaching physicist could find another job, work fewer hours, and get paid more money.  But we do not because we love what we do.  My wife works a 9-5 job and to this day does not understand why I work 60+ hours a week without receiving overtime pay.  One reason is that I could not succeed without putting in these hours.  The second is that, frankly, I enjoy my job every day.  Something new and exciting and interesting is always coming up, and the hours fly by.  I literally never have a boring day at work.\n\nHaving to apply for grants is very far in the future for you, so my advice is not to worry about it at this point.  Just find out if you are a good fit for the research lifestyle.  It is true that grant writing is very competitive, and the deadlines and rules are somewhat arbitrary and extremely strict.  If you pursue a career in physics, however, you will change in many ways before it is your turn to apply for funding.  Professionally you will be a different person entirely, so please do not be intimidated by this part of the job so soon. \n\nI do not know much about working outside of the fields of research and academia, but I have many friends from school and former colleagues who now work designing and testing RAM or fuel cells for companies, working as government or military analysts, or making bank in financial or consulting firms.  Industry jobs typically pay much better than academic or national lab positions, and it is not uncommon to start at six figures immediately after a PhD.  The price you pay is that you are not free to pursue your own interests.\n\nNow that I have mentioned salary, you should know that tuition is usually paid for in full for physics graduate students.  You will also receive a yearly stipend of about $20,000.  I did not know this when I was an undergraduate.  For this stipend, you will be expected to work as a teaching or research assistant.  You may also be supported by a fellowship, freeing you of these obligations, and allowing you to finish your coursework more quickly.  Interest on any student loans you may have from college is deferred until you finish your degree, so you can start to pay the loans down while in graduate school.  This is a nice perk.\n\nAcademic postdocs typically make in the neighborhood $30-40k, and national lab postdocs $50-70k.  Assistant professors start near $70k as well.  You are not going to get rich, but you will live comfortably.\n\nLet me also mention that it is impractical to create your own lab in your garage, to run it without external funding and without students, to manage a separate career on the side, and to do any meaningful physics."}