{"doc_id": "710", "name": "2012_10_humanities_student_major_286_sociology", "namespace": "we1sv2.0", "metapath": "", "pub": "sociology", "title": "2012-10-humanities-student-major_286_sociology.txt", "pub_date": "2012-10-07T00:00:00Z", "Sentiment": "0.157", "Subjectivity": "0.354", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "352", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c6gsd07", "Reddit_id": "c6j7bqh", "Subreddit_id": "t5_2qhbo", "Commenter": "Spike716", "length": "2222", "content_scrubbed": "Well, as a non-subscriber to this subreddit (I'm just browsing), I'm going to go ahead and defend econ and business. I'm sure my opinion won't be popular here, but you'll get the benefit of a different perspective.\n\nI've found that most of the actual *content* taught in \"social science\" courses is hogwash. None of it is very scientific and professors of all subjects end up confirming their own dogma. However, the classes are useful for strengthening your skill sets in different areas. \n\nWith that said, it looks like sociology majors end up in one of two camps: qualitative and quantitative. Qualitative sociology is super interesting, but also very wishy washy and masturbatory. The only thing this will really qualify you for (if you're lucky) is writing high-end magazine articles that will ultimately end up in /r/Foodforthought. Quantitative sociology is also kind of interesting, but is really just a watered down version of economics and psychology. \n\nI was an econ major with a focus in behavioral finance at a small liberal_arts school, where I also read plenty of sociology, psychology, and philosophy. Even academic economics tends to be a bit dry, I used the slightly more rigorous skill set from that area to focus on what interested me outside of class. Also, having an economics major on my resume helped me infinitely more than psychology (the most popular major in America) or sociology (which is seen as largely worthless outside of academia, rightly or wrongly) would have. \n\nAdditionally, I think economics and business are very interesting from a sociological and anthropological perspective. Some of that may not get through in microeconomics 101 (which will be very math-based and abstracted from reality), but it[.] there. I would recommend picking up a copy of [The Origin of Wealth](http://www. amazon. com/Origin-Wealth-Evolution-Complexity-Economics/dp/157851777X), which looks at business and econ through the lens of anthropology, information theory, biology, sociology, and psychology. \n\nOverall, I'd say to try a bunch of different classes at the beginning, focus on what you want to do with your life after college, and use your major as a stepping stone to get there. \n\nHope this helps."}