{"doc_id": "635", "name": "2012_02_humanities_student_major_403_calgary", "namespace": "we1sv2.0", "metapath": "", "pub": "Calgary", "title": "2012-02-humanities-student-major_403_Calgary.txt", "pub_date": "2012-02-13T00:00:00Z", "Sentiment": "0.033", "Subjectivity": "0.188", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "518", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3qfxap", "Reddit_id": "c3qpep4", "Subreddit_id": "t5_2qn40", "Commenter": "ekster", "length": "3402", "content_scrubbed": "http://arts. ucalgary. ca/departments-programs/womens-studies\n\nWhat is Women[.] Studies?\n\nWomen[.] Studies is about the diversity of women. The program explores the social construction and variability of gender. We also examine how power relations linked to race and ethnicity, social class, sexual orientation and ability/disability impact the lives of women on the local as well as on the global levels.\n\nRelatively new, women[.] studies programs developed within the second wave of feminism in the 1970s. They give university curricula a focus on women and on women[.] experiences, history, social movements and activism, literature and achievements. Today, Women[.] Studies is a dynamic field that continues to grow and develop as new research and perspectives emerge.\n\nAt the U of C, Women[.] Studies is a liberal_arts program that draws from, and contributes to, many academic disciplines including sociology, political science, history, philosophy, economics, English literature, psychology, religious studies, natural sciences and the arts. Women[.] Studies students learn feminist theories, analyses and research methodologies along with oral and written communication skills. Students also have the opportunity to apply this knowledge in feminist praxis and community service learning courses. The knowledge students gain in cultural and political literacy can help them to become an agent of change in our society, and in the institutions and organizations in which they become involved.\n\nIs Women[.] Studies Just for Women?\n\nNot surprisingly, our students reflect the cultural diversity they study and are of all ages, ethnicities, socio-cultural backgrounds, genders, sexual identities and beliefs. Although Women[.] Studies focuses on women, it is not exclusively for women. Men can and do pursue majors and minors in the program.\n\nWhatever your background, gender or interests, you'll find a major in Women[.] Studies relevant to the current events, issues, work and studies of daily life. A combined major or a minor in Women[.] Studies complements almost every major area of study at the University of Calgary and many students choose to combine Women[.] Studies in a joint major with another program of interest.\n\nWhy Minor in Women[.] Studies?\n\nA Women[.] Studies minor is compatible with any major area of study!\n\nIt will provide you with an interdisciplinary component to your degree and is flexible enough to be tailored to any set of interests.\nIt will contribute to your training as a critical thinker and will offer a counter-balance to major areas of study that might not place women at the center of academic inquiry.\nIt will help to prepare you for graduate or professional school and will contribute to your employability by offering you the opportunities to develop your analytical, research and communication skills\nCareer Paths\n\nWomen[.] Studies and other liberal_arts degrees open doors to a wide range of professions and careers. Graduates have pursued careers in the following areas:\n\n* Advocate\n* Business\n* Campaign Organizer\n* Caseworker\n* Clinical Social Worker\n* Community Organizer\n* Education\n* Film Maker\n* Fundraiser\n* Gender Development\n* Government Relations\n* Grant Writer\n* Issue Expert\n* Journalism\n* Legislative Counsel\n* Lobbyist\n* Market Researcher\n* Policy Analyst\n* Political Director\n* Public Administration\n* Public Policy Advisor\n* Reproductive Health Counsellor"}