{"doc_id": "662", "name": "2012_02_humanities_student_major_690_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2012-02-humanities-student-major_690_canada.txt", "pub_date": "2012-02-21T00:00:00Z", "Sentiment": "0.24", "Subjectivity": "0.437", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "294", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3tfm9r", "Reddit_id": "c3tfvri", "Subreddit_id": "t5_2qh68", "Commenter": "[deleted]", "length": "1701", "content_scrubbed": "With the way funding is set up for regulated and unregulated programs the tuition to liberal_arts is fixed at a low rate while the unregulated programs are able to increase tuition costs to cover the shortfall.\n\nThe two main faculties that are not protected (and this goes by a University by university basis, and are certainly not universal as you claim) are Law and Medicine, while some also include Dental/Pharm in that as well. \n\nWhile you are right to comment that tuition increases in Medicine are not fair, to suggest that increasing the Arts is the_right move just seems to be a move of bitterness. \"We have to pay more, so you should to!\" doesn't fly when the average wage for a doctor in Canada is $200,000/year. \n\nIn addition, professional faculties receive a far higher $/student in provincial funding, often through specific grants, than any arts faculty. This includes huge grants from provincial and federal governments, as well as individual contributions from large donors. At my campus, the last large donor for the arts fac was almost 50 years ago. The last large donor for the Fac of medicine was... TWO years ago.\n\nI think there is a way for this to be win win. I support the Fac of medicine having a high tuition because it costs a lot to operate. I also support that targeted forgiveness of student loans is great way to motivate doctors to practice in fields and locations that are experiencing a shortage, particularly GPs in rural communities.\n\nEDIT: On a side note, I find what you are implying pretty despicable. You want arts students to fund medical school when most arts departments across the country can barely pay for what they currently have from their own students. "}