{"doc_id": "1510", "name": "2012_01_humanities_student_major_57_cogsci", "namespace": "we1sv2.0", "metapath": "", "pub": "cogsci", "title": "2012-01-humanities-student-major_57_cogsci.txt", "pub_date": "2012-01-02T00:00:00Z", "Sentiment": "0.06", "Subjectivity": "0.204", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "337", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3dbg79", "Reddit_id": "c3dbmwe", "Subreddit_id": "t5_2qh0k", "Commenter": "manova", "length": "1920", "content_scrubbed": "Well, I talked about what is wrong without offering any solutions.  Here are my ideas.  First, quit the emphasis that everyone needs to go to college.  This starts with employers.  The receptionist does not need a college degree.  A factory worker does not need 4 year degree.  Tech support and daycare workers do not need a degree (my school just started a 4 year degree for both of these).  Professions that need a 2 year degree (or much less) can lead to comfortable middle class lifestyles.  We need to teach kids about this.  \n\nNext is to change the expectation about college.  Too many look at college as a ticket to punch to get a job.  They attend class, study when they have to, and expect their good GPA to equal a higher salary.  College is about the experience.  Not getting drunk at football games (though I would argue that learning how to socialize and appropriately consume alcohol is an actual job skill).  College is a sandbox.  You have access to great resources (libraries, computers, lab equipment, people with PhD[.]) that you will not have access to later or would have to pay very high consulting fees.  I recently visited a friend of mine at a high dollar liberal_arts school to tour his lab late on a Friday evening (5 or 6pm).  Every lab we walked past had undergraduate students working on independent research projects.  It should be clear to students that during their four plus years of college, they should have a goal of creating something.  Write a program, start a company, start a charity, write a book, publish a scientific paper.  You have faculty that will help you accomplish your goals.  They want to work with motivated students.  But you cannot do this if you go back to your apartment right after class and never interact.  \n\nThe classroom is for learning facts, and the rest of college is for experiential learning.  College is what you make out of it, so make the most of it."}