{"doc_id": "1609", "name": "2012_01_humanities_student_major_1139_cerebral", "namespace": "we1sv2.0", "metapath": "", "pub": "cerebral", "title": "2012-01-humanities-student-major_1139_cerebral.txt", "pub_date": "2012-01-28T00:00:00Z", "Sentiment": "-0.007", "Subjectivity": "0.307", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "371", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3l9rhh", "Reddit_id": "c3lpy1z", "Subreddit_id": "t5_2skzt", "Commenter": "lukejmo", "length": "2141", "content_scrubbed": "I think giving your opinion on an ideology could easily be constructive and interesting. What you just said about killing millions of people, for instance, is what I mean by constructive and interesting. It[.] something that I could read and go, \"Hm, maybe this guy has a point. I'll think about that.\" Or maybe I might disagree with you for reasons x, y and z and I might want to respond to you. Just randomly calling a very diverse and complex movement like Communism (or Capitalism, or Fascism, whatever) a \"cunt\" is pretty lame. \n\nPeople who don't think Communism is a cunt will think you're an idiot. People on the fence about Communism will get the impression that anti-Communists are small minded people who have just enough hate to write something negative, but not enough brain cells to write anything beyond a school-yard insult. People who already have made up their minds about Communism probably never read your comment in the first place. Pretty basic rhetoric.\n\nMaybe, just maaaybe some one has read what you just said about genocide, and they now agree with you. Because you have now said something with a semblance of content. Do you understand? \"Communists are cunts\" is vague and says barely anything about Communism and a lot about you.\n\nAre Communists cunts because they are literally giant vaginas? Because you don't like their attitude? Because you have a strong belief in the power of the free market? Because you have performed a close study of the works of Hayek and Milton Friedman and the willful ignoring of these economic giants' works by wanna-be radical liberal_arts college students is a travesty? Because the girl who rejected you in 10th grade was the great-granddaughter of Leon Trotsky? Because you think Che Guevara shirts are annoying? Great! Then put it out there for all the internet to hear. Go for it. I'll listen to what you have to say. The prophet Muhammad said, \"Seek wisdom, even unto China.\" In this case my friend, you are China. \n\nWhat I'm trying to say is, I don't mind if you want to say negative things about Communism. Whatever, man, go for it. Just stop being so damn childish about it."}