{"doc_id": "715", "name": "2012_10_humanities_student_major_316_uva", "namespace": "we1sv2.0", "metapath": "", "pub": "UVA", "title": "2012-10-humanities-student-major_316_UVA.txt", "pub_date": "2012-10-08T00:00:00Z", "Sentiment": "0.003", "Subjectivity": "0.445", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "356", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_115d36", "Reddit_id": "c6jigkx", "Subreddit_id": "t5_2rcav", "Commenter": "pfs3w", "length": "1945", "content_scrubbed": "I will assume you posted this status with the intention of politely declining any advice to use your time at college to prepare for a career outside of college, but when you say \n\n let[.] just say my degree isn't going to help with what I want to pursue in life.\n\nI'm curious as to why this is so (not that I'm demanding personal info or anything, just an inquiry).\n\nThat said, it[.] going to be based on two *major* factors (with other smaller considerations coming into play as well):\n\n* **Factor 1**: What are you already good at and/or interested in?\n\nDid you come out of high school with a proficiency in programming in Java? Then consider going for a major that uses that background and puts you ahead, so you can fill requirements faster. Did you take a bunch of AP French, and are almost fluent in it? Make French your major. Play an instrument? Music theory. If you are interested in some of those, mention it, and someone who had that as a major can offer what they thought and how easy it was.\n\n* **Factor 2**: What kind of work do you consider *hard* or *easy*?\n\nDo you HATE reading assignments? Well, most language or history majors are going to assign a metric fuckton of pages to read for each assignment. Hate writing papers? Don't do a liberal_arts major. Can't stand numbers or formulas? Then math, science and engineering are most likely out. Same as before, what are you best at and don't mind doing as an assignment, and people can offer options where that type of work is or isn't likely.\n\nAt the same time, I'm really curious as to what your prerogative is for looking for the easiest way out. I'm used to people asking for the easiest \"classes\" to take for a semester, but no one who is interested in going to college for little gain and really just for a degree.\n\nIt sorta devalues what the rest of us worked hard to achieve. Not that it[.] your intention, and I shouldn't be personally offended. I'm just *really* curious."}