{"doc_id": "1549", "name": "2012_01_humanities_student_major_512_christianity", "namespace": "we1sv2.0", "metapath": "", "pub": "Christianity", "title": "2012-01-humanities-student-major_512_Christianity.txt", "pub_date": "2012-01-13T00:00:00Z", "Sentiment": "0.106", "Subjectivity": "0.22", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "359", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_og4af", "Reddit_id": "c3gyqiq", "Subreddit_id": "t5_2qh6c", "Commenter": "[deleted]", "length": "1897", "content_scrubbed": "Well, I'll try to speak from experience.\n\nI was kinda like this when I graduated high school. As in, I can literally remember walking out after graduation, in my cap and gown, with my family beside me, thinking, *Now what?*\n\nWell, I figured I should get a job first. So, I walked uptown, applied at a McDonalds, and got one. I didn't really have any money for college at that time, nor did my family have any to send me, so it seemed like the most sensible thing to do.\n\nI worked there and as a waitress at Cracker Barrel for two years. My life didn't have too much purpose in those days, and I watched friends go off to Bible college. In year two, I started praying about going to college. A friend of mine, who attended a different college, handed me a magazine one day, with an article that talked about God[.] leading in your life. The magazine was published by the college I ended up at- it was one of the two I was praying about at the time.\n\n(Long story shorter) While there, I started as a Humanities Major (also known as a clueless major), but continued to pray about what major to go into. With prayer and listening to suggestions from family, I ended up in Education.\n\nI don't **love** *all* of what I do, but there are definitely aspects of it that I can see that God knew I would fit here.\n\nMany people try to do what they say they *love.* But it may also be that God wants you where your talents lie. I'm not sure which is the best way to direct yourself out of those two, since I myself wonder about it from time to time. (I've been teaching awhile now.)\n\nBut I would say that, first and foremost, you should definitely consult Him on what He thinks would be best for you. Also, remember that He knows what direction you're going to go, and knows what lessons He has prepared for you there. Technically and spiritually-speaking, you can't really go wrong with this. God is in it all."}