{"doc_id": "1569", "name": "2012_01_humanities_student_major_669_atheism", "namespace": "we1sv2.0", "metapath": "", "pub": "atheism", "title": "2012-01-humanities-student-major_669_atheism.txt", "pub_date": "2012-01-17T00:00:00Z", "Sentiment": "0.118", "Subjectivity": "0.365", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "636", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_c3ibwoe", "Reddit_id": "c3ibyrn", "Subreddit_id": "t5_2qh2p", "Commenter": "TwistedSic", "length": "4249", "content_scrubbed": "Second Half: 95 (7) \"Hypothesis\", a scientific theory reflecting a minority of scientific opinion\n96 which may lack acceptance because it is a new idea, contains faulty logic, lacks supporting\n97 data, has significant amounts of conflicting data, or is philosophically unpopular. One\n98 person may develop and propose a hypothesis;\n\n    ·         This is false.  A hypothesis is a proposed explanation of observed phenomena.\n    ·         http://en. wikipedia. org/wiki/Hypothesis#Scientific_hypothesis\n    ·         Note that Intelligent Design does not meet the criteria to be a hypothesis of consideration. It is not falsifiable or fruitful and relies on the existence of a trans-dimensional being.\n\nIn conclusion I must protest that House Bill # 1227 not be passed. Intelligent Design has no foundation for teaching,  of the dozen or so peer reviewed articles written in the last 20 years each one has failed to be featured in a major science journal, is not a hypothesis and does not have legal grounds to be taught in school.\n\nSee Kitzmmiller vs Dover in which it was ruled that Intelligent Design is merely another name for creationism and is unconstitutional to be taught in school. http://en. wikipedia. org/wiki/Kitzmiller_Vs_Dover\nAlso see the \"Wedge Strategy\" document.\nHTML:  http://www. antievolution. org/features/wedge. html\nPDF: http://www. antievolution. org/features/wedge. pdf\nThis document leaked from the Discovery Institute (the primary proponents of Intelligent Design) outlines a  5 and 20 year plan with the following goals.\n\"Governing Goals\n\n    To defeat scientific materialism and its destructive moral, cultural and political legacies.\n    To replace materialistic explanations with the theistic understanding that nature and human beings are created by God.\n\nFive Year Goals\n\n    To see intelligent design theory as an accepted alternative in the sciences and scientific research being done from the perspective of design theory.\n    To see the beginning of the influence of design theory in spheres other than natural science.\n    To see major new debates in education, life issues, legal and personal responsibility pushed to the front of the national agenda.\n\nTwenty Year Goals\n\n    To see intelligent design theory as the dominant perspective in science.\n    To see design theory application in specific fields, including molecular biology, biochemistry, paleontology, physics and cosmology in the natural sciences, psychology, ethics, politics, theology and philosophy in the humanities; to see its innuence in the fine arts.\n    To see design theory permeate our religious, cultural, moral and political life.\"\n\n The document also list several agents in support of this cause including head Intelligent Design proponents Michael Behe, William Dembski and Paul Nelson. ID is clearly a religious endeavor in the guise of pseudoscience. At the end of the Kitzmiller v. Dover trial Honorable Judge Jones included the following within his 139 page decision.\n \n\"After a searching review of the record and applicable caselaw, we find that while ID arguments may be true, a proposition on which the Court takes no position, ID is not science. We find that ID fails on three different levels, any one of which is sufficient to preclude a determination that ID is science. They are: (1) ID violates the centuries-old ground rules of science by invoking and permitting supernatural causation; (2) the argument of irreducible complexity, central to ID, employs the same flawed and illogical contrived dualism that doomed creation science in the 1980s; and (3) ID[.] negative attacks on evolution have been refuted by the scientific community. ...It is additionally important to note that ID has failed to gain acceptance in the scientific community, it has not generated peer-reviewed publications, nor has it been the subject of testing and research. Expert testimony reveals that since the scientific revolution of the 16th and 17th centuries, science has been limited to the search for natural causes to explain natural phenomena\"\nIntelligent Design is not science, it does not belong in a classroom, and children should not be lied to and told that it is an alternative to Evolution Theory.\n \nThank you for your time,\n \nMyrealname..."}