{"doc_id": "691", "name": "2012_10_humanities_student_major_44_finland", "namespace": "we1sv2.0", "metapath": "", "pub": "Finland", "title": "2012-10-humanities-student-major_44_Finland.txt", "pub_date": "2012-10-02T00:00:00Z", "Sentiment": "0.119", "Subjectivity": "0.437", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "973", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_10t0rl", "Reddit_id": "c6gdrjd", "Subreddit_id": "t5_2qztz", "Commenter": "Terrakki", "length": "5545", "content_scrubbed": "I'll give you couple of fast answers from top of my head. Other people can feel free to correct me.\n\nI don't really have clue about the possibilities offered to foreign students who aren't part of the an exchange program. I hope someone else can explain those things to you, or you could contact the Finnish school yourself and I'm sure you would get a satisfactory answer. However, I think at least the student housing should be available even if you aren't part of an exchange program.\n\n\n* What[.] a typical rent per month for a studio apartment in a city? In a college town?\n\nMe and my friend paid a total of 736 euros a month for 75 square-metre studio apartment which was rented from HOAS. I was in the most western parts of Helsinki, right next to the sea and 30min bus ride away from the city center. The rent included electricity, water, heating and even a slow but stable internet(2/1 Mbit, but we upgraded it to 100/10Mbit for extra 20 euros a month).\n\n\n* Roughly what is the cost of living? (incl. rent, food, transport, etc)\n\nDepends on how much you want to spend on drinking and other past time activities. For me it was 368 euros on rent and around 200 euros on food and maybe 50 euros on alcohol every month. Although I was spending way too much on food actually. Not bothering to cook properly myself more than maybe twice a week so I ended up buying a lot of expensive, unhealthy and not so good tasting ready-made market foods. I have heard fellow students can spend under 100 euros on food in a month.\n\n\n* Is there reliable, convenient public transport in the cities?\n\nYes, absolutely. We have really good bus and tram network in the cities. And one subway line as well, which is also pretty handy if you happen to live close to it. I think more subway lines will be built in coming years.\n\n\n* My grades really aren't outstanding. Is it difficult to get into Universities/Polytechnics in Finland? Are they very competitive with enrollment?\n\nPolytechnics are fairly easy to get in, at least if you are applying for the engineer degrees. Other degrees such as a degree of social work(kindergarden teachers, etc.) are a bit harder to get into. Universities should be even harder to get into, but I don't have any personal experience on that. I have applied twice to different degrees(IT/Software engineering and Car/Logistic technology) in Metropolia, University of Applied Sciences and both times I have gotten in rather easily even with not so good entrance exam scores. Although my high school grades are a bit better than average but still not outstanding by any means.\n\n\n* I'd like to study software engineering. I have plenty of practical experience and skill, though I have never been very great at math by the book. Do entrance exams have a heavy emphasis on mathematics?\n\nAt least the entrance exams the local people have to take when applying to software engineering are pretty math/physics/chemistry heavy. Another part is the part where you are given a 5-10 pages long text written in Finnish about something and you have 20 minutes to read/study it as well as you can and then you will have to answer a few questions about it as well as you can. Don't know if foreign students will have to do this part at all, or if they are supposed to do it with a text written in English. Software engineering studies themselves include quite a bit of mathematics and physics (8 courses, I think) since those are requires for you to be able to call yourself an engineer (no matter which is your area of expertise).\n\n\n* Do Universities/Polytechnics care more about entrance exam scores or transcript grades when considering prospective students for enrollment?\n\nFor the local students there is a system where every applicant will be scored by their grades, entrance exams results the fact which school/education program they want to get in the most (you pick your favourite and gain a couple of extra points for you total score towards that school/education program). Again, I have absolutely no idea how this would work on a foreign student.\n\n\n* Is it possible to take an entrance exam abroad?\n\nI'd assume it is. But again, I'm not totally sure.\n\n\n* Are entrance exams uniform throughout the country, or does each school have it[.] own exam?\n\nFor the most of schools they are the same. For example all of the engineering programs within the polytechnics share exactly the same exam. But there probably are some special cases with things such as the arts program in the universities and such.\n\n\n* Which parts of Finland speak the most English?\n\nYou should be fine with English in any of the University cities. But in the general the southern part of Finland has probably a bit more fluent English speakers in general. Anyone under 30 years old will understand English really well and maybe even speak it well, although probably with quite a heavy accent.\n\n\n* Is it possible to apply for different majors at the same school? Apply for the same major at different schools? Different majors at different schools?\n\nAgain, for the local students it[.] totally possible and that[.] how most of the people get into schools. Should be possible for foreign students, but again I'm not 100% sure.\n\n\nI suppose Metropolia is as good a school as any. I have studied there(currently having a year off and working), don't really have much of positive/negative opinion of it.\n\n\nI'll try to google a good website for you during my lunch break so you can find information from yourself. But now I'm off to continue my work before my boss gets too mad. "}