{"doc_id": "1533", "name": "2012_01_humanities_student_major_377_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2012-01-humanities-student-major_377_AdviceAnimals.txt", "pub_date": "2012-01-10T00:00:00Z", "Sentiment": "0.031", "Subjectivity": "0.427", "Score": "24", "Upvotes": "24", "Downvotes": "0", "Wordcount": "315", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_oav9z", "Reddit_id": "c3fufcr", "Subreddit_id": "t5_2s7tt", "Commenter": "eastiseast", "length": "1945", "content_scrubbed": "English major here.\n\nI sense the hivemind has a disdain for humanities students that I think is undeserved and unfounded.  At my university all students are required to take a certain number of designated \"writing intensive classes,\" and this is by *far* the most complained about requirement.  To a certain extent, I understand that electrical engineers (or anyone, for that matter) don't want to take classes that teach skills they won't need.  But if writing a 5-page paper is the most difficult thing you'll do in college, I think you need to reexamine your belief that \"humanities are easy\" or \"science/engineering is hard\" or \"this is a worthless skill.\"\n\nMy point, I guess, is that studying the humanities teaches valuable skills that apparently aren't in high supply these days: critical analysis, logic, formation and development of an argument, and, put more broadly, the ability to interpret and convey ideas through writing.  Every printed page you read - magazine, newspaper, book, even advertisements - are put through an editing process, usually for a long time and across several iterations.  This is also true for many, though certainly not all, web pages.  To those who poke fun at humanities students, I ask you: *who do you think does this shit?*\n\nFinally, there[.] a basic contradiction that bugs me.  The hivemind **constantly** berates those who accept information without criticism (from consumers of mainstream media to other redditers who believe erroneous stories on the front page), but mocks those who actually study the methods of critical analysis.  Of COURSE there aren't many jobs that deal with 12th century English poetry (it should be mentioned that this sounds more like a thesis course than an undergraduate course, but let[.] grant the hyperbole), but a student of 12th century English poetry is probably much more qualified for a slew of jobs like those mentioned than just about any other college graduate."}