{"doc_id": "1766", "name": "2013_11_humanities_student_major_1330_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2013-11-humanities-student-major_1330_AskHistorians.txt", "pub_date": "2013-11-21T00:00:00Z", "Sentiment": "0.114", "Subjectivity": "0.388", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "312", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdjwiox", "Reddit_id": "cdjzywb", "Subreddit_id": "t5_2ssp3", "Commenter": "agentdcf", "length": "1799", "content_scrubbed": " With more and more schools seeing grads as a source of cheap labor (an execrable development to say the least) they're letting in more, even if fewer are applying. I'm not sure if that[.] having an effect on how many are finishing, though, but I can tell you that we did a 20th C. US search (with rather open criteria) just a few years ago, and we had nearly five hundred applicants.\n\nI'm happy to say that my graduate student association (in which I played no small part) was able to change this, at least for now. Incoming cohorts were 15 to 20 people before the 2008 crash (I was fall 2007), many of whom had only partial guaranteed support and some with none at all. After 2008, the department pretty much kept bringing in that many students, but with the budget cuts, they wound up being unable to support a pretty significant portion of the students brought in. That generated an unacceptable attrition rate, and it[.] really hollowed out some of the cohorts. Two years ago our grad student association went to the department and the School of Humanities and essentially got them to agree that no students would be admitted without at least five years of support guaranteed. Now we admit five to seven per year.\n\nAnd for the job search, I've heard that 20th-century US is the single toughest job market. I'm part of an open-rank search committee right now for Western Europe (with some important qualifiers), and we're anticipating about 150 applications, maybe as many as 200.\n\nI haven't started looking through them yet, but I'm curious about what proportion of the applicant pool actually have a real shot. Some segment will clearly be unsuitable, without the prestige in their resume from their institution(s) or their publications. When you looked at those 400, how many were obvious cuts?"}