{"doc_id": "1750", "name": "2013_11_humanities_student_major_1212_srssucks", "namespace": "we1sv2.0", "metapath": "", "pub": "SRSsucks", "title": "2013-11-humanities-student-major_1212_SRSsucks.txt", "pub_date": "2013-11-19T00:00:00Z", "Sentiment": "0.059", "Subjectivity": "0.296", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "773", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r1hla", "Reddit_id": "cdimld7", "Subreddit_id": "t5_2uuwv", "Commenter": "Jovianmoons", "length": "4672", "content_scrubbed": "The recent question from the woman about the gender gap in philosophy made me realize I ought to be spreading the word.\n\nEDIT:\n\nI was going to respond to some of the more laughable comments, but they all amount to this. I decided to save time. \n\nYeah, so, like I said... Incorrigible...\n\nOne thing I can assume from the comments on here is that some of you redditors sure did enjoy Critical Thinking PHI105. Several of the women and men who have commented to affirm that gender bias is a problem in philosophy _teach_ that course. You've out-philosophied them, you punk rockers! \n\nNow turn in your truth tables and venn-diagrams, and stop using terms like 'logic' and 'circular' reasoning before you shoot your eye out. \n\nI have the slightest curiosity about whether any of you philosopunks bothered to, you know, clicked the links and _read_ the dozens of studies and professional papers you dismissed out of hand. Didn't you feel even the slightest twinge of anxiety given the fact that you had literally _no idea_ what the hell you were talking about, let alone arguing against? Are you aware that philosophy is, like, an actual profession, and that those of us who are educated in the field are trained specifically to be able identify B. S.? How did you _not_ realize that you sounded ridiculous to anyone who actually understood the terms and concepts you were misusing?\n\nOops, there went my curiosity. Now I can't be bothered with you. \n\n\nAnyway... Back to spreading the word...\n\n\n\nORIGINAL POST\nPhilosophy has, by far, the worst representation of minorities and women in all the humanities. \n\nI'm a graduate student in the field who happens to be a woman. I've had to struggle against many situations that arise out of gender biases. \n\nIt[.] pretty bad, folks.\n\nhttp://beingawomaninphilosophy. wordpress. com\n\n\nWe're working on it. \n\nwww. biasproject. org\n\nSee the recommend reading page on this site. \n\nMost of what I've experienced has not been overt mistreatment due to my gender. The guys and profs in my department are great. They're just a little oblivious.\n\nMy speculation is that two things make philosophy[.] gender gap so egregious. \n\n1) Gender biases are often implicit (I. e., a person who has them might not be aware of the fact)and\n\n 2) philosophers think it indubitable that they are aware of the contents of their own mind. \n\nBecause 2, they are often incorrigible when confronted with the possibility that they may harbor some hidden beliefs. \n\nBut this is fallacious, because there are many things which we believe but of which we are not aware. That[.] how humans think. We take for granted that certain things are the case without question. We have to do this: doubting whether our fundamental grasp of reality is accurate in every respect means not functioning. \n\nEven the most socially progressive person harbors implicit biases. However, such people are the least likely to realize this without being made aware of it by someone else.  Theories suggest that things like gender bias are those beliefs we reject explicitly but harbor implicitly. That is, they're the sort of beliefs we don't want to admit to having. \n\nI recommend that all philosophers learn about *implicit bias* . Having an implicit bias doesn't mean you're a jerk, and not being a jerk doesn't mean you don't have implicit biases. In short, we all harbor implicit biases, and implicit biases often result in our making stupid assumptions. This applies to *any* effort to engage in reasoning. Kinda toxic to the analytic process...  \n\nI also recommend that people learn about *stereotype threat*.  When i learned about this phenomenon, it explained my experience as a woman in philosophy. \n\nThere is a plethora of info on the bias project site. I hope you read some of the work that[.] been published on these topics. The more people become aware of the implications and costs of our gender gap, the better philosophy will become. I have faith in philosophers. Historically, we we always put up a big fight right before we have a big shift in the common view. But however dear our false beliefs, the truth is dearer still.\n\nEdit to add references: The speculative argument given in 1 and 2 is my own guess about the cause of the gender gap. Everything else can be attributed to Sally Haslanger, Jennifer Saul, Tamar Gender, and Claude Steele, among others. \n\nFinally, I should have included a link to this site:\n\nwww. reducingstereotypethreat. org\n\nIt[.] useful for anyone who wants to gain insight into the likely effects of implicit bias. I especially recommend it for those philosophers who are anglophone and male, and those who aren't. ;-)\n\nhttp://redditlog. com/snapshot/27783/34263"}