{"doc_id": "1746", "name": "2013_11_humanities_student_major_1173_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2013-11-humanities-student-major_1173_explainlikeimfive.txt", "pub_date": "2013-11-19T00:00:00Z", "Sentiment": "0.016", "Subjectivity": "0.369", "Score": "20", "Upvotes": "20", "Downvotes": "0", "Wordcount": "296", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qzoxw", "Reddit_id": "cdi4gev", "Subreddit_id": "t5_2sokd", "Commenter": "upvoter222", "length": "1791", "content_scrubbed": "The Common_Core is a series of optional standards suggested for determining school curricula.  45 states have adopted it.  The standards for math and English are [summarized here](http://www. corestandards. org/the-standards) if you want to read about it in more detail.  The idea is to make sure students are better prepared when they finish high school.  In terms of content, it has some new ideas like an increased focus on reading non-fiction.  There are also suggestions that fewer topics are covered, but each in more depth.   \n\nA lot of time, effort, and research has gone into the Common_Core, so many people favor it on the grounds that it appears to be a well-made plan for designing a curriculum.  They also point out that it[.] effectively voluntary, so schools won't be forced to make too many changes that they oppose.\n\nOpposition comes from a variety of concerns.  Some dislike the idea of a uniform set of standards on the national level, arguing that schools need to function more on a case-by-case basis and adjust their teachings to their particular students.  Others dislike specific attributes of the Common_Core.  For example, one critic wrote that he didn't like having Algebra I material being moved from 8th grade to 9th grade.  There are also concerns that it encourages teachers to \"teach to the test\".  \n\nThen there are some people who are batshit insane.  Some claims made by these people include accusations that the Common_Core is an attempt at liberal indoctrination, that it[.] a plan for a federal takeover of education, that it[.] a part of some dastardly scheme designed by Obama, that data collected to analyze education will be used in creepy ways, or that students will be turned into mindless worker drones with absolutely no knowledge of the humanities.  "}