{"doc_id": "1660", "name": "2013_11_humanities_student_major_331_jobs", "namespace": "we1sv2.0", "metapath": "", "pub": "jobs", "title": "2013-11-humanities-student-major_331_jobs.txt", "pub_date": "2013-11-05T00:00:00Z", "Sentiment": "0.139", "Subjectivity": "0.433", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1435", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd7s3pa", "Reddit_id": "cd7trcf", "Subreddit_id": "t5_2qhnd", "Commenter": "TheMilitantMongoose", "length": "8112", "content_scrubbed": "(Massive wall of text warning, I didn't mean to write this much but as I started typing. Your question ended up taking me down several different paths before I could even try to answer it without talking nonsense. Perhaps I talked nonsense anyway, but I did my best and I hope its worth reading)\n\nHonestly, the real answer is beyond my comprehension. I hope people far smarter than myself are working hard on it, but I'll at least say what a few of my thoughts on the issue are.\n\nSo let[.] start with the actual jobs that may still exist. First would be your politicians and businessmen. Unless we hand politics and companies over to AI (which could happen one day, but likely way after this if ever and is a completely different discussion), we'll still have the need for these bastards. At least it will give the most power hungry/ambitious/greedy something to do. They'll need a small contingent of people below them but if everything was 100% streamlined and automated I imagine a major company could be run by 100 people, if not less.\n\nAfter that is researchers. Even if the AI outranked us in science, I find it hard to believe the inquisitive among us wouldn't be trying to push the envelope right there with them anyway. Human ingenuity is one of the hardest things for us to replicate, so we'll need scientists right up until they science their job away.\n\nWith everything being mass manufactured by automated robotic factories, I could forsee a market for human-hand made goods springing up. Hand carved tables, hand blown glass. If you have the skill to do it well, it will probably be in high demand. If everything is cheap only because it can be made for next to nothing with no extra effort, things that require effort may gain a value they did not have before. A tangent to this is art and music. I can't see the arts being changed very much by all this, other than instruments and materials being more cheaply available and leveling the playing field to some extent. And I guess if everything was, for the most part, economically equal, then starving artists might not be so hungry any more.\n\nWhile I'm sure there are plenty of other possible jobs that will still exist, I can't think of any and they aren't super important since we are mainly discussing the rest of the population. To discuss everyone else, we first have to make the distinction of what type of economy we WILL have. I can imagine two, although I'm sure there are other possibilities. The first being that everything is free, what I think of as a non-economy. All manufacturing and distribution would be run by some regulating body but no money would be made. I'm not sure what the nuances would be in this scenario to be honest, except maybe a limit to how much raw material you are allowed to use per person to manage resources. The other system would be a sort of welfare economy. If 95% of the population was unemployed, the welfare would have to be pretty high.  Perhaps as high as even a few thousand a month in our terms. It would be tough to have a 1%er situation in this scenario, in my opinion. If you tried to make 95% of the people live off $500 a week while the other 5% who are employed get the rest of the economy, I think you'd have quite a few riots and uprisings on your hand. With so much time on peoples hands, they would have to be beyond comfortable. I figure that upper middle class all around would be a pretty fair stability point. While the non-economy makes more sense to me, the welfare economy would probably be more socially stable. At least with money being a thing that exists, people can try to find ways to make more of it.\n\nSo what are the rest of the world up to?\n \n \nLeisure:\n\nI imagine many people with dedicated hobbies would take to this hobby full time. Sports enthusiasts might play every day, hikers might spend nearly all of the time in the woods. Sculptors might make so many works that they have to pawn them off on friends or throw them away. In the welfare system, I could see two types of ways to make money extending off of this. You'll find a smattering of instructors for every type of hobby. Skateboarding coach, racing coach, birdwatching coach. The other being competitions. If leisure is the main activity of the masses, there has to be something for most people to strive for. You might end up with multiple tier leagues for every sport, with people playing division Q football, with the only real goal to be self improvement and fun. Higher tier competitions in any activity could have reward money, making getting good at something a way to be slightly richer than the other welfare recipients.\n\nExploration/Risk based Employment:\n\nAt this point, space exploration will likely be ramping up. Population increase and limited resources won't go away just because of robots. People might end up almost becoming disposable workers, if they choose to. It might not be cost effective to send a rocket with machinery off planet if metals can be mined at the target location. It might be cheaper to send some humans to get things started, maybe with a few token robots, to risk their lives because human life will be a smaller loss overall. This could come with high compensation, but it could also just provide a way to get away and do something interesting compared to life on earth.\n\nNiche Work:\n\nIf everything becomes globalized and automated, there won't be much room for niche markets. Currently, factories won't make less than X number of a certain item because prototyping it and making any required molds costs enough time and money that it isn't worth it. Unless robotics circumvents this requirement, items that have a market worth serving but only barely so might not receive enough attention for an automated factory to be tasked to handling it. Small niche businesses might be able to stick it out, with the_right product.\n\nSocial Groups - Advertising selling:\n\nIf corporations are still privately owned, they are likely ridiculously highly taxed to make a welfare economy work. A company that makes 10 billion in a year in profits might give 95% of that to the government, then split the remaining 5% between reinvesting in the company and giving its 100 workers, who are probably essentially all executives, big bonuses. If this is the case, there is still an incentive for companies to profit and we'll still get everyones favorite thing in the world: advertising. The good thing that spawns off from this is that places like reddit would still have a way to create income. In fact, if taxes were so high, and corporate structures so small, advertising might increase massively. Corporations with complete automation would only be limited by how much their customers would be willing to buy, and increases in sales could turn into more bonuses because there isn't much wealth to spread around in the company. This could give rise to far more websites, events, etc that are funded by advertising. Already people make a career out of youtube videos and running events that are fully sponsored, this market could increase greatly.\n\nPerhaps its only because I'm tired and my brain is starting to shut off for the night, but those are the only real activities I see besides widespread nihilism. I, for one, would be happy to spend the rest of my life reading, hiking, travelling the world and playing video games without having to worry about bills. I think many people would as well. For those that MUST have something to occupy themselves, I think they had better hope to pick from the above. \n\nAnd, unfortunately, none of this accounts for the unknowns. Human trajectory changes so often that this could all be a load of malarky. Maybe some new technology comes out tomorrow that for some reason needs human operators galore and robotics and AI just won't cut it. Maybe we reach the pinnacle of AI and it just isn't enough. I know I said a lot of things, and they weren't really a direct answer to your question, but it[.] because it[.] so much more profound of a question than it seems and I think the human race as a whole really needs to start thinking about it. "}