{"doc_id": "1752", "name": "2013_11_humanities_student_major_1223_wildstar", "namespace": "we1sv2.0", "metapath": "", "pub": "WildStar", "title": "2013-11-humanities-student-major_1223_WildStar.txt", "pub_date": "2013-11-20T00:00:00Z", "Sentiment": "0.169", "Subjectivity": "0.587", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "346", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r1voj", "Reddit_id": "cdishhb", "Subreddit_id": "t5_2sqwc", "Commenter": "warriorscomeoutnplay", "length": "1878", "content_scrubbed": "Now this might just be me, but I think the artsyle of Wildstar is absolutely delightful. It[.] cartoony in it[.] appearance, and I'm happy about that. \n\nOne of the major reasons I'm actually excited for Wildstar is the way it looks. Waaay too many MMOs coming out these days have an \" edgy \" feeling to them ( and I realize there[.] a stigma to that word, but hear me out ). They've got sort of a grimdark thing going, using a weird combination of anime-esque proportion and design but without the huge eyes, and \" realistic \" with the sorta gray-brownish mixed in with subdued colors for magic and gratuitous use of bloom. A major recent example of this being Guild Wars 2, but there[.] a lot of others that fit that bill. It[.] not that I find this style to be distinctly UGLY, nor do I hate it or such, but it[.] used a lot these days and not really my cup of tea.\n\nNow, Wildstar on the other hand, has brighter, more lively colors, clearly defined characters that almost look outlined, very bouncy and dramatic moves by characters, and doesn't take itself too seriously. A lot of people liken Wildstar[.] artstyle to that of a Pixar movie or such, but personally I think the best analogy is a Saturday morning cartoon. I don't at all agree that it[.] childish, however. Most people are not walking stereotypes, and adults don't solely enjoy gritty, serious, ' grimdark ' content. It[.] less of a matter of being \" for kids \", than it is of being \" For all ages \", something everyone from your little brother, to your dad, to your grandma can look at and enjoy. \n\nSo yeah, as far as the general design goes, I personally think that it looks gorgeous and has a very well defined personality and charm to it. And as far as not getting a feeling of grandeur goes, I don't think one can really appreciate it until you yourself are running through the environments and seeing the sights. \n"}