{"doc_id": "1681", "name": "2013_11_humanities_student_major_522_badhistory", "namespace": "we1sv2.0", "metapath": "", "pub": "badhistory", "title": "2013-11-humanities-student-major_522_badhistory.txt", "pub_date": "2013-11-08T00:00:00Z", "Sentiment": "0.085", "Subjectivity": "0.411", "Score": "61", "Upvotes": "61", "Downvotes": "0", "Wordcount": "459", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1q7bjy", "Reddit_id": "cd9zki0", "Subreddit_id": "t5_2wo26", "Commenter": "[deleted]", "length": "2775", "content_scrubbed": "The three you mentioned, plus the ever popular issue of the (American) Civil War:\n\n* **The Dark Ages**: This so called \"dark period\" of history completely ignores the world outside Europe (which at this time included advanced states in China, India, and the Middle_East), and also is just plain wrong. Although one might argue that \"Europe\" became less cohesive and more chaotic at this point, in reality many areas saw a flourishment in the arts and sciences. Some key European inventions of the time include the **heavy** mouldboard plough, windmills, and the ~~water wheel~~ blast furnace. \n\n* **Hitler being elected by the majority**: the largest percentage the Nazi party ever received in a **fair** election was around ~~32%~~ 37%. This *was* the highest any party got in that election, but it was firstly not a majority and secondly after a fair level of intimidation was carried out by Nazi stooges. These elections were the last ones before Hitler was appointed chancellor by president Hindenburg in a misguided attempt to appease the Nazis. After Hindenburg[.] death, Hitler basically assumed all of the executive powers of the German government consolidated as the Fuhrer (claiming to not want to be the president out of respect to Hindenburg) and with that the Third Reich was (basically) born.\n\n* **The Library of Alexandria**: the LOA *was* a valuable repository of knowledge, but claiming that its destruction \"set back\" civilization (or whatever the most recent badhistory claim about the LOA is) is kind of like saying that if we had lost the Library of Congress to a German bomb in WWII, civilization would have been seriously set back. The LOA was one of many repositories of knowledge (others at the time included the Academy of Gundishapur and the House of Wisdom), and furthermore by the time it was destroyed its significance had somewhat faded, as the locus of Western Eurasian academia moved east and the Islamic Golden Age saw its first days.\n\n* **The American Civil War as a conflict over states' rights:** demonstrably false. Most, if not all of the Confederate states specifically mentioned slavery in their founding documents/constitutions as the driving force behind succession. The wave of succession (and I believe the bulk of it) began **before** Lincoln had even come into office (after he was elected). The only way the war was about \"states' rights\" is if you're discussing the states' rights to treat people like chattel.\n\n=\n\nHopefully these help: you can find a **lot** of valuable information on this sub and especially on /r/AskHistorians. Feel free to ask for clarification/about other pieces of bad history, or history in general! We can be a bit of a circlejerk but we really just want to help people learn about history/discuss it."}