{"doc_id": "1812", "name": "2013_11_humanities_student_major_1662_physics", "namespace": "we1sv2.0", "metapath": "", "pub": "Physics", "title": "2013-11-humanities-student-major_1662_Physics.txt", "pub_date": "2013-11-27T00:00:00Z", "Sentiment": "0.106", "Subjectivity": "0.401", "Score": "52", "Upvotes": "52", "Downvotes": "0", "Wordcount": "505", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rkgkm", "Reddit_id": "cdo87tu", "Subreddit_id": "t5_2qhi6", "Commenter": "pimpbot", "length": "3057", "content_scrubbed": "I was a philosophy student pursuing my PhD under a full academic scholarship when I dropped out of my program in 2003 (at least I think it was 2003). So I say the following as someone who is substantively educated in the field that I often tend to criticize.\n\nEver since humanities started coming under budgetary attack in the late 80s/early 90s, philosophy has been on the defensive both with respect to justifying its place in the university curriculum and with respect to its broader cultural significance. That tendency has only become more pronounced over time and I believe it is this context that sets the stage as it were for many of these philosophy - physics slap-ups. In many respects these disputes can be viewed as simple territory disputes grounded in, at least in the case of philosophy, an existential anxiety concerning its own continuance.\n\nNow speaking as a philosopher I do find many aspects of philosophy continue to be crucially important. However I also acknowledge that there are other aspects of philosophy that are less so, and still others that I regard as almost wholly self-indulgent. I further acknowledge that in some philosophical circles there is a reactionary element that insists on viewing all science through the lens of so-called [.]cientism'. While this is not an entirely fair criticism it is a convenient straw-man for philosophers to criticize scientists with, because in one stroke it justifies the existence of philosophy while also serving in the territorial dispute with science over who is best equipped to determine fundamental facts about reality, and who is more co-opted by institutional or political bias. It is only natural when these are the sort of considerations in the background - the questioning of basic motives etc -  that disputes can become pretty heated.\n\nFor what it[.] worth I happen to think that science is on the_right side more often than not. This is largely due to the under-siege mentality that reigns in philosophy as in all humanities programs, which leads to people banding together in defense of the indefensible for the sake of putting up a united front. Sort of like a humanities' version of the 'thin blue line'. Where science is in the wrong it is usually because a scientist has taken the scientism bait and begins approaching their work ideologically, which of course does happen on occasion.\n\nIn addition to this a whole book could be written (and many assuredly have) on different conceptions of 'truth'. In general you will always see intense disagreement between those who believe that truth is something that they possess and those who regard themselves as truth-seekers. That kind of disagreement is also in play, both across disciplinary boundaries and also within them. You may notice the same intense and fundamental disagreements between true believers and empiricists have colonized our political institutions as well and led to some historic showdowns in recent memory. In my opinion this is no coincidence.\n\nAnyway, that is my experience and what I have observed."}