{"doc_id": "1661", "name": "2013_11_humanities_student_major_332_personalfinance", "namespace": "we1sv2.0", "metapath": "", "pub": "personalfinance", "title": "2013-11-humanities-student-major_332_personalfinance.txt", "pub_date": "2013-11-05T00:00:00Z", "Sentiment": "0.092", "Subjectivity": "0.497", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "378", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd7u6g9", "Reddit_id": "cd7usfj", "Subreddit_id": "t5_2qstm", "Commenter": "[deleted]", "length": "2117", "content_scrubbed": "That[.] amazing progress on your debt, and I applaud you. Truly a remarkable achievement. (Not /s)\n\nBut so many kids are going to rack up a similar bill and have no way in hell of paying it off. I seriously almost feel pain when I see people saying they have six figures' worth of debt for a bachelor[.] degree--any old bachelor[.] degree, when their first job is almost certainly going to pay $10/hr at some call center or McJob until they finally get a shot at their career. All I can think of is that my house cost $153,600... but at least I have a house, I'm not paying my $1100 and then *still* having to come up with rent and food and gas on top of it. And if I run into financial difficulty, worst case scenario is that I go into foreclosure and have bad credit for a few years. With student loans, you (general you, from here onward) can't even get rid of them through bankruptcy! (Thanks, Bush!) You're basically an indentured servant, and with the job market driving down wages and benefits, it seriously scares me to think what millions of college graduates are going to do with this crushing debt that they literally could take to their grave. It[.] bad.\n\nI think we really need to realize, as a society, that higher education is a profit center and that colleges are *marketing* to students. They're selling you a product, not an education, and certainly not a better shot at success--not if you're mortgaging your entire future to pay for it, so that any advantage you might have gained is gone with that $1200/mo loan payment. There is enormous value in a formal liberal_arts education, because it teaches you critical thinking and an expanded worldview, but there are also hard pragmatic issues to consider, such as whether you'll be able to save for retirement or accrue assets of your own with the opportunities that this education affords you. If you can't, if your ability to secure your position is made far more vulnerable by assuming this debt, then it[.] literally not worth it. As with any investment, there should be a reward, and not just the \"I'm a more well-rounded individual\" kind of reward. "}