{"doc_id": "1658", "name": "2013_11_humanities_student_major_317_malefashionadvice", "namespace": "we1sv2.0", "metapath": "", "pub": "malefashionadvice", "title": "2013-11-humanities-student-major_317_malefashionadvice.txt", "pub_date": "2013-11-05T00:00:00Z", "Sentiment": "-0.075", "Subjectivity": "0.312", "Score": "25", "Upvotes": "25", "Downvotes": "0", "Wordcount": "327", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pzm9b", "Reddit_id": "cd7pn2w", "Subreddit_id": "t5_2r65t", "Commenter": "madethisforGW", "length": "1894", "content_scrubbed": "My clothing choices run the gamut. Sartorial misadventures notwithstanding, I've noticed that I am treated differently--sometimes vastly differently--depending on the image I'm currently projecting. This goes beyond merely my clothes, but they are certainly the focus.\n\nI'm a lawyer by day, so it[.] not surprising that people address me as \"sir\" around the building (since most people in my building who are not members of the bar seem to automatically assume anyone with a suit on is an attorney and therefore of some importance). But that extends beyond my building--if I stop at a store on the way home, I am also typically addressed as \"sir\" and treated deferentially.\n\nWhen I take off the suit, things change. I reside in a small town with an expensive, private liberal_arts school that tends to attract financially advantaged families from the Northeastern U_S. The residents of the town seem to have an uneasy relationship with the student body. \n\nIf I head into the same stores that I was just describing without my suit on, people[.] perception of me seems to change drastically. The fact that I tend toward a prep sort of look in my casual wear seems to exacerbate the problem. For the last several months, I've been testing it out--quite unscientifically, of course--by wandering around the local grocery store. If I am suited up and need to walk past someone in an aisle and say \"excuse me,\" they nearly always acknowledge it in some manner--either by saying something to the effect of \"no problem\" or a quick head nod. If they walk past me as I am checking a shelf, I nearly always get an \"excuse me\" from them. When I am not wearing a suit, its as though the local populace won't even acknowledge my presence. I've come to assume it[.] because they believe me to be a local college student. \n\nRidiculous, I know. But I enjoy this little game I've been playing around town."}