{"doc_id": "1803", "name": "2013_11_humanities_student_major_1619_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2013-11-humanities-student-major_1619_changemyview.txt", "pub_date": "2013-11-26T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.37", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "287", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rigf6", "Reddit_id": "cdnm9w3", "Subreddit_id": "t5_2w2s8", "Commenter": "Ragnarok4750", "length": "1651", "content_scrubbed": "School/College/University isn't just about learning your \"trade\". That[.] an archaic way of looking at education, and really more reminiscent of ancient class-based systems where if you were born to a farmer, you get raised to farm and that[.] what you do until death.\n\nIn modern societies there is a ton of knowledge and skills that will greatly benefit you. And though you take it for granted, those other classes all provide you with basic knowledge that helps you get along in the world. For instance, knowing about arts in a historical context gives you a more sophisticated way of looking at new works. Classic literature can provide great insight into forms of communication and timeless story tropes, as well as sharpen your critical analysis skills. History/Social Studies gives you a good look at where we came from and how the world ended up the way it is today, which can help you analyze current and future political choices you make. There[.] all sorts of stuff you take for granted, that you would probably not know if it wasn't taught to you as part of general education. Overall, they're teaching you how to learn and analyze things, not just nailing information into your head.\n\nAside from that, let me just point out that every university is different and you shouldn't assume things about all schools based on just yours. For instance, I had a very small set of general classes: Calculus 1/2, Physics 1/2, Chem and Bio. In addition, each semester we took 1 class in the \"Humanities\" (you could do them all at once, but that can fuck you over in the long run). Aside from that, all our other classes were directly related to our major."}