{"doc_id": "1668", "name": "2013_11_humanities_student_major_374_mensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "MensRights", "title": "2013-11-humanities-student-major_374_MensRights.txt", "pub_date": "2013-11-06T00:00:00Z", "Sentiment": "0.151", "Subjectivity": "0.409", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "311", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd8h4tf", "Reddit_id": "cd8i60f", "Subreddit_id": "t5_2qhk3", "Commenter": "theskepticalidealist", "length": "1629", "content_scrubbed": " I spent a lot of time with the arts students at my time in Uni (they were a lot of fun) and I found them to be highly intelligent. I also found they ignored a lot of evidence in favor of what they wanted to believe. The same thing happened with my science friends but nowhere near as often.\n\nI think thats very accurate. If you are forced to be scientific in something as important to your life as your career that you'll spent most of your time working on, it makes sense to me that you will have greater likelihood of appreciating that way of thinking even if that appreciation is subconscious. I think if you don't have that, people will need to get that on their own or from somewhere else. But as I said, it really doesn't mean someone will be rational or not, and certainly not in all areas. Hell, PZ Meyers is a biologist.\n \nI think it[.] to assume that just because someone is a good actor (or singer or sports player) that they are also somehow wise.\n\nI think actors have the most sway from those, because they can play characters that are a lot smarter than they are. And I think its still hard for people to completely remove that from their perception of them. \n  \nI mean look at what I assume is a Patrick Stewart quote. He isnt taken seriously because he is an old white guy, he[.] taken seriously because he has a lot of status and has done a lot of work people respect him for. Otherwise he'd just be another guy with a sign on the street and no one would care. In fact, personally, I'd even bet that if someone like Judy Dench stood on the side of the road with a sign, she'd actually get more people[.] attention."}