{"doc_id": "1740", "name": "2013_11_humanities_student_major_1142_toronto", "namespace": "we1sv2.0", "metapath": "", "pub": "toronto", "title": "2013-11-humanities-student-major_1142_toronto.txt", "pub_date": "2013-11-18T00:00:00Z", "Sentiment": "0.089", "Subjectivity": "0.249", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1409", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdhob92", "Reddit_id": "cdhozor", "Subreddit_id": "t5_2qi63", "Commenter": "swordfishtrombonez", "length": "7553", "content_scrubbed": "Women make like 70 cents on the dollar (minority women make even less).  Women are less likely to be in positions of power.  Women are more likely to be victims of violence.  Women are just as likely to be victims of war (even if they don't serve in the military, look at the number of civilian causalities).\n\n[This is an interesting article](http://www. amptoons. com/blog/files/mcintosh. html).  It[.] about white privilege - I think the title was deliberately meant to turn some people off.  In essence, the author (a white lady) thought about all of the invisible advantages she had by virtue of being white.  When you are in a position of power (whether it be white, male, Western, etc etc) it[.] very easy to not notice the disadvantages others face on a daily basis.  \n\nI'm just going to post the list because the comments section is already full of lengthy posts.  This was written in the late 1980s, so some of the items are likely much less true today (especially in a city like Toronto) than they were back then.  I thought it was really interesting because I have never thought of a lot of the things on this list.  \n\n1. I can if I wish arrange to be in the company of people of my race most of the time.\n\n2. I can avoid spending time with people whom I was trained to mistrust and who have learned to mistrust my kind or me.\n\n3. If I should need to move, I can be pretty sure of renting or purchasing housing in an area which I can afford and in which I would want to live.\n\n4. I can be pretty sure that my neighbors in such a location will be neutral or pleasant to me.\n\n5. I can go shopping alone most of the time, pretty well assured that I will not be followed or harassed.\n\n6. I can turn on the television or open to the front page of the paper and see people of my race widely represented.\n\n7. When I am told about our national heritage or about \"civilization,\" I am shown that people of my color made it what it is.\n\n8. I can be sure that my children will be given curricular materials that testify to the existence of their race.\n\n9. If I want to, I can be pretty sure of finding a publisher for this piece on white privilege.\n\n10. I can be pretty sure of having my voice heard in a group in which I am the only member of my race.\n\n11. I can be casual about whether or not to listen to another person[.] voice in a group in which s/he is the only member of his/her race.\n\n12. I can go into a music shop and count on finding the music of my race represented, into a supermarket and find the staple foods which fit with my cultural traditions, into a hairdresser[.] shop and find someone who can cut my hair.\n\n13. Whether I use checks, credit cards or cash, I can count on my skin color not to work against the appearance of financial reliability.\n\n14. I can arrange to protect my children most of the time from people who might not like them.\n\n15. I do not have to educate my children to be aware of systemic racism for their own daily physical protection.\n\n16. I can be pretty sure that my children[.] teachers and employers will tolerate them if they fit school and workplace norms; my chief worries about them do not concern others' attitudes toward their race.\n\n17. I can talk with my mouth full and not have people put this down to my color.\n\n18. I can swear, or dress in second hand clothes, or not answer letters, without having people attribute these choices to the bad morals, the poverty or the illiteracy of my race.\n\n19. I can speak in public to a powerful male group without putting my race on trial.\n\n20. I can do well in a challenging situation without being called a credit to my race.\n\n21. I am never asked to speak for all the people of my racial group.\n\n22. I can remain oblivious of the language and customs of persons of color who constitute the world[.] majority without feeling in my culture any penalty for such oblivion.\n\n23. I can criticize our government and talk about how much I fear its policies and behavior without being seen as a cultural outsider.\n\n24. I can be pretty sure that if I ask to talk to the \"person in charge\", I will be facing a person of my race.\n\n25. If a traffic cop pulls me over or if the IRS audits my tax return, I can be sure I haven't been singled out because of my race.\n\n26. I can easily buy posters, post-cards, picture books, greeting cards, dolls, toys and children[.] magazines featuring people of my race.\n\n27. I can go home from most meetings of organizations I belong to feeling somewhat tied in, rather than isolated, out-of-place, outnumbered, unheard, held at a distance or feared.\n\n28. I can be pretty sure that an argument with a colleague of another race is more likely to jeopardize her/his chances for advancement than to jeopardize mine.\n\n29. I can be pretty sure that if I argue for the promotion of a person of another race, or a program centering on race, this is not likely to cost me heavily within my present setting, even if my colleagues disagree with me.\n\n30. If I declare there is a racial issue at hand, or there isn't a racial issue at hand, my race will lend me more credibility for either position than a person of color will have.\n\n31. I can choose to ignore developments in minority writing and minority activist programs, or disparage them, or learn from them, but in any case, I can find ways to be more or less protected from negative consequences of any of these choices.\n\n32. My culture gives me little fear about ignoring the perspectives and powers of people of other races.\n\n33. I am not made acutely aware that my shape, bearing or body odor will be taken as a reflection on my race.\n\n34. I can worry about racism without being seen as self-interested or self-seeking.\n\n35. I can take a job with an affirmative action employer without having my co-workers on the job suspect that I got it because of my race.\n\n36. If my day, week or year is going badly, I need not ask of each negative episode or situation whether it had racial overtones.\n\n37. I can be pretty sure of finding people who would be willing to talk with me and advise me about my next steps, professionally.\n\n38. I can think over many options, social, political, imaginative or professional, without asking whether a person of my race would be accepted or allowed to do what I want to do.\n\n39. I can be late to a meeting without having the lateness reflect on my race.\n\n40. I can choose public accommodation without fearing that people of my race cannot get in or will be mistreated in the places I have chosen.\n\n41. I can be sure that if I need legal or medical help, my race will not work against me.\n\n42. I can arrange my activities so that I will never have to experience feelings of rejection owing to my race.\n\n43. If I have low credibility as a leader I can be sure that my race is not the problem.\n\n44. I can easily find academic courses and institutions which give attention only to people of my race.\n\n45. I can expect figurative language and imagery in all of the arts to testify to experiences of my race.\n\n46. I can chose blemish cover or bandages in \"flesh\" color and have them more or less match my skin.\n\n47. I can travel alone or with my spouse without expecting embarrassment or hostility in those who deal with us.\n\n48. I have no difficulty finding neighborhoods where people approve of our household.\n\n49. My children are given texts and classes which implicitly support our kind of family unit and do not turn them against my choice of domestic partnership.\n\n50. I will feel welcomed and \"normal\" in the usual walks of public life, institutional and social.  "}