{"doc_id": "1821", "name": "2013_11_humanities_student_major_1760_subredditdrama", "namespace": "we1sv2.0", "metapath": "", "pub": "SubredditDrama", "title": "2013-11-humanities-student-major_1760_SubredditDrama.txt", "pub_date": "2013-11-28T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.301", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "346", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdp99d5", "Reddit_id": "cdpaxod", "Subreddit_id": "t5_2ss5b", "Commenter": "zxcvbh", "length": "2129", "content_scrubbed": "Like most academic fields, the majority of work in philosophy is largely irrelevant to daily life, although philosophical work might be more so. The quality of work produced by philosophers is also more variable than in any other discipline: philosophy produces some of the most insightful findings and also some of the most vacuous, trivial bullshit.\n\nSo breakthroughs in philosophy that are felt by all of society and that are worth reporting in the media are very rare. But when they come, they're huge -- John Locke and John Stuart Mill[.] work in developing classical liberalism form the backbone of modern liberal democracies (ever heard of the definition of liberty as \"the freedom to do anything that doesn't infringe on anyone else[.] freedom\"? Mill came up with that.)\n\nScience as we know it had its groundwork laid in epistemology. Naturalism and the rejection of teleology in science are both necessary to the practice of modern science.\n\nNot all important developments in philosophy change the world, of course: modal logic has important applications in computer science despite its relative obscurity to the general public, for example.\n\nOf course, there are the negative influences as well: much of the ideological conflict of the 20th century was rooted in the philosophical thought of Marx and Lenin.\n\nConsidering all this, it'd be quite arrogant to assume that philosophy has no more major advances left. We just have no idea what the next world-changing philosophical idea will look like.\n\nThe relative rarity of major philosophical advances means that anyone who doesn't intend to pursue academic research in philosophy is best served pairing a philosophy degree with some other professional skill set. I could link to philosophy majors' high performance on the GRE and LSAT and employment statistics that show they outperform all humanities and about half of STEM majors mid-career to show that they tend to be on the_right tail of the critical thinking curve, but I'm sure you've already seen the statistics and dismissed them as irrelevant for you to feel qualified making such a criticism of the discipline."}