{"doc_id": "1751", "name": "2013_11_humanities_student_major_1221_truereddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueReddit", "title": "2013-11-humanities-student-major_1221_TrueReddit.txt", "pub_date": "2013-11-20T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.246", "Score": "29", "Upvotes": "29", "Downvotes": "0", "Wordcount": "470", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r1v0p", "Reddit_id": "cdis2d0", "Subreddit_id": "t5_2qyt6", "Commenter": "kleopatra6tilde9", "length": "3198", "content_scrubbed": "I am not happy that this is the top submission in TR. This is more a /r/TrueNews (or /r/features) submission than an insightful article. I like the way the numbers are presented but I don't see much further insight. \n\nFor starters, this is my default comment for liberal_arts submissions. As you see, the ending of the article, \"We need a concerted effort to get more young people studying the science and engineering degrees that will drive our economy forward and more of them taking up well paid opportunities.\" is a joke when there is no STEM crisis.\n\nI think the numbers show that the quality of the education is not what it is supposed to be. A graduate should be able to resolve his uncomfortable situation and a bunch of underemployed graduates should come up with a solution to such a systematic problem.\n\nI think it is important to know that liberal art degrees were designed for the rich:\n\n---\n[Essay on a Course of Liberal Education for Civil and Active Life (1765) is an educational treatise by the 18th-century British polymath Joseph Priestley.](http://en. wikipedia. org/wiki/Essay_on_a_Course_of_Liberal_Education_for_Civil_and_Active_Life)\n\nDedicated to the governing board of Warrington Academy at which Priestley was a tutor, it argues that the education of young people should anticipate their practical needs, something Priestley accused the current universities, Dissenting and Establishment alike, of failing to do. In Priestley[.] eyes, the contemporary focus on a traditional classical education prevented students from acquiring useful skills. This principle of utility guided his unconventional curricular choices for Warrington[.] aspiring middle-class businessmen. He proposed that students study English and the modern languages instead of the classical languages, learn practical mathematics, read modern rather than ancient history, and study the constitution and laws of England. **He believed that these topics would prepare his students for the commercial middle-class**  *life that most of them would live; he did not believe that the poor should receive this same education, arguing \"it could be of no service to their country, and often a real detriment to themselves.\"*\n\n---\n\nThe term \"[middle class](http://en. wikipedia. org/wiki/Middle_class)\" is first attested in James Bradshaw[.] 1745 pamphlet Scheme to prevent running Irish Wools to France. The term has had several, sometimes contradictory, meanings. It was once defined by exception as an intermediate social class between the nobility and the peasantry of Europe.[by whom?] While the nobility owned the countryside, and the peasantry worked the countryside, **a new bourgeoisie  (literally \"town-dwellers\") arose around mercantile functions in the city. Another definition equated the middle class to the original meaning of capitalist: someone with so much capital that they could rival nobles.** In fact, to be a capital-owning millionaire was the essential criterion of the middle class in the industrial revolution. In France, the middle classes helped drive the French Revolution.\n\n---\n\nvs.:\n\n[The STEM Crisis Is a Myth](http://www. reddit. com/r/TrueReddit/comments/1lgi7e/the_stem_crisis_is_a_myth/)"}