{"doc_id": "1714", "name": "2013_11_humanities_student_major_802_asksciencediscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "AskScienceDiscussion", "title": "2013-11-humanities-student-major_802_AskScienceDiscussion.txt", "pub_date": "2013-11-13T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.45", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1039", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qjhul", "Reddit_id": "cddtkma", "Subreddit_id": "t5_2vlah", "Commenter": "Gr1pp717", "length": "6232", "content_scrubbed": "You would probably be better off asking this in /r/Futurology ...\n\nBut, assuming that we have no major catastrophes (ice ages, water world, desert world, super volcanoes, magnetic declination, etc) between now and then (unlikely), OR assuming that we get enough of our resources off this planet in time to limit the impact of one of these events.. lets start with a foundation: the near future.  \n\nWe're about take our next step into space: industry.  Over the next couple of decades we will see super trillionaires being made from asteroid and moon mining.  Why is this important?  The materials that make it back to earth will flood the market more material than we've used over our entire history as a species.  It will change things such that labor is *always* the limiting factor.  That is, we will technically be able to build anything we can imagine without concern for resources, but would be limited by manpower. \n\nBut... that is rapidly disappearing.  Automation is not only rapidly taking over for manual labor and some more intensive roles (like [medical research](http://live. wsj. com/video/this-robot-is-changing-how-we-cure-diseases/C44DAE3D-C7FD-4C87-9E3F-685498A0C2CB. html?mod=e2tw#!C44DAE3D-C7FD-4C87-9E3F-685498A0C2CB)) but we are getting better and better with artificial intelligence.  It is anticipated that by around 2050 we will have what could be considered a \"real\" AI - reason being that we would no longer be limited by hardware in this endeavour.   Regardless of the actual date, 2050 or 2550, it will most likely happen well before 20,132 .... And what this means is that we will have machines, capable of building and maintaining themselves, that could do virtually everything for us.  The only temporarily limiting factor is in the arts.  Would an AI be able to make a compelling video game in the next 300 years?  Doubtful.  But you're talking about 18,000 more years - it seems more than plausible by that point.\n\nWhat does this mean?  We have unlimited supply of both materials and labor. All of those \"nice but impractical\" projects that man has dreamed about for so long will suddenly become feasible. Self sustaining city-towers, space exploration and habitation,  Only select materials would remain an issue, like oil and other bio-products.  Food, not so much, since we are capable of producing vastly more than we need already; much less once it[.] all automated.  At some point in this process we will end the age of work.  Artistic and human-related jobs (e. g. waiting tables or exploring space) being the only things left.   Will people still do stuff?  definitely.  Whatever they want, really.  But lets get into that in a moment.  There was one resource that out space and automation ventures haven't accounted for: energy.  \n\nAs the scale of our new unbounded ambitions climb, so will the energy requirements.  As mentioned previously fossil fuels will not be a long_term solution - especially as far out as you are talking.  And we can only go so far with geothermal, solar and other forms of energy generation.  Mining the moon for helium-3 will provide a short term fix, but that too is limited.  Our initial solution would likely be a dyson sphere of sorts.  Likely the satellite variety, since it doesn't require as much material.  Either way, trying to capture a higher percentage of the sun would be the best long_term solution.  I *imagine* it would be enough for the time frame that you are talking here.  If not we will have likely found ways to extract energy from the gas-giants by then.  Or possibly cracked interstellar travel and dispersed our energy needs over several solar systems. \n\nPoint being that where you end up would likely have a well controlled population level.  As the earth becomes overpopulated, simply send more out to space.  So don't expect some dystopia caused by such issues.  \n\nOne thing to note is that it is highly likely that people will live several hundreds of years by this point.  Not only do we have strong indicators of life extending medicines, but we're getting pretty good at replacing parts. The brain itself is about the only thing we really *need* to be who we are, and everything else is either to support the brain, or support the things that support the brain.  So by that point in time I could imagine us to at least have the technology to ditch our bodies for more reliable/redundant/replaceable ones.  I know I would do that if I could.  Mental illness becomes the only barrier for a long life at this point.  Brain cells themselves can apparently live for much longer than our bodies allow. \n\nSo now back to what jobless people with unlimited resources and very long lives might do... Well, entertainment would be the primary thing I imagine.  Space exploration would likely be a primary drive for people, since it would be about the only thing worthwhile left for humans to do.  There are so many places for us to visit that we could spend a great amount of time and resources mapping it all.  And that[.] only what we can see from earth.  \n\nWe will likely be able to plug directly into virtual reality by that point as well.  Whether this would create a dystopia of brains plugged into machines or not is very debatable.  I say no, as I feel like it would be more like video games and internet browsing are today.  People can only stand so much of it.  And many people outright dislike it, and would rather be outside, pushing themselves or socializing over a beer.  I can't see those things going away - even with a completely reconstructed virtual world where they could all the same stuff virtually. But, for the most part it is probably what you would find: people hanging out at home enjoying whatever they feel like for that day.   If communication via entanglement-type methods is possible, many people may actually pilot physical spaceships remotely.  \n\nBut.. here[.] the thing.  Almost all of the above is likely within the next 1,000 years.  Can you imagine where things would go from there?  I can't.  Much less another 17,000 of those types of increases.   There[.] a very good chance that we'll have encountered another species by then.  And us being the cocky war mongerers that we are probably won't survive it.  \n"}