{"doc_id": "1747", "name": "2013_11_humanities_student_major_1182_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2013-11-humanities-student-major_1182_GradSchool.txt", "pub_date": "2013-11-19T00:00:00Z", "Sentiment": "0.136", "Subjectivity": "0.338", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "295", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qzn51", "Reddit_id": "cdi6x8i", "Subreddit_id": "t5_2r4r8", "Commenter": "Second_Foundationeer", "length": "1924", "content_scrubbed": "There are a lot of fellowships/scholarships you can apply for at the same time you apply for PhD programs. In fact, it[.] probably not too much of a hassle because you're filling out similar paperwork and essays anyway. Here are some that might helpful:\n\n[NSF GRFP](http://www. nsfgrfp. org/)\n\n[DOE CSGF](http://www. krellinst. org/csgf/)\n\n[NDSEG](http://ndseg. asee. org/)\n\n[SMART](http://smart. asee. org/)\n\n[Hertz](http://www. hertzfoundation. org/)\n\n[Link Foundation](http://www. binghamton. edu/link-foundation/)\n\nThese vary, but I think most of them are limited to incoming/1st/2nd year graduate students. The NSF GRFP deadline has passed for this year, but keep this for next year. The DOE CSGF is only open for incoming/1st year computational science graduate students. The SMART requires you to work for the military/navy/army for 2x the number of years you receive the fellowship. \n\nI think that of all of these, the SMART is the one with the lowest on-paper requirements, but getting it depends on whether the military bases you choose needs you. Also, I've heard that the SMART sucks in terms of your job after graduation because you get paid well, but your base never gets enough funding to do anything super interesting.\n\n---\n\nYou also don't *have* to apply for fellowships. If you're a strong candidate, your program will offer you some kind of compensation through TAing, RAing, or some kind of department fellowship. However, an external fellowship makes you more attractive to a professor so that you have more freedom in choosing which research group to join. It[.] not a guarantee of getting the group you want, but it can make a difference sometimes. \n\nDon't worry about being embarrassed, everyone has to start somewhere. \n\n\nPS. I think everything I posted only applies to STEM because that[.] what I do. I don't know if it applies for the humanities, in which case I hope someone else helps clarify that. Good luck! "}