{"doc_id": "1676", "name": "2013_11_humanities_student_major_475_intp", "namespace": "we1sv2.0", "metapath": "", "pub": "INTP", "title": "2013-11-humanities-student-major_475_INTP.txt", "pub_date": "2013-11-08T00:00:00Z", "Sentiment": "0.014", "Subjectivity": "0.34", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1694", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1q3tkj", "Reddit_id": "cd9jq10", "Subreddit_id": "t5_2qhvl", "Commenter": "valenteine", "length": "8828", "content_scrubbed": "I've told a few people about my childhood but haven't considered posting it so publicly. Here I go, but I may leave stuff out.\n\nPretty much I hated my childhood. I hated teenhood. And I'm not liking young adulthood either as much as I would like to.\n\nI was pretty solitary as a child and got very irritable when people bothered me, especially when I was working on a jigsaw puzzle. I was also very scared of social interactions. I remember at around 3 or 4 years old, for my birthday was a big surprise party. I knew people were waiting for me at home, but when I got there and they yelled \"surprise\" I cried and stayed in my room for a very long time. I didn't like people touching me either, except for perhaps my dad. \n\nMy dad was hardly ever in the picture, so he didn't get a chance to see how my mother really treated us. The main message I took away from her was, \"You have no friends,\" \"no one likes you,\" and \"you have shit for brains.\" I also took away that if I was a \"smart ass\" that I would be punished for it. To this day, I think these sorts of messages have affected me unconsciously. \n\nIn order to avoid interaction with my mom, I would always play outside with my younger brother or by myself in the fields. It was also a good way to avoid an unwarranted spanking. I also preferred to be at school for as long as possible, for similar reasons. In preschool I had no friends. In elementary school, I had about 5 consistent friends who I still talk to but rarely now days. I was pretty athletic, artistic, and intelligent for my peers. I was sent to science camps on scholarships, and won a few prizes for my artwork. I was encouraged to pursue the arts, both visual and performing (instrumental), but I didn't.\n\nRight before we moved from that town, my mom had my little sister. At that point in town, my mother became much less abusive. I think having the third kid used up most of those kinds of hormones and energy. I remember one time she tried to spank me and end up hitting herself and I laughed, which wasn't the thing to do. And once she told me to stop crying while she spanked me, so I did, but after that when she wanted me to cry, I couldn't. So her stress relief became a bit (more) stressful. I also didn't like the way she treated my brother. In some cases I found it worse. I won't even mention some of the stuff she wanted me to do to him, that I didn't do, and was punished for...\n\n(I'm actually getting upset right now thinking of all this, and partly want to cry.)\n\nWhen we moved, I had even fewer friends. My first friend was about 5 years older than me, and 3 years later graduated highschool and moved. I got picked on quite often, and secretly was a pyromaniac. The kids at the bus stop knew what would happen to them if they told of all the fires I started. I did have a crush in middle school. He picked on me. I hated him. He found out I liked anime and we were in the same advanced class. And we became friends. And I was forced onto the basketball team bc of my height and athleticism. In the art class I did take, I was encouraged to continue the arts again, but had no desire to \"be a starving artist.\"\n\nIn high school, I made one more friend and we were friends the whole time. I had some other \"friends\" but we weren't very close, though one did treat me like a little sister. Again I was forced onto the basketball team, and this time also track team. Tried volleyball but hated the coaches and quit. I was secretly depressed throughout high school and did some destructive things. And like before, did the best I could to avoid my mother, like purposely taking on other activities. In high school I really did hate my mother and could see no other feeling towards her. If she died I would not have cared. I've seen people around me die and I didn't care. I think the only people I cared about at the time were my brother and sister. I didn't always get along with my brother, but at we got older, we became more amiable. And I was always in love with my little sister. \n\nI guess something to note here, is that my mother, brother, and sister are very extroverted, and I am very introverted. So having them around probably forced me to want to have more space. \n\nWhen at home in high school, I spent it all on the computer or in my room with the door closed. My mom was always upset my door was closed and would open it. Eventually I was so distressed that I told my dad about just about everything upsetting with my mom. I don't know what he said, but things changed quick, fast, and in a hurry. My mom got a lock for my door, and for awhile didn't bother me, unless she noticed that I wasn't eating enough. \n\nIn my last year of high school I was apathetic about everything. Nihilistic. Hated it all. And so on and so much more. I let my grades go and had no ambitions, like I use to. After high school, I was okay with working at mcdonalds until there was a new manager that I, and literally every other employee, hated. And I mean literally. At the end of the year, I was the last one left of the original crew, and I then left. I got a job at a grocery store, but working 60 or so hours a week wasn't enough. At the store, managers said I wasn't good enough with customers and the staff, and I knew they were lying in order to not give me a good raise. I had customers who gave me Christmas gifts, and two of the workers there would do just about anything for me. Other people and other management liked me too. The store manager was cool with me. Looking back, I should have said something to him. But it[.] fine I didn't.\n\nI was so restless I felt the need to go to school, and enrolled in a music program at the local community college. I got bored with that school and couldn't stand my life at home and in my town and transferred to a first tier school in my state that is hundreds of miles away. \n\nThis was actually great. I took care of myself with my secret savings, grants, and scholarships. I took japanese courses where I met similar personalities to mine. For about three years, things were amazing and I had really awesome and close friends that I could always have fun with. Things happened, and one of those friends abandoned me. The other stuck with me, but since I was so fucked mentally, he left me too. I had to make new friends, and put on a face. I tried. I made new \"friends\" but I didn't connect with them. I forced myself to finish what ever I had left of college and graduated. I had not job lined up, and it was virtually impossible to get one. I want home and was depressed for a long time. I spent literally every day in my room, ate about once or twice every two days, and just watched anime and movies when I wasn't sleeping. My mom was upset about this and did her usual thing, but I just didn't care. When I got fed up with myself, I went to see a doctor from my church and she gave me antidepressants. They helped. I got a part_time job where I worked two days a week, so I had extra change, but then I began spiralling out of control again. I met a guy from high school and hooked up with him. It was fun sometimes but mainly distressing. This is where my old friend decided to stop talking to me. I was very chaotic. Happy and sad at the same time or altering times very rapidly. The guy and I broke up and I was crushed, though there were no deep feelings there. Hi mom gave me some money to essentially start my life over. That same day I packed a few things and drove back to my college town, enrolled in school, and waited for the semester to start.\n\nThat summer, I did a bunch of promiscuous things you'd probably would think came from a reality television show featuring a super slutty less than porn star material girl. And from here, all my relationships and interactions were chaotic or messed up in some manner. \n\nAnyways, I took some classes, and re enrolled, but had trouble in school and everything, mainly to do with me being ill all the time. I went through a few bouts of homelessness, and all kinds of treatments for bipolar disorder, when I could afford them. \n\nNow I'm okay. I have a job. I'm not homeless. But I'm also not on medications or doing any treatments. My main issues that have come to light and actually trouble me now days is that I don't know how to interact with people well, and there is nothing in my life I find fulfilling. I've been neglecting school again by concealing my problems with absorption in card games, particularly mtg. Recently, it[.] been an obsession. I have been dreaming about mtg lately. My only issue with that is that I still feel empty when I wake up. My dreams before were of people in my past that I know I miss, at least in terms of emotionally. Those dreams were saddening and sometimes made me cry upon waking, but at least I didn't feel an emptyness, but rather a longing. \n\n"}