{"doc_id": "1627", "name": "2013_11_humanities_student_major_45_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2013-11-humanities-student-major_45_philosophy.txt", "pub_date": "2013-11-01T00:00:00Z", "Sentiment": "0.282", "Subjectivity": "0.357", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "921", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1poap4", "Reddit_id": "cd4hj6v", "Subreddit_id": "t5_2qh5b", "Commenter": "AnoruleA", "length": "5667", "content_scrubbed": "I'm glad I brought my collection of Aristotle with me to work today.  I'll sift through the edition and see what I can find.\n\n  \n\nEdit: okay here it is:\n\n\n*****  \n\n\n**tl;dr** Aristotle pretty much agrees with you, as long as one[.] personal goals are virtuous, which you have mentioned.  \n\n\nFrom Aristotle[.] \"Ethica Nicomachea\" (Nicomachean Ethics) Translated by W. D. Ross in *The Basic Works of Aristotle* pp. 927-1112  \n\n\nIn particular, Book X, pp. 1093-1112.  Book X discusses pleasure and happiness.\n\n  *****\n\nMuch in the Aristotelian tradition, he begins with a proposition:  \n\n\nAfter these matters we ought perhaps next to discuss pleasure.  For it is thought to be most intimately connected with our human nature, which is the reason why in educating the young we steer them by the rudders of pleasure and pain; it is thought, too, that to enjoy the things we ought and to hate the things we ought has the greatest bearing on the virtue of character.  For these things extend right through life, with a weight and power of their own in respect both to virtue and to the happy life, since men choose what is pleasant and avoid what is painful.\n\n\n\nAfter a refutation of Plato[.] contention that pleasure is *not* good, Aristotle goes on to define what is pleasurable.\n\n  \n\nOne might think that all men desire pleasure because they all aim at life; life is an activity, and each man is active about those things and with those faculties that he loves most; e. g. the musician is active with his hearing in reference to tunes, the student with his mind in reference to theoretical questions, and so on in each case; now pleasure completes the activities, and therefore life, which they desire.  It is with good reason, then, that they aim at pleasure too, since for every one it completes life, which is desirable.\n\n  \n\nThus, Aristotle positions pleasure as accompanying both an action and a disposition.  To Aristotle, a particular disposition influences the individual to focus his or her attention on what provides the most pleasure, and thus people tend to ignore other activities which are less pleasurable.\n\n\n\nBut Aristotle does not equate all pleasures.  There is a hierarchy, where pleasure derived from thought is at the top, and pleasure derived from consumption is at the bottom, with the arts and sciences somewhere in the middle.\n\n  \n\n As activities are different, then, so are the corresponding pleasures.  Now sight is superior to touch in purity, and hearing and smell to taste; the pleasures, therefore, are similarly superior, and those of thought superior to these, and within each of the two kinds some are superior to others.\n\n  \n\nAfter describing this hierarchy, Aristotle then contends that people[.] desires can be corrupted such that they desire things which are not good.\n\n\n\nFinally, after all much discussion of pleasure, Aristotle talks about happiness:  \n\nNow that we have spoken of the virtues, the forms of friendship, and the varieties of pleasure, what remains is to discuss in outline the nature of happiness, since this is what we state the end of human nature to be.\n\n  \n\nAristotle is very explicit, claiming that life as an action is interminably connected with the nature of happiness.  Here, Aristotle makes it clear that happiness, as opposed to pleasure, is not associated with a disposition, because of this relationship between life and happiness; there is a true form of happiness in humanity.  Happiness, instead of being associated with a disposition, is a self-sufficient activity which inheres in types of activities.  Some activities are desirable, and other activities are not desirable.\n\n\n\nAristotle criticizes leisure, or what he calls \"pleasant amusements\", he criticizes political power, and criticizes consumption and sex as sources of happiness:\n\n  \n\nHappiness, therefore, does not lie in amusement, and if one were to take trouble and suffer hardship all one[.] life in order to amuse oneself.  For, in a word, everything that we choose we choose for the sake of something else--except happiness, which is an end.  Now to exert oneself and work for the sake of amusement seems silly and utterly childish.  But to amuse oneself in order that one may exert oneself, as Anarchsis puts it, seems right; for amusement is a sort of relaxation, and we need relaxation because we cannot work continuously.\n\n  \n\nThus, worldly pleasures are not sources of happiness, but sources of relaxation.  Happiness instead comes from living a virtuous life.  However, living a virtuous life requires exertion, but in exertion one does not find happiness.  Instead, \"happiness is activity in accordance with virtue.\"  By extension of this statement, the greater the virtue one[.] exertion is aligned with, the greater the happiness is.\n\n\n\nThe nature of virtue, however, is that it requires contemplation, and so happiness is a contemplative activity.  \n\nHappiness extends, then, just so far as contemplation does, and those to whom contemplation more fully belongs are more truly happy, not as a mere concomitant but in virtue of the contemplation; for this is in itself precious.  Happiness, therefore, must be some form of contemplation.\n\n  \n\nAristotle does concede that man cannot be virtuous all the time, for man cannot sustain life purely through contemplation.  But man must not consume to excess, for that would not be virtuous.\n\n\n\nThen, the last few pages of Book X talk about how society should be organized with relation to Nicomachean Ethics, but I will not go into that here.\n\n  \n\nIn conclusion, happiness is an activity that inheres in the life of man according to virtue.\n\nEdited for formatting to be more easily read."}