{"doc_id": "1729", "name": "2013_11_humanities_student_major_1072_libertariandebates", "namespace": "we1sv2.0", "metapath": "", "pub": "LibertarianDebates", "title": "2013-11-humanities-student-major_1072_LibertarianDebates.txt", "pub_date": "2013-11-17T00:00:00Z", "Sentiment": "0.047", "Subjectivity": "0.332", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1716", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdgdnlv", "Reddit_id": "cdgsnf7", "Subreddit_id": "t5_2tvku", "Commenter": "txanarchy", "length": "9890", "content_scrubbed": "The counter argument to Hobbes' theories, for instance (page 5), was to boycott the offending business.... The larger the company, the more immune they are to boycotts.\n\nBoycotts and public backlashes have been extremely helpful throughout the years in forcing companies to change or adopt new policies. Microsoft[.] DRM plans for XBox One were shelved after their customers expressed outrage over their new policy. Nutella tried to stop their fans from posting things about their product on social media sites. The backlash that ensued forced them to change their policy and they are no longer stopping people from doing so. Bank of America was going to start charging a $5 fee for debit card holders but soon reversed their decision after hundreds of thousands signed petitions urging them to drop the plan while over 21,000 people pledged to close their accounts if the fee were instated. Netflix plan to spin off its DVD business (remember Qwickster?) and charge a separate fee was quickly shot down by their customers who were angered that they were now going to have to pay twice as much money for the same service. It took only days for Netflix to reverse course. Verizon was going to institute a $2 convenience fee for those who paid their bills online or over the phone but they backed away after their customers revolted. Boy Scouts of America reversed their policy denying gays membership to their organization after massive public backlash. Dozens of companies pledged to no longer support them and thousands of people threatened to leave the organization if it did not reverse its policy. The pressure finally forced the Boy Scouts to alter its ban on gays. Those are just some of the examples I could think of where consumer action forced companies to alter their policies. Boycotts and petitions have and do work and will continue to work. \n\nThe best protection for consumers is obviously competition. The more competition there is the more the consumer wins. However, thanks to the state many times competition is made impossible. Take cable and telephone companies for example. Each cable company enjoys its own monopoly thanks to local and state laws. They are given exclusive control over certain areas. When Google Fiber entered in the market in Kansas City Time Warner was forced to lower prices and increase speeds so that they retained their customers. The same is true for cell phone providers. The federal government artificially restricts access to the spectrum necessary to provide service. This naturally limits the number of companies that can participate in the market. \n\nIn the real world, even the threat of punishment by force is barely enough to keep order. People want to screw over their customers and neighbors. \n\nIn the real world people aren't trying to screw over their neighbors or their customers. In the real world people are generally good to each other. People don't murder or steal or rape or pillage, not because there are laws against such things, but because people are in general very good and have no desire to harm others. The vast majority of businesses aren't out to screw their companies. The only people that say stupid shit like this are those that have never owned a business and haven't got the first clue as to what makes them work. Those that think everyone in the world is evil and only out for themselves have a seriously distorted view of the world. Consumers tend to shy away from a business that harms them in some way. Yes, there are companies that treat their customers badly and there are people who do bad things but those are the exception, not the rule. \n\nYou can't tell me that removing all legal restrictions, and telling them that they'll be sorry for their wrongdoings, because we'll all look at them with a sour face if they misbehave, will have a better affect than laws with teeth.\n\nYes, I can say that. Most companies are trying to earn money and they can't do that by treating their customers poorly, driving them to the their competition. Again, the only people who say these kind of idiotic things are the people who have never owned a business. Go down to any business anywhere in your town, talk to the manager or the owner, and ask them what would happen if they started screwing their customers over. Go ask them if their mission is to make their customers angry or to make them happy. Do it. You might learn a thing or two about how businesses actually conduct themselves.\n\nBut it[.] not just about criminal law enforcement. There are all kinds of public services that you aren't taking into account. Look at air traffic. Sure, private companies could direct airlines safely... as long as the only people in the air are those who agree to the rules.\n\n[Right now 251] (http://www. cnn. com/2012/11/20/travel/air-traffic-control-towers/) of the 374 air traffic control towers are controlled by private businesses. These private companies are just as safe as those run by the FAA and are cheaper to operate. \n\nYou like hypoteticals, so here[.] one. Suppose you own a store, and one morning you go to open up and see that it[.] already open, and some tough guys are behind the counter, and tell you this is their store now, so fuck off! Well, Libertarians believe in solving problems with guns, so you go home to get yourself armed to re-take what[.] yours, but when you get there, your key doesn't fit, and some other people have moved in, and they say it[.] their house now, and your guns are now theirs. Who are you going to call?\n\nIt drives me nuts that you people will claim libertarians are pie in the sky dreamers but refuse see the state is already doing these things to you.\n\nSome tough guy shows up to my business and my home and claims they belong to him? Doesn't the IRS, DEA, police departments, city councils, state governments, etc. already do this? Let[.] take the IRS for example. They demand you pay them their tribute for the \"privilege\" of living in their \"free\" country. If you don't they send some tough guys over with guns, slap some bright red stickers all over your property, change the locks, and tell you that your business is now the property of the US government. You go to your home and guess what? Same guys, same bright red sticker, same story. Your home, your bank account, your business, your investments, your car -- everything -- seized by the state. Tell me, who are you going to call? Who is going to fix this for you?\n\nYou say libertarians live in a \"fairy tale\" but you can't see that you are living in one right now. Trying to disprove libertarian theory with statism isn't going to work because you are facing the exact same scenarios only you really don't have any recourse. The state OWNS you. They own your home. They own your business. They own your car. They own your children. You live in a \"free society\" with a benevolent government that takes care of you... until you fail to pay your taxes or violate one of their many thousands of laws.\n\nYou say \"Libertarians believe in solving problems with guns\" but you don't? You're either a liar or a fool. Same scenario you gave me. You show up at your business and some toughs are there saying it[.] theirs now. You go home only to find out that this same group of tough guys have seized your house. Who are you going to call? Probably men with guns -- the police. You are going to use guns, by contracting the police, to retake your property, aren't you? So what are you really accusing us of? Libertarians would do the same thing, only it would a private security company. What are you really trying to accuse us of here? Tell me? Because from where I'm sitting it[.] the same outcome, except in your world the state can steal your property and you don't have a fucking leg to stand on.\n\nThe reality (and pardon me for sticking to reality)\n\nI really wish you did live in reality. \n\n is that human society has had an organized government at its core from the earliest recorded days. The Hittites were among the earliest recorded societies, and they had kings and bureaucrats. Despite the long history, Libertarians are convinced that it never really worked, and that everything will work out just fine if we suddenly drop ten thousand years of tradition and just hope it all works out because they can't think of any reason why it shouldn't.\n\nNo, people have not \"organized government.\" The root of government is violent oppression through conquest. The kings you are talking about were nothing more than warlords who happened to have more men, more weapons, more ability to conquer the people around them through war. They held on to power through violence, extorted the people, stealing their wealth and property. They used religion to legitimize their power and violence to retain it. The whole of human history has been man trying to break free of the tyrannical control of these criminals. Man has marched steadily onward in an attempt to limit the power of the crooks that claim they have some divine right to rule them. Over time the \"people\" have assumed more and more power for themselves, as they should. The kings of old were replaced with democracies which supposedly are there to care for the liberties of the people. Libertarians, more specifically anarchist, are trying to continue humanities forward progress of a masterless society. Humans do not need overlords to tell them what to do.\n\nYes, dropping ten thousand years of oppression is the goal of libertarians. We want to end ten thousand years of plunder, of war, of oppression, of violence and lies. Pay attention to history for once in your life. Look at the progress of mankind in terms of political systems. They have moved from authoritarian dictatorships to ever more \"democratic\" systems in order to give people more freedom. Freedom is what we are after. Nothing, nothing, the state does is justified or necessary for humanity to live and proper. "}