{"doc_id": "1680", "name": "2013_11_humanities_student_major_521_education", "namespace": "we1sv2.0", "metapath": "", "pub": "education", "title": "2013-11-humanities-student-major_521_education.txt", "pub_date": "2013-11-08T00:00:00Z", "Sentiment": "0.12", "Subjectivity": "0.263", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "276", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1q5w9s", "Reddit_id": "cd9z6li", "Subreddit_id": "t5_2qhlm", "Commenter": "ItsPrisonTime", "length": "1664", "content_scrubbed": "From my experience. Gather a group of like minded individuals and start brainstorming together. When you have a strong identity, then start spreading ideas of wanting change and advancement/growth. (power comes in large groups)\n\nLearn to be a leader first. If you haven't heard of Ted Talks, check them out. There[.] a lot of conferences and videos on http://www. ted. com/ that can inspire you and give you ideas.\n\nThey also have a youth day. \nhttp://tedxyouthday. ted. com/\n\nI'm not speaking on behalf of all schools, but often schools are HIGHLY resistant to change and for good reason, a lot of \"BIG CHANGES\" messed a lot of things up in the past decade ( rising of poorly managed charter schools, no child left behind, ect ). Education at this present state is a very complicated/complex issue. No one has the \"cure all\" answer. Start with the small things first, when they actually work, then move towards something slightly bigger.\n\nThere are soooo many factors for \"resistant to change\". Maybe the staff are outdated or stretched waaay to thin to think of new ideas, maybe the staff are lazy/ignorant, maybe the staff are RIGHT and they have been in the system long enough to know certain new ideas won't work. It could be ANYTHING. It[.] up to \"great changers\" to understand thoroughly before they do anything --- and not the huge mishaps of \"change\" throughout the years.\n\n\nIn my opinion, you'd do your school a great good, just by motivating other students to want to \"be better\". And gathering everyone monthly to excel at anything (humanities, engineering projects, film festivals ect) \n\n\nOther tools you might like: change. org / donorschoose. org / good. is\n"}