{"doc_id": "1720", "name": "2013_11_humanities_student_major_913_uconn", "namespace": "we1sv2.0", "metapath": "", "pub": "UCONN", "title": "2013-11-humanities-student-major_913_UCONN.txt", "pub_date": "2013-11-15T00:00:00Z", "Sentiment": "0.11", "Subjectivity": "0.235", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "268", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qpba4", "Reddit_id": "cdf5ur2", "Subreddit_id": "t5_2rjvg", "Commenter": "Calam1tous", "length": "1565", "content_scrubbed": "I have a couple responses to this. First, STEM is where most research funding is headed towards, so of course schools are going to dump all their energy in that area in order to raise their research output. That[.] a no brainer.\n\nNow, as a person who almost went for a fine arts degree, I love really appreciate the stuff she is talking about. Literature, poetry, music, film, etc are. all great and have deep intrinsic value to one[.] education. But they *don't earn you money*. Of course, she addresses this exact argument:\n\nSome argue the days of furthering or bettering oneself through a liberal_arts education are gone, but that[.] true only if \"furthering and bettering\" means \"making more money.\" If that[.] the case, then let[.] just teach our kids to write ransom notes.\n\nHowever, she[.] missing how the high education system has evolved in response to society over the past few decades. In the 20th century, you didn't *need* to go to a University to get a job. You could start a career as an apprentice straight out of high school and only very specialized careers (like Law) required a full academic pathway. Nowadays, we have absolutely *flooded* the university system. Everyone goes to college, whether they really want to or not and students naturally make a beeline to whatever diploma will earn them the highest salary.\n\n\nSo, in principal, she is right: the Universities *shouldn't* be places that just enable you entry into the job market. But we allowed it to become that as a society. Want that to change? Stop oversaturating the high-education field."}