{"doc_id": "1736", "name": "2013_11_humanities_student_major_1112_asianparentstories", "namespace": "we1sv2.0", "metapath": "", "pub": "AsianParentStories", "title": "2013-11-humanities-student-major_1112_AsianParentStories.txt", "pub_date": "2013-11-18T00:00:00Z", "Sentiment": "0.107", "Subjectivity": "0.445", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "364", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qu0hx", "Reddit_id": "cdhck2m", "Subreddit_id": "t5_2u8j6", "Commenter": "burdalane", "length": "2092", "content_scrubbed": "Does anyone else have parents whose primary motivation is not how much money their kids make? My dad[.] primary motivation is to be able to research the topics that interest him. He[.] kind of INTP/Aspergerish, as in, he will be completely absorbed in his research and ignore everything else. I'm not sure what my mom[.] primary motivation is. She didn't even want kids for the first 10 years of marriage. She is constantly nagging and yelling at my dad, who tends to ignore her and everyone else. She seems to be down on herself because she never had much of a career or an independent life. She had a job in Taiwan before she got married, but she was extremely sheltered by her parents and gave up working after getting married and coming to the US. Now, she seems to be happier because she[.] found hobbies and no longer has to care for a child. \n\nMaybe my parents aren't as concerned about money because they never really experienced financial hardships, except when my dad was a grad student/postdoc. They are concerned about my employability, and they like to talk about how other people, who majored in liberal_arts, have ended up unemployed or doing something they consider undesirable, like filming documentaries in Tibet. They seem to think that only desperate, unemployed people would want to do something potentially risky. They also see STEM fields as more prestigious. When they were young, my dad[.] field (theoretical particle physics) was the pinnacle of prestige in my mom[.] social circle.\n\nI should add that I am more concerned about money than my parents because enough money could be a way out of working. Of course, that amount of money requires actual skill, as well as social skills and hard_work, so I've generally been disappointed and am now paid below average for my field of computer science. \n\nFinally, when I was in high school, I had never heard of petroleum engineering as a profession, so it was not even on my radar. I got into computer science because of the possibility of developing something that makes a lot of money without needing a whole lot of hardware."}