{"doc_id": "1778", "name": "2013_11_humanities_student_major_1431_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2013-11-humanities-student-major_1431_politics.txt", "pub_date": "2013-11-23T00:00:00Z", "Sentiment": "0.013", "Subjectivity": "0.331", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "562", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdkuavw", "Reddit_id": "cdl2ttv", "Subreddit_id": "t5_2cneq", "Commenter": "sarevok9", "length": "3173", "content_scrubbed": "I think that this standpoint and the one above it are wrong for a few reasons (I come into this discussion not as a teacher, but as a Level 3 CRLA certified tutor). \n\nEducators have long allowed too many excuses for \"being bad at math\" and excused behavior that is detrimental to students.   I was \"bad at math\" when I was growing up.   It was hard.   My mother never finished Geomerty / Algebra 2, and my father dropped out in the 9th grade, so he never had algebra 1.   So when I was in high school it seemed totally natural to slack off and fail out of algebra.   I did exactly that.  \n\nWell, in the short run, it was great.   I didn't have to work, noone was surprised, and I could spend more time focused on things that happen in adolescence. \n\nIn the long run I did go back to college as a CS major.   I had scraped just enough math knowledge together over the years to make it into College Algebra (Algebra II -- The lowest transferable credit bearing algebra class).  I realized after a brief bit of struggle that I was able to do math quite easily.   It took focus and determination, but it became second nature to me.   I progressed from Algebra II (college algebra) to pre-calc, calc I, calc II, calc III, Multivariable Calc Ia / Ib, Chaos Math, and Linear Algebra.   During the time I was in calc 1 I started tutoring students in math.   I've often found that my expectations of my peers (other students) was absolutely the key to their ability to understand it.   Taking the extra time to understand the gaps in their knowledge and fill those in while progressing forward was extremely rewarding to me.   I had kids that were failing fundamentals of math (lowest math offered by the college -- not credit bearing, roughly 7th grade math, fractions / decimals, etc) pick themselves up and with help move up to Calc I (that[.] 5 semesters of math) despite their majors not calling for that directly.   \n\nWhy?  Because I told them that it got harder, and that I thought they could do it.   I had people switching majors from liberal_arts to computer science, engineering, and other hard_sciences.   The fact that these kids realized that the \"can do math\" and having something that took all the time they needed made all the difference.\n\nFor every student that falls through the cracks, there[.] the potential to become someone like me.   \n\n14 years after I failed Algebra I in high school, I'm now a pretty successful engineer.   I teach programming, math, and help others when I can.   \n\nThere is a relevant study referred to as \"Pygmalion in The Classroom\" by Rosenthal in the 1960[.] that shows how teacher expectations often directly influence student outcomes.  I think that educators need to keep in mind that students need to be held to a high standard across the board.   The company that I work for now has about ~1000 people in the office that I work at.   The MAJORITY of us are engineers.   The majority of engineers are here on H1B visa[.] from Bangalore / other parts of India.   There simply are no Americans that fit the minimum requirements of the job.   Analytical math is the gateway to engineering, and we're letting that fall through the cracks."}