{"doc_id": "1786", "name": "2013_11_humanities_student_major_1487_brocku", "namespace": "we1sv2.0", "metapath": "", "pub": "brocku", "title": "2013-11-humanities-student-major_1487_brocku.txt", "pub_date": "2013-11-24T00:00:00Z", "Sentiment": "0.114", "Subjectivity": "0.282", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "445", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rc808", "Reddit_id": "cdlyxua", "Subreddit_id": "t5_2sm4k", "Commenter": "FPSChris", "length": "2589", "content_scrubbed": "Hey! I graduated Poli Sci 2 years ago and I'm now doing my Masters in Education (Leadership and Administration)\n\nI'll answer your questions then do some feedback.\n\nMy average was 79 coming out of high school, my graduating average was 74. I got pretty involved in extra curricular so my marks suffered at the expense of real experience, but I am in grad school so it all works out!\n\nThe workload is pretty standard to any other humanities/social science program. I did a combined undergrad in History and Political Science, and they were nearly identical. The workload is sorta like a heartbeat, there will be long stretches of nothing, then lots, then nothing, then exams. its stressful, but not unmanageable.\n\nI learned so much from the program! Actually paying attention and learning has given me some really cool perspectives to bring into new settings. My focus was on International Relations, the role of institutions and security. There are ups and downs. some days you will feel like the world is shit, everyone is shit and we are all doomed, and other days you will stumble across the good that makes everything better (4P26 [International Security] and 3P26 [International Institutions] are the two courses which made me feel  like this respectively)\n\nThere is a small but awesome co-op program run through the department! Some professors will get you to do work off campus which is really cool, and if you cant get off campus they will make other arrangements!\n\nI had a full time job before I graduated. My combined poli sci education with my extra curricular experience landed me a full time job with the student union managing all the student clubs and an international refugee program. I chose this MEd route because of the leadership aspects of it. Alot of which I learned in poli sci and I'm discovering new ways to apply it! I have since left that job and I'm starting up an environmental solutions company.\n\nOther stuff\nLike I said, did a combined major, and history was a really cool fit! The historical knowledge applied to todays problems clear up alot of the scary dilemmas we face today. Understanding how Iran works historically explains its behavior for the last few years and the breakthrough yesterday.\n\nThe professors are fantastic. So many of them are well respected scholars and amazingly intelligent people. They will always make time for you and answer any question you have. \n\nAs for courses, it really depends what you are into! There are 5 sub straits of poli sci to explore, pick the one you love the most and just go with it!\n\nTL;DR You wont regret it!"}