{"doc_id": "1665", "name": "2013_11_humanities_student_major_360_randomactsofchristmas", "namespace": "we1sv2.0", "metapath": "", "pub": "RandomActsOfChristmas", "title": "2013-11-humanities-student-major_360_RandomActsOfChristmas.txt", "pub_date": "2013-11-06T00:00:00Z", "Sentiment": "0.192", "Subjectivity": "0.44", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "294", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1q1thu", "Reddit_id": "cd8b2g7", "Subreddit_id": "t5_2t3dk", "Commenter": "Rayofsunshine2", "length": "1648", "content_scrubbed": "Hi I would like to request help for my daughter Melissa she is fourteen and is a bright young girl. Over the last few years I have gone through a bad divorce with an abusive ex he never spent much time with the kids {I am a single mom to three, my oldest does not live with me the second oldest wanted his sister to have a good chrsitmas so he decided not to have his photo taken} but now he has fully disowned them which was heart breaking to my youngest to because though he was not the best father he was still their father. \n\nI am currently taking care of five people, My oldest sons bestfriend,wife & their one year old son had no where to go last year after he was born so I let them stay with me. They are slowly saving for a new place which I am fine with I am not kicking them out anytime soon but it does make food and electric bills go up. I am still making car repair payments so I am unable to provide a christmas for my daughter this year.\n\nMy daughter loves makeup, nail polish, photography, the arts and is determined to do great things in life over the summer she took summer classes to earn exta school credits. She hopes to graduate early and is hopeful she can get a scholarship to attend college she would like to major in photography or the arts. [this](http://i. imgur. com/oDdiBRB. jpg) is her and you can read more about our situation/her on my [post](http://www. reddit. com/r/RandomActsOfChristmas/comments/1q0aa8/request_i_am_a_single_mother_who_needs_help_with/). this year has been hard money wise and she has gone without a lot of things she wanted/needed because of it i would love for her to have a great christmas. "}