{"doc_id": "1730", "name": "2013_11_humanities_student_major_1074_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2013-11-humanities-student-major_1074_canada.txt", "pub_date": "2013-11-17T00:00:00Z", "Sentiment": "0.171", "Subjectivity": "0.545", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "266", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdgo6g9", "Reddit_id": "cdgt6ef", "Subreddit_id": "t5_2qh68", "Commenter": "I_Conquer", "length": "1536", "content_scrubbed": "Sure.\n\nTo be clear, I'm open to the idea but not necessarily an advocate. But a major benefit would be that the companies providing training and the companies requiring labor would be the same companies.\n\nIf a company had a good enough training record, they could require a three-year contract, where they train you on the job with a guaranteed $S/year salary for three years. You sign a contract to accept it or to pay $C+10%-T where C is the cost of training, 10% is their training bonus, and T is the amount of your contract that you'd already completed (say training you cost $27,200, if you quit the day after training, you owe them ~$30,000 but if you quit after two years and eleven months you only owe 1/36th of $30,000.)\n\nOther companies will hire skilled workers that are good enough and will offer to pay the difference. That way, if the company is a good enough trainer, they can become profitable just through the 10% margin. Over time, potential market entrants will be able to determine the chances of getting bought out and bumped up. \n\nIt would take a lot of work to prevent workers, training companies, and buyout companies from scamming each other, but because they all have their own money on the line, it wouldn't take as long as you'd think.\n\nAlongside that, it would be perfectly acceptable for university to assist training these same workers in contract negotiation, economics, basic humanities, basic maths and sciences, etc. Depending on the length of skill training, the two could fold into each other well."}