{"doc_id": "1791", "name": "2013_11_humanities_student_major_1515_baseball", "namespace": "we1sv2.0", "metapath": "", "pub": "baseball", "title": "2013-11-humanities-student-major_1515_baseball.txt", "pub_date": "2013-11-24T00:00:00Z", "Sentiment": "0.198", "Subjectivity": "0.45", "Score": "23", "Upvotes": "23", "Downvotes": "0", "Wordcount": "603", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rdzwr", "Reddit_id": "cdmd7m0", "Subreddit_id": "t5_2qm7u", "Commenter": "Impractical_Joker", "length": "3271", "content_scrubbed": "I'm currently a senior and in the same boat as you. I've narrowed my list down to four very good liberal_arts, D3 schools. I began the process in December of my junior year, and went to a few showcases over the winter. Honestly, I advise you to save your money, unless you are going to the showcase of a school that you are seriously interested. The winter showcases are really only for the top tier D1 level players who are trying to commit by the spring or early summer. \n\nAlso, you most certainly are NOT starting too late. Don't worry. \n\nHere is what you should start doing in the next three to four months: \n-Get a copy of your transcripts from your high school and scan it into your computer to send to coaches later\n-Start taking standardized test, i. e. SAT, ACT, SAT II etc. (but you probably know that)\n-MAKE A RECRUITING VIDEO. I can not stress how important this is. It is definitely a necessity, and don't let anyone tell you otherwise. If you have highlights from any of your games since the start of freshman year, use them, but only use the videos that best highlight your skills (don't just throw in clips for the sake of filling time). If you don't have any video yet, you can do two things: (1) Film yourself taking BP, running the 60, pitching (if your a pitcher), etc. and compile it into a video. (2) Have someone video tape you (any video cameras well work well, as well as an ipad, but don't use an iphone) at any showcases you go to, and if possible at most (if not all) of your high school or travel games. Then pick and chose your best clips. \n-Email lots and lots of coaches, even if you don't have an overwhelming desire to go to their schools right now. If your like me you will change your mind many times in the coming 10 - 12 months\n-Fill out recruiting questionnaires for all of the schools that you email. Make sure to update your info every couple of months\n-In your emails, make sure to attach your recruiting videos and your transcripts. Don't get discouraged if coaches don't email you back right away. Be persistent. Send an email a week until they respond \n-As for showcases, the important ones are this summer. This summer is extremely important. Make sure to sign up for 3-5, and (obviously) make sure every school that you're interested in gets to see you play at some point. If you are a good academic student, I HIGHLY recommend this camp: http://www. headfirsthonorroll. com/\n-When your senior year starts, make sure to get a copy of your senior class schedule and email that to coaches too\n-Finally, enjoy the process. It is stressful at times, but it is so rewarding when you get a letter or an email from a coach. \n\nAgain, you are NOT late. You are actually well ahead of most kids with low D1, D3 interests. Most kids wont start visits with coaches until the summer. Oh, and I can't stress this enough: DO EVERYTHING ON YOUR OWN! What I mean is you email the coaches and make the phone calls. Your parents should not be doing that. But, DO keep them very, very involved on everything your doing. Just do it yourself. \n\nAlso, if you don't mind me asking, what schools are you interested in, and in what part of the country do you live? \n\nGood luck with everything!\n\nTL;DR Please read this. I spent a lot of time writing it\n\n"}