{"doc_id": "1692", "name": "2013_11_humanities_student_major_599_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2013-11-humanities-student-major_599_TwoXChromosomes.txt", "pub_date": "2013-11-10T00:00:00Z", "Sentiment": "0.061", "Subjectivity": "0.41", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "275", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qbr7i", "Reddit_id": "cdbhc35", "Subreddit_id": "t5_2r2jt", "Commenter": "cashewalchemist", "length": "1448", "content_scrubbed": "Would it help to know this happened to other people, and that they survived just fine?\n\nI was a physics major. And if you look at my transcript, you'll see that my physics courses were the weak points in my GPA. In fact, I took quite a few humanities and social science courses, and never got anything less than an A. My physics scores ... pretty much never As. My SAT and GRE scores were similar. Damned near perfect in verbal, lower on math. In fact, my freshman year, I had a professor say to me, after I could not do a problem at the board, \"That[.] OK, everyone has a subject they don't understand. At least you're not a physics major.\" She just walked away awkwardly when I told her that, in fact, I was.\n\nNow, I'm in a physics PhD program, acknowledged by professors and students alike as a \"rock star,\" and my PI hinted that I might be able to graduate early. I still struggle more than most other students with grasping the class material, and this is no secret to anybody, but I work my butt off, and that, in the end, is waaaaaaaaaay more important. In fact, I suspect that I have a leg up on \"smarter\" people, because I was forced to work so much harder. \n\nDon't worry. Just go to office hours, find a study group, and work your butt off. In the end, learning to work and learning to learn will probably be the most valuable tools you gain in college, and challenging yourself as you are puts you in the best position to get those tools."}