{"doc_id": "1689", "name": "2013_11_humanities_student_major_568_asu", "namespace": "we1sv2.0", "metapath": "", "pub": "ASU", "title": "2013-11-humanities-student-major_568_ASU.txt", "pub_date": "2013-11-09T00:00:00Z", "Sentiment": "0.037", "Subjectivity": "0.25", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "693", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1q8kte", "Reddit_id": "cdavuxp", "Subreddit_id": "t5_2rghd", "Commenter": "filmguy1234", "length": "3937", "content_scrubbed": "Barrett transfer student here. This probably doesn't apply to OP, but might to someone else reading this thread.\n\nI transferred into ASU this semester from a CC with loads of scholarships and honors. I got into Barrett and was super excited to be here. Within a month of being here I decided to quit.\n\nBarrett sucks for transfer students. My reasons:\n\n1. You MUST start there as a freshman IMO in order to take advantage of the culture. There were approx. 1200 incoming freshman this semester and only 75 incoming upper division (numbers quoted directly from my honors advisor btw). It is a high-school environment. Nothing wrong with that, but not what I was looking for. Also, it[.] way too easy to get lost in the heard when you come in as upper-division. Also, ASU is expanding Barrett rapidly (too rapidly IMO) so this situation will only get worse.\n\n2. As a biz student with loads of quality work experience, the extra honors work really doesn't matter one bit. I suppose if I was a STEM or humanities person trying to get into a good grad school it might matter, but as an accounting student hoping to get into the masters of accounting program (not too diff with a good GPA) and then a big firm (same)... nope, not worth it.\n\n3. Piggybacking on the last one, I question whether Barrett really works well with the Biz school. In my experience the honors level business classes (300 level) are so few and far between that there[.] a good chance you might end up not being able to take them based on scheduling conflicts anyway.\n\n4. Extra work. Again, if you need a thesis to prove to a grad school that you're worth admitting, then by all means go with Barrett. If not (like me) then it[.] just a 8-12 month pain in the ass that[.] not needed. Likewise, the honors contracts for individual classes seem to basically boil-down to the student writing an extra 10-page paper and the professor giving them a check mark for putting forth the effort. Most of the professors I approached about these in WPC didn't seem very eager to put much effort into meeting with students to do something really valuable (full disclosure: I never completed one so take this with a grain of salt). \n\n5. MONEY. This is probably the biggest one. Barrett costs a good bit extra. $500 fee per semester plus a more expensive meal plans (which you'll be forced to carry freshman year) all for a dining hall that[.] good but not that stupendous, plus the 9-12 extra credits you'll be paying for (human event =6, thesis defense =3, plus any internships). Probably costs a freshman an extra $7k-10k more over four years than a regular student (assuming scholarships don't cover it of course).\n\n6. Human-event. This class blows. No really, it blows. They now require it (actually an equivalent: \"History of Ideas\") for upper division transfer students too but I've heard the same from every single freshman I've spoken too. You will read a shit ton of passages from classic books about some vague subject (gender, leadership, bioethics, etc.) that can't possibly be summed up in the one or two weeks you read about them. Then you'll be asked to write essays and \"think deeply\" on these writings and will be lucky to get a B+/A- grade on any of them because the professors are trying to convince you that Barrett is rigorous. Basically these just end up wasting your time (and money, if your scholarship doesn't cover tuition!) and mildly fucking with your GPA depending on how much ego the professor chooses to display. No thanks.\n\nIn the end Barrett looked cool from the outside but quickly lost it[.] luster once I got in there. I could see it being a great opportunity for certain people (read: freshmen only and probably not business students) but it[.] shouldn't be considered the only way to get a good experience/education from ASU.\n\nTL;DR: Barrett sucks for transfer students but might be good for a freshman depending on how bad you want/need it for grad school."}