{"doc_id": "1717", "name": "2013_11_humanities_student_major_822_thegirlsurvivalguide", "namespace": "we1sv2.0", "metapath": "", "pub": "TheGirlSurvivalGuide", "title": "2013-11-humanities-student-major_822_TheGirlSurvivalGuide.txt", "pub_date": "2013-11-14T00:00:00Z", "Sentiment": "0.103", "Subjectivity": "0.348", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "325", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qllki", "Reddit_id": "cde5pfy", "Subreddit_id": "t5_2vfzu", "Commenter": "SugarandSass", "length": "1827", "content_scrubbed": "What is your degree? Is it something that you could morph into another type of job? Hardly anyone I know works in the field that their degrees were in. I have a friend who[.] a highly paid programr whose degree is in English. And a Poli Sci major who works as a researcher and proposal writer. And a Music major who works in the legal department of a non-profit. \n\nHell, my BA was in Communications, Creative Writing, and Religion. My MA was in Humanities with a focus in Digital Media. My internship in my last semester was in Hillary Clinton[.] presidential campaign headquarters in NYC.  I'm currently a technical writer for a government contractor, haha. Aside from a vague connection from the writing thing, my current job (of 2 years) has absolutely nothing to do with my degrees or my internship, which absolutely kicked my ass, btw. While I absolutely believed in the cause, my internship just cemented in my mind that I was NOT cut out for politics. Still looked great on a resume!\n\nOften, employers just look to see that you HAVE a degree, not necessarily what it[.] in. If you graduated from something, that proves to them that you have the dedication and ability to complete short and long_term tasking, probably have some research ability, and at least a little motivation (though you'd never know it by the end of senior year, haha). \n\nWhat I'm trying to say is don't stress yourself. If you think you can stick it out through that last semester and internship, you can find yourself something that has nothing to do with your degree. Maybe take some specialized courses or certifications to get into the field you want after you graduate. Cheer up, girly! :) You're not stuck in a path you can't change. Tons of people feel this way by the ends of their undergrad (or even grad) careers and it[.] not set in stone!"}