{"doc_id": "1718", "name": "2013_11_humanities_student_major_867_science", "namespace": "we1sv2.0", "metapath": "", "pub": "science", "title": "2013-11-humanities-student-major_867_science.txt", "pub_date": "2013-11-14T00:00:00Z", "Sentiment": "-0.01", "Subjectivity": "0.038", "Score": "160", "Upvotes": "160", "Downvotes": "0", "Wordcount": "233", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdejr0o", "Reddit_id": "cdem249", "Subreddit_id": "t5_mouw", "Commenter": "trentlott", "length": "1499", "content_scrubbed": "Let[.] look at her research output\n\n* Somatechnics, 2012 - 5-year Impact Factor of 0. 387\n  I offer up my narrative as a contribution to the growing discourse on fat identity and stigma management. And in conclusion, I consider whether fat identity development, and coming out as fat, are developmental processes that can be characterised by stages.\n\n* Feminist Review 2012 - Impact Factor: 0. 523\n five feminists in academia come together to share how feminism affects their practice. Ranging in reflections on teaching, research, service and scholarship, this article describes a cooperative enquiry into feminism in action in Aotearoa, New Zealand.\n\n* 3 articles in 2012 in The Conversation Media Group. (Not a journal) . \n 35 per cent of the Conversation Australia[.] audience is located beyond Australia[.] borders, [65% of the audience being Australian.]\n\n* Her thesis, 2008\n Using interview data, this study examined the construction and maintenance of role-related weight identity in morbidly obese women. This dissertation found that for all but one of the women in this sample, weight identity was constructed in a negative way.\n [T]he recruitment list-serve was presented to students, faculty and staff at a local University, no faculty responded to participate. . . . This sample also lacked any women who identified as lesbians. Research has demonstrated that women who identify as lesbians hold lower levels of body dissatisfaction.\n\n**tl;dr : She[.] not a scientist, she does humanities.**\n"}