{"doc_id": "1739", "name": "2013_11_humanities_student_major_1141_toronto", "namespace": "we1sv2.0", "metapath": "", "pub": "toronto", "title": "2013-11-humanities-student-major_1141_toronto.txt", "pub_date": "2013-11-18T00:00:00Z", "Sentiment": "0.012", "Subjectivity": "0.281", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "734", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdhmr5g", "Reddit_id": "cdhoddp", "Subreddit_id": "t5_2qi63", "Commenter": "sun_tzu_vs_srs", "length": "4523", "content_scrubbed": "I was in university for a *long* time, and spent much of my time there in a humanities field known to be a bastion of feminist criticism.\n\nWhat you miss is that the individual instances of study (like the three you've pointed out) when classed under the heading \"feminism\" cease to be *just study* and begin to be *ideology*. There is no reason to call a study of industrial-era female experiences \"feminism\", save trying to further one (arbitrarily defined) group[.] status in a sort of class/gender warfare. Why isn't it just humanism? Why not egalitarianism? Why perpetuate gender inequality by gendering the very name of your discipline? How is that contradiction not shockingly obvious?\n\nThen there[.] the \"catching up\" argument; It is a logical contradiction, because how can a discipline which explicitly excludes one (again, arbitrarily chosen and defined) group[.] perspective judge to what degree a discourse consists of both perspectives? It can't. In order for such a calculation to be possible, you'd need some entirely de-gendered perspective (which was, incidentally, first- through second-wave feminism[.] stated goal) to act as a judge, e. g. a humanism. \n\nI here note the \"men[.] rights groups shouldn't be allowed because we deal with men[.] rights in feminism\" argument. Not so common among serious academics as it is among students, true. But the students being taught by academics are somehow arriving at arguments like the one above and taking them seriously en masse. If that is the product of the teachings of academic feminism, do you not think we should have a serious conversation about whether or not said product is desirable?\n\nIt boils down to Logic 101: if you're attempting to dissolve class differences, don't subscribe to an ideology that inherently perpetuates classism.\n\nThen there[.] the question of why the female/male binary is an axis on which we should focus study. It is entirely possible -- and depending on how closely you pay attention to sociologists/demographers, likely -- that political and social oppression has closer correlations to categories outside of gender than within. E. g. were females really more oppressed in feudal times than males because the male tended to head the nuclear family? Let[.] not forget that the feudal lord literally owned his subjects -- males, too -- and \"their\" fiefs, and yes, the lord was male, but was his maleness *really* the source and cause of the oppression? Further was the female subject[.] oppression really greater than the male[.]? If the answer is no then spending time and energy on feminism or gender studies is not just useless but *harmful*, because we a) draw attention away from greater sources of harm, e. g. class, property, political warfares, and b) perpetuates the blinders by pretending there[.] some essential power relation between male/female that is *greater than all other possible distinctions* that we could be focusing on, leaving the road open for abuses of power to continue along other axes. \n\nI here note the anthropologist you cite who is studying single female mother w/ incarcerated husband experiences. That is great, but why does it have to be *feminism*? The fact that the black husband is incarcerated should ring a million oppression bells that have little to do with gender, e. g. poor black non-connected people (the vast majority of whom happen to be men, but I digress) being vastly overrepresented in the US prison system than any other class and mostly due to laws with questionable basis, i. e. minor \"drug\" possession. Unsure of why we need a bunch of -isms (e. g. feminism) preventing stuff like this from being studied and privileging the study of female experience over all other classes of experience, it just clouds our search for the roots of power and by extension oppression. What does the -ism add, in this case?\n\nFirst- and second-wave feminisms generally stated the dissolution of feminism as a goal once equality was achieved, which implied that though they looked past the inherent contradiction in seeing equality from within feminism, they at least recognized that equality cannot exist simultaneous to feminism (likewise men[.] rights, to import modern times). That view is now seen in the academy as hopelessly outdated, feminism is seen as permanent and *a priori* necessary. That is my problem with feminism as an academic field. It perpetuates an ideology without questioning the logic of its foundations, which position I don't need to invoke Godwin in order to point out its flaws. "}