{"doc_id": "1764", "name": "2013_11_humanities_student_major_1326_theoryofreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TheoryOfReddit", "title": "2013-11-humanities-student-major_1326_TheoryOfReddit.txt", "pub_date": "2013-11-21T00:00:00Z", "Sentiment": "0.055", "Subjectivity": "0.332", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1144", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdjupyj", "Reddit_id": "cdjvi19", "Subreddit_id": "t5_2rtff", "Commenter": "LawlAbx", "length": "6849", "content_scrubbed": "The work I mentioned isn't nearly complete but I can share some of my sources and explain some of Tocqueville[.] theory.\n\nIncoming huge wall of text :\n\nThe authority of a king is purely physical, and it controls the actions of the subject without subduing his private will; *but the majority possesses a power which is physical and moral at the same time;* it acts upon the will as well as upon the actions of men, and it represses not only all contest, but all controversy. I know no country in which there is so little true independence of mind and freedom of discussion as in America. In any constitutional state in Europe every sort of religious and political theory may be advocated and propagated abroad; for there is no country in Europe so subdued by any single authority as not to contain citizens who are ready to protect the man who raises his voice in the cause of truth from the consequences of his hardihood. If he is unfortunate enough to live under an absolute government, the people is upon his side; if he inhabits a free country, he may find a shelter behind the authority of the throne, if he require one. The aristocratic part of society supports him in some countries, and the democracy in others. **But in a nation where democratic institutions exist, organized like those of the U_S, there is but one sole authority, one single element of strength and of success, with nothing beyond it. In America the majority raises very formidable barriers to the liberty of opinion: within these barriers an author may write whatever he pleases, but he will repent it if he ever step beyond them. Not that he is exposed to the terrors of an auto-da-fe, but he is tormented by the slights and persecutions of daily obloquy. His political career is closed forever, since he has offended the only authority which is able to promote his success.** Every sort of compensation, even that of celebrity, is refused to him. **Before he published his opinions he imagined that he held them in common with many others; but no sooner has he declared them openly than he is loudly censured by his overbearing opponents, whilst those who think without having the courage to speak, like him, abandon him in silence.** He yields at length, oppressed by the daily efforts he has been making, and he subsides into silence, as if he was tormented by remorse for having spoken the truth. Fetters and headsmen were the coarse instruments which tyranny formerly employed; but the civilization of our age has refined the arts of despotism which seemed, however, to have been sufficiently perfected before. The excesses of monarchical power had devised a variety of physical means of oppression: the democratic republics of the present day have rendered it as entirely an affair of the mind as that will which it is intended to coerce. Under the absolute sway of an individual despot the body was attacked in order to subdue the soul, and the soul escaped the blows which were directed against it and rose superior to the attempt;** but such is not the course adopted by tyranny in democratic republics; there the body is left free, and the soul is enslaved. The sovereign can no longer say, \"You shall think as I do on pain of death;\" but he says, \"You are free to think differently from me, and to retain your life, your property, and all that you possess; but if such be your determination, you are henceforth an alien among your people. You may retain your civil rights, but they will be useless to you, for you will never be chosen by your fellow-citizens if you solicit their suffrages, and they will affect to scorn you if you solicit their esteem. You will remain among men, but you will be deprived of the_rights of mankind.** *Your fellow-creatures will shun you like an impure being,* **and those who are most persuaded of your innocence will abandon you too, lest they should be shunned in their turn.** Go in peace! I have given you your life, but it is an existence in comparably worse than death.\"\n\nMonarchical institutions have thrown an odium upon despotism; let us beware lest democratic republics should restore oppression, and should render it less odious and less degrading in the eyes of the many, by making it still more onerous to the few. Works have been published in the proudest nations of the Old World expressly intended to censure the vices and deride the follies of the times; Labruyere inhabited the palace of Louis XIV when he composed his chapter upon the Great, and Moliere criticised the courtiers in the very pieces which were acted before the Court. But the ruling power in the U_S is not to be made game of; the smallest reproach irritates its sensibility, and the slightest joke which has any foundation in truth renders it indignant; from the style of its language to the more solid virtues of its character, everything must be made the subject of encomium. **No writer, whatever be his eminence, can escape from this tribute of adulation to his fellow-citizens. *The majority lives in the perpetual practice of self-applause*, and there are certain truths which the Americans can only learn from strangers or from experience.**\n\nFrom: [Chapter XV: Unlimited Power Of Majority, And Its Consequences—Part II](http://www. freerepublic. com/focus/f-news/2216858/posts) , emphasis mine.\n\nSo Tocqueville[.] main point in this is that holding a controversial or opposite opinion to the majority is essentially political suicide and both you and your opinion won't be held to the same regard as the ones held by the majority. I propose that this is equivalent to giving an opinion a downvote.\n\nThe problem I have ran into though is that there are many factors that also influence voting habits. [Information cascade theory](http://en. wikipedia. org/wiki/Information_cascade) can be used to explain why frontpage articles see such an inflation of votes, as the rating system inherently influences individuals to upvote highly upvoted content. Duncan Watts et al. did a great study on a topic similar to this (songs & ratings given to them by users), and have found that individuals rate songs higher if they are seen as being popular with other users. ([link to study](http://www. princeton. edu/~mjs3/salganik_dodds_watts06_full. pdf)), and the effect is greater when the songs are *listed by descending popularity*. It doesn't take much imagination to see how this can apply to reddit.\n\n\nThere[.] also much more to consider:\n\n*\nHence what I call the Fluff Principle: on a user-voted news site, the links that are easiest to judge will take over unless you take specific measures to prevent it.\n\n[Paul Graham: What I Learned from Hacker News](http://www. paulgraham. com/hackernews. html)\n\n*Overarching distrust of fellow users due to anonymity and furthermore :\n\n*Poe[.] law, trolling & their consequences\n\n\n\n\n\n"}