{"doc_id": "1798", "name": "2013_11_humanities_student_major_1565_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2013-11-humanities-student-major_1565_news.txt", "pub_date": "2013-11-25T00:00:00Z", "Sentiment": "0.11", "Subjectivity": "0.403", "Score": "47", "Upvotes": "47", "Downvotes": "0", "Wordcount": "707", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rexfa", "Reddit_id": "cdmzyj8", "Subreddit_id": "t5_2qh3l", "Commenter": "[deleted]", "length": "3854", "content_scrubbed": "Having read a number of posts on Reddit concerned with college costs, I wanted to at least give some perspective from the professor standpoint. I'm a tenured professor, in the humanities, at a state school in the Northeast. I have been at my current position for 8 years. I spent 10 years in graduate school (though part of that time I worked as a high school teacher). When I applied for my position, they had 160 applications, 157 of whom had, or were near the end of getting, a Ph. D. I make $55,000 a year, pay 3% of my salary towards retirement, pay more than my department secretary towards healthcare (not knocking her, she is great, it[.] just her union is huge and bargained for a better deal), and pay a separate fee for dental and vision care. I also pay all the other payroll and income taxes as everyone else, plus, I have $45,000 in student loans. I teach three classes each semester, and one to two in the summer. I am expected to publish at least one major article a year, or work towards publishing a book every four or five years. I advise as many as 20 students a year (though informally I advise several dozen more). I must serve on several committees at my school, several committees in my field, and must demonstrate service in the community. Should I not do any of these things, I do not receive raises. (Actually, I have not received a raise in three years, and will not receive one for two more years. I am also contractually obligated to \"give back\" 5 days of pay this year and 4 days next year; a nice way of saying, pay reduction.) I also must continually demonstrate all these efforts to receive promotions. [Please understand, none of this seems extreme or \"too much\" to ask of me, though I'm not sure compensation and expectations are fully aligned (but that[.] worth debating).]\n\nWhile tenure sounds nice in some ways (and yes, it is in many ways), it also means you are stuck. Only the superstars ever get other job offers, especially in the humanities, social_sciences, and many of the physical sciences (business school profs and law profs are different). Cuts to college budgets (yes, the last five years have seen massive cuts in budgets -- and I do mean massive for some schools) have meant zero new tenure track positions, so for most of us there are no jobs to apply to (and yes, I feel lucky as hell to have a tenure track job... my point is that it comes with a price, too). I have to live far away from family and friends, in a small college town, where my prospects for dating are terrible. Again, I love what I do, but it can break a man[.] soul. \n\nI want everyone on Reddit to know that most of us professors are pissed as hell that colleges are charging exorbitant rates to students. Most of us don't want to give you expensive textbooks (we are always looking for ways to lower those costs, but it is hard, what with the way bookstores work and publishers, too). Most of us do what we do because we love the life of the mind; we adore our students; we love to watch you all grow. We got into this because we are eternal students ourselves. \n\nCollege education is not affordable now for most students. Please know that the majority of your professors will continue to fight administrations and state governments (in my state, less than 15% of state college money comes from the government at this point -- which means tuition makes up the rest) to correct this atrocious problem. Most of us labor under meager pay (compared to our qualifications and the time it took us to get here). I don't expect to make huge amounts of money in my life; I'd like to have a family (maybe one day), maybe a nice, small home to raise in kids in, and just be somewhat comfortable (don't we all really want this?). I just want all of you to know that most of your professors (there are some exceptions) are making modest livings. "}