{"doc_id": "1722", "name": "2013_11_humanities_student_major_960_musictheory", "namespace": "we1sv2.0", "metapath": "", "pub": "musictheory", "title": "2013-11-humanities-student-major_960_musictheory.txt", "pub_date": "2013-11-16T00:00:00Z", "Sentiment": "0.199", "Subjectivity": "0.296", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "373", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qpyia", "Reddit_id": "cdflgyz", "Subreddit_id": "t5_2qrjj", "Commenter": "apollolee", "length": "2244", "content_scrubbed": "If you have good enough grades, apply for a scholarship to study at a Bachelor[.] degree-granting university.\n\nIf your grades aren't good enough for a scholarship, don't take out student loans to study music theory and composition.  I did.  I'll probably have my student loans paid off around the time I retire.\n\nIn this case, your friends' level of success didn't really have much to do with whether or not they got the associate[.] degree at your community college, but how hard they worked and how lucky they got after they left.\n\nIn fact, job prospects are exceedingly slim for vast swaths of performing arts and liberal_arts majors, even when they come from universities like Stanford and Berkeley.\n\nThe best way to learn how to write music when you have a head full of music theory is to take some songwriting classes online (or do a bunch of youtube tutorials) and write a bunch of music.  Have you taken Pat Pattison[.] [Coursera Songwriting Course](https://www. coursera. org/course/songwriting)?  When I took it, I ended up with 37 pages scrolling on Evernote.\n\nHow comfortable are you with DAWs, like Ableton Live, Logic Pro, or Reason?  Do as many tutorials as you can find, post them publicly to a blog, and suddenly you're an internet teacher.\n\nCommunity colleges are great, but you're still a ways off from a bachelor[.] degree.  Are you good enough at your major instruments to pass upper division standing (that[.] what my school called it when you could play an instrument well enough to qualify for 300+ level lessons/perform in the orchestra), despite a on-again-off-again practice schedule?  For singer-songwritery stuff, how are your guitar and piano chops?\n\nIf I were in your shoes, unless I was considering doubling in computer science or business, I'd probably stick with working at my job and working on my music. \n\nI wish you the best.  Crank out some music, don't be afraid to suck, post your tunes/tracks/grooves to soundcloud, find a stranger to smirk at your music (friends always give you friendly feedback, strangers are more inclined to say \"I don't get what you're trying to say.\"), and keep moving your skills forward.  Even overnight successes have years of struggling along, singing and playing to the four walls."}