{"doc_id": "1758", "name": "2013_11_humanities_student_major_1263_uofo", "namespace": "we1sv2.0", "metapath": "", "pub": "UofO", "title": "2013-11-humanities-student-major_1263_UofO.txt", "pub_date": "2013-11-20T00:00:00Z", "Sentiment": "0.044", "Subjectivity": "0.337", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "1206", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qijic", "Reddit_id": "cdj5rjj", "Subreddit_id": "t5_2sfxj", "Commenter": "[deleted]", "length": "6701", "content_scrubbed": "1: Live in the dorms. No, you will hate it at some point, but its an easy way to make friends and generally just stay grounded. I didn't like being woken up at 4 AM by someone drunk off their ass singing about how you should vote for Obama but that[.] just part of the experience. \n\n\n2: The dorms are not for studying. Go to the library. Not the law library. Law students hate it when undergrads use their library. And it[.] technically against the rules. Its just seldom enforced. \n\n\n3: The center, front of any large class is where you want to sit. When you have a class with 300 students no professor[.] going to remember your face. Ask questions. Visit them during office hours. Especially if it[.] a hard class. Professors who can actually *remember* who you are are far more likely to give you a grade boost when you're . 5% off the next grade level.\n\n\n4: You're responsible for your grade. *Do not blame the professor.* It[.] easy, and it might make you feel good but it doesn't change reality. Some classes are purpose built to weed people out of majors they're not focused on.\n\n\n5: The drug and alcohol culture at UO doesn't really give a shit either way. If you don't like it, don't expose yourself to it, but if you *do*? Well, some people can do moderation, and for others moderation is harder than going cold turkey. Just avoid doing it on holiday weekends, and after finals and midterms. DPS and the fuzz are looking for stupid freshmen during those times.\n\n\n6: You'll want a good rain coat, and an umbrella. Eugene can get hard rain, but typically it[.] just *light*. Still, it[.] no fun sitting through a class feeling like a washed out rat. Worst time to figure out my coat had lost it[.] ability to repel rain.\n\n\n7: The earlier you settle on your major, the better. UO gives you two years to figure it out, but you want to settle early. Gives you a clear goal, and helps map out your next four years. If you don't like the major it[.] not like you can't transfer later.\n\n\n8: If you want to work *in* your major, you need to treat your class work as a job. The 1 to 2 hours outside of class studying for every hour spent *in* class is kind of a bullshit statistic professors offer up. Different people learn at different speeds, but if you don't have the material absolutely mastered, you're not done. I graduated with a bachelor[.] in anthropology and while I had no interest in seeking a graduate[.] degree or higher in it, the difference between the folks who were grad school minded in undergrad, and those who wanted *just* a degree was astounding and immediately obvious. \n\n\nAt any rate, some classes I got B[.] in and did absolutely no work outside of class because I already *liked* the material and was reasonably well versed in it before I ever sat down for class. Others? 4-5 hours a night for C[.]. Fun.\n\n\n\n9: Recognize the difference between studying *hard* and studying *smart*. Studying isn't a convenient conversion where you put in X hours and get Y results. Different subjects demand different methods. You will work yourself to the bone over nothing, and just get a lot of frustration if you can't learn the difference. If you were the type in high school who did little or no work and still got A[.] and B[.] you'll *really* want to take the study skills class. Might sound below you, but *seriously*. Take it. \n\n\n10: *Speed Reading*. Learn it. Eventually you'll get a professor who assigns an astronomical amount of reading to you, and while he wont *tell* you, he knows damn well no one[.] actually going to read every last word. ~75% of all text in any book is *junk*. It[.] worthless. It[.] only there to bring you from one thought to the next. Learning to phase those parts out and focus on the *meat* of the writing will save you *so much* time. In the day-to-day context of what happens in class, and in office hours, you don't need to hang by every word in the damn book. You just need to be able to intelligently *discuss* the material. If you're writing a paper or a dissertation or research work? *Yes*, you'll want to know the real guts of the work. \n\n\n11: Take the time to figure out what eateries around UO are good. Dorm food isn't *bad* by college standards, but it still gets old eventually. Bepe and Giani[.] is just off campus and is probably the most authentic Italian in Oregon, or barring that, at least Eugene. It[.] a bit pricy, but its a nice place to take a date, or to bring your parents to. Places like Sweet Basil, Tasty Thai, Maple Garden, Caspian Cafe, Jail, and Cafe Sienna are *fantastic*. Good food, good portions, good prices. Anyone who[.] spending *any* time in Eugene *must* eat at Papa[.] Soul Food. No exceptions.\n\n\n12: Your adviser[.] greatest use is informing you of which classes are liable to be time consuming, and mapping out schedules terms in advance.\n\n\n13: No more free summers. Freshman and Sophomore year you should really take summer classes. Just don't take the 4 week condensed classes. They're insane. 8 week classes are more laid back (summer classes are in general but..... yeah, 4 week classes), and you get to enjoy Eugene during the three best months of the year. And there[.] about 2000 students rather than 22,000. Junior and senior year you should look into internships. If this has to be wedged against a paying job, do it. But do not spend your summers doing nothing, and *only* working for pay isn't an excuse. You will *always* get a job quicker after college if you carry credentials that set you apart. These days everyone and their grandma has a degree, and has the kind of McDonalds / Cart pushing / I have a pulse! type jobs to their name. But an internship in your field? That[.] another can of worms. \n\n\n14: Cluuuuuubs. Outside of dorms the best way to meet people is by common interests. There[.] a club for almost anything. Take advantage of it. \n\n\n15: Generally speaking as you progress in majors, liberal_arts majors become more *focused* in subject matter, while the sciences generally just become more *work.* \n\n\n\n16: You'll skip class eventually, so you may as well do it intelligently. Don't skip the first or last day of class, and don't skip the day of, after, or before major dates (tests, finals, paper due dates). It[.] also unwise to skip days before and after holidays. Even if it[.] the Wednesday before Thanksgiving, often professors throw the folks who show up a nice bone. It[.] fairly common for classes those days to get binned anyways. \n\n\n17: Take PE classes. They meet infrequently and they're not worth much credit, but you'll learn a new hobby / skill, and its *easy*. If not, still use the rec center. You're paying for it in your student fees. It[.] a nice way to blow off steam after studying. "}