{"doc_id": "1671", "name": "2013_11_humanities_student_major_405_filmmakers", "namespace": "we1sv2.0", "metapath": "", "pub": "Filmmakers", "title": "2013-11-humanities-student-major_405_Filmmakers.txt", "pub_date": "2013-11-07T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.323", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "1207", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1q41n6", "Reddit_id": "cd9086g", "Subreddit_id": "t5_2r1ip", "Commenter": "chadeusmaximus", "length": "6983", "content_scrubbed": "(Warning:  Wall of text)\n\nSome advice from someone who decided not to go to film school, but instead chose to go to regular college:\n\n\"If you can't get a job working on someone else[.] projects, then create your own.\"\n\nCreating film is like starting a business from scratch every time.  You create/find a decent script, write up a business plan, get your cast and crew together, and then film it.  To do this, you need people with all kinds of talents. Obviously you need the actors, and camera crew, but you'll also need the art department, props, costumes, animal handlers, Production assistants, script supervisors, It guys, Editors.... etc....  I'm sure you get the idea.\n\nBut you can't do anything without the money.  And that[.] where a lot people get hung up, finding the money.  You need money for equipment, you need money to pay people.  You need money to pay for insurance.... etc....  I'm sure you get the idea.\n\nIn the past, if you didn't have atleast $1,000,000, then creating a film was a foolish idea.  It  just wasn't possible.  So you were forced on somebody else[.] set, for very little pay, in order to produce your art.  Sure, you could eventually work your way up, if you jumped through the appropriate hoops and kissed enough ass.  But you were still beholden to the big studios and had to do things their way.  \n\nNowadays things have changed.   Thanks to the digital revolution, you have literally saved almost a million dollars, just in film and camera equipment.  (Not kidding. factor in film cameras, cost of film reels, development costs, and editing, your average 2 hour film could run close to a million.  Source [Independent Feature Film Production](http://www. rakuten. com/prod/independent-feature-film-production/30281451. html?listingId=212199624&s_kwcid=).  (Buy the way, get this book.  It[.] awesome!)  Throw in the insanely powerful PCs we have today, and all the software tools, It[.] a different ball game than it was 10 years ago.  \n\nHowever, the toys may have changed, but the basics are still the same.  You'll still need to know your fundamentals.  basic camera work, basic editing techniques, 3 act structure, storyboarding, etc. Film school should prepare you pretty well for all that.     What it won't teach you, is how to get the money you need to take that awesome idea you have, and raise the money you need turn that idea into the next mega blockbuster.  \n\nFor that, I'd recommend studying up on entrepreneurship, and small business development.  Like I said before, making a movie is like starting a business from scratch.  Hell, in Hollywood, a movie is its own legal entity.  MOVIE STUDIO will  have several projects going at once- MOVIE 1, MOVIE2, MOVIE 3, etc.  each movie will be a separate legal entity, probably an LLC, that is owned by MOVIE STUDIO.  This way if one of their projects does really badly, they can just file bankruptcy on the MOVIE, meanwhile MOVIE STUDIO just writes it off as a loss and moves on.  \n\nOK, that was a tangent.  moving along. \n\nSo you got in to film school.  Awesome.  What[.] next?  Study your ass off.  Absorb everything your professors teach you.  Work on as many film projects as you can.  Work on student projects, work on live sets of real productions.  If possible work as an extra to get a feel of how other people do things from both sides of the camera.  Your mind should be a sponge, absorbing everything you can about your field.  \n\nAnd through it all, you should have your own project/projects that you are working on.  Because when you get that one chance, and meet the_right guy at the_right time, you want something to show for all your hard_work.  (You were networking this whole time right?)  So you just finished shooting your first short, and then they want to know what you're doing next, you should have an idea of what your next project is.  People want to be a part of other people[.] adventures.  Always have a next project.  This will allow you to grow as an artist, and will give you something to talk about when meeting people.  \"Well I  just finished a 10 minute Star Wars fan film.  Our goal on that was to learn some new VFX and editing techniques.  Now that we finished that on time and on budget, we're planning on doing a feature length independent film next.\"\n\nThrough it wall, there will be set backs.  Chances are, you'll graduate with a film degree, and nobody will care.  In today[.] economy, a film degree is looked down upon, just as a liberal_arts, or any other arts degree really.  Employers don't care about the degree, they only care if you have the skills necessary for the job.   Even in the film world.  Sure you may have a degree in film studies, but have you ever held a camera in your life?  Then good luck getting a job as a cameraman.  \n\nSo after all that, what[.] my advice?  \n\n* Think about where you want to be in five years, and start collecting the skills that will get you there.  When you do finally get an interview, you want to be able to prove that you can do the job.\n* Create a really strong portfolio.  This will prove invaluable if you are in any sort of creative field (visual arts, cinematography, writing, music, programming, video game design, etc)\n* Learn your way around a computer fairly well.  Computers are never going away, and they are becoming more important all the time.\n* Learn basic programming/scripting.  This will prove valuable on those late night editing sessions. Or when creating abasic websites, or even writing scripts for your 3d program.\n* Start networking now.  Be nice/professional to everybody you meet.  If possible get contact information.\n* Start a web-series on a subject that you find interesting.  This will give you experience writing/shooting/editing/etc.  Create a website that hosts this project (even a simple page with links to your youtube page.  This will be your first portfolio and a place to show your progress.)\n* Gather a group of friends that you are willing to grow with throughout the years.  At first you'll work together for free on shorts, but then when one of you makes it professionally, you can all get paid to do professional stuff together, because by that point, you'll have a well oiled team that works together really well.\n* Read, Read Read. Study the industry.  Read blogs. Read industry magazines. Read books.  NEVER stop learning, and NEVER stop growing as an artist, because once you do, it[.] really hard to regain your momentum.\n* Always use contracts. ALWAYS\n* Study up on Entrpreuership and small business.  Learn how to run a business, because that should be your eventual goal.\n* Chances are that you won't be able to get a job in the film industry straight out of college.  But that[.] ok.  Because you should have other skills that you can fall back on.  Get a job with a steady paycheck, so you can pay rent and other bills, and then work on your art during your off hours.  \n\nGotta run.  Have a few things more to say when I get back.  I'll try to remember.\n"}