{"doc_id": "1712", "name": "2013_11_humanities_student_major_787_columbus", "namespace": "we1sv2.0", "metapath": "", "pub": "Columbus", "title": "2013-11-humanities-student-major_787_Columbus.txt", "pub_date": "2013-11-13T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.218", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "675", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qiqu8", "Reddit_id": "cddmhqd", "Subreddit_id": "t5_2r373", "Commenter": "k41y17", "length": "4692", "content_scrubbed": "From left to right the buildings in the photo are: \n\n* [Townshend Hall](https://ksamedia. osu. edu/sites/default/files/originals/1902_townsend_hall_x2333_e_front_elev. jpg)- built in 1898 and named to honor Dr. Norton S. Townshend, one of seven founding faculty of OSU. He also was one of the first Board of Trustees members, a position he resigned to become the University[.] first professor of agriculture. It is built at an odd angle for a reason: The Rail-Light Company was considering extending its streetcar line through campus on Neil Avenue to serve the former Olentangy Amusement Park (now Olentangy Village). The University[.] Board of Trustees was not so keen on this plan and decided to block it—literally. This explains why Neil Avenue, though continuous, is not straight behind the Thompson Library. Townshend still stands today, and now houses offices for International Studies, Sociology, and Arts & Sciences. \n\n* University Hall- [Originally](http://library. osu. edu/blogs/archives/files/2011/09/1874_university_hall. jpg) built in 1874. The bricks used in the building were made in kilns north of the building from clay dug south of Woodruff Avenue in the general vicinity of the present Chemical Engineering Building. At first there were four professors living in the building, and the east end of the first floor was a student dormitory, called \"Purgatory.\" There was a \"commons\" or dining room in the east end of the basement. The library of the College was housed in University Hall until it moved to Orton Hall in 1893, and the Administrative offices were in University Hall until the present Administration Building (AKA Bricker Hall) was completed in 1924. In the spring of 1968 a bulging floor on the fourth floor of the north wing led to a study by a firm of professional engineers. Their report stated that there was \"sufficient doubt on the structural integrity of the north wing to consider it unsafe. \" The north wing was immediately abandoned, and on May 9, 1968 the Board of Trustees instructed the administrative officials of the University \"to move toward the abandonment of the entire University Hall facility.\" It was demolished in 1971. A [new](http://wosu. org/2012/news/files/university_hall-592x374. jpg) University Hall was constructed in 1976 and is a near replica of the original. It occupies the same site, and it incorporates from the old building a portion of the old stonewalls and arch at the front entrance and the tower clock. Currently the building is home to classrooms, a memorabilia museum, and offices for many various departments and colleges. \n\n* [Brown Hall] (https://ksamedia. osu. edu/sites/default/files/styles/primary/public/originals/04_0001757_0. jpeg?itok=eIMq_Cxm)- Built in 1903 as an Engineering Building. At some point, it housed Architecture, but this college was moved out in 2004 upon completion of Knowlton Hall. Brown was vacated in 2008 and sadly, demolished in 2009. \n\n* [Hayes Hall] (https://ksamedia. osu. edu/sites/default/files/originals/05_0003426_0. jpeg)- Built in 1892 as the Manual Training Building or School of Industrial Art, it is now the oldest building remaining on campus. Hayes Hall was named for Rutherford B. Hayes, President of the U_S, three-time governor of Ohio, and OSU Board of Trustees member. Hayes was governor when the state accepted the federal Morrill Act, which eventually established OSU. Hayes was a strong advocate for teaching mechanical education and to honor him the building began as the home of industrial arts on campus. It even had a [foundry] (http://library. osu. edu/buckeye-stroll/uploads/images/1900_foundry. jpg) on the lower floor. \n\n* [The Armory] (https://ksamedia. osu. edu/sites/default/files/originals/05_0003035_0. jpeg) Built in 1898 as a multipurpose facility for military science, and men[.] and women[.] physical education. A fire in June 1958 caused significant enough [damage] (https://ksamedia. osu. edu/sites/default/files/originals/05_0003048_0. jpeg) that the Armory was torn down in 1959. The Wexner Center for the Arts was built on the site 30 years later. As an homage to the original building, the Wexner Center incorporated a turret that resembled the Armory[.].\n\n\nSince Brown Hall was constructed in 1903 , and Derby Hall being built in 1906- since it is not in the photo (it would be between Brown and Hayes), I'd estimate this photo is from between 1903-1906.  \n\nIf you like this kind of stuff I suggest checking out the [John H. Herrick Archives] (http://herrick. knowlton. ohio-state. edu/) of OSU buildings, the [KSA Digital Library] (https://ksamedia. osu. edu/), which has photos, or going on a [Buckeye Stroll] (http://library. osu. edu/buckeye-stroll/).  "}