{"doc_id": "1646", "name": "2013_11_humanities_student_major_214_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2013-11-humanities-student-major_214_AskReddit.txt", "pub_date": "2013-11-04T00:00:00Z", "Sentiment": "0.129", "Subjectivity": "0.34", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "641", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd641uv", "Reddit_id": "cd6dxtq", "Subreddit_id": "t5_2qh1i", "Commenter": "[deleted]", "length": "3766", "content_scrubbed": "I'm going to write you an essay: mostly for other people[.] knowledge, but basically because I want to clear up things about my state, and for myself a little too.\n\nTexas is kind of an oddity. It IS politically conservative (as am I), but there is no shortage of Liberals here in the state. In the US, liberal politics tends to be more prominent in Urban Areas. Texas is home to 6 of the 20 largest cities in the US, and 3 (almost 4) of the largest 10. It doesn't really fit in anywhere. It[.] kind of its own thing. Even the social culture is kind of its own thing, according the Times: http://science. time. com/2013/10/22/the-united-states-of-attitude-an-interactive-guide-to-americas-moods/\n\nIt is often lumped in with the American South. Make no mistake, there are aspects of Southern Culture visible in Texas. It is also what we're officially taught in School: that Texas is part of the South. I think this is mostly because of the Civil War.\n\nOften time, however, we also see Texas being described as part of the Western US (i. e. Arizona, California, Utah). This we can attribute to many films, basing themselves in the American Southwest. We see that many other large sources (such as the NBA and the Liberal Arts College rankings in USA Today) categorize Texas as part of the western US.\n\nTexas has a wide range of influences, more than most other American States. Six Flags is from Texas, and the name originates in the past nations that have held claim to Texan territory. Six total: Spain, France, Mexico, Texas (being an independent country for about 10 years), the confederacy, and the US. This does not include large amounts of immigrants which shapped the culture of the state: notably the Cajuns in next door Louisiana, Germans (there is a sort-of anarchic dialect of German still spoken around San Antonio), Vietnamese (along the gulf coast), and Czech (like in West, Texas).\n\nIts one of the only states that is minority-majority (one of 5) -- which is odd because minorities tend to vote more liberally. Most of the \"minority\" consists of Americans of Mexican decent. A large portion however (about 10%) is also African American. \nLarge metropolitan areas in the state, most notably Dallas-Fort Worth and Greater Houston are large primary destinations for immigrants for anywhere in the world. \nFor example:\nDallas-Fort Worth Metropolitan area hosts the 2nd largest population of Laotians in the US by volume, 4th largest population of Burmese in the US, 4th for Vietnamese (Houston beats out Dallas to 3rd by a significant margin), and 4th for Indians (Houston coming in at 6th -- Pakistani community also is very strong), 1st for Tongan.\n\nBoth metropolitan areas have very vibrant immigrant communities from China and Korean. A lot of investors and people in general I've met as surprised by the large Asian population in the state (in term of Sheer volume, Texas comes at 3).\n\nIt[.] not just Asians. The state is also home to the largest Nigerian community in the country. Approximately 1,700 people out of ever 100,000 are Muslim in the state (in a state with a population about 25 million) -- numbering 5th in terms of percentage, not volume (i. e. the number of Muslims exactly).\n\nWhat I'm trying to drive home is is that the Media like to portray Texas as a very backward place: home to many crazy Christian conservatives. Home to dessert and cows.\nTo be fair, yes they are there, but even most Conservatives aren't crazy. Only west Texas is really dessert, the east is Forrest and swamp.\n\nIt[.] really an odd ball state. I don't like lumping it in with other sub-regions cause it[.] kind of its own thing. See \"The U_S of Texas\" Time article -- it[.] odd economically as well.\n\nI can provide sources for all this information upon request."}