{"doc_id": "1703", "name": "2013_11_humanities_student_major_689_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2013-11-humanities-student-major_689_AskHistorians.txt", "pub_date": "2013-11-12T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.33", "Score": "43", "Upvotes": "43", "Downvotes": "0", "Wordcount": "408", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qfzkg", "Reddit_id": "cdck5k9", "Subreddit_id": "t5_2ssp3", "Commenter": "waughj3", "length": "2444", "content_scrubbed": "Well you would probably be college educated and majored in some kind of Liberal Arts. \n\n\"There was then a selection which, though it may seem monstrous, was quite logical: mathematics and science students were assigned to factories and research centers while law and liberal_arts students were immediately placed in flight schools for training as suicide pilots.\" -Millot, Bernard. Divine Thunder; the life and death of the kamikazes. pg 195\n\nA lot of these pilots where very educated and spoken and read in multiple languages.\n\n\nThe Japanese did not resort to using the tactic of 'Kamikaze' until the war had essentially been lost. Training varied from person to person. This excerpt from a letter from someone who worked at a Kamikaze training facility to his son.\n\n\"At the hall where their farewell parties were held, the young student officers drank cold sake the night before their flight. Some gulped the sake in one swallow; others gulping down (a large amount). The whole place turned to mayhem. Some broke hanging light bulbs with their swords. Some lifted chairs to break the windows and tore white tablecloths. A mixture of military songs and curses filled the air. While some shouted in rage, others cried aloud. It was their last night of life. They thought of their parents, their faces and images, lovers' faces and their smiles, a sad farewell to their fiancees- all went through their minds like a running horse lantern...Although they were supposedly ready to sacrifice their precious youth the next morning for imperial Japan and for the emperor, they were torn beyond what words can express- some putting their heads on the table, some writing their wills, some folding their hands in meditation, some leaving the hall, and some dancing in a frenzy while breaking flower vases. They all took off wearing the rising sun head band the next morning. But this scene of utter desperation has hardly been reported. I observed it with my own eyes, as I took care of their daily life, which consisted of incredibly strenuous training, coupled with cruel and torturous corporal punishment as a daily routine.\" -Tierney, Emiko. Kamikaze diaries: reflections of Japanese student soldiers pg 10-11\n\nI am afraid that some of the responses have been a little off in their accuracy about the normal background information on Kamikazes. If you would like me to go more in depth, provide more sources, have any question feel free to ask away.\n"}