{"doc_id": "1634", "name": "2013_11_humanities_student_major_103_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2013-11-humanities-student-major_103_AskReddit.txt", "pub_date": "2013-11-02T00:00:00Z", "Sentiment": "0.05", "Subjectivity": "0.4", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "529", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd4zjdo", "Reddit_id": "cd4zyxo", "Subreddit_id": "t5_2qh1i", "Commenter": "question_sunshine", "length": "3058", "content_scrubbed": "At what age are you expecting people to just know what they want to do with their entire lives to build entire curricula around? If you say college aged, I wholly agree that the 4-year college system is filled with unnecessary fluff. But if you're going to start divvying kids up in high school when the basics are learned in such a way that you can first truly comprehend them, you're talking about an age when most kids are too young both to know what they want to do and what they'll be good at. Some school districts do send kids to math/liberal_arts/fine arts/technical/vocational high schools that organize kids by skills, but they still don't omit the basics in science, math, history, literature, and civics because we as adults use that stuff later on to form a basic understanding of the world we live in. \n\nThis basic understanding can lead to the urge to explore topics on one[.] own and the development of passion in a topic that may not be the person[.] strongest suite. If you're never introduced to it on a rudimentary level how can you know that it[.] not for you? The idea of closing off a person[.] mind to whole fields of study simply because they have yet to exhibit skills in that area impedes progress. If you look at human history science, math, & medicine stem from philosophy, which itself stems from religious & political history, which is the major focus of most of the art & literature movements. All these subjects play into each other in a way that requires some understanding of each. \n\nI'm guessing that you're still in high school and they're teaching you history by forcing you to memorize names, dates, and places instead of stories, movements, and eras. They're teaching you science by making you watch the teacher do tried and true experiments that are in no fucking way dangerous but we can't trust teenagers to do themselves. They're teaching you math by making you show your work on a piece of paper and you better do all the steps or you'll fail the test even if you're  genius and you figure out a better way to do it that would blow the mind of a college professor, but your 10th grade teacher isn't fucking smart enough to understand math that doesn't follow the textbook, it doesn't matter how many proofs you offer her. They're teaching you literature by making you read heavily edited crap, thanks to all the \"oh it[.] to graphic/sexual/violent\" whines from all the idiot mothers out there, omitting both the author[.] and the story[.] historical/religious/political context and thus any real fucking lesson you would get from it, instead trying to get you focused on why the author named the characters and places what they did because there is totally hidden symbolism in every work of literature, except really all the hidden symbolism has been stripped out by the editors. \n\nThe problem isn't that kids are learning the basics, the problem is the shitty uncreative, no-nonsense way the American public school system goes about teaching kids the basics leads the students to no longer care. \n\n\n\n\n\n\n\n\n\n\n"}