{"doc_id": "1683", "name": "2013_11_humanities_student_major_539_china", "namespace": "we1sv2.0", "metapath": "", "pub": "China", "title": "2013-11-humanities-student-major_539_China.txt", "pub_date": "2013-11-09T00:00:00Z", "Sentiment": "0.015", "Subjectivity": "0.448", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "323", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cda9cs9", "Reddit_id": "cdaclyk", "Subreddit_id": "t5_2qh2v", "Commenter": "Hautamaki", "length": "1973", "content_scrubbed": "Alright:\n\nStrengths of China[.] system: The central government has the power to focus on and overcome nearly any individual problem, whether that be stimulating economic growth, going more environmental, or quashing dissent.\n\nWeaknesses of China[.] system: The inherent lack of individual choice and transparency, the inherent corruption, the necessary stultifying of education in the humanities, and other resultant problems are precisely what creates the majority of these problems in the first place.  Furthermore local governments are so corrupt as a result of authoritarianism that only the central government can effectively get shit done, but the central government can only effectively deal with 1 problem at a time so it[.] a constant struggle to balance these diverse and competing needs and all it will take is 1 or 2 major consecutive fuckups and the whole thing collapses because unlike a democracy there is no system built in for the people to peacefully replace their leadership or even vent their frustrations and agitate for change.\n\nDoes all that mean China SHOULD be a democracy tomorrow?  No, I don't think so because as we all know one of the primary weaknesses of democracy is that it requires an educated and responsible electorate and China is simply just not there yet.  Forcing democracy on a society that is not ready for it has been tried to death in the last decade and it has universally been an embarrassing and costly failure.  China learned its lesson from the Russian experience.  Russia suddenly turned democratic and now their country is a shithole, at this point good mostly for funny youtube videos and incredibly hot and desperate young women.  I wouldn't want the same for China so I hope they continue to develop economically and educationally before reforming politically, which, if you are optimistic, appears to be the road they are on.  It[.] a very difficult needle to thread but so far they are pulling it off, so fingers crossed."}