{"doc_id": "1832", "name": "2013_11_humanities_student_major_1822_christianity", "namespace": "we1sv2.0", "metapath": "", "pub": "Christianity", "title": "2013-11-humanities-student-major_1822_Christianity.txt", "pub_date": "2013-11-30T00:00:00Z", "Sentiment": "0.111", "Subjectivity": "0.414", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "254", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rrz2n", "Reddit_id": "cdqa5j9", "Subreddit_id": "t5_2qh6c", "Commenter": "whats_the_differance", "length": "1631", "content_scrubbed": "I think that the most important way to increase understanding between atheists and believers is simply for people to get to know each other (f2f if at all possible).\n\nI'm a Christian, and I'm currently in a humanities PhD program in the Northeast US. Largely because of my geographic and academic locations, the majority of my friends and acquaintances fall into the atheist/agnostic camp. However, I've been able to have some really productive and respectful conversations with friends about our respective experiences and (non-)beliefs; I think that those conversations were able to happen precisely because we had already grown comfortable with one another through other social interactions. \n\nI have some friends and family who are religious but either don't know any atheists or only kinda-sorta know one guy or gal in the neighborhood or at their workplace who has a snarky bumper sticker and quotes Richard Dawkins. As a result, they're much more likely to sort all atheists into one stereotyped box (I imagine that the same probably goes for atheists who aren't close with any religious folks). \n\nThe same goes, in my experience, for inter-religious understanding. Having good friends who are Muslim has mercifully kept me from the deeply suspicious attitude that some Christians hold towards followers of Islam. \n\nOf course, the question remains: how does one foster these relationships—especially when Americans are more and more inclined to hunker down in ideological echo-chambers? The situation is further complicated by the fact that ideological divides increasingly seem to be becoming geographical divides as well. "}