{"doc_id": "1759", "name": "2013_11_humanities_student_major_1272_lawschool", "namespace": "we1sv2.0", "metapath": "", "pub": "LawSchool", "title": "2013-11-humanities-student-major_1272_LawSchool.txt", "pub_date": "2013-11-20T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.25", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "298", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r3atf", "Reddit_id": "cdj8rmi", "Subreddit_id": "t5_2rb9g", "Commenter": "[deleted]", "length": "1675", "content_scrubbed": "It[.] definitely a culture shock for us who (1) went to large private and public universities and (2) got heavily involved. I still can't get over how if I don't immediately connect with someone, guy or gal, I still have to see them *every* day. Completely opposite experience to 'hm, well, if I want to I can easily never see you or hear you again in my lifetime.' That mentality, which carried me out of middle school and into grad school, cuts down on the gossip *a lot*. So I think part of the answer is that you really can't change 'gossip.' Some environments just are naturally conducive. \n\nFor those who come from smaller liberal_artsy-type schools I hear the transition isn't rough or even noticeable. A sort of 'what are you talking about, this is barely gossip?' Personally, it makes me believe that there[.] really nothing particularly gossipy about law school. It[.] just that there[.] a ton of grads who are coming from a background where, for the first time in our lives, we're surprised that we don't a solid chance of casually eliminating people from our lives. You have to grow a thicker skin. \n\nFor a third point I'd just suggest cutting down on the one night stands or, at the very least, making sure they're with people not in the law school. If you're around Boston, aim for one of the other million grad students. If you're at Seattle, check out your nearest bookstore/bar. If you're at USC, check out those undergraduates and for those in Atlanta have fun with the med/public health grads. \n\nSo, yep... Those are my thoughts. You can't change it, you should grow a thicker skin and if nothing else try not to rub genitals with too many of your classmates. "}