{"doc_id": "1626", "name": "2013_11_humanities_student_major_41_cfb", "namespace": "we1sv2.0", "metapath": "", "pub": "CFB", "title": "2013-11-humanities-student-major_41_CFB.txt", "pub_date": "2013-11-01T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.379", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "298", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd4ej55", "Reddit_id": "cd4g4t0", "Subreddit_id": "t5_2qm9d", "Commenter": "geo-grapher", "length": "1702", "content_scrubbed": "Your understanding is a common one. It[.] hard to see \"behind the curtain\" of academia and there are a lot of folks who don't want that to happen. The colleges, schools, and departments want to have their students succeed both in the university and out. They take a gamble on every student they admit to ensure that. There is no formula that works perfectly here. Because there is no formula and because we've created a society obsessed with statistics, the metrics which are easily translated to that realm are put forward by groups who gain from them. US News doesn't want it to be widely known that their rankings are meaningless, Kaplan, College Board, ETS, and the rest don't want it known that their tests are better for formulaic knowledge than critical thinking. You often see that there are students who do everything they are \"supposed to\" in high school but don't get accepted most places while students who barely make it through the secondary ed system get accepted everywhere. There is no telling who succeeds in academia and who realizes it[.] not for them or that they are in the wrong major.\n\nI have students who failed basic biology who are among the strongest in any of my classes. I also have students who do okay, but not great, in my classes before realizing that they are better off in a geosciences department or a humanities department. There shouldn't be a hierarchy of learning. Society works best when there are people who are knowledgeable in a multitude of subjects. My opinion, as a part of that system, is we need to stop pushing students to choose some majors over others for financial reasons, stop pushing kids out of school early and let them explore what[.] out there."}