{"doc_id": "1649", "name": "2013_11_humanities_student_major_226_lostgeneration", "namespace": "we1sv2.0", "metapath": "", "pub": "lostgeneration", "title": "2013-11-humanities-student-major_226_lostgeneration.txt", "pub_date": "2013-11-04T00:00:00Z", "Sentiment": "0.215", "Subjectivity": "0.519", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "313", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pughj", "Reddit_id": "cd6l6ef", "Subreddit_id": "t5_2r40j", "Commenter": "commentguy123", "length": "1907", "content_scrubbed": "The relationship between PhDs and the modern university is utterly fascinating. Universities are overproducing PhDs, post-docs are common despite impressive publishing records, and there[.] no sign of admissions slowing down (the pyramid mustn't collapse). Instead of creating more tenured chairs, the drive is toward celebrity professors and adjunct instructors (or just let the PhD students teach the undergrad courses, uni still gets paid, so whatever). The system selects for true believers; those lucky enough to gain tenure aren't the type of people who would agitate for change (in fact, they likely benefited from the crooked power structure). Expect more of the same.\n\nIt[.] an incredibly corrupt institution built on shocking opportunity cost (otherwise the attrition rate would be a lot higher) and a perverse incentive structure, but that should come as no surprise to those here that are still nursing their astronomical student debt.\n\nI'm on the tail end of mine and my most valuable takeaway is a warchest of horror stories. I have no desire to pursue an academic career given the current impossible climate, which is a shame given that the bulk of my training has been grinding on preparing manuscripts acceptable for publication. This training (i. e., academic hazing) primarily corresponds to an in-depth knowledge of the literature, but most of it is garbage in several respects, so it[.] not as though the program has imbued me with any useful skills or practical knowledge. In fact, that sort of thing is kind of discouraged (see: academia is a cult).\n\nFortunately STEM here, so I'm not as deep in it as the humanities folks, but I feel absolutely foolish for sticking around instead of walking away with an MS and getting a normal job where I'd be classified as an employee under labor law. But hey, I'll be able to demand that people call me \"doctor\", so that counts for something, right?"}