{"doc_id": "1831", "name": "2013_11_humanities_student_major_1819_games", "namespace": "we1sv2.0", "metapath": "", "pub": "Games", "title": "2013-11-humanities-student-major_1819_Games.txt", "pub_date": "2013-11-30T00:00:00Z", "Sentiment": "0.17", "Subjectivity": "0.493", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "271", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rrx29", "Reddit_id": "cdq8u6l", "Subreddit_id": "t5_2qhwp", "Commenter": "TheVGamer", "length": "1533", "content_scrubbed": "I've been playing **Legend of Zelda: Twilight Princess**, my first Zelda game. Three hours in. I've been a PC gamer for all my life so I never played the classic console exclusives. Only know has emulation of PS2/Gamecube/Wii become possible for me so I'm diving into the piles and piles of games I've missed over the years. \n\nI have no idea why I chose Twilight Princess first, I guess it looks gorgeous and because I'm holding off on playing Wind Waker because Assassin[.] Creed IV just got released. At 1080p, the artstyle shines through the technical limitations the game obviously has. \n\nGameplay wise, I don't find it very special. This is of course from the perspective of seeing games that came after it inspired by Zelda so I can't really appreciate it as much. The camera controls are janky, the targeting system is awful, the combat is simplistic while being satisfying at the same time. But from what I gather, great gameplay isn't exactly why people like Zelda. It[.] the atmosphere and exploration that[.] great and I found both of those to be so very great just in the first three hours. Roaming around the starting village was such a cool experience because while they don't exactly explain what you should do, the game is built so everything is intuitive. No quest markers here, just great level and game design. \n\nI'm gonna keep playing it and I'm going to keep enjoying it and then I'll play another great game I missed. As for the N64 Zeldas, I'll just buy a 3DS for that as a remake of Majora[.] Mask seems likely. \n"}