{"doc_id": "1672", "name": "2013_11_humanities_student_major_410_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2013-11-humanities-student-major_410_TwoXChromosomes.txt", "pub_date": "2013-11-07T00:00:00Z", "Sentiment": "0.035", "Subjectivity": "0.346", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "487", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd8rdfd", "Reddit_id": "cd917m5", "Subreddit_id": "t5_2r2jt", "Commenter": "panhumanist", "length": "2878", "content_scrubbed": "Did she ever mention what she studied? What schools she attended? I can't find any specifics on her blog. Something tells me she[.] not a STEM major, because they usually have no trouble finding employment in and out of academia--she'd still probably make more as a stripper however. I'm just going to assume she[.] coming from a humanities background.\n\nThe people struggling did some or all of the following: got humanities degrees with little earning potential, went to overpriced private colleges, took private loans, hid at university after getting their BA instead of working. A lot of them assumed they'd just stay in academia without realizing that wages are depressed for these jobs *because there[.] an oversupply of academics to fill them*. There really isn't the research/business component in the humanities like there is for STEM, so the private sector doesn't pick up any of the slack either.\n\nYour assessment of a string of ill thought out decisions is very accurate. She shouldn't have chosen the humanities if she (or her family) wasn't already well off enough to support herself; or without having a solid plan to find employment. Some vague notion about looking for work at a university after you've got your doctorate isn't a solid plan. Only in the last few decades has the humanities changed to be something other than the domain of idle, rich, intellectuals. We've given poor and middle class people access to the education through loans, but the earning power of that education hasn't magically improved. So they're stuck trying to pay for something which isn't going to return much value. She also could have gone to a more affordable state school, and/or done her lower division work at a community college. She could have stopped at a BA. Adding graduate work to a humanities degree doesn't increase your earning potential very much, but it does increase your financial burdens both in loans and opportunity costs.\n\nAnd I'm not attacking the humanities as worthless. They're very important, very worthwhile to study and I'm happy that our society has these fields well covered. Unfortunately, they're not a net positive return on their investment, so they should be left to people who are already financially secure and don't need to work. The absolute elite of those people actually will be able to make money doing it, but by definition most people aren't going to be in that category. Being really knowledgeable and proficient at a hobby doesn't entitle you to be paid for it, even if some people can pull that off. Studying these things is a hobby, and hobbies generally *cost* money, they don't make it.\n\nIt[.] sad that she[.] stuck in the situation she[.] in, but it[.] more to do with bad planning, and refusing to turn back after it was clear she made a mistake. Instead, she doubled down and tried to force something that wasn't ever going to work. "}