{"doc_id": "1631", "name": "2013_11_humanities_student_major_71_foodforthought", "namespace": "we1sv2.0", "metapath": "", "pub": "Foodforthought", "title": "2013-11-humanities-student-major_71_Foodforthought.txt", "pub_date": "2013-11-01T00:00:00Z", "Sentiment": "0.132", "Subjectivity": "0.263", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "275", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pmeyr", "Reddit_id": "cd4t5bp", "Subreddit_id": "t5_2rete", "Commenter": "Stanislawiii", "length": "1517", "content_scrubbed": "One thing that the authors don't really bring up, but sticks out in my mind as a partial cause for the decline in humanities_major is the degree to which you can teach yourself these things.  \n\nI am sort of a history nerd.  Especially middle ages.  I studied Biology in school, but never took more than the required history stuff.  What I have been doing is reading about it -- books about the history of the middle ages, whatever I can get.  And there are websites as well (though you have to be somewhat careful about which websites) -- and you can get a fairly good grasp of what it was like to live during those times.  My father does the same thing with the Civil War -- read lots of good books about the civil war, and you can get a good grasp of the era.  \n\nI'm also trying Russian in the same way.  A bit slow on declension as my only other real language experience is in Spanish which doesn't decline nouns, but even then, I think you could probably teach yourself most languages with basic texts, a few recordings for accents and listening practice, and a bunch of willing speakers/readers willing to correct your attempts to speak/write in the language of your choice.  \n\nThat[.] the thing with humanities that isn't true of physics or other stem subject (excepting maybe math) -- you cannot really self teach in STEM because you need lab time, you need to do those experiments and dissect the frogs and mix up the chemicals -- those skills are just as important as reading the book and understanding it.  "}