{"doc_id": "1643", "name": "2013_11_humanities_student_major_189_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2013-11-humanities-student-major_189_funny.txt", "pub_date": "2013-11-03T00:00:00Z", "Sentiment": "0.066", "Subjectivity": "0.334", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "313", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd5uy0n", "Reddit_id": "cd5wihe", "Subreddit_id": "t5_2qh33", "Commenter": "Today_Is_Future_Past", "length": "1922", "content_scrubbed": "I can't speak for the previous poster, these are not my personal beliefs, but merely attempting to provide potential counter points.  \n\nSome people don't care about this topic because if you're already left_leaning you've had this shoved down your throat every where you look for the past 5-20 years.\n\nFor many people, the more forceful/\"in your face\" someone is with their beliefs, even if you agree with their view, the more you become uninterested in helping the issue, and look at it as distasteful to dedicate so much in the way of activist resources to these causes.\n\nThe topic of feminism/sexuality/gender rights has been in the spotlight for a long time, and could be argued to be fighting for a sensationalist topic at the expense of many other issues which could be argued to impact a higher volume of people in more significant ways (over crowded for profit prison systems, corrupted judicial/electoral/economic systems, unlawful wars, impending environmental destruction).  \n\nNot only are the resources of a finite activist lobby being tapped by this topic, but academic resources are flooded with these topics.  For the last two decades feminist and queer_theory have dominated a large majority of the humanities in terms of publications and research grants, as the previous articles demonstrate.  That was all effort that could have been put towards something else.\n\nThere then becomes the issue of \"why do so many people seem to be interested in this issue and not issues that impact larger populations more severally?\"  This is where the topic of sensationalism comes into play.  I've already poked at a dozen hot spots by playing devils advocate, so I'll leave that topic for someone else.\n\nTL;DR:  The methods of the movement, attention given and greater personal desire for other areas of change can drastically reduce the interest in this topic even amongst people that recognize it[.] moral imperative."}