{"doc_id": "1767", "name": "2013_11_humanities_student_major_1341_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2013-11-humanities-student-major_1341_AskReddit.txt", "pub_date": "2013-11-21T00:00:00Z", "Sentiment": "0.011", "Subjectivity": "0.316", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "264", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdjzz0f", "Reddit_id": "cdk3oj4", "Subreddit_id": "t5_2qh1i", "Commenter": "The_Original_Gronkie", "length": "1494", "content_scrubbed": "A lot of times people end up with these useless degrees because their parents wanted them to go to college and the kid never really decided on what they wanted to do as a career, so they go in undecided and then pick their major based on the teacher they liked, the curriculum that seemed easy or didn't interfere with their partying, or didn't have early classes, so they end up with communications or psychology or humanities or business administration or something else just as useless. \n\nI'm a strong advocate of working while your in college, but not \"flipping burgers\" or something so worthless to your career. Find something that has at least some connection to what you want to do and get a part-time job doing it. Creative writing? Get a job in a bookstore. Accounting? Be the part-time custodian at a a small CPA firm. Pre-law? Same thing, empty trash cans. Etc., etc.. You'll make connections, you'll learn the lingo, you'll have some substantial lines on your resume. Later, when you go for an actual job, the interviewer will see all those other entry level graduates with fast food experience, or nothing at all, and then he'll see yours, working part-time at that firm across town where his buddy works. At that moment your resume moves to the top of the pack, even if all you did was mop the bathroom floors and vacuum the rugs.\n\nYou'll party less, sure, but when you have a job in your degree and friends are whining about making minimum fast food wages, you'll thank yourself."}