{"doc_id": "1814", "name": "2013_11_humanities_student_major_1704_martialarts", "namespace": "we1sv2.0", "metapath": "", "pub": "martialarts", "title": "2013-11-humanities-student-major_1704_martialarts.txt", "pub_date": "2013-11-27T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.26", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "481", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rlzyz", "Reddit_id": "cdoks40", "Subreddit_id": "t5_2qkt4", "Commenter": "Kurimu", "length": "2890", "content_scrubbed": "It really depends on what you are looking for.  E. g., your version of \"twirling\" may not be exactly what I may think of it in terms of use in a sword, but that is based off my own training around the Japanese katana.\n\nAs well, just because it works on other untrained persons does not necessarily mean it is a good technique.  Especially considering the art of sword fighting you would, in general, have a style based around fighting others with another weapon.\n\nThe four I can think of off the top of my head:\n\n[Kendo](http://en. wikipedia. org/wiki/Kendo): Kendo is a sport based martial art based around the use of a Shinai (bamboo sword) and protective gear (bogu), and based on a point system of hits during a match between two Kendo practitioners.\n\nI have never done Kendo, but from those that practice it do really seem to enjoy it.  If you have any questions, go over to /r/Kendo.\n\n~\n\n[Iaido](http://en. wikipedia. org/wiki/Iaido):  I am practitioner of Iaido, and I find it highly fun.  However, it is a very, very, very strict martial art in terms of details to everything you do.  The structure of teaching is very strict, and so is the testing between the ranks.  It is likened to \"moving zen\" due to slow movements, dedicated cuts, and old saying of that every person practicing Iaido is facing himself when he cuts.\n\nIaido is fun, but you have to be really into it to enjoy it.  Like I mentioned earlier, everything is very detailed on what you do.  This includes how you wear your hakama, how you sit with your hakama, how you draw your sword, how you cut with your sword, how you chiburi your sword, how you put away your sword, how your sageo on your sword is tied to your hakama, how your sageo around your sleeves is tied, how you walk after making a cut, etc. etc.\n\nFor any questions, go to /r/Iaido.\n\n~\n\n[Aikido](http://en. wikipedia. org/wiki/Aikido#Weapons):  Aikido is a martial art founded by O'Sensei, and again another martial art that I practiced.  It is not solely weapons based, as the majority of the martial art is empty-hand based, but we do practice fairly regulary, and is required on our testing, in the use of bokken (wooden sword), jo (staff), and tanto (knife).\n\nFor any questions go to /r/Aikido.\n\n~\n\n[HEMA](http://en. wikipedia. org/wiki/Historical_European_martial_arts#Development_of_the_modern_HEMA_community) (Historical European Martial Arts): There is currently a resurgence in the use of weapons fighting and general martial arts borne in the \"West\" of Europe.  The vast majority of martial arts you see now-a-days at local schools are of Eastern origin, there are those that wish to train the arts crafted from European origin.  I don't know much about this, but there was a post here in /r/martialarts a few weeks back with more info in it.\n\nIf you're in the U_S, go to: [HEMA Alliance Website](http://hemaalliance. com/?page_id=233) for more info."}