{"doc_id": "1727", "name": "2013_11_humanities_student_major_1045_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2013-11-humanities-student-major_1045_canada.txt", "pub_date": "2013-11-17T00:00:00Z", "Sentiment": "0.091", "Subjectivity": "0.389", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "279", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdgeh6p", "Reddit_id": "cdgfpyb", "Subreddit_id": "t5_2qh68", "Commenter": "mtled", "length": "1671", "content_scrubbed": "\"Pushed\" is a relative term. I'm not sure what Kenney is envisioning, but from a general perspective we do need to shift away from over-valuing a university degree, remove the stigma attached to cegep technical and college certifications and help people get training in fields that will allow them to work, pay taxes and contribute to society (instead of stuck in unemployment). There is a definite disconnect between student expectations as they approach post secondary education and what the world has to offer in terms of jobs; let[.] face it, the vast majority of BA History grads won't ever work in a field even remotely tied to what they studied, but for a lot if kids, they seem to think they will be the exception to that and are sorely disappointed when it doesn't work out. \"Study what you love\" doesn't really work from an economic perspective. I know several students struggling through engineering who would be much more successful as machinists, AMTs, mechanics, etc but mommy and daddy expect a university degree.\n\nI don't really have a one-size-fits all solution to all this, but removing the stigma from skilled labor, giving realistic information about job prospects following various degrees - especially liberal_arts ones - and encouraging funding for programs that can get people the skilled training they need are certainly steps in the_right direction. \n\nI live in Quebec and I think it[.] a damn shame that we don't give more value to the cegep technical diplomas. I think we have the beginnings of a fantastic educational structure, but it isn't being used properly. Finding a way to strengthen those qualifications is hard, but I think necessary."}