{"doc_id": "1625", "name": "2013_11_humanities_student_major_36_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2013-11-humanities-student-major_36_news.txt", "pub_date": "2013-11-01T00:00:00Z", "Sentiment": "0.211", "Subjectivity": "0.382", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "303", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pm1wh", "Reddit_id": "cd4dum7", "Subreddit_id": "t5_2qh3l", "Commenter": "barumbumbum", "length": "1874", "content_scrubbed": "This is a great way to regulate a population. This whole emphasis on STEM is about creating a generation of students who believe the \"science and technology will save us\" and \"objectivity and rationality are the only reasonable ways to see the world\" memes. But this is how America has in many ways always been- create problems and then seek out the solution to problems through the same mechanisms that created them (cf fiscal policy of the last few decades). I'm not all-out-anti-STEM by any means (I'm typing on a computer after all), but in the big picture this is about creating an **economically productive and politically docile citizenry**. What better way to massage the masses into such docility? And it[.] easy. You don't even have to be overly anti-humanities; just reeaaalllllyyy for STEM. Eventually no one looks to the humanities, and you can say, \"See, students just aren't interested in this stuff anymore. Better cut funding and support STEM so we can save 'our future' 'together' 'by our bootstraps'.\" It[.] not that what people don't know won't hurt them, it[.] that people won't know when they're being hurt; but they'll feel it and have no way to express it or make sense of it outside of the math/science/positivist lens they've been taught to see the world through. When we keep fighting wars for the same reasons, creating enemies to justify research and development of defense technologies (for example), we just won't be able to understand why these things keep happening... so we'll keep producing, extracting tech-building materials from Africa and exploiting cheap labor in SE Asia through \"proven\" neocolonial practices (\"hey, we know what works; we're scientists.\")\n\n**TL;DR** Producing a generation of STEM-only-minded and profit-driven young people is about maintaining extant systems of power, not so much improving lives or life situations. "}