{"doc_id": "1757", "name": "2013_11_humanities_student_major_1258_lostgeneration", "namespace": "we1sv2.0", "metapath": "", "pub": "lostgeneration", "title": "2013-11-humanities-student-major_1258_lostgeneration.txt", "pub_date": "2013-11-20T00:00:00Z", "Sentiment": "-0.03", "Subjectivity": "0.368", "Score": "23", "Upvotes": "23", "Downvotes": "0", "Wordcount": "309", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdiy7e4", "Reddit_id": "cdj4ua7", "Subreddit_id": "t5_2r40j", "Commenter": "[deleted]", "length": "1663", "content_scrubbed": " Today things are tough, I give you that, but the jobs are out there if you go and look. Oh, I'm sorry you majored in the humanities or spent four years on post-Marxist Latin American studies and feminist critique of Russian formalism. Guess what? If you don't study something useful, why would someone hire you? If you don't roll up your sleeves and network instead of playing Playstation all day, why would someone hire you?\n\nBut, see, that[.] the crux of your argument right there, where it falls apart. When you graduated back in the 70s, you didn't *have* to go into a bunch of debt to get a degree that was \"useful\" for somebody to take you seriously. You could do that with a high school diploma or less. That[.] you having us beaten as far as not having to start off your adult life 20, 30, 40k in debt.\n\nWhen I graduated, we were in the middle of the oil crisis, inflation was through the roof (\"WIN\" ring a bell? Thought not), we had a weak administration and a country demoralized by lost wars and the sad legacy of the Nixon administration.\n\nAround the time most of us graduated, we were either entering or coming off the worst financial collapse since the Great Depression. As for the oil crisis, I would like to point you to the price of gas averaging about 3 bucks a gallon while the minimum wage is about 7. 25 an hour.\n\nThis is like the quintessential boomer perspective. \"Oh, I had it tough, too, when I was young. You're just a bunch of whiners, blah blah blah\".\n\nNope, sorry. The world is very much different than when you were young. I'm sorry that you are too foolish to see this because it[.] going to wind up biting you in the ass pretty hard."}