{"doc_id": "1694", "name": "2013_11_humanities_student_major_605_musictheory", "namespace": "we1sv2.0", "metapath": "", "pub": "musictheory", "title": "2013-11-humanities-student-major_605_musictheory.txt", "pub_date": "2013-11-10T00:00:00Z", "Sentiment": "0.103", "Subjectivity": "0.503", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "281", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qcaax", "Reddit_id": "cdbj60h", "Subreddit_id": "t5_2qrjj", "Commenter": "cruzan", "length": "1485", "content_scrubbed": "I took AP theory as a course my senior year in high school, got a 4 on the exam (5 on aural, 4 on... the other one)\n\nThe class is certainly extremely helpful, I'm a sophomore music major at a liberal_arts college with a strong music program, and I since my school didnt accept AP theory scores I didnt place out immediately, but I tested out of most of the introductory music theory classes. \n\nThe thing is, AP theory is a very rushed and basic version of theory, but you need to grasp it before you get into the more complex stuff. And If you want to study music in college, but are having issues understanding the material then it wont necessarily be an issue for getting into schools, but it could set you back a little bit, depending on what the schedule for your major looks like. \n\nBasically, If I hadn't learned what I learned in AP theory, I probably would have been really behind on stuff when I got to college and wanted to become a music major. Granted, I go to a liberal_arts college where I have other requirements, so I can only take so many of my music credits each semester. And I dont know if that would be more or less of a problem at a music school like berklee\n\nThe other thing is that my understanding is music schools (like berklee) dont necessarily care too much if you dont know that much theory, they obviously look for it, but if you're talented enough as a performer, you could still get in. I'm not 100% sure about that though so someone would have to verify"}