{"doc_id": "1813", "name": "2013_11_humanities_student_major_1689_programming", "namespace": "we1sv2.0", "metapath": "", "pub": "programming", "title": "2013-11-humanities-student-major_1689_programming.txt", "pub_date": "2013-11-27T00:00:00Z", "Sentiment": "0.141", "Subjectivity": "0.327", "Score": "37", "Upvotes": "37", "Downvotes": "0", "Wordcount": "1135", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdo8kj5", "Reddit_id": "cdofv6x", "Subreddit_id": "t5_2fwo", "Commenter": "Whisper", "length": "6550", "content_scrubbed": "  unless they decide to take one of the $250K+ standing offers that Amazon, Google, etc have given them\n\nAh, no. Amazon and Google try to pull this kind of bullshit, too. \n\nPretty much any company with a large public presence knows that \"nerds\", technologists, and others whose primary skill is with things rather than people are going to have a high percentage of wounded egos from their childhood environment (where they did not yet have the power of having *civilization itself dependent on them*, and were patronized a lot by people who would grow to sell insurance). They know that this percentage of wounded individuals is going to try to address that hurt by *looking* awesome to others they meet in their adult lives. \n\nAnd that means that being a publicly \"cool\" company is a social asset that can be used to avoid paying these particular neurotic individuals their market value (as defined by what \"uncool\" companies have to pay people like them). \n\nThat[.] why software engineers themselves say stupid, masochistic things \"don't hire anyone who doesn't program for fun\", or \"your github repository is your resume\", or \"only bogon-emitting *suits* care about the money\". Attitudes like that hurt all of us.\n\nThat[.] why the tech industry has things like six-hour \"gangbang\" interviews, take home coding problems, etc. Because for every well-adjusted professional who knows his own worth and won't put up with that nonsense, there are one or two who will jump through any amount of hoops to be able to say \"I work at Google\", in the vain hope of basking in some sort of reflected glory. \n\nAll those \"perks\" are really just a combination of ways to make the job look cooler so they can pay you less, and to make it easier and more convenient for you to stay at the office longer and longer, working instead of enjoying your life. \n\n- Free lunches? They don't want you leaving to eat at a restaurant, socialize with friends, maybe run an errand or two. They want to grab a plate of food, go back to your desk, and work. Or eat in the cafeteria with your colleagues on your project, discussing design ideas, then finish eating and go right back to your desk, and work.  \n\n- Laundry facilities on the premises? People running errands for you? Daycare for your kids? No. They just don't want you leaving. \n\n- Free soda? Bitch, please. It[.] sugar water. Do you have any idea how cheap that stuff is, in bulk? Probably not, because if you were that sensible, you wouldn't put that awful stuff into your body. \n\n- A \"relaxed work atmosphere\"? What, you wear sandals? That[.] kid stuff. Professionals dress like professionals as a matter of personal pride, not because mommy makes them wear shirts with buttons. \n\nHere[.] a test to see if something is a real perk...**Do senators get it?** Senators don't get free soda, or wear t-shirts to work. There are no washing machines in the capital building. They don't get free massages, and there are no nap tubes. \n\nDo you think society respects you more than senators, to give you those things? Of course not. People just know that senators aren't socially naive, and easily distracted by the equivalent of shiny objects. \n\nWhat perks *do* senators get? Stellar healthcare packages. Probably pretty awesome 401k matching. Offices. Assistants. Respect. The ability to supervise their own comings and goings. And an appropriate amount of the almighty Yankee Dolla. \n\nMaybe it[.] because I never really was a nerd per se, and I see it more easily, but this way software engineers cooperate with their own exploitation bothers me. \n\nI've made a conscious commitment, in my own life, to act like a professional, and expect to be treated like one. \n\n- I have sworn off six-hour fly-in interviews. \n\n- I will not work for less than market, regardless of free stuff. Professionals do not take their fees on the barter system. \n\n- I will not be one iota more accommodating to publicly visible companies with cool images than to small ones with rented office space. Everyone[.] money is the same color. \n\n- I will not wear ties, but I will also not wear t-shirts and jeans. I am a professional part of a product team, not an antisocial basement gnome that people must put up with because he speaks the language of machines. \n\n- I will set my own hours, because respected professionals can pop out of the office for an hour in the afternoon to run an errand, without asking anyone[.] permission. But I will reliably be available when I am needed, because I am a respected professional, not a basement-dwelling slacker. \n\n- I will not have any code samples available on github. I am a professional, and what I write for clients is confidential work product. \n\n- I will not spend my evenings contributing to open source projects for free. Open source software is a business like any other, and most serious open source projects have budgets and employees like everyone else. Professionals do not work for free. \n\n- I will not offer, or refer, unpaid internships to students coming into my profession. Unpaid internships are for humanities_major and others without useful contributions to make. \n\n- I will not criticize the work of other software engineers where it will be seen or heard by outsiders. Seeing us struggle over the title of \"king nerd\" harms our image in the eyes of the public. Yes, there are incompetent software engineers. But even the worst of us is better at this than the best outsider, and if there[.] housecleaning to do, we will do it *in our own house*. With the doors and windows shut. \n\n- I will enforce a work-life balance that maximizes my creative efficiency, not my code output, or the speed with which I meet milestones. I will not work nights unless *I*, in my sole professional judgment, decide it is a sensible use of my time. \n\n- I will not permit schedules to be dictated to me by non-engineers. Nor will I permit them to decide when a project is complete. It is the carpenter, not the housewife, who declares when the roof is sound. \n\n- I will not allow my performance to be formally evaluated by non-engineers. \n\n- I will model my behaviour after other respected professions, and enforce upon others that I be treated in a manner displaying the same respected. This enforcement will take the form of withdrawing my *monetarily valuable presence and contributions* if I am not treated like a professional. \n\nI call on others to join me in this. \n\nIf you are a software engineer, and this list of standards seems unreasonable, then I suggest it is because you do not know your own value. "}