{"doc_id": "1794", "name": "2013_11_humanities_student_major_1539_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2013-11-humanities-student-major_1539_news.txt", "pub_date": "2013-11-25T00:00:00Z", "Sentiment": "0.156", "Subjectivity": "0.394", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "308", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdmnu5q", "Reddit_id": "cdmogva", "Subreddit_id": "t5_2qh3l", "Commenter": "anticlaus", "length": "1716", "content_scrubbed": "well first all, you started out with \"First of all, giving unlimited student loans regardless of major or performance is the reason college cost has risen twice as fast as inflation every year for 40 years.\"\n\nThen you said \"Yet my interest rate and loan amount is the same as someone just starting college in art history.\"\n\nThen you said \" Therefore why should an art major have to pay $55k per year to get a degree when they will be lucky to make $35k in a year when they get out?\"\n\nFinally you said \"You should be able to go to art school if you want, but not for $55k.\"\n\nI know your statement was more than 4-5 sentences, but this is the gist I got from each of your paragraphs.\n\nYour first two quotes postulates that student loan interests and amount should be based on major. You last two quotes postulates that the cost of college should be based on the major studied (accounting for future earnings).\n\nFirst of all the government cannot dictate private school tuition. Second of all, the tuition from liberal_arts and other income from programs such as sports or performance arts subsidizes engineering and other high cost tech/science programs. You are right about the fact that labs and specialized equipment costs a lot of money. \n\nI was replying more to your suggestion that interest rates and loan amounts should be based on the major being studied. First you are right that liberal_arts majors on average earn less than STEM majors. As a banker, looking at the facts I would loan less and charge more interest for liberal_arts major. The economic effect of that decision would of course naturally lead to less and less liberal art majors over time as more and more are priced out of a college education."}