{"doc_id": "1734", "name": "2013_11_humanities_student_major_1098_thebluepill", "namespace": "we1sv2.0", "metapath": "", "pub": "TheBluePill", "title": "2013-11-humanities-student-major_1098_TheBluePill.txt", "pub_date": "2013-11-18T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.384", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "419", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdh2cx7", "Reddit_id": "cdh58yk", "Subreddit_id": "t5_2vzvv", "Commenter": "Sonic_Bluth", "length": "2326", "content_scrubbed": "Future field report: \n\nI started integrating feminist viewpoints into my game to ingratiate myself to women for sex purposes. In my day-to-day routine I keep a little moleskine and write down all the examples of rape culture, institutionalized inequality, and male privilege I see, so I have material for my near-a-humanities-building game (I took up a minor in sociology to get \"behind enemy lines,\" and the classes are interesting enough that I may go for a double major. Again, for sex purposes.)\n\n It was tough at first, but before I knew it my notebook seemed to be filling up faster and faster. Now that my mind is primed to see them, there are actually a ton of examples. \n\nI'm also beginning to learn that I can express my concerns about the role of my own gender in the same sociological language as feminism. It[.] hilarious how these feminists will just eat up any MRA stuff you say when you make it sound like you aren't calling women the naturally inferior gender, but instead say stuff like patriarchy is something that affects all of us equally and oppression isn't some zero-sum game.\n\nIt[.] like, haha, don't you even know that I'm super-alpha, designed by nature to be your enemy? These women are so easy,  all I have to do is not deliberately antagonize them and they'll do stuff like value me as a person not mind that I'm around. They won't have sex with me, but that[.] chill because they aren't my type anyway, even though the number of them who seem to have body weight issues is way less than what you guys led me to believe. One girl actually might have sex with me, but her defenses are down so much because of my ally-frame that I don't even have to treat flirting like we're playing fucking Risk or something and I'm trying to trick her into invading Australia, so I'm ironically kind of out of my element. She seems to extend her interactions with me by her own volition, but I don't see that on the official list of DOIs.\n\nMy research has led me to believe that actually scoring with this type of woman (which I really want to do because she seems to have a positive effect on my mood just by speaking to me, an useful skill) may require a higher-level technique. Add it to the glossary, boys: GIC(FSP), Genuine Internalization of Concept (For Sex Purposes). Lets see how deep the rabbit hole goes."}