{"doc_id": "1749", "name": "2013_11_humanities_student_major_1197_trueaskreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueAskReddit", "title": "2013-11-humanities-student-major_1197_TrueAskReddit.txt", "pub_date": "2013-11-19T00:00:00Z", "Sentiment": "0.05", "Subjectivity": "0.228", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "379", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r0318", "Reddit_id": "cdiivrs", "Subreddit_id": "t5_2s91q", "Commenter": "[deleted]", "length": "2266", "content_scrubbed": "Well at least your self-diagnosis was spot on. You sound pretentious. You choose your words to make yourself sound smarter. You value classics and arts, like any Liberal Arts kid. That[.] fine. But recognize this: The arts you value, the literature you value is valuable because it relates to a wider variety of experiences in the world. Let[.] use your literature example as a lens for how fucked up your worldview is.\n\nYou've decided its value is face value. You've missed the point entirely. You've written off 99% of human experience because you've read War and Peace. Congratulations. War and Peace, Crime and Punishment, The Grapes of Wrath, Journey to the West, Atlas Shrugged (shit), For Whom the Bell Tolls - these are not things that make you different from the people that haven't read them - these are experiences you are supposed to add to your frame through which you look out on the world. You skipped that step.\n\nInstead of making that influence your world view, you've added it as a notch on your belt. It[.] something that makes you more educated, more worldly or smarter than other people. You're not. You're just a privileged english_major One of millions. Your insight into the human experience is trivial, at best. \n\nEveryone[.] way of life, and every interest available to any person has value. You've seen nothing of the world. You've been through almost nothing. You do not lead an examined life, you lead a privileged life. But for some reason, through three years of college, you've decided you lead this introspective life that is somehow qualitatively better than a guy who works in a kitchen and reads paperback fantasy novels. Stop judging other people and recognize the fact that you don't, you know very little. \n\nThat is, after all.. Mr. Classical Education, the foundation of Wisdom. Check your Socrates, punk. You think people are coasting through life because they don't watch high-brow movies or read classic literature, or they'd rather argue about football than debate the Second Treatise of Government and the origin of currency? Dude, you've coasted through life so far. It[.] abundantly clear. Coasting through life or making something of it has NOTHING to do with your appreciation of music, art, literature and film. Nothing."}