{"doc_id": "1705", "name": "2013_11_humanities_student_major_718_lostgeneration", "namespace": "we1sv2.0", "metapath": "", "pub": "lostgeneration", "title": "2013-11-humanities-student-major_718_lostgeneration.txt", "pub_date": "2013-11-12T00:00:00Z", "Sentiment": "0.116", "Subjectivity": "0.253", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "275", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdcru80", "Reddit_id": "cdcs1dk", "Subreddit_id": "t5_2r40j", "Commenter": "[deleted]", "length": "1539", "content_scrubbed": " Sure there are, but either your company is asking too much or paying too little. That, or theya re simply being picky. If it were a big problem and it was hurting business, then why are corporate profits at record highs?\n\nI know my company better than you do.  The real issue is that the shortage in the oil and gas industry is drawing people from my industry and driving up pay expectations.  My industry has nowhere near the profit margins of the oil/gas industry, and so we simply cannot sustain those pay rates.\n\nIt is going to affect things very soon, and there[.] no clear way to fix it.  Even when we offer higher rates, people simply do not want to work in manufacturing.  They don't want to live where manufacturing exists, and they do not want to do that type of work.  I don't know what they want to do, but I can tell you what they don't want to do.\n\n There is no flood of liberal_arts majors.\n\nCollege enrollment has no bearing on the number of them already graduated.  What are the statistics on the un or underemplyed of our generation?  I can tell you off the bat that engineers are around 3% unemployed, so that field is about right.  Is it the business and nursing programs that are experiencing and overabundance, or is it liberal_arts?  Or is it the unskilled, uneducated labor?  With high youth unemployment, who are the unemployed?\n\n I don't care. Morally, I could not work for most branches of the U_S government.\n\nMost?  Really?  The government is the largest single employer.  Your moral standards sound pristine."}