{"doc_id": "1820", "name": "2013_11_humanities_student_major_1747_cfb", "namespace": "we1sv2.0", "metapath": "", "pub": "CFB", "title": "2013-11-humanities-student-major_1747_CFB.txt", "pub_date": "2013-11-28T00:00:00Z", "Sentiment": "0.065", "Subjectivity": "0.374", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "304", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdoxya5", "Reddit_id": "cdp10lz", "Subreddit_id": "t5_2qm9d", "Commenter": "Telionis", "length": "1810", "content_scrubbed": " I didn't realize there could be more than one land-grant university in a state. \n\nSadly, in the South, there were usually two land-grants per state, one for whites and one for blacks. My alma mater VT was for whites and Virginia State for blacks, same with Clemson and SC State. Also see Kentucky State, WV State, and Winston-Salem State (NC). The black colleges were supposed to be \"*separate, but equal*\", but of course nothing was further from the truth. VT got 2/3rds of the land grant funds, and much more support over the years. Coupled with much wealthier alumni, this resulted in an utterly enormous disparity; today our endowment is 46x bigger than VSU[.]. Such a large disparity is not atypical at all; Kentucky[.] endowment is 83x that of Kentucky State, and WVU[.] is actually 170x that of WV State[.].\n\nStill, you must admire the heck out of the HBCUs, as there is absolutely no indication that the actual product (quality education) was inferior to the much richer white schools, and that is despite facing overwhelming racism and bias in addition to a huge budget disadvantage.\n \nOf note, in the late 1960s, VT and VSU actually tried to merge. We would have absorbed the existing Virginia State and become a single university system with students and professors moving between campuses freely. VT, which was A&M-only at the time, would have taken on the name VSU, added humanities and liberal_arts to become a \"comprehensive university\", and continued to operate the old VSU as a satellite campus (possibly called Petersburg State or VSU-Petersburg). The State Assembly refused to allow it (legend says UVA opposed it), so instead we just added \"*& State University*\" to the end of our name, added humanities and liberal_arts anyway, and now we're stuck with the strange name of VPI&SU."}