{"doc_id": "1637", "name": "2013_11_humanities_student_major_140_femradebates", "namespace": "we1sv2.0", "metapath": "", "pub": "FeMRADebates", "title": "2013-11-humanities-student-major_140_FeMRADebates.txt", "pub_date": "2013-11-02T00:00:00Z", "Sentiment": "0.044", "Subjectivity": "0.325", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "575", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd54uiz", "Reddit_id": "cd589ld", "Subreddit_id": "t5_2y44v", "Commenter": "jolly_mcfats", "length": "3581", "content_scrubbed": "Call me anti-intellectual but I'm a little suspicious of thinkers who only ever use big words even when talking to people like me who won't understand them. If Einstein can write popular science books, I don't see why Butler can't write accessible explanations of her ideas.\n\nI personally agree.  I've mentioned this before, but I think this speaks to your point:\n\n Richard Feynman, the late Nobel Laureate in physics, was once asked by a Caltech faculty member to explain why spin one-half particles obey Fermi Dirac statistics. Rising to the challenge, he said, \"I'll prepare a freshman lecture on it.\" But a few days later he told the faculty member, \"You know, I couldn't do it. I couldn't reduce it to the freshman level. That means we really don't understand it.\"\n\n\nOveruse of abstruse terms is something  [Judith Butler has been accused of before](http://linguafranca. mirror. theinfo. org/9912/writing. html), and is certainly part of the writing style favored by foucault and derrida.\n\nProponents of this writing style maintain that it allows one to \"think the world more radically\".  Critics feel that it hides an idea from honest analysis through obscurity, and that it is motivated by an emotional need to create a perception of sophistication. [Noam Chomsky described this phenomenon like this](http://www. youtube. com/watch?v=j-FVctaW3j0&noredirect=1):\n\nI think that, it[.] not that hard to understand. I mean, suppose you are a literary scholar at some elite university. Or, you know, anthropologist or whatever. I mean, if you do your work seriously, that[.] fine, you know. But you don't get any big prizes for it. On the other hand, you take a look over in the rest of the university and you've got these guys in the physics department and the math department and they have all kinds of complicated theories, which of course we can't understand, but they seem to understand them. And they have, you know, principles and they deduce complicated things from the principles and they do experiments and they find either they work or they don't work. And that[.] really, you know, impressive stuff. So I want to be like that too. I want to have a theory. In the humanities, you know, literary criticism, anthropology and so on, there[.] a field called theory. We're just like the physicists. They talk incomprehensibly, we can talk incomprehensibly. They have big words, we'll have big words. They draw, you know, far-reaching conclusions, we'll draw far-reaching conclusions. We're just as prestigious as they are. Now if they say, well look, we're doing real science and you guys aren't, that[.] white male, sexist, you know, bourgeois or whatever the answer is. How are we any different from them? OK, that[.] appealing.\n\nI don't think that this is exclusive to postmodernists.  When I attended college, art history and sociology courses were a big part of the requirements for my degree.  While I really did learn some interesting things, and developed much better critical reasoning skills, I learned a bad habit; to use obfuscating language.  Clarity was less important than vocabulary when seeking an A grade on a paper.  People, especially professors, were easily tricked into confusing complicated language with complicated thoughts.  Plain language was something to be avoided, not something to be used as frequently as possible.\n\nConsequently, when I encounter impenetrable language, my first instinct is to wonder if the emperor is wearing any clothes.  This isn't meant to be a dismissal of all thoughts expressed in dense language- just a reaction to the style."}