{"doc_id": "1753", "name": "2013_11_humanities_student_major_1224_abandonedporn", "namespace": "we1sv2.0", "metapath": "", "pub": "AbandonedPorn", "title": "2013-11-humanities-student-major_1224_AbandonedPorn.txt", "pub_date": "2013-11-20T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.347", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "332", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdisio7", "Reddit_id": "cdit2w2", "Subreddit_id": "t5_2sh6t", "Commenter": "Kosh_Ascadian", "length": "1868", "content_scrubbed": "That is extremely short sighted.\n\nMost of the technology you use today runs on stuff that used to just be \"wow, look at this neato thing that happens sometimes in some places\". Things that inherently seem useful only to scientists and inventive tinkerers. None of it is useful, interesting or worth the investment at first. Things build upon previous things though. Each little tidbit of science broadens the horizons just a bit which makes more and more research and technology possible. Yesterdays \"neato\" is todays \"holy shit look what this thing I built can do\".\n\nSpace exploration overall is an extremely wide field of research with trickle down benefits in almost all other areas of research or our lives. \n\nSorry I don't really have time right now to bother to give you spesific examples. Like /u/Fergi pointed out just google and fall into the rabbit hole.\n\nI'd like to make a completely different and much more important point though.\n\nEven if you do not care about any of the technological and scientific advancement space exploration gives us. Do you care at all about humanities survival in the long run? If you do then it is extremely fool hardy and again short sighted to stay on this one tiny rock, which could be hit by an asteroid or any other major catastrophy at any moment. There is about a once in 100 million years per average giant meteorite hit on this planet. Each one decimates life on earth. The last one was 65 million years ago. It[.] completely likely the next one can hit us any moment. Space exploration would allow us to see it coming, maybe even change the outcome. Off world colonies would allow humans to survive. Etc.\n\nAnd if you do not care about humanities survival at all... Then that[.] a whole other rabbit hole you've got to be prepared to dive into. If you don't care- I am pretty sure I can make you care in a few paragraphs."}