{"doc_id": "1828", "name": "2013_11_humanities_student_major_1801_enoughlibertarianspam", "namespace": "we1sv2.0", "metapath": "", "pub": "EnoughLibertarianSpam", "title": "2013-11-humanities-student-major_1801_EnoughLibertarianSpam.txt", "pub_date": "2013-11-29T00:00:00Z", "Sentiment": "0.133", "Subjectivity": "0.5", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "508", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1roica", "Reddit_id": "cdpyrfu", "Subreddit_id": "t5_2tzlb", "Commenter": "GhostOfImNotATroll", "length": "3270", "content_scrubbed": "I honestly don't see how free market libertarianism could appeal to disadvantaged groups of people, especially when the entire ideology is based off a binary of \"the market vs. the government\". Ask any of these free market types about the roots of patriarchy, white supremacy, heteronormativity, etc. and all of them will say it[.] the government, and the perfect antidote to all the shit governments have done is the free market.\n\nIt[.] no surprise that free marketeers have very little understanding of [base and superstructure](http://en. wikipedia. org/wiki/Cultural_hegemony), [ideology](http://www. marxists. org/reference/archive/althusser/1970/ideology. htm), the social power of [language](http://www. amazon. com/Language-Symbolic-Power-Pierre-Bourdieu/dp/0674510410), the power of [consumer society](http://www. marxists. org/reference/archive/debord/society. htm), and whatnot; to them, everything is black and white.\n\nI have a BA in philosophy from a top-ranked liberal_arts college. My adviser was German, so I mostly learned continental tradition, which puts *a lot* of emphasis on social theory. One piece of advice I learned in school was, philosophy is not a dogma akin to religion but rather a pair of glasses you put on in order to help you see the world in a certain fashion - if your pair of glasses is fucked up, your vision will be fucked up, and likewise, if your methodology is fucked up your view of the world will most likely be fucked up as well. That[.] the main issue I see with modern libertarian ideas: they come from completely distorted views of the world which makes most of what they say very screwy. For example, I once had a free marketeer tell me that the reason why patriarchy exists is because back in the day the government would reward men for being warriors, hence males gained higher social status. This is blatantly not true, as we see that patriarchy pre-dates the formation of states in the vast majority of human societies (in fact, many feminists have argued that dominant males were the *first* states, and women were the first people to have the metaphorical gun pointed to their heads by the state). Plus, do free marketeers even have their own narrative of history that enables them to give their theories some legit footing akin to Marx and Engels' historical/dialectical materialism? Rothbard was a shit-tier historian as he was a shit-tier philosopher and economist, so I doubt it. Again, the entire narrative rests on \"market good, government bad\".\n\nNot to mention, a lot of libertarian and market anarchist strategies are only for the privileged to engage in. Talk to market anarchists about ways to create a revolutionary culture and they'll talk all about microbrewing, Bitcoin, 3D printing, going off the grid by using solar panels to power your house, growing your own food, and so on. Working-class people cannot engage in most of these for the obvious reasons. In social anarchist circles, we criticize each other all the time for proposing strategies that seem out-of-reach for \"everyday\" people (cough cough CrimethInc. cough cough), yet I rarely see free marketeers doing the same, especially since they like to assume that every single individual is capable of buying a 3D printer or starting an agorist business."}