{"doc_id": "1819", "name": "2013_11_humanities_student_major_1737_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2013-11-humanities-student-major_1737_philosophy.txt", "pub_date": "2013-11-28T00:00:00Z", "Sentiment": "0.021", "Subjectivity": "0.379", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "338", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdoxcl9", "Reddit_id": "cdoyrau", "Subreddit_id": "t5_2qh5b", "Commenter": "ChubbyDane", "length": "1815", "content_scrubbed": "This is precisely why many people studying the sciences are so utterly bored of pretending to take the humanities seriously: It doesn't seem that people who study the humanities take them seriously either!\n\nI'll gladly admit to not being the most fervent student of the sciences. I like to kick up my feet and lean back for a nice long nap as much as the next guy. But even somebody with as slacky and attitude as I know that you need to put in your hours. While studying, I had to be present at university 10 hours a day, every week day, and I had to put in 6 hours a day every weekend day to even make an effort to seriously follow the material of the week. Now I'm not saying this was non stop work, don't get me wrong. I spend considerably more time than this because I liked having a break once in a while. My department had invested in hammocks. It wasn't a bad time at all.\n\nIn terms of sheer time investment, when I compared my study with a friend of mine studying our equivalent of english, found that he could invest around 2/3rds the time I put in, and he would ace everything, and it appeared to him to be considerably more effort than any of his peers put in.... and instead of failing all of those people flat (which would be in the best interest of the university), they apparently got paper certifying them of degrees!\n\nPerhaps this is just sour grapes, but living in a country with free higher ed, it feels like a tremendous waste for society to not be pushing humanities students harder: We could get so much more out of them ! They could all be a Popper or a Kierkegaard !\n\nAt the very least, any philosophy student ought to be able to easily do calculus, statistics, computability and linear algebra simply as a matter of sharpening their faculties through the use of rigorous logics!\n\n/end rant."}