{"doc_id": "1742", "name": "2013_11_humanities_student_major_1167_languagelearning", "namespace": "we1sv2.0", "metapath": "", "pub": "languagelearning", "title": "2013-11-humanities-student-major_1167_languagelearning.txt", "pub_date": "2013-11-19T00:00:00Z", "Sentiment": "0.136", "Subjectivity": "0.422", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "495", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdi0unc", "Reddit_id": "cdi32r0", "Subreddit_id": "t5_2rjsc", "Commenter": "winnai", "length": "2783", "content_scrubbed": "I studied at Stockholm University through an exchange program with my US school. However, I also independently applied to graduate schools in Sweden (successfully, but decided to stay in the US), so I know both sides. I have only taken undergraduate courses in Sweden, but I honestly didn't really notice a huge difference in the teaching style. Classes were a bit less \"interactive\" than in the US, I guess (more lecture, little discussion), but I was working about the same amount outside of class. In my experience, University courses in Sweden are actually a bit more like the US than those in much of continental Europe (e. g. Germany). The bar was definitely lower, though, academically-speaking; it was a very relaxed environment, which I miss sometimes.\n\n\nThe application process is super easy; way more self-explanatory than the average US application, actually. The number one thing you need to get on is housing - unfortunately, if you're trying to go to Stockholm, you'll practically have to start looking before you even get accepted. Your best bet will be looking in the distant suburbs (the public transportation is great, even in the winter), but if you're okay living with roommates AND paying a buttload, you can probably find somewhere near campus if you look early enough. \n\nIf you're not in the humanities or social_sciences, disregard this entire paragraph - I'm sure the system is different for the hard_sciences/professional programs, or, at the very worst, a hard_science MA will be worth something even if it costs you money. However, the reason I didn't end up going to grad school in Sweden essentially boiled down to the extra time and money it would have cost me. There is no such thing as a non-terminal MA; as an international student, you will have to pay tuition for your MA, and then after two years you'll have to reapply for your PhD. This wasn't a huge problem for me because I had a residence permit already for other reasons and wouldn't have had to pay tuition, but I was still looking at working part-time or taking out loans to cover living expenses, which is not really worth it for an MA in my field (in the US you are offered a stipend and/or RA/TA position for the duration of the MA). The cost of living in Sweden is very high, too (especially in Stockholm), so it would have been even more damaging than doing the same in the US.\n\nIn any case, best of luck! Though you definitely don't NEED to learn Swedish, its a really good idea - it[.] way easier to make friends that way, and people won't just see you as another transient international student who will be gone in two years (even if you will). And if you do need to get a job to pay for that MA, Swedish will be crucial. Feel free to ask if you have any more specific questions :)"}