{"doc_id": "1638", "name": "2013_11_humanities_student_major_148_letstalkmusic", "namespace": "we1sv2.0", "metapath": "", "pub": "LetsTalkMusic", "title": "2013-11-humanities-student-major_148_LetsTalkMusic.txt", "pub_date": "2013-11-02T00:00:00Z", "Sentiment": "0.022", "Subjectivity": "0.509", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "423", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1prgj4", "Reddit_id": "cd5brls", "Subreddit_id": "t5_2t4it", "Commenter": "TheLAriver", "length": "2273", "content_scrubbed": "Funny, I semi-recently moved to Chicago from LA. These are my opinions, having played in a band in L. A. for a few years:\n\nThe pay-to-play venues are definitely a scam, designed to prey on the new and desperate. But most people figure that out pretty quickly and they're not really the main source of what makes LA so difficult to succeed in as a band.\n\nLA has two major issues that make it hard on bands. Firstly, it[.] a driving town. The vast majority of people only travel via car. So, right off the bat, you have the added expense of gas and the cost and/or hassle of parking. This means that people are less inclined to take a chance on something they're not already familiar with. And you don't have as much of the phenomenon that exists in cities like Chicago, where people will go to a part of town and spend the night visiting multiple bars or venues in the area. They're going to the place they know they like, and they want to keep the night down to a single trip there and back. So you don't get many people stopping in to see what[.] going on because they're passing by.\n\nThe other thing that makes it hard is that LA is a town where people from all over come to pursue careers in the arts. Your gig is up against every other struggling musician in the city, some of whom were probably the hottest shit in their town before they even got here. They arrive fully formed, taking it seriously. But also, since the city is full of artists, people become jaded and cynical about the quality of local work. Frankly, there are a lot of terrible bands. After a while, you've been to enough bad shows out of courtesy that you assume people will stink, unless proven otherwise. Everybody gets invited to a million shows every weekend, so why would they go to a random stranger[.] show that will probably not be good?\n\nI came to the conclusion that LA is a city in which to release an album, not a city in which to start a band.\n\nVenue-wise, I liked seeing shows at The Echo and Echoplex, and sometimes The Satellite, depending on who was doing sound. I liked playing shows at Echo Curio, Pehrspace, and The Satellite (especially depending on the sound person). I liked being able to say that we played The Smell, but that place makes the best bands sound like a muddy mess."}