{"doc_id": "1796", "name": "2013_11_humanities_student_major_1551_quityourbullshit", "namespace": "we1sv2.0", "metapath": "", "pub": "quityourbullshit", "title": "2013-11-humanities-student-major_1551_quityourbullshit.txt", "pub_date": "2013-11-25T00:00:00Z", "Sentiment": "0.003", "Subjectivity": "0.401", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "1161", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1ra1lk", "Reddit_id": "cdmu2wc", "Subreddit_id": "t5_2y8xf", "Commenter": "whiskercity", "length": "6253", "content_scrubbed": "I think it depends on the type of liar. I know 2 liars and 1 I think was a bit mentally unstable/insane but the other I think was just really insecure. \n\n\n\n**Liar 1 -** The guy bused tables with me at a restaurant when we were freshmen in high school. He was a weirdo, no friends. He would tell the most insane stories that no one could ever possibly believe. He said that he had like 50 luxury cars, and he had a special drivers license that let him use them despite being only 14-15. The other guys teased him a lot about it, like \"Oh yeah? Really? Do you park the 3 Mercedes next to your 10 BMWs?\" but he would stick to the lies. He even said he drove his Lamborghini to work one night and a bunch of the guys were like \"Yeah ok let[.] see it\" and went out into the parking lot with him at the end of his shift and then he said he parked it really far from the restaurant and just kind of walked off into the darkness. We all assumed he hid in the woods for 30 minutes until he was sure no one was watching, then called his mom for his usual ride home. He also said he had a Play Station 4 (back in like 2003) that he got when he was in Japan, a country he visited frequently using his private jet. I think something was seriously mentally wrong with him, because the lies weren't even remotely believable. I saw him on facebook recently posting pictures of (surprise) Lamborghinis, so I guess little has changed. I think that was just a case of serious mental illness exacerbated by teenage male culture that dictates boys be in constant competition with each other. So maybe he felt pressured to make up these stories to look cool. \n\n\n\n**Liar 2 -** Insecure Girl. Her lies always had clear motives. She had a bad reputation for being kind of a \"slut\" but I was new to the school and willing to give her the benefit of the doubt (she denied all the stories about her hooking up with different people) given that this was high school and people can be viscous. Her lies started out small enough, and were all about how my other friends really didn't like me. They all said horrible things about me behind my back, and I should stop hanging out with them and only hang out with her. I believed every word, because we had a mutual friend who was a pathological liar (laughably tall tales about spending nights in jail, dating 20 year olds, people getting in gang fights over her beauty). Me and Girl 2 always talked about what a crazy liar Girl 1 was, so I had no reason to believe that Girl 2 was also a liar. Why would she lie when we love to bash this other liar? Anyways, I was seeing a guy at the time who I really liked, but I broke it off with him when Girl 2 told me that she had AIM conversations that proved he was \"cheating\" on me. She kept saying she would bring them to school to show me, but something would always happen where she \"forgot\" them or they were \"lost on the bus\" or something. I broke off friendships with a lot of probably nice people because of lies this girl told me. \n\n\n\nEventually her lies started getting bigger and bigger and also darker– she does cocaine in the bathrooms, she killed her neighbor[.] dog with a screwdriver, her dad is secretly a nazi, she has a brain tumor and will die in a year. As the lies got bigger and bigger I started getting angrier and angrier about it and our friendship kind of fell apart after the tumor one. I remember telling her that it[.] really messed up to make up that kind of thing when there are really people out there who are dying from that. She stuck to her story, and I finally woke up to the fact that she was insane and we stopped talking. I go off to college and move out of our small hometown, she gets pregnant, has a baby and keeps living with her family, working different retail jobs. I hear about her life periodically through what remains of my hometown social circle. \n\n\n\nA couple years later, her dad dies (actually, though) and I get back in touch with her to offer condolences, etc. We still talk on occasion but our conversations are like this:\n\n\n\nHer: I see you married [our class president], that[.] cool, I'm actually engaged to an astronaut/scientist/photographer/architect/model/world traveler. Oh you're applying to [ivy league grad school]? I took courses there but they were too easy. I actually just got into MIT and John Hopkins so I was thinking one of those. Oh, you studied [liberal_arts]? Those are for dumb people, I'm going to med school/math phd/biochemistry masters. Oh you bought a house? I bought a much nicer, bigger one. I'm going to move into it later. Oh you work at [well known NGO]? I work for [federal govt agency in DC]. Oh, you walk past that every day? Yeah, well I work at their [our hometown] office, actually, which is why you haven't seen me. You took a trip to Europe? I've been there like a dozen times. You learned 2 languages in college? I'm actually a native speaker of about 10. Oh and I slept with your husband back in high school, it was weird, I have the proof around here somewhere...\n\n\n\nOn and on and on. The saddest part is that she[.] a really cool and fun person to hang out with, and pretty bright, too. I know she[.] just really insecure, or trying to impress me, but her lies are so easily debunked. I don't get why she does it. Like she claimed to work at an office right near my actual one and then said that they have a branch in our hometown. As if that isn't something any idiot could google and disprove in 10 seconds. As if our mutual hometown friends wouldn't tell me that she[.] a cashier at Best Buy. She said she spoke fluent Spanish, which was ballsy, considering I *do* speak fluent Spanish and could easily prove that one wrong. She also posts pictures on facebook of European cities or exotic places and a quick reverse image search proves that[.] bullshit, too. The worst was when she made a fake facebook account for an imaginary boyfriend. She would have long conversations with herself on it. It[.] really sad. \n\n\nWhen people tell lies that are so easily disproved it makes me think there[.] something wrong with them mentally. \n\n\n\n--------------\n\n\n**TL,DR: People are insecure, and want you to think that they're successful because they're worried you won't think they're smart if they're not.**\n\n"}