{"doc_id": "1810", "name": "2013_11_humanities_student_major_1650_zen", "namespace": "we1sv2.0", "metapath": "", "pub": "zen", "title": "2013-11-humanities-student-major_1650_zen.txt", "pub_date": "2013-11-27T00:00:00Z", "Sentiment": "0.104", "Subjectivity": "0.424", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "572", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rjp29", "Reddit_id": "cdo46ac", "Subreddit_id": "t5_2qhmf", "Commenter": "[deleted]", "length": "3195", "content_scrubbed": "Yes op. No further explanation needed. There[.] only so much you can say about this place (/r/meditation is exactly the same, and I'd wager the buddhism subreddit isn't far from the plague) without going back to the original point. The biggest irony here is that buddhism teaches liberation of the ego, but users here time and time again keep their ego fed. Every time you post a pretentious quote in the hope of sounding enlightened you're feeding your ego and you feed your ego every time you talk about an aspect of zen while trying to convince whoever you're talking to that you know a lot about this stuff even though there is a good chance that your primary source material of buddhism is wikipedia and this subreddit.\n\nPeople here are pretentious, as will always happen in a place that outsiders hold in high regard. Why research something when you can always pretend to know a lot about it and collect those sweet sweet REAL LIFE SOCIAL POINT$$$$$$$$$????!\n\nThis sub would have been fine if it was 1) a place for people to link about actual ZEN MATERIAL, zen literature, and 2) a place for ZEN DISCUSSION, where you discuss aspects of zen with others. But this is plagued by the fact that a lot of the people in this subreddit have no actual idea of what zen and its aspects are, so it drives both #1 and #2 into a waddling pile of shit, along with new users that get trapped in the cycle of greedy ego-feeding.\n\nEverything the majority this sub does is the result of not having an idea what zen is, while trying and thinking that they do at the same time. For starters I think the mods should try to bring up some useful books or sources on what zen is to educate the crowd that populates this, because it[.] fairly obvious that most of their zen literature is the wikipedia article. It keeps getting disturbingly shittier and shitter the more you browse ANY sort of content that is focused on the humanities, because the majority has no idea of what they're talking about.\n\nYou're rarely (or never) going to find good content here, because the users here prefer to drown their head in pretentious sayings and musings for their own benefit instead of doing some mindcracking and realizing what they should actually be talking about. People come here not to discuss zen, they come here to make themselves feel better in a passive attempt to convince themselves they've gotten smarter by quoting a random zen saying. It goes like this, see a zen saying/something reminiscent of one - \"wow this is TOTALLY ME!\" - \"I'm so profound and enlightened!\" - keep browsing and indulging yourself in more delusions.\n\nSort the top posts of this subreddit by any setting (I think the only good thread was the #1 of all time, where a guy talks about his actual experiences in a zen monastery) and you will notice that about 90% or more of the content serves only to make the poster and the people seeing the post better about themselves in a superficial way, while actually doing nothing at the same time.\n\nIf the Buddha was a /r/zen poster, he would offer no actual insight, instead he would just quote secondhand observations in the hope that everyone can make enough sense of them to make them useful."}