{"doc_id": "1756", "name": "2013_11_humanities_student_major_1254_physicaltherapy", "namespace": "we1sv2.0", "metapath": "", "pub": "physicaltherapy", "title": "2013-11-humanities-student-major_1254_physicaltherapy.txt", "pub_date": "2013-11-20T00:00:00Z", "Sentiment": "0.129", "Subjectivity": "0.32", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "429", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r2r3n", "Reddit_id": "cdj3hbw", "Subreddit_id": "t5_2tj75", "Commenter": "TurduckenII", "length": "2454", "content_scrubbed": "I got a degree in History and East_Asian Studies. I was a liberal_arts major who could speak Mandarin. I lived in China for two years after graduation, teaching English and taking on random jobs of teaching, acting, presenting, selling stuff etc. There are lot of things you can do there as a white guy who speaks Mandarin, and it[.] cool but you can't really move up from the \"odd jobs\" category unless you get lucky, have other skills such as engineering, business, or programming etc, or get transferred from a job you already have in a foreign company. I enjoyed my time there and met an amazing woman who I want to spend forever with, and now she lives with me. \n\nAnyway, I moved back to the states and I'm in the same position. Looked around, didn't know what to do, applied to one job that had Chinese language/culture as a mainstay, and then lazed around my parents house until I decided to become a PT.\n\nNow I'm living in an apartment in the city (supported by my parents), taking classes at my local community college, and shadowing PTs. I've applied to three schools so far for this application cycle (I started last spring, so naturally you're going to want to wait a year to apply as you get your pre-reqs done). But yeah, I didn't get a BS in Kinesiology, Biology, Exercise science, or pre-PT as many others do. I'm a liberal_arts major but I did well on the GRE and so far have a 4. 0 GPA in the pre-reqs, 3. 3 in my BA. \n\nMake sure you get some diverse PT experience! I shadowed a guy for 92 hours and he was pretty good, but very average. I then looked up another PT who was incredible, interdisciplinary, really full of life and talent. I wrote an essay about him. Also, get inpatient observation experience if you can! You really have to pester hospitals but they will usually let you in after you do CORI and a background check. Might take a while, so plan EARLY. It[.] a balance between spending enough time shadowing someone so that they can write you a letter of recommendation, and getting diverse experience. Try for 20 hours of inpatient experience, and the rest develop a relationship at an outpatient clinic or private practice. \n\nWant to know how you stack up? Check out the applicant data report for PTCAS. If you don't know what PTCAS is, it[.] a centralized application service that you will become very familiar with. \n\n[Applicant Data Report](http://www. ptcas. org/uploadedFiles/PTCASorg/About_PTCAS/PTCASApplicantDataRpt. pdf)"}