{"doc_id": "1809", "name": "2013_11_humanities_student_major_1649_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2013-11-humanities-student-major_1649_AskReddit.txt", "pub_date": "2013-11-27T00:00:00Z", "Sentiment": "0.07", "Subjectivity": "0.328", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "1281", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rjj2f", "Reddit_id": "cdo43ui", "Subreddit_id": "t5_2qh1i", "Commenter": "gigantism", "length": "7313", "content_scrubbed": "It had only been one month since the first World Trade Center Bombing when Dr. Abdul Mu'iz, of the Kuwaiti Red Crescent, entered the U_S on a fundraising mission. Touring the West Coast, Dr. Mu'iz told the stories of countless Afghan children who had been injured by Soviet land mines. The donations that he hoped to collect from well-to-do Muslim families in America would go a long way toward rehabilitating those children, victims of a 10-year-long war with Russia and the civil war then raging in Afghanistan.\n\nHis guide for this tour of America was Ali Abdelsoud Mohammed, a 6'1\" former member of the Egyptian Army. A man who spoke fluent English, French and Hebrew, he was a strong pick for Mr. Mu'iz, as Mohammed made friends easily. Neither man was who he appeared to be, and maybe those they spoke to sensed that; despite countless talks and requests for donations, Dr. Mu'iz[.] trip garnered only a few hundred dollars for the cause he was championing.\n\nAli Mohammed had once been a major in the Egyptian military, actually in the same division as Khaled Islambouli, the solider who assassinated Anwar Sadat. At the time, Egyptian officials had believed that Ali Mohammed was part of the assassination plot, or at the very least a member of a radical fundamentalist group, and they removed him from the military. They had been right, Ali Mohammed was a member of Al-Jihad.\n\nThe U_S had not been a target of their organization, for its stated purpose was to overthrow the Egyptian government and install an Islamic Republic in its place. Their only beef with us at the time was that we were a huge supporter of the government that the country then had in place. Therefore, to find the real weaknesses in Egypt, Ali Mohammed was given a new order from Al-Jihad: penetrate American intelligence in the region. After all, how hard could it be?\n\nIn 1984, Ali Mohammed simply walked into our CIA station in Cairo and announced that his services were available. Wisely, the CIA officer handling him believed that he was sent to infiltrate our intelligence agency as a plant, although he believed that Mohammed was part of Egyptian intelligence and not a member of Al-Jihad. Unwisely, he knew that he didn't want him involved in our activities in Egypt, so he sent out an internal memo seeing if any other CIA station might be interested in him.\n\nHamburg, Germany, said they needed just such a man, and so Ali Mohammed became a CIA asset in Germany, assigned to penetrate a mosque affiliated with Hezbollah. On his first job for the CIA, Mohammed walked into that mosque and immediately told the Iranian cleric that he was a CIA plant, assigned to monitor their activities. What Mohammed didn't know was that the CIA had already infiltrated that mosque; they knew immediately that Mohammed was not trustworthy.\n\nHis employment was terminated immediately and in time the CIA notified the State Department about Ali Mohammed, labeling him as untrustworthy and issuing an order to bar his entrance into the U_S. That would have worked well, except by the time the State Department was notified, Ali Mohammed was already in the U_S, on a visa approved by the CIA to protect our most valuable assets. To stay in California, however, he needed to be married; and so Linda Sanchez, a medical technician, wed our would-be jihadist.\n\nNow it was time for him to really go to work. Mohammed joined the U_S Army and was stationed at the John F. Kennedy Warfare Center at Fort Bragg. Here he really came about; he was constantly given high performance ratings and fitness awards. Called the best of the best and beyond reproach, Ali Mohammed ended up giving videotaped lectures on the Middle_East, their cultures and politics to his fellow soldiers. What the officers did not suspect was that at night he was at his local Kinko[.], copying our maps of the Middle_East and military training manuals. On the weekends, he headed off to Jersey City to train young would-be jihadists in the arts of war.\n\nIn 1988, he asked for a separation from the Army to go kill a few Russians in Afghanistan and was granted leave. He was actually helping train the first members of what would become Al Qaeda. He left the army in 1989, but joined the Reserves and moved to Silicon Valley. Yes, he would take off for months on end to the Middle_East; but, still trying to break into our intelligence agencies, he applied as a translator for both the FBI and CIA. Now, at this point you would think the CIA would check their own records on Mohammed, but they didn't. In May of 1993, when John Kent of the FBI came calling on an unrelated matter, Mohammed started regaling the agent with stories of Afghanistan and a local radical mosque. Because of the sensitive information he had been given, Kent brought in the Department of Defense; counterintelligence agents from Fort Meade flew to California to talk to Ali Mohammed.\n\nIf you are not sitting down, you'd better do so.\n\nMohammed told our military about Al Qaeda, even said he had trained some of their recruits and showed on maps of Afghanistan where their training camps were located. It was the first time our intelligence agencies ever heard the name Al Qaeda and the first time we heard that Osama Bin Laden was in charge. It was the spring of 1993.\n\nAgent Kent sent his report in to the FBI, and one was filed at the Department of Defense and then, because of all this shocking information - nothing happened.\n\nFrom there, Ali Mohammed took Dr. Mu'iz on his tour of the West Coast allegedly trying to raise money for Afghan children. He would continue to train young jihadists at bin Laden[.] camps, using techniques he had learned in Special Forces training at Camp Bragg. He was also put in charge of training Bin Laden[.] personal bodyguards. It would be Ali Mohammed who first traveled to Nairobi and scouted the American Embassy - a perfect target for a suicide bomber.\n\nIn the end Ali Mohammed was finally caught in the roundup for the bombings of our embassies in Africa, as he tried to flee the U_S for Egypt. Imprisoned for eight months, he finally pled guilty in May of 1999. But, according to a 60 Minutes show broadcast in February of 2002, Mohammed was still awaiting sentencing, although no one knew where he was being held.\n\nAnd that[.] the story of the man who wrote Al Qaeda[.] training manual, double dealt the CIA and Defense Department, trained young jihadists for Bin Laden and scouted out one of our embassies in Africa for bombing. The CIA in Egypt didn't trust him, and the station in Hamburg realized he was a double agent and notified the State Department - and yet he was given free access to come to America and then allowed to join the Army[.] Special Forces.\n\nOh, and that Dr. Mu'iz that Mohammed escorted on his West Coast tour in 1993? That was really Dr. Ayman al-Zwahiri, one of the leaders of Al-Jihad, who would in time merge his group into Bin Laden[.] Al Qaeda. By the way, years later, when the FBI asked the Department of Defense for the documents pertaining to their interrogation of Mohammed, particularly those detailing when he spoke of Bin Laden and Al Qaeda, DoD said those interviews and documents had been lost. The warning lights had been flashing red from 1984 to 1998, but no one noticed they were going off."}