{"doc_id": "1698", "name": "2013_11_humanities_student_major_636_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2013-11-humanities-student-major_636_changemyview.txt", "pub_date": "2013-11-11T00:00:00Z", "Sentiment": "0.089", "Subjectivity": "0.311", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "460", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qdrzn", "Reddit_id": "cdbtep5", "Subreddit_id": "t5_2w2s8", "Commenter": "DocWatsonMD", "length": "2763", "content_scrubbed": "I sympathize with your general dissatisfaction, but simply *not teaching* these things is not the way to go. It doesn't really achieve anything other than a brief personal ego boost for what is, essentially, thinking of the children.\n\n-----------\n\nFrom a practical sense, it just wouldn't happen. If you cut philosophy departments from the public education payroll, they'll just re-brand themselves or integrate into other fields. This doesn't really change anything and only serves to create a hassle for the government, the schools, the professors, and the students. It will cost more money to implement than it would save.\n\nYou can't put blanket bans on fields of study. Determining what fields are \"useless\" is a completely subjective process. At the point where STEM enthusiasts ban public funding of philosophy, there is no reason that any powerful group could ban or defund any other field for whatever arbitrary reason, like classes on Soviet Russia or evolutionary biology. It isn't a healthy precedent to set.\n\n-----------\n\nThe important thing to realize is that no field can exist in a vacuum. If you don't believe me, go to a page on Wikipedia and click on the second link in the article that directly leads you to another Wikipeida article. Click the second link of this article, and keep doing this over again. Watch how the subject slowly changes as you click through the articles.\n\nLet[.] try Adolph Hitler as an example.\n\n* Adolph Hitler\n* Germans\n* Ethnic group\n* Identity (philosophy)\n\nOkay, I know. Some people may say that history is a cheap shot. It[.] generally considered a humanities field.\n\nIn that case, let[.] try the page for a Boeing 747.\n\n* Boeing 747\n* Airliner\n* Airline\n* Travel\n* Location (geography)\n* Point (geometry)\n* Topology\n* Connectedness\n* Topological space\n* Mathematics\n* Number\n* Counting\n* Enumeration\n* Computer science\n* Computation\n* Information processing\n* Observation\n* Data\n* Level of measurement\n* Quantitative research\n* Mathematical model\n* Mathematics (we hit a loop, so we use the first link instead)\n* Quantity\n* Magnitude\n* Order theory\n* Glossary of Order Theory\n* Lattice (order)\n* Supremum\n* Subset\n* Set (mathematics)\n* Mathematical object\n* Philosophy of mathematics\n* Philosphy\n\nTo say that philosophy does not deserve receive the support of the public education system is an absurdly short-sighted claim at best. The field of philosophy deserves to be taught in public universities just as much as any other field, as no field can exist in a vacuum.\n\n---------\n\nNow, some argue that those pursuing *degrees* in philosophy and other fields should not be eligible for public *scholarships* funded by taxpayers. However, that is a completely different debate that goes unstated in your original post."}