{"doc_id": "1682", "name": "2013_11_humanities_student_major_527_openbroke", "namespace": "we1sv2.0", "metapath": "", "pub": "openbroke", "title": "2013-11-humanities-student-major_527_openbroke.txt", "pub_date": "2013-11-08T00:00:00Z", "Sentiment": "-0.024", "Subjectivity": "0.333", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "508", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1q6de9", "Reddit_id": "cda31sg", "Subreddit_id": "t5_2whk0", "Commenter": "[deleted]", "length": "3037", "content_scrubbed": "I am one who despises Reddit and who kills their account whenever something especially despicable is found.  Had to sign up for posting a few comments to this quality post from this short-term account.\n\nStuff like this is Reddit in a nutshell and exactly why it is such a godforsaken cesspool.\n\nThe next two top level comments are both classic brocialist style statements. The first is about the methodology of the study. While this may be a valid point - skepticism is a good thing - the study isn't drawing any major conclusions.\n\n The next one is where it really gets bad, though. Sadly, it[.] from someone who I respected within Reddit[.] socialist community, so seeing them make this comment is disheartening. It[.] a long comment, but it mostly focuses on how uneven this is. Why weren't women[.] magazines included? Men get raped to! Etc, etc.\n\nReddit loves to cloak itself in a veil of science and reason and automatically assume the intellectual high ground even though it is collectively grotesquely unqualified to do so (cf. Dunning-Kruger Effect).  Unsurprisingly both terrible comments center on attacking the humanities as a system of organized study; one by imagining a statistical shortcoming and the second by rejecting the field of study because of one[.] personal reasons.  The comments are total busts: one Redditor simply does not have the required background in the field to point out methodological flaws and the other is OT.\n\n Such a comment also deals with a common tactic among the redditors we deal with: if you look at individual pieces instead of the whole, the argument is easier to dismiss. It[.] about ignoring large scale trends by dismissing individual pieces of evidence.\n\nYES!  Again, this is all part of the damnable \"STEM = space station, non-STEM = WOULD YOU LIKE FRIES WITH THAT LOLBRO\" horseshit.  Evidence and proof works a bit differently in STEM and non-STEM.  In humanities, one is dealing with terribly noisy data and the focus is on TRENDS where a single anomalous data point is nowhere near sufficient to refute the underlying theory.  In engineering and physics, things work a bit differently and one reliable anomalous experimental finding is enough to force the discipline to come up with new theories to explain them.  In the eyes of Reddit, smugly whining \"wut about teh menz? <insert stat here\" is enough to demolish feminism, since they take that as their selective data point and can \"deduce\" that the whole field is worthless.\n\nI am appalled by the Reddit-wide general level of ignorance, smugness and ego it takes to decide to deduce (from first principles) the entire fields of law, psych, economics, political science, etc and decide the established experts in those areas, who have literally spent decades reading and researching in those subjects and seeing how those fit into society as a whole, can be dismissed right off the bat by a young smug STEM-fetishist white male.  I don't think I have ever seen that degree of pride in wilful ignorance anywhere else on the internet."}