{"doc_id": "1702", "name": "2013_11_humanities_student_major_687_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2013-11-humanities-student-major_687_AskHistorians.txt", "pub_date": "2013-11-12T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.245", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "620", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qg0et", "Reddit_id": "cdci9qh", "Subreddit_id": "t5_2ssp3", "Commenter": "mgsantos", "length": "3737", "content_scrubbed": "It has to do with the reverence the world had for the French language in the 18th and 19th century, during the development of global diplomacy. Was it linked to French power before the Franco-Prussian war? Sure was, but there was also a major cult of the language itself, deemed to be the most beautiful language, the best for poetry and oratory. It has to do, when we talk about diplomacy, with the need for an international language but also with the fact that French is a language that is very elitist, it[.] very easy to tell those that use it properly, the highly educated people able to use the several verbal modes and expressions. This created an interesting phenomenon, with people around the world studying French deeply. Diplomats were, and still are, highly educated and usually connected to local aristocrats. Being Brazilian, I can tell you that all major Brazilian diplomatic figures (Rio Branco and Nabuco, for example) had a weird fascination for France and the French language. Besides that, all the king[.] courts around the world tried to emulate the French court and its golden age (Louis XIV). Many nobles in the 18th and 19th century spoke fluent French, with cases of Russian nobles that didn't even speak Russian. Portugal and Brazil had the same thing, also serving as a way to communicate in secret in front of the servants. Today, this has changed a lot, with English replacing French as the international language, including in diplomacy. The U. N. primary language is English. The E. U. primary language is English as well. French isn't going down without a fight, though. Many French institutions are lobbying to keep it as the main language in international affairs, but not as many people speak it nowadays, making it a hard task. \n\nI can't speak for other countries, but to become a diplomat in Brazil you have to take a test in Portuguese, English, French and Spanish. Until the 1970[.] French was the most important test after Portuguese, but lately English has taken that place. \n\nA good exercise is to imagine business and the U_S; words like 'networking', 'bill of landing' 'invoice' are used everyday in Brazil, China, Iraq and Zambia. One can argue, though, that English lacks the reverence that French had. French, Spanish and Portuguese speakers tend to think the English language is a poor language when compared to Latin languages. Of course this is not true, most people won't read Shakespeare or Joyce but will watch Friends and listen to One Direction. I see this in Brazil all the time: English lyrics sucks! Well, if you compare Britney Spears to Vinicius de Moraes you're bound to be disappointed with the English language.\n\nMany sources will back what I said, I don't know if there is an historic document that could be cited. Joaquim Nabuco[.] 'Minha Formacao' (Nabuco was an important Brazilian diplomat in the late 1800[.]) is useful to understand how diplomats of that era perceived the French language as one of the greatest achievements of mankind (before Russian literature began it[.] international rise, French literature was deemed superior in every sense). About Russian courts, Wikipedia is helpful: ''From the 17th to the 19th centuries, France was the leading power of Europe; thanks to this, together with the influence of the Enlightenment, French was the lingua franca of educated Europe, especially with regards to the arts, literature, and diplomacy; monarchs like Frederick II of Prussia and Catherine the Great of Russia could both not just speak and write in French, but in most excellent French. The Russian, German and Scandinavian Courts spoke French as their main or official language, regarding their national languages as the language of the peasants.'' \n"}