{"doc_id": "1792", "name": "2013_11_humanities_student_major_1526_linguistics", "namespace": "we1sv2.0", "metapath": "", "pub": "linguistics", "title": "2013-11-humanities-student-major_1526_linguistics.txt", "pub_date": "2013-11-25T00:00:00Z", "Sentiment": "0.319", "Subjectivity": "0.432", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "269", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rehyq", "Reddit_id": "cdmj8fm", "Subreddit_id": "t5_2qhos", "Commenter": "EvM", "length": "2520", "content_scrubbed": "In the Netherlands there are quite a few MAs, all of which are excellent in terms of faculty (there[.] an abundance of linguists in the Netherlands).\n\n* [Groningen](http://www. rug. nl/masters/linguistics-research/?lang=en) They have a good computational linguistics department. And it seems the Neuro-side is covered pretty well as well (see [here](http://www. rug. nl/masters/language-and-cognition-research/program)).\n\n* [Nijmegen](http://www. ru. nl/masters/program/humanities/linguistics/specialisations/general-program/) would be a good option if you go the neuro/psycho/cognitive route. Maybe slightly less so for the computational track, though there are some good people (e. g. [this guy](http://antalvandenbosch. ruhosting. nl/)). They are also close to the Donders institute & the Max Planck institute, which is great.\n\n* [Utrecht](http://www. uu. nl/university/international-students/en/linguistics/Pages/default. aspx) is oriented more towards generative linguistics, but they have great research facilities for neuro-stuff. There are some computational linguists, but less than in Groningen. Even though it is oriented more towards generative linguistics, there is a good discourse studies research group (and so there are also cognitive linguists). You might also be interested in the [artificial intelligence MA](http://www. uu. nl/university/international-students/EN/artificialintelligence/Pages/default. aspx?refer=/university/international-students/EN/programs/mastersprograms/artificialintelligence/Pages/default. aspx) as well. (N. B. similar masters are offered in Amsterdam and Nijmegen)\n\n* [Free university of Amsterdam](http://www. vu. nl/en/programs/international-masters/programs/l-m/linguistics-research/your-program-in-a-nutshell/index. asp) seems a good fit as well. Their computational linguistics department is very good I think. The other courses seem to fit your profile as well.\n\n* [University of Amsterdam](http://gsh. uva. nl/ma-programs/programs/content30/linguistics. html) I don't know much about this other than what their website says, other than that the Institute for Logic, Language and Computation has a very strong reputation.\n\n* [University of Leiden](http://hum. leiden. edu/linguistics/linguistics-research/program-linguistics-research. html). Great at historical linguistics. Cognitively oriented. I don't know much more than what their website says.\n\n(Full disclosure: I studied at the U of Utrecht. If you want to know more about that program you can ask me anytime.)"}