{"doc_id": "1693", "name": "2013_11_humanities_student_major_604_writingprompts", "namespace": "we1sv2.0", "metapath": "", "pub": "WritingPrompts", "title": "2013-11-humanities-student-major_604_WritingPrompts.txt", "pub_date": "2013-11-10T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.279", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "766", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qbzfs", "Reddit_id": "cdbiy92", "Subreddit_id": "t5_2s3nb", "Commenter": "Gorptastic", "length": "4291", "content_scrubbed": "\"Now now, students! Class is beginning now! Get to your seats, students!\" I cried, leaning out the doorway of a large lecture hall. Since it was the first day of Alphabet School, notwithstanding such a hot summer day, and also considering the fact that this lecture hall was far removed from the others on Romance Language University, most of my students were still bustling into the room.\n\nI held the door open with my upper-right hand prong, watching the various shapes and sizes of scribbles wander into my lecture hall. They gazed around them at the expanse of linguistics, of the accumulated knowledge and time of language development, and sat down. The room was quiet and smelled of dust and I strode over to the lectern to give my first speech.\n\n\"Without regard as to why you're here today,\" I began, \"Let me say I am glad you found yourselves here. As many of my students have said before, 'X marks the spot!\"\n\nA few giggles in my audience. I continued, \"I realize that most of you arrive here as mere squigglies, without a formal discipline of the Romance language (or any language) to speak of. Yet realize that, by the end of this semester course, you will understand how, why, and when to perform the invaluable function of being an X.\" I drew a giant letter X on the whiteboard behind me. \"And, as this will be an elective course for most of you, and you probably intend to become a different letter or a different language family sometime in your Alphabet experience, you will by the end of my course develop a greater appreciation for a much-underrated letter. My letter -- X.\n\n\"As you may know, I am the last X in the world. But, despite what my colleagues in the Vowels department may say about me, there is much to love about my profession. An X is mathematically precise, for example, and must have two straight lines with equal and opposing angles, slopes, and intersecting midpoints. An X is used in many graphical displays, in the fields of Physics, Economics, Chemistry, and Mathematics. If there is an equation designed to solve for an unknown variable, which letter of the Alphabet has the task of illustrating that variable?\" My voice trailed off.\n\nIt was a rhetorical question, so the lecture hall remained quiet. \"The X, of course!\" I yelled out, lifting my prongs upward in exultation. \"Though I can see I've bored some of you already. Fine,\" I said, noting some of the scribbles in the back row beginning to bob their lines in slumber. \n\n\"What about the arts? Who could enjoy the comedy of *Don Quixote* without my help? Who could play a percussion ensemble without the xylophone? And what about the saxophone? Who would appreciate the Greeks' brave stance at Thermopylae without knowing the heinous ruler Xerxes? How could the human race, your eventual employers, even survive without my help?\" There, a few more giggles in the audience. \"Yes, your human employers. Who knows what I am talking about?\"\n\n\"Sex?\" One scribble piped up. Muffled giggles. I leaned forward into my lectern and bellowed, \"YES! I'm talking about sex! Sex with a capital X! It is the first axiom of humankind, to express their existence in terms of S-E-X! Without the X it is just an S and an E, do you S-E-E what I mean now?\"\n\nI noticed a few scribbles turning to those sitting next to them, exchanging glances of amusement. A few others were still repressing giggles, and others were rolling their I[.], burying themselves within a Vowels book for another class.\n\n\"But, students,\" I continued. \"Being an X is not always easy. My instruction is disciplined, it is rigid, and you will see no curves on your exam. I have had many ex-students who came back to me and wished they paid more attention to my lectures. I won't lie to you; this is a difficult class. If exactitude is something you don't like, I suggest you take a class in Typos...\" The class burst into more laughter. Everyone knew Typos was the class students took to get an easy grade. You didn't have to be an expert on the Alphabets to know that.\n\n\"As long as you work hard and pay attention, you will excel in my class.\" I said, gazing at the expanse of students sitting before me. \"And another thing. You will have an exam on the tenth day of each month, so be prepared. With this said, who wants to learn about my job?\""}