{"doc_id": "1745", "name": "2013_11_humanities_student_major_1171_uiuc", "namespace": "we1sv2.0", "metapath": "", "pub": "UIUC", "title": "2013-11-humanities-student-major_1171_UIUC.txt", "pub_date": "2013-11-19T00:00:00Z", "Sentiment": "0.13", "Subjectivity": "0.396", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1469", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdhztpb", "Reddit_id": "cdi470y", "Subreddit_id": "t5_2qkxs", "Commenter": "Helpful_guy", "length": "8141", "content_scrubbed": "Hmm, it partially depends on what gen-eds you still need to fulfill! Personally, I always looked for courses that were mentioned in the Easy Classes group, that were also able to fulfill more than one gen-ed requirement. This gave me a lot of much-needed flexibility and helped me knock out multiple requirements at once. Obviously a lot of these courses could be different now since I took them between 1-3 years ago, but here[.] a writeup on the easier gen-eds I've personally taken, and how I feel about them.\n\nThey may not all necessarily be the easiest available, but I certainly didn't bust my ass in any of them. I'll definitely make it clear if the class had a lot of work to do.\n\n**Rhetoric**\n\nI got a relatively high ACT English score and didn't have to take Rhet 105 so unfortunately I can't tell you much about it. :/\n\n**Advanced Comp**\n\nFIRSTLY, check and make sure there isn't a required class in your major that will take care of this requirement. I know a lot of majors have the advanced comp requirement built into their curriculum, but you don't necessarily get to that course until your junior/senior year. For instance, when I was a Bio major there was at least one lab course that counted as an advanced comp due to the lengthy lab reports. In my current major there is a class on environmental writing that counts as an advanced comp AND advanced hours in my major. Anyway,\n\nBTW 250 - Business Writing - is my vote for best advanced comp class. It was very helpful and comparatively little writing. The general requirement for advanced comp classes are that they make you complete 25 pages of writing through the semester, so a lot of classes will have like five 5 page papers, or three 5 pagers and a 10 page final paper, or something similar. In here you write a few 1-2 page papers (usually due every 2 weeks or so) which knocks out a chunk, then you do resume writing activities and make a simple portfolio which also helps count towards the page requirement (meaning less actual paper writing), then class is pretty much canceled for the last month of the semester for you to work on group projects. My group project was actually the biggest paper I've ever worked on in college (it turned out to be something like 23 pages, but we had 4 guys working together) but it was actually really enjoyable, and the work was not stressful at all. Seriously recommend this class, it[.] helpful and I remember a lot from it. The resume activities were really great, they made me get my ass in gear and start working on a resume and setting goals, and the critiques you get from the teacher and students is immensely helpful.\n\n**Humanities**\n\nRLST 110 - World Religions - Counts for humanities AND either a Western or Non-Western (based on what you need) This course has supposedly changed a great deal since I took it, but it was interesting and relatively easy. There are weekly discussions with quizzes along with 2 multiple choice exams and two 4-5 page papers. **Much more work than the previous two**, but it has the added bonus of double counting as a gen-ed. There was a good amount of reading to be done, which was all partially optional if you paid attention in class. Quiz during discussion every Friday, no real homework to do other than reading, but keeping on top of all the information and doing the papers was a good bit of work.\n\nSCAN 251 - Viking Mythology - Awesome class, I totally loved it. This is another one that can double count, and it will get you historical/philosophical perspectives and Western comparative cultures credit, so if you take this in tandem with RLST 110 you can knock out your western, non-western, and 6 hours / 2 courses of humanities with two classes. The professor is a bit of a timid guy, and some people didn't really seem to like his lectures, but I thoroughly enjoyed the class as a whole. Discussion was really fun as well. There[.] a decent amount of reading to do (~2-3 chapters once or twice a week, depending on the week), but a lot of it is open to interpretation so as long as you skim it and have a general idea of what[.] going on you'll be okay. No homework, quizzes every monday, midterm/final (both of which had at least one essay portion) but no actual papers.\n\n**Social and Behavioral Sciences**\n\nANTH 180 - The Anthropology of Death - Double counts as a Western AND a social/behavioral science. Honestly I despise the professor, but **it[.] hard to find courses much easier than this.** Probably the least effort I've ever put into a class. All you do is go to lecture 2-3 days a week (30% of the time you watch TV or movies) and you're basically guaranteed an A. There[.] no book. There[.] no homework. Just occasional online readings. When I took it the only grades were the two exams and a very small \"project\". I'm talking a paragraph of writing and a doodle. The exams were mostly multiple choice, but the bitch professor made like half the questions extremely easy, but over material you would only know if you had been in class. e. g. \"What was the TV show about that we watched during the lecture on cemeteries?\" Pretty much the whole point of the class is she likes talking and wants to be listened to. If you come to class and listen to her you'll get a free A in a 3 credit hour course.\n\nSOC 100 - Intro to Sociology - It was a total joke when I took it 3 years ago. You can get by never going to class. I (along with a few hundred other kids) probably went to lecture about 4 times through the semester after realizing the professor was just reading from his slides and he posted them online anyway. Just 2 exams and a 5 page paper + discussion attendance+participation. The grade was split something like 50% exams, 20% paper, 30% discussion attendance. I didn't even buy the books, I just borrowed them from a friend twice a semester and crammed the night before the exam. It was a joke, really.\n\nGEOG 105 - Geography of Technology - Was super easy when I took it but it has a different teacher now. You learn a lot of really basic GIS stuff, which is pretty neat, and for the lab section you do some neat little projects with the Google maps API. But again, the teacher for this course now is professor Robinson, who teaches a lot of advanced Geography/GIS courses, so I'm not really sure what the course is like anymore. I can't imagine it[.] much work though.\n\n**Natural Science and Technology**\n\nI used to be an MCB major so I didn't really have to worry about this section. I APed out of MCB and IB 150 so I can't really tell you what they're like, but I've been told IB 150 and 105 are really easy. I think IB 105 online is probably your best bet for super simple natural science credit. Chem 101 would also be really easy for you if you have prior chem experience. Gretchen Adams is an amazing teacher.\n\n**Western Comparative Culture**\n\nSee: ANTH 180, SCAN 251, RLST 110\n\n**Non-Western**\n\nSee: RLST 110. I haven't found many non-westerns that sound much easier.\n\n**Quantitative Reasoning 1**\n\nSTAT 100 - Intro to statistics - (Only with Fireman) another class everyone knows about. SUPER easy QR1 credit. If you're even half good at basic math you'll probably demolish all the exams. iirc the homework is optional and attendance is extra credit. I am hardly comfortable with my math skills and I napped through most of the lectures and got an A. Not much else to say about this class except that Fireman is a fun teacher. She also looks DAMN good for how old she is.\n\n**Quantitative Reasoning 2**\n\nATMS 120 - Severe and Hazardous Weather - (Only with Snodgrass) Fulfills a QR2 requirement for **very little** work compared to your other alternatives! Obvious class that everyone knows about. Very enjoyable and super easy. While there is a bit of weekly homework involved, it[.] always super easy, and the lectures are more enjoyable than a majority of gen-eds. The exams were also all online/open note. There[.] also an extra credit assignment pretty much every week, so you have potential to do very well in the class with a bit of effort. Only downside is you have to purchase the book/code brand new and it[.] over $100. (at least when I took it)"}