{"doc_id": "1726", "name": "2013_11_humanities_student_major_1012_trueaskreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueAskReddit", "title": "2013-11-humanities-student-major_1012_TrueAskReddit.txt", "pub_date": "2013-11-16T00:00:00Z", "Sentiment": "0.025", "Subjectivity": "0.364", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "400", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qsp3p", "Reddit_id": "cdg6q2r", "Subreddit_id": "t5_2s91q", "Commenter": "gcwyodave", "length": "2240", "content_scrubbed": "I grew up in a town in Northern Arizona.  We had about 1400 people.  Our school was K-12 and had 320 or so students total, about 80 in the high school (9-12) section.  We had no football team because there weren't enough guys in the school.  Our soccer team was co-ed.  I played baseball, but we couldn't field a team our senior year because only 8 guys wanted to play.  You wanted to see a movie, get groceries, go to Target/Wal-Mart, or see anything resembling a city?  Yeah, 90 minute drive, son, get on it.\n\nSchool:  Everyone was super close.  The only \"cliques\" were racial boundaries (whites, hispanics, natives).  I still, 10 years later, regularly communicate with most of my graduating class.  That class had 27 kids in it, 5 of which were females.  So, needless to say, my first girlfriend was a college girlfriend.  I like being from a small school.  We had each other, and that was it.  College hit like a ton of bricks, though.  Since we didn't have AP, or honors, or anything, I floated through high school pulling down mostly As without even trying.  I thought I could pull that in college.  It took me 5 years to graduate college with a shit GPA because that first year just crippled me.\n\nLong commutes don't bother me.  I lived in southern Cal. for a couple of years and people would freak out about driving over 50 miles for something. It was SO FAR.  Yeah, I'd drive 180 miles round trip to put gas in my car because I was bored growing up.\n\nWe didn't have shit to do for fun, so those of us that didn't turn to drugs perfected the arts of dicking around in the woods, blowing things up, building campfires, and general hooliganism.\n\nNowadays, I fit in pretty much anywhere with ease.  However, whenever I'm in a city, there[.] this pretty consistent feeling of claustrophobia.  It[.] pretty easy to get overwhelmed in crowds.  I've had a couple of panic attacks  in the past at music festivals, or trying to ride a super-packed subway somewhere back east.\n\n10 years on, almost literally everyone I know, including my parents, teachers, friends, and friends' parents have packed up and moved somewhere else.  I haven't been \"home\" in years.  Some days I miss it like crazy, but mostly it[.] good to be the hell out of there."}