{"doc_id": "1653", "name": "2013_11_humanities_student_major_258_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2013-11-humanities-student-major_258_changemyview.txt", "pub_date": "2013-11-04T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.328", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "327", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pwwl3", "Reddit_id": "cd6w6xt", "Subreddit_id": "t5_2w2s8", "Commenter": "hamoboy", "length": "2084", "content_scrubbed": "On a different yet relatable note, I don't think having an internationally diverse student body is important\n\nActually, that opinon of yours is not shared by most universities and is in large part the reason behind universities marketing to foreign students. One of the main goals of a university education, especially at a liberal_arts college,is to help their students become well-rounded, informed citizens and scholars. A good way to foster this is to meet and study alongside people from diverse backgrounds, who would, presumably, bring with them a diverse set of opinons and life experiences to apply to the process of university education.\n\n(I do however think a nationally diverse student body is.)\n\nSurely if you can see the benefit for diversity *within* your country, you could see the same benefits for interacting with people from *outside* your country.\n\nHowever, these benefits that international students bring to universities are not realized spontaeneously. Like had been covered in the previous CMV, large groups of foreign students from one place tend to form insular groups, with little interaction between them and the local students. This negates any possible benefit both parties could be receiving from forming friendships and inter-cultural understanding between them.\n\nI suppose then that what would be most beneficial for both local students and international students is that universities admit a more diverse range of international students, rather than large blocks from one country or another, and have processes or services in place to facilitate and encourage the foreign and local students to socialize and realize the maximium benefits that meeting people different from you can being about.\n\nI know that at my uni, exchange students and international students had a series of events and social gatherings specifically to aid in their integration into the uni community, and meeting and befriending the local students. It was quite succesful, and I believe it benefited my uni experience, getting to meet people from Europe, Asia and other places."}