{"doc_id": "1632", "name": "2013_11_humanities_student_major_98_photography", "namespace": "we1sv2.0", "metapath": "", "pub": "photography", "title": "2013-11-humanities-student-major_98_photography.txt", "pub_date": "2013-11-01T00:00:00Z", "Sentiment": "0.035", "Subjectivity": "0.287", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "458", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1posi4", "Reddit_id": "cd4z9po", "Subreddit_id": "t5_2qh2a", "Commenter": "CondescendingRoman", "length": "2599", "content_scrubbed": "I happen to have had the pleasure of knowing the teacher mentioned in the article. She was an art teacher at the school where she taught. The entire student body, about 1000 girls, absolutely loved her. She was, without a doubt, phenomenal.\n\nOn the night she passed, the school had a Winter arts showcase going on. During intermission she stepped out to take some pictures. No one really thought much of it when she didn't come back. Next day, news comes out that she was killed. Story goes like the article says, there were two trains. A train hit her from behind as she tried to take pictures of the oncoming train. She had a husband, three kids, and hundreds of girls that looked up to her.\n\nFor a while, the atmosphere of the school was depressing. Girls wore orange scarves in memory of her. A poster went up in the arts building until halfway through Spring semester. Every single art project for the rest of the year was dedicated to her.\n\nI've never read a post mortem about someone I knew.\n\nOne lady died, and now she[.] another warning to not taking photographs on train tracks. Reading that article was so strange to me; Mrs. Carlisle was mentioned as an afterthought, probably from the author Googling \"[photographer train death](http://www. google. com/search?q=photographer+train+death),\" because it[.] the first thing that show up. It[.] strange to see her death brought up on some random blog. The moment before I clicked the link, I had some sinking feeling that her name would show up in the article.\n\nI'm not a photographer, I just like taking pictures. But I have to say, even though I haven't thought about her for months, not taking pictures near train tracks has been burned into my mind because of her. I was enlisted to take some prom photos for my friends on some decommissioned rail line. By the time we left for the dance, everyone was annoyed by me asking \"Okay, you're sure there[.] no train coming?\" Now, I take rapid transit from my univeristy into the city every now and then and I occasionally seem someone leaning over the tracks with a cell phone trying to get a \"cool\" picture of the oncoming train. \n\nI don't really know where I'm going with this. Don't take pictures near trains, I guess. If the worst happens, you end up affecting everyone around you. It[.] illegal, yeah. The pictures aren't the best and it[.] a bitch cliche. Wonderful. But in the end, if you pay the ultimate price for trying to get a picture with some nice leading lines, you cause a butterfly effect that ends up in some college freshman trying to tell the story of his friends' teacher[.] death."}