{"doc_id": "1713", "name": "2013_11_humanities_student_major_794_annarbor", "namespace": "we1sv2.0", "metapath": "", "pub": "AnnArbor", "title": "2013-11-humanities-student-major_794_AnnArbor.txt", "pub_date": "2013-11-13T00:00:00Z", "Sentiment": "0.064", "Subjectivity": "0.293", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "495", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qj9qy", "Reddit_id": "cddpkxx", "Subreddit_id": "t5_2r5tm", "Commenter": "MilkyVillager", "length": "3080", "content_scrubbed": "I work with the Michigan Theater and have been hearing all kinds of truths and rumors since the MLive article was published. Let me clear up some of the misconceptions that I read in the article and that I'm reading in this thread:\n\nDISCLAIMER: These statements are in no way official statements of the Michigan Theater Foundation. These statements are meant only for personal, general clarification of common misconceptions regarding the rumors surrounding State Theater.\n\n1) The film programming for the State has been handled by the Michigan Theater programming department since 1997. If it seems like they receive the Michigan[.] leftovers, well, they do. Film distribution deals sometimes entail that we need to run a movie sometimes up to 2 months. Without the State Theater screens, we are at a disadvantage of getting movies such as \"Blue Jasmine\" or \"12 Years a Slave.\"\n\n2) Because we rely on the State for our programming, the Michigan gifted the State a digital projector not too long ago. Mr. Chaconas was only slightly correct when he mentioned in the article that \"it[.] doing a little better than it has been but not well enough to upgrade to digital projectors.\" They could not afford them on their own, but do have a digital projector in place.\n\n3) Currently, renovations of the space stand at an extraordinary price. The building was grandfathered in when the Americans with Disabilities Act was passed in 1990. Any major upgrades to the facilities would require, by law, for the installation of an elevator for handicap access. The cost of such a project would be upwards of $200,000 dollars.\n\n4) Mr. Chaconas mentioned in the article that \"We may work something out with the Michigan Theater and let them take it over.\" This has been presented to the Michigan Theater foundation before and has been a project on the back burner since we assumed programming duties in 1997. It is feasible and a possibility, but could also prove too challenging to come out successfully.\n\nWhen the Michigan was saved in the late 70[.], it was through generous\nphilanthropic gifts of large sums of money, not through successful operation. Heck, the most profitable thing the Michigan could do is turn our entire space into retail and office space, but we don't. Our mission is to preserve, restore, and operate the Michigan Theater facilities for the benefit of the community and the arts. We depend on help from the community with both moral and monetary support.\n\nIf you don't want to witness the demise of the State Theater, please contact our local [Historic Preservation Society](http://www. a2gov. org/government/communityservices/planninganddevelopment/historicpreservation/Pages/Historic%20District%20Commission%20Main%20Page. aspx) and voice your concerns about the project.\n\nRemember, this renovation project is not by any means on the fast-track. There is time for everyone involved to mull over options and give their opinions on the project. If you are concerned about losing the State, I encourage you to do something even if it only means seeing a movie on Friday night!"}