{"doc_id": "1640", "name": "2013_11_humanities_student_major_160_intp", "namespace": "we1sv2.0", "metapath": "", "pub": "INTP", "title": "2013-11-humanities-student-major_160_INTP.txt", "pub_date": "2013-11-02T00:00:00Z", "Sentiment": "-0.016", "Subjectivity": "0.281", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "487", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pqwpt", "Reddit_id": "cd5g05z", "Subreddit_id": "t5_2qhvl", "Commenter": "zootphen", "length": "2572", "content_scrubbed": "Warning, woe is me.\n\n\nI'm an ADHD INTP and a stoner.\nI had a horrible time in high school because the type of school I went to before was so completely different.  I was homeschooled until 3rd grade, when I was put into an artsy waldorf-charter school with classes like knitting, sculpting, japanese, science music and art. The teachers there were all really lax and they carted about their students, so I got shit done but never really learned great work habits. In 9th grade I was sent to a humanities magnet at a local public high school. I was having a horribly difficult time in the classes because I didn't even know how to take notes the \"right way\" so that alone failed me out of one class and had 5 times more homework than I could even consider completing.\n\nA little more than half way into the year, I'm falling every class except for English ( I am an avid reader and had read hundreds of books before I was 15) and Biology. \nI slip by and graduate due to having the A[.] from those two classes to balance out all of my D[.].\n\n\nSo 10th grade, dropped into another school year with basically the same classes except now with honors English... The teachers treat me like Crap because they think I'm falling the classes on purpose. I dropped out that year and started smoking the pots.\n\nI moved to an independent schooling program and did alright for a while. But I didn't have the determination to be able to do the required work every week. So I stayed in that program for 3 years skating by on a couple of hours of work a week. Now here I am in the 3rd year of that, still technically a 9th grader, stressing myself out to the point of skipping my one day of school a week (I think I just slipped like, my 6th week in a row). I'm just waiting for truancy officers to come knocking at my door...\n\nWhen I'm not feeling horrible about my failures in the public school system, I do stuff I enjoy. I watch recorded lectures on stuff I'm interested in from  the best schools in the (English speaking) world, I cook awesome dinners for my family, bake, listen to music, play videogames,  and hang out with my 2 good friends. \n\n\nI don't know what to do with myself, I've dug myself such a deep hole, my fucking shovel is broken. \n \n\nI have no goals, I tell myself I'll take the ged eventually, but I just haven't because I've gotten so sick and tired of taking the same classes over and over again every year to the point where I just don't care.\n\nSo yeah, fun times... \nI don't know, I guess I have hope that I'll figure it out, I just don't know where to go from here."}