{"doc_id": "1822", "name": "2013_11_humanities_student_major_1761_programming", "namespace": "we1sv2.0", "metapath": "", "pub": "programming", "title": "2013-11-humanities-student-major_1761_programming.txt", "pub_date": "2013-11-28T00:00:00Z", "Sentiment": "0.12", "Subjectivity": "0.351", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "271", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdov8ri", "Reddit_id": "cdpb002", "Subreddit_id": "t5_2fwo", "Commenter": "IConrad", "length": "1630", "content_scrubbed": "  Usually, they are highly qualified but extremely cheap labor. \n\nAs humanities_major?  I'm sorry, but I live in the *real* world. And this just isn't true. At best in terms of productivity humanities_major will be doing work that is equivalent to untrained unskilled labor, by and large. (There are a few very rare exceptions but they're not worth considering here in general.)\n\n Their position in the job market is best described as somewhere between a rock and a hard place,\n\nYes, because even with their exceptional investment in their education, their work qualifications are indistinguishable from the same skillset required to ask, \"Do you want fries with that?\"\n\nNot to say that most STEM grads are really any better off. But there[.] a *qualitative* difference between the things a humanities major[.] internship will be asking of him as opposed to the things a programming grad[.] internship will be asking of him.  A humanities major will be spending time as a gofer, or else personal assistant; observing the life and work environment and politics of the field.  A programming major or architectural engineering major on the other hand will be putting their hands in on actual projects; producing actual goods and services for clients.\n\nThe presence or non-presence of the degree makes no difference in the quality of work provided by a PA to a professor or newscaster.  It does, however, make a vast degree of difference to the architectural designer or the code monkey peon. \n\nAnd that[.] why one gets paid while the other doesn't; the former *is already working* -- whereas the latter is *still learning how to work*."}