{"doc_id": "1687", "name": "2013_11_humanities_student_major_553_uwaterloo", "namespace": "we1sv2.0", "metapath": "", "pub": "uwaterloo", "title": "2013-11-humanities-student-major_553_uwaterloo.txt", "pub_date": "2013-11-09T00:00:00Z", "Sentiment": "0.173", "Subjectivity": "0.42", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "433", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1q9ncg", "Reddit_id": "cdan0uy", "Subreddit_id": "t5_2rb5s", "Commenter": "GreyPebbles", "length": "2539", "content_scrubbed": "I used to be in UW Architecture.\n\nGetting into this program is not as straight forward as getting into programs that just require grades, extra-curriculars and some written material on an application. The interview and precis exam are very important, if you get to that stage. Grades, on the other hand, don't seems as important for this program as they do for engineering programs. Once your grades and application get you to the interview&precis stage, I don't think they have much of an influence anymore. The professors and other faculty members then personally pick each student based on other criteria like your creative thinking and passion. \n\nFor the interview, prepare to show them the best of your creative abilities. It[.] common to bring a visual portfolio, but you don't have to. I had classmates in the program who performed music during the interview for the main content of their \"portfolio\". It doesn't have to be something in the arts either. They are very open-minded. They're friendly (from my experience) but they may stump you with some unexpected questions. I wouldn't expect them to ask anything technical, but rather opinion based questions to get a sense of how you think. Try not to be nervous during the interview, maybe by getting some practice beforehand. Also, be yourself, and show that you're enthusiastic about the program. I advise you to try to get to know more about the program and try to understand what they value.\n\nFor the precis, my only advice is to practice beforehand and time yourself. Practice on all sorts of literature, especially philosophical literature. I can't say what type of literature you will get for the precis, but I'm willing to bet [Robert Jan van Pelt](http://en. wikipedia. org/wiki/Robert_Jan_van_Pelt) is in charge of it. The piece I got was on irony and sarcasm. Personally, I felt like the precis was a lot harder than the interview because I couldn't understand all of it and couldn't gauge how well I was doing. \n\nWhether it[.] worth doing your undergrad here depends on what you want to get out of your undergrad. There are some amazing things to learn and be exposed to in this program and I feel very lucky to have been accepted. The reason I switched out was because I realized that I don't want to be an architect for life. If I was only concerned about my education, I would have stayed in the program, but for career-related preferences, I switched to civil engineering. So, it comes down to what you want out of your undergrad and what you want for your future."}