{"doc_id": "1738", "name": "2013_11_humanities_student_major_1123_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2013-11-humanities-student-major_1123_explainlikeimfive.txt", "pub_date": "2013-11-18T00:00:00Z", "Sentiment": "0.021", "Subjectivity": "0.299", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "256", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qwsu9", "Reddit_id": "cdhiva5", "Subreddit_id": "t5_2sokd", "Commenter": "wbader", "length": "1467", "content_scrubbed": "Generally historians wont call them the 'Dark Ages', 'Early Middle Ages' is preferred.  Many of the common legends about the age as one without education, short life spans and constant war are not true.  \n\nThe Church was the center of learning and a major patron of the arts.  Education among lay people was reduced for some time but was already being revived during this period.  The Church also wasn't as anti-science as people make them out to be and some better understanding of the natural world was worked out by monks.\n\nThere was generally less war during this period as no central government meant no one could mobilize large armies.  Without as much long distance trade armies couldn't stay in the field as long.  Wars tended to be short and less deadly than during Roman times.\n\nOne measure people like to use is average life expectancy, which I always have found to be misleading.  while life expectancy may have only been in the 30s but that is due to high death rate among infants and children, once you were an adult you could expect to live into your sixties.\n\nTo directly answer the question though, Rome collapsed due to combination of factors mostly by economic collapse, cultural drift and civil war.  This was mostly due to the influx of 'barbarians' from the east but nothing is ever that simple.  That is about the extent of my knowledge of it all.  You probably could get a good answer from r/askhistorians, but don't call them the 'Dark Ages'."}