{"doc_id": "1785", "name": "2013_11_humanities_student_major_1480_criticaltheory", "namespace": "we1sv2.0", "metapath": "", "pub": "CriticalTheory", "title": "2013-11-humanities-student-major_1480_CriticalTheory.txt", "pub_date": "2013-11-24T00:00:00Z", "Sentiment": "0.104", "Subjectivity": "0.446", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "572", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdlmz7y", "Reddit_id": "cdluoap", "Subreddit_id": "t5_2tmcb", "Commenter": "yyiiii", "length": "3523", "content_scrubbed": "Some interesting questions. I've never read Adbusters, thanks for the info. I think you are partly right. I would say dropping names act as an anchor, but I wouldn't say it serves as shield from critique, after all you just critiqued the piece in your comment, and I'm about to do the same now, ostensibly, if Franco were to read these comments, he could respond to them and the conversation would continue... indefinitely.\n\nIn the information age, anchoring written argument to historically powerful or popular author[.] is akin to dropping breadcrumbs as you pick your way through a jungle. If the writing is clear, the argument speaks for itself while the names dropped serve as de facto hyperlinks to further elaboration and knowledge- or another way, as silent support from a really savvy peanut gallery that can be accessed at any time by anyone curious enough to input the author[.] name into wikipedia or google: \n\n*Hmm, googling 'Barthes'.. hmm, wikipedia says he was a [.]emiotician' what the hell is that... read, read, read, aha! now I know some interesting things, back to my life as a _____ (insert non-academic occupation here)*\n\nIn academia this practice has been the standardize over hundreds of years, it[.] what makes academic writing [.]cholarly', but it[.] also been super restrictive and stifling for people (nascent academics specifically) to use and apply to their everyday lives. Threats of plagarization excommunication, and intellectual anxiety of the merit of ones own ideas ideas, has facilitated a kind of neurotic obsession with citation and decorum, and what has happened, in my experience, is an ossifying circle jerk of 'new' ideas echoing, reorganizing and reframing hstorical ideas in order to get said ideas published and approved by a myopic group of 'peers' in an effort to (understandably) secure professional employment and economic stability in a career as an academic. But today those careers are scant, getting one doesn't even really emancipate you from economic disparity, and on top of that the scholarship this stressful process has produced is well argued, well cited and well liked by minority groups of similarly minded academics that it is inaccessible, unproductive and essentially useless to the vast majority of the world. And in the 'Humanities', where humanity is supposedly the modus operandi of study, this seems like a bit of a bad joke.\n\nPart of the reason I shared the link is because it was written by a 'celebrity' (doing his PhD at Yale) and because of its accessibility to a wide and general audience (readers of Vice), partly because of the author[.] identification and partly because of the nature of the writing. I think critical theory specifically, and academic Humanities in general, suffers from a historical privilege to epistemological access that has limited it[.] efficacy and utility to the world at large- to humanity. Today this privilege is becoming irrelevant via the Internet. \n\nI think that scholars today are burdened with the responsibility of making what they learn in academic institutions accessible to everyone and freeing it from the festering ivory tower which it has been sequestered to-while maintaining rigorous conceptual analysis. In order to benefit as many people as possible, Humanities scholarship (for lack of a better term) has to first be useful to the person producing it (Franco, being a celebrity, is no doubt intimately aquainted with the concept and effects of myth) and then accessible to as much of humanity as possible."}