{"doc_id": "1628", "name": "2013_11_humanities_student_major_46_drugs", "namespace": "we1sv2.0", "metapath": "", "pub": "Drugs", "title": "2013-11-humanities-student-major_46_Drugs.txt", "pub_date": "2013-11-01T00:00:00Z", "Sentiment": "-0.014", "Subjectivity": "0.466", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "2042", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd41uxs", "Reddit_id": "cd4ijkw", "Subreddit_id": "t5_2qh7l", "Commenter": "DiDon15", "length": "11439", "content_scrubbed": "When I was a freshman in college, there was a six month long Undercover DEA operation at my school of only 1200 students. Of course, it was mostly privileged white kids with a pension for partying, but it was a very closed environment and the biggest operators were still small time in the grand scheme of things. The narc they employed did it because he had been involved in a DUI manslaughter case where his girlfriend was killed when he wrecked... so he did this to avoid more serious charges.\n\nWell, he ended up getting 19 kids. Only one individual fought the charges, used a public defender, and had only sold the narc a half eighth of weed. He wasnt even a drug dealer, the guy just asked him to help him out, and being the kind dude he was, he ran down the hall and grabbed a sack from someone who sold maybe an ounce or two a month. He ended up getting 9. 5 months in the fed pen. Longest sentence out of all the cases and one of 5 to spend time in jail. The other four were involved in a what was a relatively large cocaine operation for the size of the campus. Each was found with 10s of grams or more, and multiple thousands of dollars stashed away. You know the risk you run when you do that, but just running down the hall and doing someone a favor shouldn't warrant a serious length of incarceration.\n\nThe narc went on to be involved in two more duis. A group of us ran into him two summers later at a party, and he got his, but the damage had been done. My buddy ultimately served his time, came back to school, and got his degree, but fuck the DEA for abusing their power.\n\n**Edit to add:\nIt[.] been a long time since the event took place, and I ended up chatting on the phone with a roommate and best friend of mine from school. He reminded me that it ultimately surfaced through reliable and trustworthy administrators and town officials (it was a very small, rural area. Two colleges were the biggest employers.) that the motivation behind the raid was essentially a political land grab. An individual running against the incumbent for the sheriff position was well connected politically and well off financially orchestrated the whole event to undermine both the sheriff and the other individual in the race, the lead campus officer at my school. Cool guy, actually. \n\nAfter that experience, my own experiences in court, a liberal_arts education focused in economics and political science, and experiencing a bit of real world shit I'm left sitting here feeling totally jaded towards the whole American machine. Here we are, a country with the greatest potential that the world, possibly the entire universe, has ever seen. And we're fucking it up. The war on drugs is but a drop in the barrel. Thinking about what our future economic potential would be if we diverted the funds waste fully spent on the totally unsuccessful attempt to eradicate drugs just makes me sick! As is, our future kids, the little sperms swimming around my testes, are totally fucked. But, shit, we've got a government that[.] based on connections, wealth, and, while there are outliers, family heritage. The individuals that fill these rolls are often narcissistic megalomaniacs who are immune to criticism and have little regard for the rules they impose over others. Who the fuck else would want to do a thankless job where people not only ridicule you on a regular basis, but threaten, and sometimes succeed in killing you. Fuck that. I won't even get into the whole wealth disparity issue. Jesus Christ. I'm a fond admirer of the idealists who laid the framework for capitalism, Adam Smith, Hume and those who forged the way for liberalism and enlightened the world with what had the potential to be a try unique and effective democratic process, Locke, Jefferson, and Hamilton. At first you may think, well fuck these retards because they forgot that we as humans will ultimately be just as ruthless as any animal, but, no, many of them warned us of exactly what would come to pass in clear terms. We've sure as hell fucked that one up. Build a central bank, the politicians argued, it'll be wonderful, they said. Wrong. That shit turned into a giant Ponzi scheme and has the entire game rigged. You can do that with immense power, especially in the form of control of the largest reserve currency worldwide. Yes, I do know that shit was corrupt as fuck prior to this, and appreciate moving forward, even if just a baby, baby step.\n\nGo to war, because, well the first world one was necessary. The melting pot was still strong, and growing stronger with new immigrants coming to start a new life in America by the thousands daily. These people had real connection to what was going on. So the public interest was there. The threat of becoming the little bitch that almost did was there. We had just emerged as a nation from a bloody civil war, and were still settling the nation. Time to prove ourselves! Gotta pay for it, though. Ah! Yes! Man, we sure lucked out creating that federal reserve thing, cause we can use that to fund the war! A bond here, a bond there, we'll pay em back later. Sure... of course we'll debase the currency a bit, but this is our chance, and we won't make it a regular thing! A decent gamble. It works. The second go round, we had to get all up in that shit cause those motherfuckers attacked the shit out of a very important piece of our military infrastructure at the time. Sure as fuck aren't gonna let ourselves be the little bitch again. Oh, and this shit is gonna get real, too. They're gonna regret the fuck out if that one. And we sucker punch two cities, civilians and all, with two of the biggest weapons ever created. We emerge victorious. It pays off big, and our country begins to take a turn for the top tier. We got some momentum, we're the baddest motherfuckers on the playground... oh, and by some stroke of awesome luck we're the worlds leading oil producers. Ain't that some incredible shit. America: the land of plenty and opportunity. Oh, but lets definitely start a clandestine spy agency to advance our now imperialistic ideals. Dude... brilliant! Oh... dudes, global communications are a big deal with space and shit taking off! we gotta monitor that shit too. Vietnam was pretty fucked, but hey, fewer casualties than either of those other wars. We were trying to do the_right thing, right? And those damn soviets, fucking eyeing us like we're some kinda pussy. I dunno, didnt that Dwight dude warn us about the American war machine and how it might grow out of control recently? Nah, fuck that guy, he[.] got no clue what he[.] talking about. Whelp, nuclear standoff in full force. Didn't some Orwell guy warn us about a \"cold war\" recently? Hey, at least the flower child generation protested the heck out of that shit and introduced our great country to awesome psychedelic drugs, an interesting generation of philosophers, and the fucking grateful dead. Hell yes! No, I'm seriously not being snarky, facetious, or sarcastic. That is some righteous shit in our history right there! And we went to the motherfucking moon. Holy shit. We stepped foot on an alien body in outer fucking space. Dude, we've just recently completed the first worldwide flight a couple decades before. That[.] some mother fucking serious advancement. Had to whoop the Soviets, though. Can't be a little bitch. We'll hit that red button if you make a move mother fuckers. Fuck yeah nuclear winter! We got that shit, bring it on.\n\nWe freak out about oil production in the 70[.], bc we're no longer at peak production, and haven't been for a decade or so. Time to lock that shit down! Thus begin the oil wars and the reign if the big banks, who have now fully taken control of the potential profits the protection if the central bank provides, and are beginning to exploit the fuck out of that shit. They become the most powerful men in the room, and call the shots. Awww shit, the disenfranchised blacks we did a poor job ushering out of the era of segregation are freaking us out a bit with that crack and gang shit. Time to ramp that war on drugs up and just say no. Oh, and fuck yeah ending that cold war!! Ha, take that soviet scum! The 90[.] were actually pretty cool. Sure, some fucked up shit was still going on behind the scenes with the banks, but that crafty son of a bitch bill Clinton left us with a surplus. Guess getting blown by an intern here and there is still pretty good as long as you don't get impeached. And the braves had the greatest pitching staff in the history of baseball, and won the ship. \n\nOh fuck, these Arab mother fuckers have come over here on our turf and fucked with our tallest fucking building on some more kamikaze shit. Aw naw, that shit ain't gonna fly. We're bout to fuck your shit up! Thus provides the perfect opportunity to capitalize on another vague war, \"the war on terror.\" Some fantastic coincidence led to the_right people being in the_right places to make some serious fucking moolah. War machine turnt up to 11. For the record, I enjoy entertaining conspiracy theories here and there, but have a decent grip on what is out in left field, what is simply plausible and what may have actually happened.  There are still some sketchy things from 9/11 that totally bother me. I won't get into it, but the whole story is undoubtedly juicer than we are led to believe. But those al Qaeda peeps were pissed off because of some shit we set into motion and, fuck, we'd sure as shit be pissed if hundreds of thousands of our regional natives were buttfucked by the US quest to protect the reserve currency. We made some horrible decisions about who we propped into power, and its really coming back to bite us in the ass hard these days. Unable to see past the propaganda machine, likely too dumb/simple/naive, most folks don't realize the goal of senor Osama was to financially ruin us via a game of cat and mouse knowing full well we would react with the force of a thousand suns. The national pride will swell, our track record has us cocky, and how could we resist earning some serious moolah??? What could go wrong? In an atomic clusterfuck, everything. War debases the dollar. Housing market crashes cause we were too caught up in profits to recognize that we were giving loans to people who couldn't afford them, then bundling them together, and selling them as safe investments. Alan Greenspan has to sit in front of congress and say that everything he thought he knew about the way the world worked was wrong. That[.] humbling. And now were rotting from the inside out, controlled by a political system rigged by a gerrymandering scheme that is ignored by everyone, and controlled by a group of individuals owned by big interest lobbyists. Government for the people, by the people, right? Every great super power in the history of mankind, and there were some impressive beasts in the past, has fallen. Almost always due to overextension of ones resources in the quest for imperialistic gain ultimately creating a society based upon greed and gluttony. A tale as old as time, and one that isn't going to stop with us. It[.] just a matter of when. \n\nThe Wheel of Time turns, and ages come and pass, leaving memories that become legend. Legends fade to myth, and even myth is long forgotten when the Age that gave it birth comes again.\n \nSorry for the diatribe. I'm pissed off about a lot, and r/rage deserves it[.] money[.] worth. Thanks for your time. Sorry for wasting it."}