{"doc_id": "1804", "name": "2013_11_humanities_student_major_1623_utulsa", "namespace": "we1sv2.0", "metapath": "", "pub": "utulsa", "title": "2013-11-humanities-student-major_1623_utulsa.txt", "pub_date": "2013-11-26T00:00:00Z", "Sentiment": "0.187", "Subjectivity": "0.34", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "647", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1riuzr", "Reddit_id": "cdnon1x", "Subreddit_id": "t5_2sh23", "Commenter": "christian-mann", "length": "4095", "content_scrubbed": "*Remainder of the letter:*\n\n**Faculty and Programs**  \nWith growing student enrollments, it is imperative that TU keep pace with faculty hiring.   In August 2013, we welcomed 35 outstanding new faculty to our academic community, bringing the total number of regular full-time TU faculty to 336.  TUs undergraduate (headcount) student-to-faculty ratio remains an enviable 11 to one.  Because of our commitment to maintain a low student-to-faculty ratio, the majority of TU classes (62. 8%) continue to have enrollments of 20 or fewer students, and only 29 classes have enrollments of 50 or greater.  As we continue to experience enrollment growth in the future, attending to these key metrics that describe our learning environment will be important barometers of the universitys ongoing commitment to a TU education that is characterized by face-to-face instruction delivered by accomplished and experienced faculty members to able and motivated students in small group settings.\n \nPositively contributing to this will be the addition of 5 new faculty members to the TU teaching ranks systematically over the next several years. As part of the Tulsa School of Community Medicine partnership between TU and the University of Oklahoma, the Oxley Foundation is providing $15 million over the next four years to TU to establish faculty positions in one or more of the following fields: basic sciences, chemistry, medical, social_sciences, communication disorders, bioinformatics, medical law ethics or other associated disciplines. Recent changes in the TSCM model have resulted in TUs role now being one of a contract for services provider, a model very similar to the highly successful Physician Assistant partnership we have had with OU for the last six years. When not contracted to teach basic science courses at the TSCM, these new TU faculty members will assume teaching responsibilities and advance research initiatives on our campus. We expect to hire the first faculty member by the fall of 2014.\n\nThe depth and richness of our academic programs continue to evolve.  The humanities departments in Kendall College have brought forward an exciting new proposal to create an interdisciplinary humanities center that will be called the Oklahoma Center for the Humanities. The new center will foster collaborative interdisciplinary teaching and research, initiate colloquia and symposia, provide a platform for visiting lecturers and a voice for the our humanities departments to continue the great conversation around ideas that are vital to a healthy and functioning civil society.  It will also deepen TUs commitment to the Modernist Journals Project, a collaborative project between Brown University and The University of Tulsa.\n \nAnother significant effort to broaden and deepen our curriculum has come from our colleagues in the College of Law.  Since the summer, the dean and the faculty have been working to develop an undergraduate law curriculum that will be initiated through the offering of undergraduate block courses.  I am hopeful that one or two of these new offerings will be approved by the curriculum committee this spring and can be taught as undergraduate block courses for the first time in the fall of 2014.  The kind of initiative and creativity shown by the law faculty in this endeavor should remind all of us just how a dynamic university grows, changes, and adapts while maintaining fealty to foundational ideasin this case ideas that deal with systems of laws and concepts of fairness and justice. \n \n**Thanks to You**  \nThere is much more I could write about other projects and initiatives that are underway at TU, but my campus update is already overly long.  William Blake said, The thankful receiver bears a plentiful harvest.  No where is this more true than at The University of Tulsa. Thank you also for the role you play at our great university be it as student, staff, or faculty.  Our future is bright indeed, and working together we can continue to enhance the educational impact of The University of Tulsa.  Happy Thanksgiving to you and yours.\n \n--Stead"}