{"doc_id": "1655", "name": "2013_11_humanities_student_major_299_marketing", "namespace": "we1sv2.0", "metapath": "", "pub": "marketing", "title": "2013-11-humanities-student-major_299_marketing.txt", "pub_date": "2013-11-05T00:00:00Z", "Sentiment": "0.143", "Subjectivity": "0.515", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "316", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd7e18p", "Reddit_id": "cd7h9xu", "Subreddit_id": "t5_2qhmg", "Commenter": "detective_mosely", "length": "1786", "content_scrubbed": "I love hiring humanities_major for marketing jobs! I was an English major myself, and it[.] been enormously beneficial to my career, in terms of writing persuasively and concisely (very important), and critical thinking.\n\nMy school didn't have a marketing major so I'm not sure what that even entails, but nobody I've ever interviewed with such a degree has ever impressed me. Doesn't mean that they're uneducated or that it[.] a bad degree to have, but I've just never been captivated by a marketing degreeholder.\n\nWhen I hire a new grad, internships matter to a certain extent, but they don't impact my decision greatly. I admittedly look at where the candidate went to school as an undergrad because I've seen a correlation between how tough your undergrad institution is and how successful you'll be on the job. This doesn't make or break the candidate though, as we've got a wide range of schools represented on our team. \n\nThe most important thing for me is what the candidate does with their free time. One of the best hires I've had is someone who created his own blog and treated it as if it was some big time media property even though it didn't get much traffic. He secured interviews with musicians and authors, setup the website himself, hooked advertising up and got his feet wet with AdWords to promote it a little bit too. The site had virtually no traffic but he was really committed to it and in the process did a lot of different marketing functions to try to make it work.\n\nI guess the moral of the story is, whatever you end up studying, you need marketing in action. Some employers here value that experience in the form of an internship, others value it in terms of what you're doing on your own, but it really boils down to some semblance of practical experience."}