{"doc_id": "1670", "name": "2013_11_humanities_student_major_398_koryu", "namespace": "we1sv2.0", "metapath": "", "pub": "Koryu", "title": "2013-11-humanities-student-major_398_Koryu.txt", "pub_date": "2013-11-07T00:00:00Z", "Sentiment": "0.111", "Subjectivity": "0.372", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "853", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pkmt1", "Reddit_id": "cd8wxg0", "Subreddit_id": "t5_2xj9v", "Commenter": "aikidont", "length": "4809", "content_scrubbed": "I just saw this, and I'm about where you stand.  I honestly don't know.  I know that in Don Draeger[.] books, he doesn't entirely discount these types of bujutsu.  I'm not sure of the historicity of Draeger, but his reputation is good and on a lot of other things.  He[.] basically the forefather of the modern science of hoplology, as much as the gun community wants to give credit to Jeff Cooper for the term (he used \"hoplophobe\" to mean someone afraid of guns, but not hoplology to mean the study of human combat until later and his focus was on pistols, essentially, not the entirety of how humans interact and the study of extant combat systems from a historical perspective).  So, I tend to think he did something right in his research (not everything of course).\n\nAnyway, Kawakami has political clout in his area for sure from some means or another, having become an honorary director of a \"ninja\" museum and also appointed a professor at Mie University to study \"ninjutsu.\"  I don't know what to think, honestly.  As far as I know there[.] no documented evidence he can produce, which of course fits in with that whole \"ninja\" theme, but you'd think there would be some sort of recorded .. something.  It[.] such a part of Japanese society.\n\nThere[.] also the fact that whatever he is, any exposure to someone real, as admitted to himself as I read his wiki, is very short and very little. To quote wiki: *\" [Kawakami] says he learned his art as a boy from a man named Masado (Masazo) Ishida, a medicine peddler claiming to be one of the last remaining ninjutsu practitioners alive*\n\nThis leads me to assume the exposure to who he claims as his teacher (I know of no information on that person) is very small because it was only when he was a boy.  Also, I know nothing and haven't heard anything about someone by that name, Masado Ishida, that fits the bill, but it[.] not my focus, so that[.] not very surprising either way.\n\nFor example we can compare him to someone who is very legitimate in a similar way, Don Angier.  Except with him the historical method has proved fruitful.  He did have a lot of exposure to his teacher, Yoshida, and has a lot of family documentation of the Yoshida family to prove he did learn their bujutsu and that Yoshida entrusted the continuation to him.  And when you see him move, if you have a keen eye you can see he[.] doing some things that are very telling if you've studied the arts related to the Yoshida family arts, and thefather of Yoshida back in Japan (a student of Sokaku Takeda), and that you see in Japanese styles that a kid in NY in the 1940s-50s would never have seen unless he was taught by someone who did those things.  So there you have someone who showed skills and was very forthcoming about with his history, even though he[.] a private person and trains a very select group of people.  And more importantly, it[.] independently verifiable that his teacher had fled Japan to America and he learned a lot from his father, Yoshida Kotaro (one of Sokaku Takeda[.] top student, and the guy who introduced Morihei Ueshiba to Takeda in 1915).  Angier didn't know of Ueshiba and anything, just the art he'd learned from Yoshida, and had long since been teaching on his own, independent and for a long time didn't know of aikido in America, long before Pranin published his research to prove Daito Ryu, at the time a very, very small and unknown art, was the main influence on aikido (that research didn't really hit the world with force and really turn heads until the early 1990s, though he began publishing in the links in the 1980s).  So Angier couldn't have simply just read up on it, there was nothing about it in English and even in Japan it was confined to a small community of practitioners, not famous like its aikido counterpart (and Angier shows things that are far more like Daito Ryu than any style of aikido, just entirely different).\n\nSo ... it[.] murky.  Kawakami[.] doing something, but the very nature of what he[.] calling what he[.] doing makes it unverifiable at the moment from a historical perspective.  Just because he[.] doing martial arts doesn't mean he[.] preserving something that[.] very old.  I'm very limited in my historical focus, so I just have nothing.  I'd like to know, it might be worth looking into.  For example, studying evolution of the katana to look at verifying the square cut guard and straight blade, which I'm not familiar with really except in ninja stuff and cartoons.  I'd imagine if there were swords still made in that method during the eras claimed, archaeology could provide some insight because there must still be some around somewhere.  I dunno, just treating it from a respectful, historical perspective.\n\nIn a way it[.] almost impossible to prove if it were true, from the simple fact that HE IS NINJA!! :P"}