{"doc_id": "1684", "name": "2013_11_humanities_student_major_543_teaching", "namespace": "we1sv2.0", "metapath": "", "pub": "teaching", "title": "2013-11-humanities-student-major_543_teaching.txt", "pub_date": "2013-11-09T00:00:00Z", "Sentiment": "0.016", "Subjectivity": "0.304", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "426", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdab54l", "Reddit_id": "cdaefqz", "Subreddit_id": "t5_2qyj9", "Commenter": "milqi", "length": "2541", "content_scrubbed": " First, just because the common core doesn't include objectives about \"appreciation for learning\" or inquisitiveness, doesn't mean that teachers can't involve these in their classrooms. \n\nActually, that[.] exactly what it means.  Teachers are told that anything that does not follow guidelines and standards are a waste of time.  They get written up for it and told they are bad teachers.  Go against what your admins tell you for long enough, you'll find yourself out the classroom.\n\n Second, it is the responsibility of an education system to equip students for post-secondary education and for potential careers.\n\nTechnically, you are correct.  However, with technology changing so quickly, the economy in a massive state of flux, globalization drastically shifting cultural values and the internet allowing anyone to google instructions on everything, equipping students for post-secondary education doesn't mean what it used to.  College is no longer the only viable option for success.  And it certainly isn't a guarantee of landing a job.  Therefore, it is far more important for students to learn more of the humanities, logic and cognitive thinking than it is for them to learn about all of global history in a year or two (which always boggled my mind - how does one compress 10,000 years of world history into 2 years? Who chooses what[.] more important than something else? Anyway!!!).  \n\nBut let[.] stay on history for a moment.  We spend a lot of time shoving names and dates down the throats of kids, but after the exam they remember nothing.  That[.] not getting an education.  If they don't understand WHY certain events happened, then those names and dates are nonsense and useless pieces of information.  And they certainly aren't learning where anyplace is on a map.  I had one student insist that India was in Europe and she was being corrected forcefully... by students insisting it was in Africa (or my personal favorite - in China).  How are kids supposed to compete in a global market if they don't where anything is on a globe?  And the fact that they do not know where countries are is NOT the fault of the teachers.  It is the fault of the curriculum, which is designed by administrators, who are told what students need to learn by Education Departments, which are run by people hired by elected officials who are in the pockets of corporations that design standardized tests that they want states to buy and administer so that they can make money.  And that, my friend, is why the kid in the video is 100% spot on. "}