{"doc_id": "1797", "name": "2013_11_humanities_student_major_1561_programming", "namespace": "we1sv2.0", "metapath": "", "pub": "programming", "title": "2013-11-humanities-student-major_1561_programming.txt", "pub_date": "2013-11-25T00:00:00Z", "Sentiment": "0.002", "Subjectivity": "0.345", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1152", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdmegpm", "Reddit_id": "cdmyv0f", "Subreddit_id": "t5_2fwo", "Commenter": "OrangeCityDutch", "length": "6763", "content_scrubbed": "I am in the same boat, rather I would say my schooling stopped somewhere in intermediate, not advanced, mathematics. In fact, being terrible at math is what made me switch my major from CS in the first place(at my university to major in CS you must minor in math) despite excelling at it in high school. Recently however, I have been making great strides in understanding mathematics. I am a liberal_arts major, so with the math I had already taken, I only needed one math class in college with I put off to the last semester, dreading it. I have always been fascinated with more advanced math concepts(such as what is showcased here) but couldn't spare the attention or tenacity to get through the lower levels. Eventually I went from being bored to being behind which made my attitude toward the subject change from a mild irritation to full blown hatred. This attitude was reinforced by people who would tell me I wasn't a \"math person\" and I readily adopted that identity. In truth, I have always known my lack of understanding mathematics to be a weakness of mine and I wasn't ready to address it. I think what \"flipped the switch\" as you might say was my focus on getting a good GPA, which provided the basic motivation to put in the effort to understand more math. This had fantastic results, and lately I'm enjoying math more than I probably ought to. I don't know if this will work for you, but this is what I believe worked for me:\n\n1. I realized I didn't hate math, I hated [arithmetic](http://en. wikipedia. org/wiki/Arithmetic), and that[.] ok. Many famous mathematicians, physicists and other smart people also dislike arithmetic. Once I realized this, arithmetic was again reduced to a mild irritation and I became more excited about math.\n\n2. I shed the identity of being a right-brained person and stopped using that as an excuse. The whole right/left brain thing is bullshit, so when I found myself saying things like, \"I don't get this\" I tried to correct myself and say things like, \"I haven't found a way to understand this yet, but I will.\" This also meant not engaging in the sort of conversation that reinforced my previous identity, i. e. talking with other liberal_arts majors about how we're glad to not be required to study much math, agreeing with people when they say a subject is beyond them or that I/we are just not \"math people.\" Sometimes this meant being a bit of an outsider, for example being the only person in a class glad to see the professor go off on a tangent explaining something and having resentful looks shot your way for asking questions that expand the scope of the lesson, but the satisfaction of finally understanding something quickly made these minor social concerns irrelevant.\n\n3. I translated math into languages I understood. More advanced math has always **looked** scary, with it[.] latin terms and odd symbols, thus I often found myself translating much of that into \"programr speak,\" which helped immensely. After doing that for a while, you start to see the two ways of writing the same thing as equivalent, like a person who speaks spanish and english doesn't really translate \"hola\" into \"hello\" every time they encounter it, they just become equivalent.\n\n4. I sought help and refernce outside my textbook and instructor. Most of the tricks instructors use to get you to remember certain math terms or principles have little effect on me, I'm not very good with acronym mnemonics and such, I'm much better off if I understand why something works. My past mathematical instruction was along the lines of, \"do a and b to get c because that[.] the way it is.\" I struggled to find relevance with many concepts being taught and without understanding why something works(which would have been interesting to me) I mentally checked out. The rememdy to this meant I sometimes spent a lot of time reading up on the historical background of some concepts, outside the hours required to simply complete homework assignments, but it was time well spent.\n\n5. I drew lots of pictures. I'm a very visual person I've come to understand, so I sought ways to visually represent concepts and used those to better understand problems. \n\n6. Often when I got an answer wrong, it was due to some mundane detail rather than a fundamental lack of understanding, so I began, \"[rubber ducking](http://en. wikipedia. org/wiki/Rubber_duck_debugging)\" my homework. This helped find a lot of these little problems that would throw off my solutions. This is why instructors ask you to show your work, which I always hated, but somehow looking at it as \"debugging\" made it easier to tolerate. I also would do little \"unit tests,\" using problems with known solutions to test my approach. In the book we used, the odd numbered problems had their answers printed in the back, homework was normally the even numbered problems or something else entirely, but I would first do the odd numbered problems in the section to make sure my approach was sound. \n\n7. I would also try to explain the concept/problems to fellow students. This replaced my participation in group whining about math, and helped me develop my understanding. When someone asked me a question I didn't know how to answer, we would look it up and figure it out together. Often the insight of another person, even one not necessarily on \"my level\" would greatly further my understanding of a concept.\n\n8. Since graduating, I've kept up my study by exploring math related to my interests. For example, I took it upon myself one afternoon to learn [vector math](http://natureofcode. com/book/chapter-1-vectors/), which I knew was useful in games and such, but always sounded a bit scary. I was so angry with myself for avoiding it, I remember shouting, \"VECTOR MATH?! THIS IS JUST FUCKING TRIANGLES!!!\" Only a couple hours after I had decided to explore the topic, I was using my own normalize, magnitude and distance methods in objective-c. Lately, I've been having a ball with the problems on http://projecteuler. net/. A coworker turned me on to it, now we have a little group approaching the problems in different languages, comparing solutions and generally nerding out about math and programming.\n\nMy recommendations based on the above boil down to this:\n\n1. Shed your preconceptions and try very hard to approach the subject with a \"beginner[.] mind.\"\n\n2. Find your preferred learning method and seek out study materials that fit.\n\n3. Find a way to make it relevant to your interests, or if you have the luxury of picking what you study(ie you're not in school) find things that are relevant.\n\n4. take things step by step, find out where you lack understanding and fill in the gaps.\n\n5. Be open to collaboration and share your experience with others.\n\nTL;DR YOU CAN DO EEEET!"}