{"doc_id": "1635", "name": "2013_11_humanities_student_major_112_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2013-11-humanities-student-major_112_AskReddit.txt", "pub_date": "2013-11-02T00:00:00Z", "Sentiment": "-0.012", "Subjectivity": "0.303", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1270", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pqd10", "Reddit_id": "cd513bp", "Subreddit_id": "t5_2qh1i", "Commenter": "Winterspark", "length": "6757", "content_scrubbed": "Well fuck, might as well add in to this. I'm not really sure if I'm living a lie, per se, but it certainly feels like I am the only person who understands how bad things are for me. People know I have issues, but I don't think they realize what it is like.\n\nI suffer from strong depression (I very much hesitate to say severe, because I know many people seem to have it worse than me), anxiety, and chronic pain. I've been depressed pretty much non-stop for the last several years at minimum, and probably off and on for at least a decade, maybe my whole life. I've only relatively recently developed anxiety issues and they seem to be getting worse. I just recently came out of a deep depression that lasted for about a week... not that I'm not still depressed. Like, here[.] what my depression is like:\n\n      ------Elated-------   For very short bursts, I can feel this\n\n\n      ------Normal-------   I don't remember what this is like anymore\n\n\n      -----Depressed-----   Most of my time is spent here\n\n\n      --Deep Depression--   Sometimes I end up here for a little bit\n\nThat whole depressed part, it varies in strength, but it never goes away. With the anxiety I have some trouble now going out to familiar places and more trouble with new places. I'd rather just stay in my bedroom all day, where it is safe and I can control nearly everything in it. I know that isn't healthy, but it[.] what I do.\n\nI have no friends, IRL or online. I have no job. I recently graduated from college with a Liberal Arts AA. It took everything I had to finish that final term, including dropping two courses that weren't needed because of the stress. I'm extremely lonely. I'm afraid of being punished by people (be that as much as truly being hurt all the way down to being made fun of) so I don't even do much interaction with people over the relative safety of the internet. I have trouble maintaining relationships. My sister, the most important person in the world to me, still talks to me but won't see me in person until I get a job. She thinks it'll motivate me. In reality, and I have told her this, it does no such thing while making me more miserable than I was before. My other sister still visits me, though, but it[.] not the same.\n\nI'm a transwomen, pre-everything. I've known I was trans for at least 6-7 years... fear, lack of a job, tons more fear (of society, mainly) have prevented me from transitioning so far. It[.] getting harder and harder to stay as I am, though. I'm reminded *every single day*, multiple times a day, that I was not born a woman genetically and everyone sees me as male. Every. Single. *Day.* ***For years now.***\n\nI need therapy, but I don't want to open up to anyone, myself included. Too painful. I need medicine, but it[.] hard enough to just barely take care of myself. Feed myself, sleep properly, etc. Trying to get doctors involved is just so much extra mental exertion. Typing this up is difficult and I can probably only do it because I have been up for nearly 23 hours so I am sleepy and maybe a bit less inhibited. Also, I'm doing my best not to think about what I'm writing.\n\nI don't feel like I fit in with anyone, male or female. I feel like no one will ever love me because of who I am and how I look. I don't know how I will ever hold down a job... but then again, I have never had one before. I am 26. I spent the last four or so years in college, before that I just... existed, basically. Played a lot of WoW. A lot of video games. Did some web design and programming, but never for money, mainly just for myself.\n\nI hate myself. I still, even after all these years, haven't truly accepted my trans status. I just wanna wake up from this nightmare. I wanna wake up and find out my body was always female, just like my mind. That this whole life was just one horrible dream that I can finally escape from. That I don't have to spend years trying to correct what nature fucked up, what society makes an already hard issue even harder, just because it can. That will cost me thousands, tens of thousands of dollars to get taken care of.\n\nMy teeth are all messed up because I have spent the last half-decade just not taking care of my body. I have some kinda of stress injury in my hands from the shitty way I sit while using the computer, but if I'm not on the computer I am basically left without anything to distract me from my life. From reality. Yet using it hurts my hands, makes it worse. I sit horribly, so I think that[.] why my neck hurts. My constant headaches are probably from the neck issues. Like I said, I am in constant physical pain in various parts of my body and constant mental suffering that I do my damndest to just tune out. Can't see it, can't hear it, doesn't exist.\n\nThis is too long, I feel. Hell, I'm not even done... but most people in my life just think that I am depressed... my sisters know of my anxieties, though no one in my family knows what it is like to be trans. To look in the mirror and not recognize what you see, to avoid mirrors just so you don't have to see it... never looking in the eyes of your reflection because then you can't ignore that it is you. Avoiding talking when alone because the sound of your voice is just so *wrong.* And so many other issues... how people see you, treat you, respond to you.\n\nWorst thing that happened recently, other than the deep depression dip I had for a short bit, was a dream. I was angry at something one of my family members said. Not sure what, something maybe like they didn't believe me about what I was feeling or whatever. So I ran into the kitchen, grabbed a paring knife and cut my arms thrice. I can still feel like aftershocks of the knife going through my arm, even though it never happened. It was a really vivid dream. It hurt, but if they didn't believe me, I'd damn well show them. I even know which knife I used. It wasn't a made up one or anything, we have the damned thing in our kitchen. Technically several, since we bought a couple sets. I've never self-harmed, unless you count not taking care of my body[.] health self harming of a sort, but I've thought of it lots. That dream still has me unnerved, though. I don't like it. Don't like that I can feel it on my arm.\n\nThat[.] all for now... I'm going to bed. But yeah, people ask how I am, even family... and I just say \"meh\" or \"okay\" or something, but nothing is okay. I honestly don't even know how long I have to live. Not that I'm suicidal... just, nothing seems like it'll ever get better, nothing seems worth it. I can't picture what I'll be doing in a year, let alone five. Hell, I can't picture what I'll be doing in six months. My future just has no certainty to it, no light or anything. Just pain, suffering, sameness... never leaving the rut."}