{"doc_id": "1659", "name": "2013_11_humanities_student_major_319_osu", "namespace": "we1sv2.0", "metapath": "", "pub": "OSU", "title": "2013-11-humanities-student-major_319_OSU.txt", "pub_date": "2013-11-05T00:00:00Z", "Sentiment": "0.188", "Subjectivity": "0.339", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "391", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pzbob", "Reddit_id": "cd7qdes", "Subreddit_id": "t5_2qj3f", "Commenter": "leedleleedleleeeee", "length": "2180", "content_scrubbed": "Pros:\n\n* Lots of research going on at KSA and the lecture series always brings in good designers who are moving the field forward. You'll get the chance to see a few big names speak about their work. (Daniel Libeskind is tomorrow, actually!) \n\n* Holistically, it is a very good education that will get you thinking in ways most college students won't ever get to. You'll learn from some pretty great profs like Jackie Gargus who'll help you too see the built environment around you through the lens of a designer.\n\n* On that note, most of the faculty is very good and the school represents a pretty healthy variety of backgrounds and perspectives. \n\n* Knowlton sends grads to top M. Arch programs every year. \n\nCons:\n\n* The way the program is set up forces you to take the long road if you do decide to be an architect. Most SoAs have a 5 year Bachelor of Architecture, which is a professional degree; you can start interning and  working toward licensure right out of undergrad. Knowlton is a 4 year Bachelor of Science in Architecture, which is not a professional degree, and will require at least 2 years of graduate school (M. Arch) before you can become a registered architect. \n\n* The aforementioned research may be plentiful and interesting, but it is also usually avante-garde, artsy stuff and not as useful for real-world application, IMHO. You won't get much technical skill at the Knowlton school because the emphasis is more on theory.\n\n* Studio will drain your life-spirit from you and leave nothing but a shell of the person you once were. (I kid... sort of) Studio can be very rewarding, but after so many long nights it will start to get to you. Don't expect to be involved in any extra-curriculars or student orgs without seeing your grades suffer.\n\n* All it takes is one bad studio prof to ruin your entire semester.\n\n\nTL;DR\n\nIf you want to be an architect, get a liberal_arts degree and enjoy our undergrad here at OSU. Then go to grad school somewhere for a Master of Architecture. \n\nIf you go for the B. S. Arch at KSA, you need to go to grad school anyway since it[.] not a professional degree -- might as well enjoy your first 4 years an avoid some suffering."}