{"doc_id": "1728", "name": "2013_11_humanities_student_major_1063_cscareerquestions", "namespace": "we1sv2.0", "metapath": "", "pub": "cscareerquestions", "title": "2013-11-humanities-student-major_1063_cscareerquestions.txt", "pub_date": "2013-11-17T00:00:00Z", "Sentiment": "0.126", "Subjectivity": "0.385", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "552", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdgal8g", "Reddit_id": "cdgnkqc", "Subreddit_id": "t5_2sdpm", "Commenter": "RemnantOfDawn", "length": "3038", "content_scrubbed": "This, 100 times this. You can use affirmative action all you want, it[.] not going to make a difference if you don't have enough women wanting to get involved in computer science.\n\nThe idea of making it easier for women who want to study CS to succeed is like trying to fix the symptoms, but not the underlying problem. Sure, it means that your office or university will have a more balanced ratio of males to females. But it doesn't change the fact that there are still 5 times as many men in computer science as there are females. Those who are interested in CS will still study it - no guy is going to say \"well, I didn't get into my top choice school for CS because of affirmative action, might as well become a stay-at-home-dad\", just like no girl is going to say \"I might as well go into computer science, because I'm a girl and so it will be easier for me\" (at least no one that would be a decent programr). So by implementing affirmative action, you're skewing the results to make it easier for women to succeed in a computer field, but only once they've already become interested in the field. This doesn't fix the underlying problem of there being far too few women interested in the field to begin with.\n\nSo yes, at Harvard and Princeton and MIT, at Google and Amazon you might have enough selectivity to be able to get 50% man-woman breakdowns. But somewhere a bit less elitist you're going to run out of women programrs and the split will go back to being heavily in favor of men.\n\nSo the solution is just what you've said - we need to start encouraging girls from a very young age to pursue technical fields, and, while not discouraging boys from joining them, let them know that there are other options as well. Assuming that their is no physical innate bias towards one field or another based on gender (I'm not qualified to make this statement, but I'm going to assume there[.] not), it[.] only societal biases that skew these statistics the way they are. We need to convince young girls that math, engineering, computer science, etc aren't \"boy things\". Similarly, we need to stop making young boys feel like there are certain fields they can't join because they're \"for girls\". Also relevant is the fact that, while boys trying to decide on a major may be extremely pressured by their families to try to find a practical major that will pay well, many girls will simply choose whatever liberal_arts major seems nice out of the assumption that they will get married and be a stay-at-home-mom. We need to do away with these issues as well. \n\nI have no idea how to go about doing this, but trying to give women who are actually interested in CS an extra boost will never solve the underlying issue that there aren't enough women interested in CS in the first place. All it really does is create an unfair work environment, further the notion (as shown by the OP) in male programrs that their female coworkers are less likely to be qualified, and therefore make it less likely that women will join CS in the first place."}