{"doc_id": "1656", "name": "2013_11_humanities_student_major_311_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2013-11-humanities-student-major_311_philosophy.txt", "pub_date": "2013-11-05T00:00:00Z", "Sentiment": "0.037", "Subjectivity": "0.314", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "423", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pz3yv", "Reddit_id": "cd7nxcy", "Subreddit_id": "t5_2qh5b", "Commenter": "Bumgill", "length": "2612", "content_scrubbed": "There are two reasons it[.] generally harder to find a position with a formal background in the humanities than STEM, at least as I see it.\n\n1. STEM programs set you up for a career path. If one gets an engineering degree, then one looks for work as an engineer. If one gets a philosophy degree, then one does not look for work as a philosopher. The science degrees are similar. Though a chemistry undergraduate degree may not set you up to become a \"chemist\" (which is a term with little meaning here since the field is so broad), you can still become a lab monkey somewhere. And then there[.] the issue of being able to do research and get published as an undergraduate (and advanced degrees subsidized by schools). Math is a bit different since it[.] not an applied science, at least directly.\n\n2. The humanities generally teach \"soft\" skills instead of \"hard\" skills. It is rather difficult to prove that one can do anything better than anyone else with a humanities degree. Largely, this has to do with the job application process. Though communication skills can be shown, it[.] rather difficult to demonstrate the ability to break down and rebut an argument in an interview situation or on a resume. Employers also tend to think that everyone can do this. You list writing as a skill? Well, most high school graduates are literate: how is that a selling point? Skills such as writing, communication, critical thinking, argument analysis and the like show up on most resumes because there[.] no risk in putting it there. Interviewers don't ask you to spot the logical fallacy or craft a response to an argument while using a charitable reading of the argument. At most, they'll ask a vague question about prioritizing tasks which is barely related. Effectiveness of communication, obviously, can be demonstrated in cover letters, resumes, and interviews, but that[.] a rather narrow application which doesn't involve clearly and succinctly presenting complex arguments using technical language. To a large degree, this stems from lack of employer imagination (if you don't have specific training doing this, then how could you possibly do it?), hyper-specialization (with degree programs in paralegalism, technical writing, copywriting, marketing, HR, health care administration, business administration, communications, and many specific jobs, what[.] the appeal of a jack-of-all-trades (likely master-of-none) humanities student?), and the current situation as an \"employer[.] market\" (why take a risk on an unknown when you can pick up someone with a degree program which focused exclusively on this position?)."}