{"doc_id": "1624", "name": "2013_11_humanities_student_major_8_foodforthought", "namespace": "we1sv2.0", "metapath": "", "pub": "Foodforthought", "title": "2013-11-humanities-student-major_8_Foodforthought.txt", "pub_date": "2013-10-31T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.397", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "321", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pmeyr", "Reddit_id": "cd45hw0", "Subreddit_id": "t5_2rete", "Commenter": "[deleted]", "length": "1756", "content_scrubbed": "I've talked about this in previous subreddits as a History and Classics double major, but I think it[.] worth noting again here:\n\nI love the hell out of my study, and although it is incredibly stressful to go on the track I'm on, I believe and understand the value of the humanities. Quite literally, 90% of conversations I have with people discussing my degree involve the question \"how are you going to find work with that?\" To which I typically respond: \"yes, it will be difficult, but it[.] worth it.\"\n\nIf there is anyone on here who[.] considering becoming a major_in_the_humanities, I strongly encourage it, regardless of how \"profitable\" it is. I have learned more and become so aware of the world around me than I ever imagined: I've read stories of pasts and peoples which have changed the way I see the world, and which have allowed me to think differently. \n\nI've learned to appreciate the world that I live in, and can see more and more the process of how we've arrived where we are. I see and hear the world analytically, and honestly believe that I no longer think like a normal person usually does. When I hear anything, I think of the context of the situation, as well as the circumstances leading up to it. I ask questions which cause pause in others, because they actually need to think about it before answering. I've become impassioned by the depth and fragility of history, and have started to reflect on my own actions because of the stories which I have read. \n\nTL;DR: From one Humanities person to another: I know it[.] an uphill road, and yes, I get worried about it too. But I wouldn't trade this mind and this education for a degree in something I don't give a hoot about and which would land me in a job that I would probably hate. "}