{"doc_id": "1830", "name": "2013_11_humanities_student_major_1816_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2013-11-humanities-student-major_1816_AskReddit.txt", "pub_date": "2013-11-30T00:00:00Z", "Sentiment": "0.146", "Subjectivity": "0.387", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "494", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rrtrq", "Reddit_id": "cdq7y0a", "Subreddit_id": "t5_2qh1i", "Commenter": "tattoosnchivalry", "length": "2536", "content_scrubbed": "In high school I pretty much took every single music class I could. I was in band (jazz and wind symphony), chorus, guitar, music theory, etc. Anyways every year it was safe to say half my schedule was in the arts department and all the teachers in the department knew and loved me. Around the end of junior year I started gaining a rep in school of smoking weed (I did, but so did most of my high school). The chorus teacher at my school was a very young teacher who was always very close to her students. One of those teachers that was weirdly close, trying to be all her student[.] friends and always giving personal advice. Anyways going into senior year she *asked* me to be in her advanced choir, I wasn't a great singer but a good musician (band was my thing) and obviously that helped in many senses, plus I always got along with her pretty well. Point is one day she called me into her office and starts telling me that if I'm going to be in her mixed choir I better not bring it (weed) around her *kids*. I don't remember exactly what I told her (she also chose to do this with 3 other students in the room) but it was along the lines of \"I don't know who you think you are but you're neither my mother nor my priest. Past that, what I do on my free time and the bullshit gossips you hear from your children are in no way your business and completely make you sound like an immature teenager. If you don't want me in your chorus then kick me out, because the last thing I need is to be judged by a chorus teacher who[.] more concerned with her popularity than how good her chorus is (which they sucked, the band kids always made fun of them). Lastly, I didn't ask to be in your advanced choir and I most certainly didn't ask for your life advice so please next time you think of giving me advice... Don't.\" I walked out and as I closed the door I yelled rather audibly \"dumb bitch.\" You guys might think its stupid, but I barely smoked back then and even then I never brought it to school. There truly was no reason for her to tell me anything, and if she would've done it out of care for me she wouldn't have tried to ridicule me in front of other students. I also went right after and spoke to the department head (my band teacher) and told him what just happened. That dude loved me and couldn't give three shits if I smoked cuz I was a hell of a good and dedicated player, he told me he would speak to her. Next day, she apologized and said she never meant to ridicule me and would love me to still join her advanced choir.\n"}