{"doc_id": "1781", "name": "2013_11_humanities_student_major_1461_mensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "MensRights", "title": "2013-11-humanities-student-major_1461_MensRights.txt", "pub_date": "2013-11-23T00:00:00Z", "Sentiment": "0.03", "Subjectivity": "0.27", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "1357", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rai92", "Reddit_id": "cdlk9cp", "Subreddit_id": "t5_2qhk3", "Commenter": "soccernamlak", "length": "8255", "content_scrubbed": "The original comment sadly was deleted before I could post, and since I wrote way too much (and spent a lot of time on it), I'd like to provide some insight to the original case.  \n\nThe original comment asked for a ELI5 on the Duke Lacrosse Scandal.  I hopefully can provide some insight on that.\n\n**Part 1**\n\nDiscloser: I lived in Durham for six years and hold a degree from Duke University.\n\nFirst and foremost, I need to paint you a picture of Durham, North Carolina.  It has a very rich and long history, from Native Americans to its growth in part due to Tobacco (which North Carolina was/is very famous for over the past 100+ years).  It also has a very strong power generation history as well (in part due to the Duke Power company).  So combine vibrant industry with wealth along with population growth, you'll get a booming city during the early 1900s.\n\nMore specifically, though, Durham quickly developed a vibrant Black community, including a string of businesses and insurance companies that earned the nickname \"Black Wall Street.\" Note this was way before the civil rights movements of the 1950s in the US.  In 1910, Dr. James E. Shepard founded North Carolina Central University, the nation[.] first publicly supported liberal_arts college for African-Americans.  So despite being in the South, Durham ended up as a center for civil rights movements and pushes before equality laws were passed in regards to race.\n\nSo you can imagine the demographics making sense:  42. 45% White, 40. 96% Black or African American.  And with the rise of the tech industry, while household income is around $60,000, the areas of Durham vary drastically to how wealth is distributed.  \n\nWhat we end up having in Durham proper is a very evenly split city when it comes to the 2 most predominant races in the US alongside a very diverse set of communities, from the high-class southern parts (near Chapel Hill) to the very poor communities of the east side to the tobacco farms of the west.  \n\nNow let[.] bring Duke into the picture.  I'll skip most of the early history here, but the Duke Family (which made their money in the area from tobacco) funded the university.  Combine that with a very active campus (including civil right protists in the '60s) and a research-driven university (especially in the 80s), you end up with a private institution that consistently ranks in the Top 10 Universities in the US.  \n\nBut with the high academic standards comes the issue of costs (mitigated by the Duke Annual Fund and other donations) which in turn starts to bring out a divide between Durham and Duke.  Remember those demographics of Durham?  Duke is (undergrad) 10% African-American, 21% Asian, and 47% White.  So racially, you can start to see where Duke could be painted as a \"white person[.] school\" (with Asians included in that category) and Durham as a \"black town,\" especially with a predominant black university, NCCU.  \n\nThen we get to income: \"In 2001 and 2002, white students reported the highest average family income of about $230,000 per year, according to the 2006 Campus Life and Learning Project. Latinos, Asians and blacks reported average family incomes of $170,980, $153,401 and $118,316, respectively\" ([1](http://www. dukechronicle. com/articles/2010/03/31/duke-draws-rich-kids-all-colors)).  That was from an article in 2010 for incomes 10 years ago.  No doubt it[.] increased since then (if only by inflation alone).  \n\nSo now we have the origins of our stereotypes.  Duke is full of rich white people and Durham full of poor blacks.  Whether this is justified or not, I leave that as an exercise to the reader.  But what we end up having is Durham **not** being a college town like Chapel Hill 9 miles away, but rather a city with a university in it.  \n\nWhat makes a good portion of this worse is not just the tension between Duke Officials and Durham Officials (never the best), nor police differences (Duke has their own police force), but the fact that Duke[.] East Campus is very close to downtown and \"Wall Town,\" which is an area of concentrated, high levels of crime ([2](http://gisweb. durhamnc. gov/gis_apps/crimedata/dsp_entryform. cfm)).  \n\nSo:\n\n**TL;DR so far: Stereotypically and on average, Duke is full of rich, white students surrounded by a high-crime, poorer black community.  There[.] always been a back-and-forth between both communities politically, as well.**\n\nPlease note that I'm simplifying a lot of this.  Again, the politics and community[.] history is very rich in history (both good and bad), and I cannot do it justice in this post alone.\n\nAll of this is necessary in understanding the lacrosse scandal.  \n\nThe players:\n\nDuke Lacrosse: Reade Seligmann, Collin Finnerty, and David Evans \n\nAccuser: Crystal Mangum\n\nOther: Kim Roberts (second escort/stripper)\n\nProsecution: Mike Nifong\n\nOn March 13, 2006, male Duke lacrosse players were throwing a party in an off-campus house owned by Duke University.  They decided to call an escort company and requested two white strippers, but the women who arrived, Mangum and Roberts, were respectively half-black and half-Asian. Crystal Mangum was 27 at the time and a student at NC Central University.  Being that Duke[.] unofficial motto is \"Work Hard, Play Hard\" and that we can and do enjoy our parties, you can imagine what might come out of the mouths of drunk college students.  One player asked if the dancers had any sex toys, and suggested that a broomstick be used as a sex today. That ended the performance, with both strippers going inside the house[.] bathroom.  At this point, Seligmann and Finnerty left the house.  The women came out, and Mangum roamed around the yard half-dressed and shouting.  Later, Mangum and Roberts left with Robert calling the players \"short dick white boys\", and \"how he couldn't get it on his own and had to pay for it\", to which one player yelled \"We asked for whites, not n*****s.\"\n\nThe two escorts left and began arguing.  Since Magnum wouldn't get out of the car after being asked (it was Roberts car), Roberts then got a grocery security guard and later police to have her removed.  Magnum was brought to the Durham Access Center for involuntary commitment. It was at this point that she said she was raped earlier.  She was transferred to Duke University Medical Center to receive treatment for her injuries.  \n\n\"It was unclear whether or not these injuries were consistent with rape. There were no abrasions, tears, or bleeding in the vaginal area, but investigators did find swelling in the vaginal area, along with tenderness in Mangum[.] breasts and lower-right quadrant. There was no blunt-force trauma, but Mangum had two non-bleeding scratches on her right knee and one on her right heel. There was diffuse swelling of the vagina, and investigators did not note any other injuries in the rest of the report. Mangum later claimed that she had performed using a vibrator for a couple in a hotel room shortly before the lacrosse-team party. This activity, or a yeast infection, might account for the swelling.([3](http://en. wikipedia. org/wiki/Duke_lacrosse_case))\"\n\nThe prosecution moved forward in the case by getting DNA samples from 46/47 players of the team (the sole exception was the black player, as Magnum had said her attackers were white).  This is despite the fact that some players were not at the party.  All of this (DNA and statements) were done the day after the party.   On April 10, 2006, it was revealed that DNA testing had failed to connect any of the 46 tested members of the Duke University men[.] lacrosse team.  Mike Nifong then went to a private laboratory (DNA Security of Burlington) to conduct additional tests. DNA from multiple males was found inside Mangum, but none matched the players. To the courts, Mike Nifong falsely represented that DNA had only been found from a single male source, her boyfriend.  Further, lack of DNA does *not* mean that assault or rape did not happen (as Nifong argued), especially considering that rape victims often delay reporting (which means DNA evidence could have been destroyed on accident).  However, here, Magnum[.] rape-kit was administered a few hours after the party and the alleged incident, so the possibility of the lack of DNA was increasingly small.  "}