{"doc_id": "1706", "name": "2013_11_humanities_student_major_751_oregonstateuniv", "namespace": "we1sv2.0", "metapath": "", "pub": "OregonStateUniv", "title": "2013-11-humanities-student-major_751_OregonStateUniv.txt", "pub_date": "2013-11-12T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.406", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "484", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qio1o", "Reddit_id": "cdd7c6l", "Subreddit_id": "t5_2s2fy", "Commenter": "duganda", "length": "2802", "content_scrubbed": "I've lived in Corvallis for going on 12 years, so while I'm not truly an old-timer, I'm much closer than I'd like.  And I did my undergrad and grad work there and worked there, so I'm also familiar with the university.  So:\n\n1) Corvallis is a good-sized small town.  It[.] many worlds in one, starting with a town that does a fair amount of sustainability work and in which you can pretty easily (though not cheaply) find organic products of all kinds, though you can also find the usual conventional stuff.  The university has grown fast and is losing some of the 'ag school' feel and gaining a more traditional college experience with hordes of students downtown and near campus during weekend and Thursday nights.  There[.] also a contingent of permanent residents who sometimes resent the university but benefit tremendously from the economic impact.  There[.] an Hispanic community that does a lot of farm work and probably a lot of other low-wage labor.  And there are probably other communities - senior citizens, maybe? - that I am glossing over.  I generally like it here; it[.] easy to get around without a car, though the public transit system is limited in hours, albeit free.  It rains a lot but rarely snows or freezes, and summers are gorgeous.    Also, like Columbia, MO, it[.] really highly educated.\n\n2) OSU reorganized several years ago, and while I can't speak for the history program directly, the history program joined with the philosophy program, which is where I got my degree.  So from the outside it[.] small but probably decent, but maybe not stellar.  Just remember that despite the overall size of the school, the major liberal_arts college in the state is UO.  OSU is the ag / science / engineering / forestry school, and their budgeting priorities ultimately reflect that.  IMO, if you go for history, you're going in no small part because of the general quality of the university, not necessarily your major program.\n\n3) I never lived on campus and so can't really speak to that.\n\n4) From the Eugene airport, which isn't major but can probably get you home (though it'll be more expensive), it[.] only about 45-50 minutes.  From Corvallis to the Portland airport is around 100 miles, and usually around 1:45, depending on traffic.  \n\n5) Would I recommend it?  Yeah, depending on what you want.  Again, I can't speak for the on-campus living experience, and the off-campus rental market is really tight, but it[.] close to lots of outdoor stuff, including the Pacific Ocean, it[.] not too far from a major city, and it[.] small enough to get around easily.  Low crime, though that may have something to do with the fact that it[.] 90+% white (the town, not the university).\n\nIf you have more questions, I am happy to answer them, or I'm sure there are others here that can as well!"}