{"doc_id": "1815", "name": "2013_11_humanities_student_major_1710_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2013-11-humanities-student-major_1710_AskAcademia.txt", "pub_date": "2013-11-27T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.294", "Score": "17", "Upvotes": "17", "Downvotes": "0", "Wordcount": "321", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rm3j8", "Reddit_id": "cdombjc", "Subreddit_id": "t5_2sakj", "Commenter": "Deightine", "length": "1925", "content_scrubbed": "Also important to question whether or not you see the \"public face\" of the happy folks you've talked to, or if your contacts have all been from the same university cultural environment. I've noticed a lot of complaining comes from the most vocal marginalized professors, abused grad students, and those who feel free to say what they really think due to internet anonymity. Take that away and they smile at the department parties, eat crap politely, volunteer for bureaucracy-laden committees, etc, and fume inside.\n\nTo reference your last question... Competition doesn't breed pessimism; perceiving competition as futile breeds pessimism, as each perception compounds until a general opinion forms, then after its reinforced enough, you tend to lean in that direction all of the time. Frustration is what drives a person to that. Much like repressed anger may drive you to depression, so can repressed frustration. Pessimism is a very effective way to write-off things that frustrate you, as a coping mechanism for a situation in which you have no perceived power.\n\nIn academia, a lot of that power is taken away from the participants. Want to do some research? Where is the money coming from? Have to appease the university or a grant approval committee. Want to change your curriculum? Do you have tenure? Even if you do, you'll still need to get the approval of your peers unless the changes are minor, lest professors disagree on topics and students ask whom is right, etc. It[.] a pretty bureaucratic place and positions are scarce, while tenure seems to grow scarcer by the day.\n\nGrain of salt: I'm a post-undergrad pre-grad, but I've spent a lot of time around the bureaucratic crap that happens in university departments. Humanities departments being some of the worst, too, as everyone wants to be nice, tries to be nice, but secretly wants to pull off someone else[.] head in every meeting they are forced to attend."}