{"doc_id": "1806", "name": "2013_11_humanities_student_major_1643_againstmensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "againstmensrights", "title": "2013-11-humanities-student-major_1643_againstmensrights.txt", "pub_date": "2013-11-26T00:00:00Z", "Sentiment": "-0.038", "Subjectivity": "0.266", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "262", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rjver", "Reddit_id": "cdnz461", "Subreddit_id": "t5_2snpl", "Commenter": "Responds_to_Woosh", "length": "1606", "content_scrubbed": "I'm guessing the point of that thread is to notice the current #1 definition of Sociology according to Urban Dictionary:\n\n\nAn academic discipline designed to:\n1. uncover the cause of modern society[.] problems, aka white males (or even whiteness in general).\n2. reveal Marxism as the solution to all of the problems that white males have caused by their oppressive habit of being successful\n\nSociology Professor: \"Why are you in college right now, instead of getting pregnant in high school and dropping out?\"\n\nMe: \"Because I made responsible choices to avoid that situation and worked hard in school\"\n\nSociology Professor: \"Actually, no, it[.] because you benefitted from White Privilege\"\n\n\n\n---\n\n\nLet[.] have a look at #2:\n\n\nThe subject of looking into somthing too much.\nThis is a robber.. He robs becouse he is poor.. He is poor becouse of poor socialization.... He had a poor socialisation becouse his parents were in a lower class... His teachers looked down on him and he got a worse education becouse of this... Sociology for ya..\n\n\n\n---\n\n\nHmm, maybe another go?\n\n\n\n #4 Sociology\n\n\nAnother fake science liberal_arts major taken predominately by psuedo-intellectual girls without father figures.\n\nEnroll in Sociology 101 if you wish to learn the basics of radical feminism, communism, and black nationalism.\nSample Sociology test question:\n\nWhat was the root cause of the Spanish influenza epidemic of 1918?\n\na. The White man\nb. The White race\nc. White people\nd. all of the above \n\n\n-------\n\n\nWell, it[.] a mystery as to why the MRM is not taught academically. I mean look at how much they respect the field."}