{"doc_id": "1777", "name": "2013_11_humanities_student_major_1418_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2013-11-humanities-student-major_1418_AskReddit.txt", "pub_date": "2013-11-22T00:00:00Z", "Sentiment": "0.145", "Subjectivity": "0.355", "Score": "51", "Upvotes": "51", "Downvotes": "0", "Wordcount": "544", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdksg3l", "Reddit_id": "cdkv3uz", "Subreddit_id": "t5_2qh1i", "Commenter": "J_Sto", "length": "3357", "content_scrubbed": "Agree. There[.] always a very vocal group of humanities haters hanging around these threads, including some self-haters. If people care to run a search on ROI and English degrees, they'll find that [it[.] solid.](http://www. salary. com/8%2Dcollege%2Ddegrees%2Dthat%2Dwill%2Dearn%2Dyour%2Dmoney%2Dback/slide/10/) Not everyone wants to be or can be or should be an engineer or work in STEM. A difference I've noticed however is that humanities_major have a wonderful appreciation for STEM studies and work that is not returned. \n\nWith an English degree, ROI depends on the degree/investment and how the professional deploys their skills. The median mid-career salary for english_major from the public university I attended is 90k. The nationwide average varies depending on the subset of schools. It[.] a versatile degree without being general. The critical thinking skills this degree can yield lead to many different tracks, are impressive and are in-demand. \n\nIt[.] strange to see this discussion occur on this site over and over: Humanities degrees are responsible for nearly all of the HQ content posted to this site and are the influence for most of the downstream content, such as memes and other references. Many of the default subs that are not UGC are devoted to professional humanities-driven verticals such as movies, books, TV and news. Furthermore at healthy companies and organizations STEM jobs are not divorced from humanities jobs but instead these skill sets bolster one another as different departments and team members work together. Their tasks might be different but they all help support the same work and goals. So yes you could major in English and work at NASA. Or you could major in English and write or edit the President[.] speeches, the style guide for *Harry Potter*, non-profit grant proposals, Jet Blue[.] social media feed, novels, magazine articles, technical manuals, video game and other media scripts or your own speeches as after your stint as a lawyer you decide to run for local office. The list is endless and anything to do with communication that requires higher level analysis or creation is open to english_major. Working at any organization, whether it be the CIA or Dreamworks, is possible, as is starting your own business and owning your own IP/work.\n\nStudents who are interested in majoring in English: don't let these threads deter you from considering this major as an option. Remember that not all English programs are equal and do your research before applying (which you should be good at assuming you want to read English at university, so hop to it). On the practical side, interning at least once during study will be key, so you will want to attend somewhere near a strong market and/or somewhere where the department has relationships and can help place you into an internship. I suggest interning twice at two different places. If you can study for one session at a top school (Cambridge, etc.), then I recommend you do that as well. It also helps to focus on a speciality in writing and editing (creative or non-fiction, or both if that[.] your interest, and there[.] also technical writing) as much as whatever speciality in text analysis you choose (British lit, folklore and mythology, rhetoric, drama, et cetera). And of course you can double major or use your minor to further curate your degree.\n"}