{"doc_id": "1629", "name": "2013_11_humanities_student_major_53_oney", "namespace": "we1sv2.0", "metapath": "", "pub": "OneY", "title": "2013-11-humanities-student-major_53_OneY.txt", "pub_date": "2013-11-01T00:00:00Z", "Sentiment": "0.091", "Subjectivity": "0.39", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "1003", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd4i261", "Reddit_id": "cd4m335", "Subreddit_id": "t5_2s5ni", "Commenter": "dfedhli", "length": "5718", "content_scrubbed": " That[.] interesting, because he didn't say that specifically. He just referred to 'propaganda' (as if AVfM wasn't lmao). Whilst it is true that women are, when working the same hours in the same profession in the same firm, they will earn the same as men, it is also economic fact that women will earn about 75% of what men of similar skill sets will earn over their lifetime, give or take exceptions in various industries.\n\nIt[.] true that he didn't specify what propaganda he meant, but I found it to be more than clear, because feminist propaganda isn't \"women make 75% of what men make because of their choices, let[.] examine why and see if we can give everyone a more equal opportunity\", it[.] (approximately) \"women make 75% of what men make because patriarchy, so we should pay them more\". Also, I'd like to see a source that includes the qualifier \"similar skill sets\", because I was under the impression that it only applied to similar education level (meaning more women doing liberal_arts and more men doing STEM plays a role; also note how feminists like to hate on STEM).\n\n It is pretty overwhelming - the ONS in the UK (where I live) reports that about 2% of men will suffer from (attempted) sexual assault in their lifetime, as opposed to 20% of women. If that[.] not overwhelming, I don't know what is.\n\nThat[.] one of the sources more skewed in women[.] \"favour\" (if you can even call it that...) that I've seen, and it[.] still less than the source I provided for aggravated assault. Considering that there are other sources out there putting the figures on rape closer together, and also considering that rape against men is reported much, much less frequently (partially just because men often don't even know they were raped, due to society[.] view on rape only possible against women), I'd hesitate to call it \"overwhelming\". However, this is not really a major point of mine.\n\n I never said that men should have a hard time reporting it or that they should be disenfranchised, but that it is appropriate that the focus is on female victims.\n\nSee, I still disagree. I think the focus should be on victims, full stop. Even if one gender is more victimised than the other (see both rape and aggravated assault) focusing on the gender which has more victims doesn't do anyone any good. If we just focus on victims, then whichever gender is more victimised will receive more focus naturally. Splitting us up into groups only disenfranchises some of us, and it makes male victims of rape (for example) feel like they can't get help because none of the focus is on them. I don't think gendered laws are actually ever a good idea. Instead of focusing a law on a gender, focusing that law on the *problem* experienced by that gender will always provide better results for society.\n\n Well yeah, women are more likely to hit their partner than men are. But this is using a very broad definition of 'hit' and is basically lumping in the wife who slaps her husband very occasionally with the dude who batters his wife. To call such slaps 'domestic violence' is concept stretching and unscientific. Whilst slaps would need to be eliminated before we can call ourselves a violence-free society, they're small fry. The state can't intervene to prevent/punish people for doing that, and probably shouldn't be - I know if that my girlfriend slapped me because I was being an asshole the last thing I would want to do is get the police involved.\n\nI'm actually referring to non-reciprocal violence. All sources I've ever read state that when only one partner is violent, it[.] more likely to be the woman. A woman who is violent toward her male partner while he does not hit her back because he is afraid (or any other reason) is not \"small fry\". It[.] abuse, plain and simple. I'm not saying the state should intervene when someone is slapped, but someone really should be getting dumped, and society hasn't really endorsed that (yet). I also want to draw attention to you minimising female domestic violence by qualifying it. \"Because I was an asshole.\" How about \"if that my boyfriend smacked me because I was being a bitch the last thing I would want to do is get the police involved\"? Doesn't that reek of abuse? \"I deserved it.\" It should, because it is. Being an asshole does not entitle someone to slap you, especially not if you are their partner.\n\n I don't support Mandatory Arrest Policies, if that[.] what your thinking. I'm favour of a more contextual approach, where police make a judgement based upon being briefed on the history of encounters between that family and the police prior to arriving at the scene. The Duluth Model is also not really a complete model of domestic violence (especially considering it[.] not that scientific...), but a tool used to help change abusers' behaviour.\n\nIf you're in favour of a contextual approach, any contextual approach at all, you are already against the Duluth model. It tosses out any context and only focuses on men as abusers and women (and children for good measure) as victims. Zero context. As a tool to help change abusers' behaviour, it[.] also not that effective - firstly, it is applied to less than half of violent partners, and secondly it[.] only been compared (to my knowledge) to doing nothing at all.\n\nAnyway, the overarching point here, for me, is that it[.] not helpful to blame only men for a problem that more women perpetrate (DV), nor is it helpful to ignore a subset of victims of a crime just because of their genitalia. The subpoint to that is that feminists (radical or not) are pretty quick to do both of these things, and the rest of the things in the post you originally quoted, and since I'm for equality, I'm forced to be against feminism."}