{"doc_id": "1744", "name": "2013_11_humanities_student_major_1170_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2013-11-humanities-student-major_1170_changemyview.txt", "pub_date": "2013-11-19T00:00:00Z", "Sentiment": "0.086", "Subjectivity": "0.316", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "271", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qzqyb", "Reddit_id": "cdi3vsh", "Subreddit_id": "t5_2w2s8", "Commenter": "[deleted]", "length": "1586", "content_scrubbed": "Let[.] think about the skills a liberal_arts degree trains you for:\n\n* Critical thinking- you are often required to assess positions, values, arguments, and strategies.  I think the applicability for this is so defensible I can leave it there.\n\n* Communicative skills- being a talented writer and speaker will get you far anywhere in life\n\n* Passion- often people discover things they really care about during their studies.  Pursing something in this will yield better results, because that passion will communicate itself in the quality of the work you do\n\n* Societal expectation- It[.] basically an expectation of society that for most fields you have at least a bachelor[.] degree.  You may think it may not give you a competing edge, but you will certainly have an edge over someone who doesn't have a degree at least.\n\nI agree with you somewhat- is just a degree good enough?  Probably not.  Work on finding an internship along with it to make up for the weaknesses education- networking and job experience.  \n\nBut in all, I think having a degree does give you an edge.  In finding that first job you may have some problems, but you will use your refined skills during your job to advance and perform well.  philosophy_major have as much trouble finding a job as most degrees, but what people forget is that once we enter a field, our average salary during our career is significantly higher than our counterparts- because the skills we learn in philosophy translate extremely well into basically any field you can enter.  Those same skills are often found in other degrees as well."}