{"doc_id": "1648", "name": "2013_11_humanities_student_major_224_uiuc", "namespace": "we1sv2.0", "metapath": "", "pub": "UIUC", "title": "2013-11-humanities-student-major_224_UIUC.txt", "pub_date": "2013-11-04T00:00:00Z", "Sentiment": "0.065", "Subjectivity": "0.409", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "380", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1puzlh", "Reddit_id": "cd6ki2k", "Subreddit_id": "t5_2qkxs", "Commenter": "soursprite", "length": "2052", "content_scrubbed": "I had graduated high school with just about every AP course taken and tested for. I would be entering college as an effective junior in terms of credits earned. I had applied for the GPPA medicine program at UIC but failed to get in. It was a bit of a relief, because despite my success in the math and sciences, I was not looking forward to a life in medicine.\n\nI had also applied (and been accepted) to Cornell, Northwestern, and Washington University and some other universities. For those, I had selected STEM majors to apply to, from biological sciences to hard engineering disciplines. To the University of Illinois however, I left myself undecided. I had picked the other universities because I felt like I should. I was in a position where I didn't really know what I wanted to do with my life. Having failed to get accepted to the UIC GPPA program, I used that as an excuse to not pursue medicine as a career. I accepted the UIUC program and enrolled in General Studies. I told my parents that I would not be going for a career in medicine or engineering. They were not happy.\n\nThat first year, my parents continued to pressure me into approaching medicine or pharmacy, while I stayed firm that I would not be going into the sciences. I paid for my own schooling, from money that I had saved up during my high school employment, hourly work on campus, and lovely lovely loans.\n\nI lived like a scrooge and kept my expenses low. I dumped every extra dollar I had into my loans, and made it through college with a degree in the humanities. I'm not filthy rich right now, but I'm far from poor. I do work that had nothing to do with my degree, but I'm happier for it. It was tough not getting financial support from family, but I paid for my own education and am now debt free.\n\nAnd now, I'm trying to pursue a graduate degree to follow studies I am genuinely interested in. I'm enjoying myself. You do not have to live a life that has been charted for you. You do have choices if you are willing to make the effort to deal with the consequences.\n\n"}