{"doc_id": "1704", "name": "2013_11_humanities_student_major_706_catholicism", "namespace": "we1sv2.0", "metapath": "", "pub": "Catholicism", "title": "2013-11-humanities-student-major_706_Catholicism.txt", "pub_date": "2013-11-12T00:00:00Z", "Sentiment": "0.192", "Subjectivity": "0.502", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "247", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qh3mg", "Reddit_id": "cdcq97y", "Subreddit_id": "t5_2qi4f", "Commenter": "kdoubledogg", "length": "1499", "content_scrubbed": "Good article. While I think most people will be concerned with the part about his same-sex attraction, I thought his section on education and the meaning of life are the most important. \n\nAt my college it is fascinating and depressing how rarely the \"big questions,\" are asked, especially among philosophy students. I think if you were to ask the majority of students in the philosophy department right now what the purpose of life is, they would have no definite answer. It[.] hard to continue building on philosophy if you have no base.\n\nI read another essay which essentially said that people have given up on the humanities, especially things like literature, philosophy and art because they have ceased to fulfill their promise to engage humanity at its core. They are now muddled with looking at the human existence through various filters (race, gender, political ideology) and completely miss the most radical and basic questions that humans need to answer.\n\nAs Pope John Paul II said in Fides et Ratio:\n\nHence we see among the men and women of our time, and not just in some philosophers, attitudes of widespread distrust of the human being[.] great capacity for knowledge. With a false modesty, people rest content with partial and provisional truths, no longer seeking to ask radical questions about the meaning and ultimate foundation of human, personal and social existence. In short, the hope that philosophy might be able to provide definitive answers to these questions has dwindled.  "}