{"doc_id": "1765", "name": "2013_11_humanities_student_major_1329_cfb", "namespace": "we1sv2.0", "metapath": "", "pub": "CFB", "title": "2013-11-humanities-student-major_1329_CFB.txt", "pub_date": "2013-11-21T00:00:00Z", "Sentiment": "0.154", "Subjectivity": "0.356", "Score": "24", "Upvotes": "24", "Downvotes": "0", "Wordcount": "389", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdjx2n6", "Reddit_id": "cdjygnl", "Subreddit_id": "t5_2qm9d", "Commenter": "StrikerObi", "length": "2230", "content_scrubbed": "I'm sure all the stuff this guy said is true, but the claim that Gaines St was \"artsy\" and that the Boosters are responsible for it now being \"once-artsy\" is 100% bull-fucking-shit and a clear indication of the author[.] anti-athletics bias. \n\nThe area of town he is referring to was literally a wasteland for the entire past decade I have been living in Tallahassee. It is not the arts district. It is adjacent to the arts district (Railroad Square), which is still thriving. In fact, the redevelopment of the area will do nothing but bring more exposure to the arts district.\n\nThe redevelopment was sparked by the City of Tallahassee, not the Boosters. Once it had enough steam behind it, the Boosters realized it would be wise to invest and make a profit, so they bought some old warehouses, bulldozed them, and started building. Of the dozen or so developments in this area, the Boosters are behind exactly one of them, CollegeTown. However, they have just begin plans for a \"phase 2\" of their successful development.\n\nOne of the companion developments is a low-cost living/studio space, partially funded by the city, for artists to use.\n\nAnother development, the very first one to go up, houses a very nice art supply store that would not exist if not for the redevelopment of this land.\n\nThe lone bar (really the lone anything) that existed in this area before the City and the Boosters started redeveloping is called The Warehouse. It is a favorite hangout of many of the grad students in the English dept thanks to hosting many poetry readings and other such things. I know this because I went there with one of my friends who was a grad student in that department. The Warehouse is still fucking there and doing just fine. In fact it looks better than ever.\n\nThe author is complaining about nothing, and is clearly butthurt because the \"normies\" and \"jocks\" are turning his floundering hipster neighborhood into a thriving part of town that people actually want to visit now.\n\nFor the record, I am a hipister. I love all of the hipster stuff in and around that part of town, and I'm super excited for all the new developments because it means more business and exposure for all the cool local businesses that reside there."}