{"doc_id": "1800", "name": "2013_11_humanities_student_major_1579_intj", "namespace": "we1sv2.0", "metapath": "", "pub": "intj", "title": "2013-11-humanities-student-major_1579_intj.txt", "pub_date": "2013-11-25T00:00:00Z", "Sentiment": "0.08", "Subjectivity": "0.313", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "330", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rgnvu", "Reddit_id": "cdn4vfx", "Subreddit_id": "t5_2qowo", "Commenter": "[deleted]", "length": "1773", "content_scrubbed": "Okay here it goes:\n\nFirst of all the fact that you equate liberal_arts with being something that can't satisfy someone with a restless mind is REALLY upsetting. Not only are some of the smartest people I know history/english/classics/language majors, but they are also much better employed than my friends who have their BS in bio or chem. I'm sorry to break it to you but no major will ever provide you with job security. YOU have to do that for yourself - with grades, internships, work experience, etc etc. You are wrong if you think that INTJs are only in the STEM field, or that only this field is challenging. \n\nYou said you got your GED. Why did you drop out? If you dropped out because you don't like school, I'm sorry to tell you that you won't find college that much different. What do you expect out of your degree? Are you looking for job stability? Are you looking to educate yourself and expand your interests, deepen your passions?? Its fine if you just want a chance at a good job - but maybe you should consider something like technical school or some sort of apprenticeship (IF school really isn't your thing.)\n\nIn any case, you seem really confused. I know most people can't decide on a major - I certainly couldn't. But I did have some idea of where I wanted to end up. You still don't know if you want to do history or chem or engineering? I mean - these are wildly different subjects and you're going to need to assess your strengths/weaknesses and your interests in order to narrow down what you want to study. I can \"appreciate\" science too - but I knew it really wasn't for me. Can you take more classes before you decide on a major? \n\nI really think you should talk to an advisor. This sub is not in the position to tell you what is best for you. "}