{"doc_id": "1673", "name": "2013_11_humanities_student_major_419_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2013-11-humanities-student-major_419_AskReddit.txt", "pub_date": "2013-11-07T00:00:00Z", "Sentiment": "0.055", "Subjectivity": "0.301", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "264", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd93tij", "Reddit_id": "cd941kt", "Subreddit_id": "t5_2qh1i", "Commenter": "Arribba", "length": "1581", "content_scrubbed": "Believe it or not, the professional world isn't entirely made up of Scientists, Engineers, and Businessmen. Almost half of all entry positions don't require a specific degree at all. Just that you have one.\n\nPeople value Liberal arts_major. History is a subject that everyone in America grew up studying, and as a result most employers at least respect the degree. It[.] a degree that is essentially the study of people and change over time. This is a soft skill, but in many fields, such as Engineering or IT, these soft skills are actually lacking. Profoundly. Engineering firms are plagued by inept management and business practices. Plagued by employees who lack communication skills. Engineers make a lot of money right out of college, but they hit their ceiling pretty fast, even with a Masters degree. Employers see a History or International Relations degree and say 'Hey, this kid can write and is an expert in a field I'm not an expert in.\" That might sound very basic, but 40% of entry positions don't require a specific degree at all. \n\nIt[.] a degree that opens doors to jobs in government (pretty wide field right there), consulting, analysis, research, technical writing, law enforcement, etc. Not only that, but people with History degrees frequently go on to become Lawyers, Doctors, Politicians, Professors, Teachers etc. \n\nIt[.] also the perfect degree to get if you want to do a double major with a hard_science. If you're doing business a double with International Relations works better, but with History it will at least make you stand out amongst competitors."}