{"doc_id": "1802", "name": "2013_11_humanities_student_major_1613_debateanatheist", "namespace": "we1sv2.0", "metapath": "", "pub": "DebateAnAtheist", "title": "2013-11-humanities-student-major_1613_DebateAnAtheist.txt", "pub_date": "2013-11-26T00:00:00Z", "Sentiment": "0.039", "Subjectivity": "0.355", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "274", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdneheq", "Reddit_id": "cdnitjm", "Subreddit_id": "t5_2ryfy", "Commenter": "simism66", "length": "1831", "content_scrubbed": " A philosopher who would have thoughtfully examined a question will have knowledge of some linked science and will rarely present himself as a philosopher.\n\nAs someone who works in academic philosophy, I can assure you that this is simply not true.  Philosophical naturalism is the leading methodological outlook in contemporary philosophy and philosophers are very keen to learn the science that is relevant to their work.  In fact, [the disparity between philosophers' knowledge of science and scientists' knowledge of philosophy](http://opinionator. blogs. nytimes. com/2013/09/18/sciences-humanities-gap/?_r=0) quite heavily favors philosophers over scientists.\n\nA neurologist answering some philosophical questions about the nature of conscience will probably have a far more interesting insight than a \"professional and academically respected philosopher\".\n\nDid you mean conscience, or consciousness?  Assuming you meant the latter, all I can say is that it[.] a collaborative effort.  The philosophers working productively in philosophy of mind, such as Dennett and the Churchlands, are very keen to be caught up on the relevant science and are always in conversation with scientists in the field.\n\nOn the nature of God, a lot of social_sciences teach us that while totally natural for a human being, the belief in the supernatural is endogenous and do not relate to an external reality.\n\nI don't really think social science makes a claim on whether or not God *exists* (at least I've never read a psych paper that makes that claim).  It[.] probably important to note that the *vast majority* (over 75%) of professional philosophers are atheists, and since the fields of epistemology, metaphysics, and ethics are *directly impacted* by the question of whether or not God exists, it[.] quite an important question for philosophers."}