{"doc_id": "1677", "name": "2013_11_humanities_student_major_492_againstmensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "againstmensrights", "title": "2013-11-humanities-student-major_492_againstmensrights.txt", "pub_date": "2013-11-08T00:00:00Z", "Sentiment": "-0.017", "Subjectivity": "0.328", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "437", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd9o3ic", "Reddit_id": "cd9pha2", "Subreddit_id": "t5_2snpl", "Commenter": "[deleted]", "length": "2401", "content_scrubbed": "I have you at +15 in vote weight fwiw. You said:\n\nIf you think that men having bodily autonomy, fairly adjudicated family courts and equal rights in higher education is a hate movement then I can tag you SRS right now.\n\nI feel like the MRM claims to represent these things but they fail to do any activism about it. What do you mean by equal rights in higher education? There are dozens of scholarships, at least in my state, for men (of any color) and most of the colleges around here are almost all white people and majority men. Women tend to have higher test scores than men at the beginning of their education but they are lower towards the end. Why is this? We should also examine the choices that men are making that are keeping them from going into grad school. Many are getting STEM degrees that do not require a grad degree, whereas most of the arts do (and more women pursue arts). I think everyone should have bodily autonomy and the feminists who I know personally fight for this, for everyone, men, women, trans, etc. \n\n   The entire court system is fucked- black men are being thrown in jail in droves for minor drug offenses. I don't think anyone should be jailed for using drugs. I think violent people need to be in jail and that is pretty much it. In my state, violent white people are rarely jailed. Child molesters of both genders are given very light sentences as well as people who seriously injure others in acts of intimate partner violence (of both genders) Anyway, what I am getting at is, I want all of these things you listed and more and that is why I went into a helping profession. It saddens me to see the MRM representing men in need when they often miss the mark when it comes to helping people and identifying bigotry. The constant demonizing of often straw-feminism is not only redundant and circlejerky but it goes hand in hand with actively alienating helping professions, the people who do actual activism and organize communities. Everything MRM related right now is online and anonymous and minority men are rarely mentioned. It is very upper middle class white male centric and only centered online and tends to come across as crass and woman hating. It makes it harder for people to work in the name of \"mens rights\" that aren't involved with the movement. Just my two cents, I know this is long. My gma just died and Im trying to get my mind off of shit :("}