{"doc_id": "1783", "name": "2013_11_humanities_student_major_1466_tumblrinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrInAction", "title": "2013-11-humanities-student-major_1466_TumblrInAction.txt", "pub_date": "2013-11-23T00:00:00Z", "Sentiment": "0.026", "Subjectivity": "0.241", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "381", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdlbmu0", "Reddit_id": "cdlmddm", "Subreddit_id": "t5_2vizz", "Commenter": "TheCodexx", "length": "2221", "content_scrubbed": "Psychologists can diagnose asexuals with hypoactive sexual desire disorder and try to \"fix\" it, even if the individual is not distressed by the lack of sexual desire.\n\nThis does open up an interesting debate. What[.] an \"identity\" versus a medical \"disorder\"?\n\nIt[.] not a conversation a lot of people want to have. I can see why. Some groups (trans, asexuals) would probably be unhappy if people generally decided that they were \"broken\". There[.] a stigma attached to the way you see yourself being a disorder. It[.] the same reason the Fat Acceptance crowd, which identifies as \"people of size\", get angry when obesity is referred to as a medical condition. Obviously it[.] not quite the same. There[.] less choice involved in being asexual or trans.\n\nBut I think it[.] an interesting concept. Are these people functioning incorrectly? Is it our duty to find a cure? If we could cure it (and we often can cure asexuality) then is it our imperative to heal someone who doesn't want to be healed? What if \"rejects treatment\" is part of the problem? There[.] a number of psychological issues that will intentionally avoid treatment. How do we classify identity \"disorders\" along *that* spectrum?\n\nI don't even know where to start answering these questions. I think it[.] worth the debate. But I'm kind of scared of what happens if/when people *do* ask these questions and not all of them end up being an answer people are comfortable with. What[.] the difference between \"oppressing\" someone and realigning their perspective? That[.] a scary thought, having your perspective skewed because it doesn't match the majority. But I also think it[.] odd that people can opt out of any sort of treatment, even if it[.] the condition that[.] influencing that opinion. Of course someone with a sex drive doesn't care if they do or don't have one. But if they *did* have one, would they find it distressing to lose it? \n\nI'm sure being asexual is difficult. I've met enough trans people who've said \"I wish I could choose to be something less difficult\". A lot of asexuals have that out. Some might even be able to have an autonomous libido once treatment is done. But a lot just don't see the point, even with their struggle to find acceptance."}