{"doc_id": "1639", "name": "2013_11_humanities_student_major_153_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2013-11-humanities-student-major_153_changemyview.txt", "pub_date": "2013-11-02T00:00:00Z", "Sentiment": "0.141", "Subjectivity": "0.405", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "312", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd4sfay", "Reddit_id": "cd5e53f", "Subreddit_id": "t5_2w2s8", "Commenter": "[deleted]", "length": "1939", "content_scrubbed": "However, someone studying English Literature, of course isn't going to be on the same level. I don't even think there[.] a claim, outside of philosophy, that humanities graduates have better critical thinking.\n\nEnglish lit major, philosophy minor here. I respectfully disagree.\n\nAdmittedly, it[.] entirely possible to earn an undergraduate degree in English without ever doing any real thinking, and the deluded stoners who approach it as something that shouldn't require any effort tend to make the rest of us look bad by association. But can't that equally be said of just about any program in philosophy? Think back and ask yourself whether all of the philosophy majors who graduated with you were capable critical thinkers.\n\nAs I'm sure you know, the experience is very different for those of us who mean it. What you may *not* know is that it is not any more the \"point\" of literary scholarship to extol the beauty of great works of literature than it is the \"point\" of philosophy to silently marvel at the elegance of various philosophical arguments. The relationship between literary scholarship and the literary text is actually almost exactly the same as that which exists between philosophy and the philosophical text: the former is a productive conversation informed by and grounded in the latter.\n\nThe (wildly various) problems that concern literary critics are inevitably philosophical problems. At bottom, the difference between literary criticism and philosophy is largely a matter of style; a competent critic is a philosopher who happens, for whatever reason, to use literature as his or her point of entry. Have you ever read any serious literary criticism? At its best, it represents a unique and beautiful fusion of creative, synthetic, and analytic thought. \n\nIf you honestly believe that a student can do that kind of work without having cultivated sophisticated critical thinking skills, I don't know what to tell you."}