{"doc_id": "1776", "name": "2013_11_humanities_student_major_1403_christianity", "namespace": "we1sv2.0", "metapath": "", "pub": "Christianity", "title": "2013-11-humanities-student-major_1403_Christianity.txt", "pub_date": "2013-11-22T00:00:00Z", "Sentiment": "0.111", "Subjectivity": "0.323", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "1717", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r8hhh", "Reddit_id": "cdkmwco", "Subreddit_id": "t5_2qh6c", "Commenter": "irresolute_essayist", "length": "9922", "content_scrubbed": "Pt 1\n\nA person synonymous with controversy: A personal reflection on why, for the sake of their students, Christian College campuses need to invite dialogue on homosexuality, chastity, and spiritual friendship.\n---\n\nI lead the normal life of a liberal_arts college student: I'm too overcommitted to do any one thing completely effectively. I wake up 10 minutes before class (and make it on time!). I am involved with a social fraternity, work two on-campus jobs. I live a busy life filled with laughter, late nights up talking to friends, and unappetizing cafeteria food. Most days are normal.\n\nSome days, though, it feels like my existence is synonymous with controversy. I say this because I'm a Christian predominately, but not exclusively, attracted to the same sex. I am a bisexual Christian who believes in the \"traditional\" (side B) Christian teaching on marriage and sexuality. I have seen at a distance and personally how controversial the existence of a person like me can become on a Christian college campus like my own. \n\nIn my school newspaper, we have had various writers from the campus gay student organization spouting the popular, \"You believe homosexuality is a sin? Well, the Bible says not to eat shellfish too\" line (which screams a pop-ideology of someone who is more familiar with \"Glee\" or \"The West Wing\" than with St. Paul or Jesus' teachings).\n\nOr, probably more damaging, I've heard random verse mining from a few fringe Christians who can be utterly dismissive of the struggles and experiences of gay folk. They offer no alternative community to these people whose \"lifestyle\" they disagree with (save to \"define the gay away\" and pretend Christian gay people don't actually exist). Not to mention I hear the pervasive, though quickly diminishing, slurs of \"queer\" and \"fag\" dropped by people who have no idea about my sexuality and even seem a little stunned when I ask them not to use hateful language.\n\nIt[.] a familiar and repetitious refrain of my past several years: I feel stuck between \"conservative\" Christians who would vocally grossed-out, if not flat hostile, toward my sexuality and \"liberal\" friends who simply cannot comprehend why I \"torture myself\" by refusing to go find myself a boyfriend. It[.] easy to feel misunderstood by both groups. Knowing a part of who you are, generates so many two-dimensional caricatures on either side of the debate, that it creates so much attention, ironically, can be very lonely.\n\n\nLevel-headed discourse is a rare commodity. One might think if there was any place for a gay Christian to think through his commitment to the life following Jesus as it relates his sexuality, it would be a Christian college campus. This has not been the case: not even in my college[.] religious life.\n\nTwo years ago, I led a freshman small group. A campus ministry spokesperson recommended all the leaders and their small groups go to the gay student organization[.] showing of the documentary \"For the Bible tells me so.\" All the groups went. It caused a huge divisive controversy in my small group.\n\nAfter the film, there was a question and answer session. A professor was asked about homosexuality and \"unrepentant sins\" by a friend of mine. As she reported to me, the professor responded, \"It[.] [same sex sexual acts] not a sin, we have to think critically and decide what is sin keeping in mind the ancient context in which these passages were written.\"\n\nThe message from the event was clear, scripture or the testament of the Church, were either interpreted incorrectly for the majority of church history or irrelevant. (Sometimes the reasoning we received from the Q&A and the movie differed on what interpretation to take).\nIn any case, the professor said we must determine for ourselves what is just and realize that the Bible, and those who interpret it, have their own prejudices. This point of view is true, in some senses (we all have our prejudices). But the more I studied, the more I disagreed with that take on how we \"retrieve doctrine\", even if I don't mean to silence that view on my campus.\n\nI hoped, and hope, straight students would be concerned with the task of making a better church and world for what I learned to call \"sexual minorities\". And, considering the fractured state, and poor quality, of the dialogue on campus, I wanted students who may be struggling with their own sexuality, as it relates to their faith, to be aware of other points of view.\n\nI wanted them to know they weren't alone in their journey following Christ in their vocation (even when their desires did not line up with it)...and I wanted to know all of these things myself. I wanted to this discussion to occur because, though I knew and not yet admitted it even to my close friends, I was one of those students: since middle school I knew I was attracted to other men.\n\nOnline, I was discovering there were gay celibate Christians who believed the Church could really \"Be the church for the homosexual Christian\" (as one of the first articles I read by Wesley Hill said). \"Why did we never hear this?\" I wondered. My short-lived mission to bring such dialogue to my campus began.\n\n\nI was not always noble in my attitude. I fluctuated between the most genuine heart-felt concern and, at my worst, self-righteous indignation at the community around me. I felt trapped and in the one place I thought that such dialogue, about being gay and chaste, about spiritual friendship, could occur! If there was any good to a Christian education, I thought, it was that it cared for the whole person: their mental, emotional, physical, and spiritual self. And I did not feel fed: I was starving.\n\nBecause of this unshakable idea of the possibility for something more for Christians like me (sexual minorities), I met with a religious life administrator on my campus and asked if we might be able to invite a celibate gay Christian to share his perspective. The only one I knew of at the time who did speaking was Christopher Yuan. I asked if my college could invite him to speak. I mentioned the showing of the film \"For the Bible told me so\" and my desire to present the other Christian view.\n\nThe administrator, director of Religious life, leaned back in his chair and said, \"Well, you know, this issue is coming to the Church. It[.] one thing to think about it abstractly and another when it[.] at your Church. When it[.] Sally and her girlfriend who wants to come to Church. Or George and his boyfriend...\" All of which I agreed with! All of which were the exact reasons I wanted to have a speaker living out his Christian commitment as best as he could in his life as a gay chaste Christian!\n\nBut here it was, what I thought were the best reasons, the greatest impetus, for inviting a \"traditional\" gay Christian speaker on my campus being used in a tone I can only describe as dismissive.\n\nThen I said it: \"But I'm gay. And I believe in this.\"\n\nIt was not the most thought out retort. Nor was it the most eloquent. We can even quibble about the exact accuracy of the term (would bisexual be more appropriate if I'm predominately but not exclusively attracted to men?). I knew I should have been more specific.\nWhat I really meant was \"I know what you're talking about, I'm interested in this in part because of my sexuality and I want not to erase gay people. I want to make the Church and this Christian college campus a better place for everyone—including those trying to live faithfully as they follow Christ.\" Of course, that[.] a mouthful. But, in any case, there it was, \"But I'm gay. And I believe in this.\" It was out there in the open. And what I meant, this administrator had to imply. \nWhich he seemed to do:\n\n\"I see... Well, okay, other students haven't yet made those sort of decisions for themselves.\" And he, in a roundabout way, informed me that the College Campus Ministries could not host an event with Christopher Yuan because they did not want to be seen as \"taking sides\". Taking sides! This was not about taking sides like one does when deciding whether to drink Pepsi or Coke or what NASCAR driver to root for. \n\nThis was about following Jesus and desperately searching to let others, to allow myself, to know we were not alone in that journey. That[.] all I wanted. The door to campus ministries' assistance slammed shut.\n\nInstead, the Director of Religious life recommended I plan the event with the gay student organization– the same one which hosted \"For the Bible tells me so.\"\n\nThe administrator was generally kind and I can sympathize with wanting to be cautious with the speakers one invites, but I was not happy with this solution. \n\nI responded, \"I think that[.] against their mission. I don't want to intrude...\" And against their mission it was. It is. That was the problem. There was no place for this idea of \"spiritual friendship\" or \"singleness\" or (God forbid!) \"celibacy\" to be spoken of on this Christian college campus.\n\nCampus ministries didn't want to take sides and the gay student organization was only for those on the \"affirming side\" (and, of course, I am guilty for not being a better bridge builder. I couldn't. I was not \"out\". I'm still not. The only people who knew about my sexual identity were my parents, a few friends, and the school psychologist I chose to speak to weekly that semester I really started to figure out how my life decisions and my sexuality intersected).\n\nStill, the administrator suggested I pursue organizing an event with the glbt+ student organization. I reluctantly made a request and the faculty adviser, the same man who spoke at the film showing, denied the request because of Christopher Yuan[.] \"lack of academic credentials\". I was disappointed and relieved. I didn't want to be the one who intruded on another organization[.] aims. I just wanted to make the college a better place for people trying to understand how their sexuality relates to their call to follow Lord Jesus....\n\n\n"}