{"doc_id": "1823", "name": "2013_11_humanities_student_major_1765_thebluepill", "namespace": "we1sv2.0", "metapath": "", "pub": "TheBluePill", "title": "2013-11-humanities-student-major_1765_TheBluePill.txt", "pub_date": "2013-11-28T00:00:00Z", "Sentiment": "0.032", "Subjectivity": "0.378", "Score": "38", "Upvotes": "38", "Downvotes": "0", "Wordcount": "1122", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rowqo", "Reddit_id": "cdpeljo", "Subreddit_id": "t5_2vzvv", "Commenter": "mrsamsa", "length": "6420", "content_scrubbed": "Some highlights:\n\nI was once told by a blue piller that simple creatures (specifically, a spider) having sex was not necessarily an innate instinctive behavior. It could be \"spider culture\" I guess.\n\nYes, because the only two possible options are: innate or culture. Nevermind the fact that I explained it in detail to him exactly why scientists don't assume something is necessarily innate just because it occurs across a lot of individuals within a species and he couldn't come up with a response.\n\nAh, yes, if she[.] drunk and she ties him down and fucks him, he raped her.\n\nHe then links to the thread he[.] discussing only to find that nobody in the thread claims that.\n\nIt really displays the difference in how both sides approach discussions. The RP side just states facts, logic, and even opinion. But even the opinion is non-judgemental. Or if it is judgemental, it[.] not attacking the argument, it[.] just attacking some idea of sorts.\n\nThen there is the BP side, which is snarky, sarcastic, condescending, and bitchy. It[.] fucking obnoxious to read. I just imagine some angry land whale SJW everytime I read one of their comments.\n\nGuys, we just can't handle their logic. This is coming from Puasenator who recently tried to argue that the RP is essentially a controlled experiment because lots of men were trying the same thing and discussing their results. When informed that it is nothing like a controlled experiment, he threw his toys out of the cot and argued that science isn't that important anyway.\n\nYup, when I posted over there and was talking about biology and psychology they called those Pseudo sciences... I was like wtf... I guess it only counts as science if they support your case.\n\nIn the comment thread he[.] referring to, literally the first line to his comment was that obviously biology and psychology aren't pseudoscience. He then concluded that the blue piller was arguing that biology and psychology were pseudosciences.\n\nLOL if I ever popped into that sub I would drive them crazy, my logic is fucking rock solid.\n\nThis is from illimitableman. Dude doesn't even know what logic looks like.\n\nThey actually banned good peer reviewed sources from the scientific community because they are behind quality journal[.] paywalls (and were supportive of TRP)\n\nSeriously, it[.] a conspiracy. Why won't they let me post articles in a debate sub that 95% of the users can't access?! (Ignoring the fact that the content of the articles directly contradicted his point).\n\nI brought this up with Purple, but one of the reasons I stopped visiting the sub has to do with the fact that so many of the BP regulars there claim to be scientists, psychologists, and psychiatrists.\n\nOoops, we're back to this already debunked desperate bit of hamstering.. So because most blue pillers aren't scientists and don't have access to articles behind pay walls, this must mean that no blue piller is a scientist - even though the people claiming to be scientists could access the articles and they responded to them.\n\nThis is almost as hilarious as when PizzaOnEarth tried to claim I couldn't be a scientist because I didn't link to the first google result for an article. I then revealed to him the existence of Google Scholar and it turned out that the first result there was the article I posted. \n\nA degree in STEM, or even psychology or sociology, is much different than a PhD in liberal_arts, such as gender studies or literature. These [.]cience' PhDs are competitive, require new research to graduate, and are considered so productive that schools pay you to go there. No student loans, no tuition. You even get extra money to take home and pay for yourself while you work.\n\nOn the other hand, if you want a gender studies PhD all you need is a bachelors and $200k you don't mind parting with. Any school will gladly take you on, and it is just an extension of a bachelors. Go to classes, write some papers. And pay tuition for another 8 years.\n\nHeck, it[.] so easy I reckon I could become an historian simply by filling out a form on the back of a cereal box!\n\nYeah overall it[.] a big waste of time. Not only that but they cherry pick the worst comments they can find instead of debating the real issues.\n\nThose bastards only comment on the issues they disagree with! Why won't you ever debate us on the topics you agree with? I don't understand!!\n\nThe \"citation needed\" response is dumb. Are people really that brain dead that they need some \"expert\" to think for them? Anybody that has done research in academia know that it is possible to publish anything you want. I can make up some rambling nonsense and get it published somewhere and use it as a source for these brain dead people.\n\nI think this guy has confused \"science\" with \"science fiction\".\n\nI love getting the \"source?\" response. It[.] how I know that I have won. It is the argument loser[.] last line of defense.\n\nYou don't think my claim has any basis in reality and all I can do to support my point is anecdotes? Bro, you've already lost!\n\nI was then banned and the mods stated to me, and in milder terms in their current stickied post that peer-reviewed scientific journal articles are not acceptable.\n\nAll I did was go on a personal attack spree, calling the mods cunts and accusing them of bias, why the fuck did they ban me?!\n\nIt[.] because named mrsamsa decided she was a man this week or something.\n\n...\n\nInteresting, I've had run-ins with her before... I guess she finally wanted a piece of that sweet male privilege?\n\n...\n\nI can confirm, mrsa has changed gender and occupation more than once in my dealings with it.\n\nI can confirm. I don't have any evidence or reasoning that confirms this. The last guy who confirmed it, PizzaOnEarth, had his ass spanked when he tried to vaguely refer to an instance where I might have referred to myself as a female, but hey, let[.] keep claiming it[.] true.\n\nWhat[.] more hilarious is that these guys obviously know they're talking shit and I imagine they're just circlejerking because they think it would piss me off. But I've never reported anyone for misgendering me. I correct them most of the time it happens but I generally don't give a shit as, unlike red pillers, I'm not an extreme misogynist who would take it as an insult to be viewed as a woman.\n\nI can't be bothered quoting any more, the whole thread is hilarious. Make sure you check out PizzaOnEarth[.] emotional breakdown, it[.] brilliant!\n\n\n\n"}