{"doc_id": "1708", "name": "2013_11_humanities_student_major_772_oregonstateuniv", "namespace": "we1sv2.0", "metapath": "", "pub": "OregonStateUniv", "title": "2013-11-humanities-student-major_772_OregonStateUniv.txt", "pub_date": "2013-11-13T00:00:00Z", "Sentiment": "0.233", "Subjectivity": "0.443", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "414", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qio1o", "Reddit_id": "cddfjle", "Subreddit_id": "t5_2s2fy", "Commenter": "HorseMeatSandwich", "length": "2386", "content_scrubbed": "Class of 2011 here.  \n\n1) Corvallis is basically your typical college town.  Population of about 60,000, and basically everything in the city revolves around the university.  You get a sense of camaraderie with everyone because so many people are either students or somehow affiliated with OSU.  There[.] a lot to do, plenty of good restaurants and bars, and it[.] right in the middle of a lot of great outdoor activities.  Tons of hiking nearby, close to the mountains, an hour from the beach, etc.  It[.] a cool town and I miss it.  Also, football saturdays are a blast.  \n\n2) The history program isn't necessarily top-tier, as the school is more science/engineering focused overall, but I have friends who majored in history and loved it (they're also all employed now putting those degrees to use, not baristas or anything like that).  All the history professors I had for gen ed classes were great.  I think the school is putting increased emphasis on Liberal Arts, so all the programs in that field are growing and on the rise.  \n\n3) On-campus living was fun.  I had a pretty weird roommate my freshman year, but overall dorm life was a great experience.  I met tons of friends, and it was nice being so close to everything.  The dining options were also pretty good.  Much better than what you would consider stereotypical crappy \"dorm food.\"  \n\n4) It[.] about 90 minutes give-or-take from Portland, and it was super easy getting there.  My junior and senior year, my friends and I would go up to Portland about once a month for a Blazer game or just to go out on the town.  The Eugene airport is about 45 minutes away, as well.  \n\n5) I would recommend it to anyone who isn't specifically looking for a smaller college feel.  OSU is a big school, and sometimes you can feel a little \"lost in the crowd,\" but once you make some friends and find your niche it[.] great.  Being a large school means it gives you the opportunity to do basically whatever you want.  There is a club or organization for pretty much anything you can think of, tons of intramural sports, a large and diverse student body, and a lot of academic opportunities.  I loved it, and I miss it every day.  Good luck if you decide on OSU!  Go Beavs!  \n\nEDIT:  [This video](http://www. youtube. com/watch?v=F_gFNzNniJA) gives a pretty good glimpse at campus life and opportunities at OSU.  Great, now I'm homesick for it."}