{"doc_id": "1641", "name": "2013_11_humanities_student_major_175_subredditdrama", "namespace": "we1sv2.0", "metapath": "", "pub": "SubredditDrama", "title": "2013-11-humanities-student-major_175_SubredditDrama.txt", "pub_date": "2013-11-03T00:00:00Z", "Sentiment": "0.033", "Subjectivity": "0.298", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1254", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd5arpa", "Reddit_id": "cd5mi3o", "Subreddit_id": "t5_2ss5b", "Commenter": "Rationalization", "length": "8274", "content_scrubbed": "These are absolutely not just internet posts and blogs. They are influential leaders with roots in academia, leadership of major feminist organizations, the justice system, literature, politics, etc. I have some quotes by influential feminists in real world positions of power. At the bottom are links to real world policies and demonstrations.\n\n-----------------------------------\n\n\"I feel that \"man-hating\" is an honorable and viable political act...\" – Robin Morgan, \"Lesbianism and Feminism: Synonyms or Contradictions?\", in Going Too Far: The Personal Chronicle of a Feminist, p 178.\n\n\"White males are most responsible for the destruction of human life and environment on the planet today.\" – Robin Morgan, \"Goodbye to All That\", 1970 in Going Too Far: The Personal Chronicle of a Feminist, p 123.\n\n\"(M)ale circumcision involves cutting the tip of the protective \"hood\" of skin that covers the penis, an area whose number of nerve endings are analogous to those in the **earlobe**, but not damaging to the penis.\" - Robin Morgan and Gloria Steinem, Outrageous Acts and Everyday Rebellions \n\n**Robin Morgan**. Key radical feminist of the American Women[.] Movement. Wrote Sisterhood is Powerful which has been widely credited with helping to start the general women[.] movement in the US. Was a founding member of radical feminist organizations such as New_York Radical Women and W. I. T. C. H. She founded or co-founded the Feminist Women[.] Health Network, the National Battered Women[.] Refuge Network, Media Women, the National Network of Rape Crisis Centers, the Feminist Writers' Guild, the Women[.] Foreign Policy Council, the National Museum of Women in the Arts, the Sisterhood Is Global Institute, GlobalSister. org, and Greenstone Women[.] Radio Network. She also co-founded the Women[.] Media Center with activist Gloria Steinem and actor/activist Jane Fonda.\n\n-----------------------------------------------------------\n\n\"Rape is nothing more or less than a conscious process of intimidation by which **all** men keep **all** women in a state of fear\" -Susan Brownmiller, Against Our Will: Men, Women, and Rape\n\n\"A major purpose of femininity is to mystify or minimize the functional aspects of a woman[.] mind and body that are indistinguishable from a man[.], and our legs have borne the brunt of this more than we care to acknowledge.\" - Susan Brownmiller, Femininity \n\n**Susan Brownmiller**. Wrote 4 books on feminism. Was a part of the New_York Radical Women organization. Brownmiller went on to coordinate a sit-in against Ladies' Home Journal in 1970, began work on Against Our Will after a New_York Radical Feminists speak-out on rape in 1971, and co-founded Women Against Pornography in 1979. Her papers have been **archived at Harvard**, in the Arthur and Elizabeth Schlesinger Library on the History of Women in America.\n\n-----------------------------------\n\n\"While men strut and fret their hour upon the stage, shout in bars and sports arenas, thump their chests or show their profiles in the legislatures, and explode incredible weapons in an endless contest for status, an obsessive quest for symbolic \"proof\" of their superiority, women quietly keep the world going.\" - Marilyn French, The War Against Women \n\n\"Sexual harassment exposed men[.] deep, unacknowledged sexual hatred of women and the censored fact that men are the agents of women[.] oppression.\" -- Marilyn French, The War Against Women \n\n**Marilyn French**. She was an English instructor at Hofstra from 1964 to 1968 and was an assistant professor of English at the College of the Holy Cross in Worcester, Massachusetts, from 1972 to 1976. Her most significant work in later life was the four-volume From Eve to Dawn: A History of Women, published by The Feminist Press in 2002. Has written fiction and non-fiction books about feminism, incorporating parts of feminism in her novels. Her first and best-known novel, The Women[.] Room, released in 1977, sold more than 20 million copies and was translated into 20 languages. A female character in The Women[.] Room declares, after her daughter has been raped: \"All men are rapists, and that[.] all they are.\"\n\n----------------------------------------------------\n\n\"American women live in a patriarchy in which the most dangerous man in town isn't the marauder or rapist, but their husband or lover.\" - Gloria Steinem, New_York Times\n\n**Gloria Marie Steinem**. Nationally recognized as a leader of, and media spokeswoman for, the women[.] liberation movement. Testified before congress. She was a columnist for New_York magazine and co-foundedMs. magazine.  In 2005, Steinem worked alongside Jane Fonda and Robin Morgan to co-found the Women[.] Media Center.  She also founded and co-founded many groups, including the Women[.] Action Alliance, on which she served as chair of the board throughout the 1970s; the NWPC, the Coalition of Labor Union Women; the Ms. Foundation for Women; Choice USA; and Women[.] Media Center. From 1971 to 1975, she served on the Advisory Board of the Westbeth Playwrights Feminist Collective—one of the first NYC based feminist theater groups. As the postergirl of the Feminist Movement, Steinem frequently appeared on news shows, television talk shows and specials, and on the covers of newspapers and magazines such as Newsweek, Time, McCall[.], People, New Woman, Ms., and Parade. \n\n----------------------------------\n\n\"Men who are in prison for rape think it[.] the dumbest thing that ever happened... It isn't just a miscarriage of justice; they were put in jail for something very little different from what most men do most of the time and call it sex. The only difference is they got caught. That view is nonremorseful and not rehabilitative. It may also be true. It seems to me we have here a convergence between the rapist[.] view of what he has done and the victim[.] perspective on what was done to her. That is, for both, their ordinary experiences of heterosexual intercourse and the act of rape have something in common. Now this gets us into intense trouble. because that[.] exactly how judges and juries see it who refuse to convict men accused of rape. A rape victim has to prove that it was not intercourse. She has to show that there was force and she resisted, because if there was sex, consent is inferred. Finders of fact look for \"more force than usual during the preliminaries.\" Rape is defined by distinction from intercourse—not nonviolence, intercourse. They ask, does this even look more like fucking or like rape? But what is their standard for sex, and is this question asked from the woman[.] point of view? The level of force is not adjudicated at her point of violation; it is adjudicated at the standard of the normal level of force. Who sets this standard?\" \"Sex and Violence: A Perspective\" (1981), p. 88\"\n\n**Catharine MacKinnon.**  An American feminist, scholar, lawyer, teacher and activist. Is the Elizabeth A. Long Professor of Law at the University of Michigan Law School.[3] In 2007, she served as the Roscoe Pound Visiting Professor of Law at Harvard Law School. MacKinnon is a highly cited legal scholar. She has frequently been a visiting professor at other universities and regularly appears in public speaking events. The Supreme Court of Canada largely accepted MacKinnon[.] theories of equality, hate propaganda, and pornography, citing extensively from a brief she co-authored in a ruling against Manitoba pornography distributor Donald Butler.\n\n--------------------------------------------\n\n[Men[.] Group Hosts Anti-Sexism Dialogue While Protestors Scream to Shut Down Event](http://www. youtube. com/watch?v=jQzQBTkQZWU)\n\n[How a feminist debate was derailed by asking all men to leave](http://www. theguardian. com/commentisfree/2012/dec/03/asking-men-to-leave-feminist-film)\n\n[\"An effort to guard the empowerment of women[.] voices on campus took form Monday when the Ryerson Students' Union (RSU) swiftly adopted a bold new policy rejecting the concept of misandry – the hatred or fear of men.\"](http://theeyeopener. com/2013/03/new-rsu-policy-challenges-new-mens-issues-group/)\n\n[Women[.] Right[.] groups responsible for shooting down legislation that adds men to the possible victims of rape.](http://www. deccanherald. com/content/309399/womens-groups-reject-ordinance-threaten. html)"}