{"doc_id": "1770", "name": "2013_11_humanities_student_major_1357_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2013-11-humanities-student-major_1357_AskHistorians.txt", "pub_date": "2013-11-21T00:00:00Z", "Sentiment": "0.106", "Subjectivity": "0.309", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "524", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r4qd7", "Reddit_id": "cdk72nn", "Subreddit_id": "t5_2ssp3", "Commenter": "[deleted]", "length": "3166", "content_scrubbed": "I think it would be useful to briefly chart the development of Dar-al-Islam, or the Islamic states, as you say. \n\nTwo things to keep in mind: \n\n1) The Roman Empire and Sassanid Empire possessed highly developed political structures with centuries if not millennia of political theory, philosophy, and culture upholding them. These did not disappear. And in most cases, the original Bedouin or Hejazi Arab Muslims were not the majority of the population in the early Islamic period. They certainly spread and migrated and many tribes came to settle in Mesopotamia or Syria or Iran or Egypt but assimilation always goes both ways.\n\n2) The Early Muslims were not as organized as we may think. There have been some arguments that the yearly tribal raid (Ghuz) became impossible when most tribes converted to Islam, because they were all in the same 'tribe' or family of Islam and one could not raid one[.] tribe members. So they raided the only people they could, the ones to the north. \n\nThe early caliphate (first 4 caliphs) was essentially a big tribal organization. Arab leadership was based on senior tribal leader democracy, so the chiefs (or luminaries) chose among themselves by voting. Governors and other administrators were appointed. The government was highly centralized. The caliph would send someone he trusted to govern and after a period of certain years, might appoint someone else, etc. \n\nWhen the Abu Umayya clan took over the caliphate following the civil war with Ali, the government became centralized along Roman lines. The capital was in Damascus and the chief bureaucrats and administrators were mainly Romans who had converted to Islam. This was a government based on the Umayya and organized along Byzantine/Roman lines. So the tax collection, etc, were all given to certain governors who were responsible for getting so much back to the central treasury. Things worked out fine enough until they didn't. \n\nThe Abu Abbas took over in 9th century. Their model was based on persian administration. Here things get interesting. From the 9th century onwards, the Persian practice of appointing sub-kings , if you will, takes root. The caliph gives out land to certain dynasties and they rule it on his behalf. This leads rise to a sort of feudalism but I am hesitant to call it that. This is also the great rise of Islamic science and humanities as all of these little provincial courts try to distinguish themselves by sponsoring the next big thinker. \n\nEuropean Feudalism is a unique phenomenon. I  would not say that the Islamic states were similar to Feudalism, but that certain ways of ruling seem to be more or less efficient given certain circumstances, and both shared some similarities, especially in the 10th and 11th century. The centrifugal forces in Islamic governance arose from a need to accommodate local reality with state ideals and it did so by using a commonplace tactic that had been developed in Persia thousands of years ago and had probably also been developed in many places, namely, having someone rule on your behalf. European Feudalism is a whole different thing though on a superficial basis, it did incorporate this. "}