{"doc_id": "1732", "name": "2013_11_humanities_student_major_1093_rant", "namespace": "we1sv2.0", "metapath": "", "pub": "rant", "title": "2013-11-humanities-student-major_1093_rant.txt", "pub_date": "2013-11-18T00:00:00Z", "Sentiment": "0.111", "Subjectivity": "0.437", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "737", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qvnw3", "Reddit_id": "cdh34mg", "Subreddit_id": "t5_2qn2b", "Commenter": "marcuschookt", "length": "4255", "content_scrubbed": "I'd like to shed some light on this matter from another perspective here.\n\nI'm an arts student studying in the only pre-tertiary arts school in my country (I'm 17). We take the IB so there are both art and academic teachers in school. Being an arts school things are very different for us than they are for 99% of other pre-tertiary students in the country (e. g. they take their \"O\" and \"A\" levels and we take IB, and our teacher-student ratio is about 1:20, which is unheard of in non-private schools).\n\nThe teachers here have no illusion that what they're doing isn't considered \"the forefront of progress\". Most of the teachers here know that teaching wasn't their first choice for a career, neither do they try to fool us into thinking so. Regardless, they put in copious amounts of effort into carrying out their duties, and they are terrific at their job.\n\nTo put it in perspective, I come from the tiny nation of Singapore. We don't have many physical goods here to offer the world, like livestock or agriculture, and so for decades we've had to try to carve it out by making our people the goods for trade, so to speak. Education and job-wise, the culture here is EXTREMELY competitive. If you take a look at [this](http://app. msf. gov. sg/ResearchRoom/ResearchStatistics/PercentageofUniversityGraduatesinSingapore. aspx) small statistic, you'll get the idea that the general education trend here is a sharp increase in overall education levels. This means to say that we're a nation quickly becoming overqualified to support itself.\n\nIt[.] been a hot topic of discussion in the country these past years. Singaporeans don't wanna stay around because they grow up, get a degree or two, and realize all the jobs they're qualified for have been taken up by others. They look around and the only jobs left are shitty jobs they are over-qualified for, from manual labor to, yes, teaching. It sounds stupid, calling teaching a shitty job, but with the education level of the general populace, it[.] quickly becoming something less desirable.\nEvery Singaporean dreams big and beyond, and that[.] why we're facing a cultural crisis of sorts because all the young citizens are running off to other countries to set up their lives.\n\nWhy I brought this up, and why I brought up the fact that I'm in an arts school, is because more so in my school is this competitive mindset prevalent. In the arts, everybody wants to practice it, EVERYBODY. You will hardly find a music major who \"just wants to study theory\". The arts teachers in our school are all over-qualified. The dancers have had numerous accolades in their preceding years, the thespians are well known in the Singapore theatre community, the Visual Artists are big names that hold their own solo-exhibitions annually, and the Musicians are all accomplished in some form or another. And yet most of them ended up here because they couldn't keep the dream alive long enough, and they had mouths to feed.\n\nI've talked to many of my teachers about it. Some of them openly admit they hate it. They feel like they should be out there in the frontline doing what they do best, but they know they can't because the demand is too low and the supply is too high. To me, there are dozens of brilliant minds in our faculty that have been suppressed not by anyone in particular, but the fact that they've just been left behind by progress.\n\nThat being said, I did mention that this has not hampered them from being the best teachers they can be. They work hard because they found in themselves a belief system to support them. They tell us constantly that we're supposed to bring change to things when we grow up and start working, and that[.] why they're working their asses off.\n\nSo I submit to you, the idea that \"those who can't do, teach\" is true to a LARGE extent. I know that there are many who do it because of passion, but you can't deny the fact that many would rather practice than teach. You can't blame the faltering American education system on this mindset, because I proved that this is a common conception worldwide, and yet it is handled differently from nation to nation. I wouldn't dare to guess what it is that makes America[.] education system flawed, but I venture to say it certainly isn't this."}