{"doc_id": "1788", "name": "2013_11_humanities_student_major_1506_books", "namespace": "we1sv2.0", "metapath": "", "pub": "books", "title": "2013-11-humanities-student-major_1506_books.txt", "pub_date": "2013-11-24T00:00:00Z", "Sentiment": "0.149", "Subjectivity": "0.415", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "328", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rdf0d", "Reddit_id": "cdm9v8k", "Subreddit_id": "t5_2qh4i", "Commenter": "J_Sto", "length": "1931", "content_scrubbed": "Spoke with some freshmen this summer who were assigned *Divergent* for honors-level English. I told them they were being cheated. Looked at their assignment and the teacher was really reaching to try and create enough connections to make that book worthy of any form of analysis. \n\nBy the time students can appreciate what challenging lit coursework does for them they'll be out of high school. In school I didn't read anything that wasn't literary and worthy. Even if I didn't personally care for the title the work was still interesting and valuable. The ethos of the AP curriculum is that it is wisest to read the best books first, and rightly so.\n\nStudents should be mandated to read literature especially as it ties to history and other humanities topics. Critics back up their analysis with evidence from their texts: These lists are not arbitrary. And of course the class must read the same work if there is to be any workshopping and discussion around the criticism. Some people might love a text, some might not. Good sports contribute regardless because that[.] how this format of discussion-based class works. Hopefully everyone in the class connects with at least one of the works covered.\n\nThat said some schools allow students to choose their own title for one assignment a year and I think that[.] a nice balance and teaches additional skills.\n\nYou can read whatever you want on your own and develop your own analysis techniques after you're a badass at reading actively, breaking down texts and have standard crit skills. Until then, padawan, get your game face on and defer to the expertise of your teachers and professors. You have masters curating lists for you, providing you the material and using their expertise to pass their skills to you! On the pragmatic side, if you can't analyze texts and complex material, then people like me will be able to manipulate you and you'll thank us for it without realizing.\n"}