{"doc_id": "1731", "name": "2013_11_humanities_student_major_1080_ladiesofscience", "namespace": "we1sv2.0", "metapath": "", "pub": "LadiesofScience", "title": "2013-11-humanities-student-major_1080_LadiesofScience.txt", "pub_date": "2013-11-17T00:00:00Z", "Sentiment": "0.112", "Subjectivity": "0.426", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "509", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qv9m7", "Reddit_id": "cdgvz03", "Subreddit_id": "t5_2sg5m", "Commenter": "ellipticcurve", "length": "2822", "content_scrubbed": "(Girl, BS/MS CS)\nPoint the first. You're right--it[.] too early to panic. IMHO, freshman year should be about taking lots of different classes and figuring things out. Like the fact that you miss science: that[.] an important data point, no? While it[.] true that I personally never changed my major, I was also one of the few in my group of friends that never did.\n\nPoint the second. STEM secret time: *everybody* feels like everybody else has got things down. I promise you this. Sure, there[.] always this one guy who just knows everything ever, but there[.] only one of him. [1] There[.] way more kids just keeping their heads down and going to office hours when they need help, which is maybe quite a lot. And though I never did a survey, I think most people in STEM don't think of themselves, necessarily, as \"math people\". I certainly didn't. I did well enough, because I worked at it.\n\nPoint the third. One thing we're beginning to recognize about women in STEM is that the sort of women who'd do well in STEM are \"globally gifted\"--[they're also talented in the humanities.] (http://www. news. pitt. edu/women_STEM) As a kid, I was pretty good at math and science, but I was so *very* talented at English that everyone just assumed I'd grow up to be a writer of some kind. Nobody actually steered me away from STEM at any point... but I got a hell of a lot more encouragement and support for my writing. Hell, my verbal SAT score was well above my math score, which is unusual for the sciences and which I was a bit self-conscious about for a while.[2]\n\nConclusion from points 1-3: ***You should definitely check out the sciences***. It[.] early enough for you to switch; the fearsome nerds of STEM are not any more talented than you, and anyway diligence is better for STEM than talent; and, because of crappy societal reasons, while you may not have actively been *discouraged* from STEM, you may not have actually been *encouraged* much in that direction either.\n\nThe most important thing you need to do now, IMHO, is focus on math. No matter what branch of the sciences you end up in, math is going to make or break you. You need to get into the highest math track, and you need to get there ASAP. How you do that will depend on your particular situation and how your school is set up. Go talk to a guidance counselor. It[.] not too late to do this, but you do need to act soon.\n\n[1] Also, in my college, that one guy? The *other* story about him, aside from his genius, was that he allegedly treated office hours like lectures: he'd go to every one, for the whole duration, with questions prepped ahead of time. So even that one guy puts in effort, albeit not necessarily where you can see.\n\n[2] I ended up minoring in English, and today I consider my mad writing skillz one of my most important professional strengths."}