{"doc_id": "1696", "name": "2013_11_humanities_student_major_626_catholicism", "namespace": "we1sv2.0", "metapath": "", "pub": "Catholicism", "title": "2013-11-humanities-student-major_626_Catholicism.txt", "pub_date": "2013-11-11T00:00:00Z", "Sentiment": "0.016", "Subjectivity": "0.406", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "655", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qdf70", "Reddit_id": "cdbqn75", "Subreddit_id": "t5_2qi4f", "Commenter": "kdoubledogg", "length": "3670", "content_scrubbed": "Hi there. I go to Dickinson College (a small liberal_arts college) and am part of the Newman Club here on campus.\n\nThe feel of our Newman Club is not much of a feel at all. Most people do not even know that our Newman Club (Catholics included) exists. The Newman Club itself is a very dead organization on our campus. They occasionally organize an event (maybe 1-3 events per semester), which are usually attended by less than five people. Church attendance is not particularly bad for a school our size (around 2000 students) and we draw in probably 40-50 students for each Sunday mass and even more for special masses. The problem is that it is a constantly rotating group of students who attend when they have the free time, and probably less than 20 make it to mass each and every week. The mass is nice and is held in a beautiful historical building on campus, but does little to foster community among the students. People mainly go to mass and then go about their lives. One bright spot in Catholic culture on campus is that we have a beautifully directed choir which draws in many students (and keeps them coming to mass every week). The choir does normal hymns, but also does some beautiful chanting. The only problem is that this appeals to a small group of students (those who can sing well) and really does little more than meet once a week for practice and attend mass.\n\nThere really are no main issues for the Newman Club outside the fact that it really does nothing. Its incredibly hard to foster community within the Catholics on campus, because often times getting to mass is the extent of their commitment (which is not that bad in this day and age). If you have any suggestions for how you guys create a sense of community, I am all for it. The other area that is really lacking is continuing catechesis for all the students. I have had more theological discussions with my non-Catholic friends and professors, than with priest or fellow Catholic students. Again, I feel like we do not do anything because it will probably be unattended, though there may be other reasons. One such reason is that our campus is politically liberal and even among those who attend regularly, they often hold views contrary to the Church (obviously, the most often relates to sexual ethics). I think the Newman Club is sort of afraid of treading on people[.] toes and estranging them from the Church because their commitment is not that strong already. So all of this causes moral stagnation for the Catholics on campus. There is hardly any sense of belonging and most Catholics keep quiet (or are uninformed) about their opinions. To be brutally honest, it[.] a hard cycle to break since nobody wants to grow in their faith, so we do not have community or theological learning, thereby keeping people from wanting to grow in faith. \n\nSecularism is the dominant force on campus. It would be seen as uncool to be radically attached to the Catholic faith. This makes it difficult to be Catholic on campus, since Catholicism is not merely a weekly commitment but calls us to be radically attached. Our campus chaplain is extremely busy, but I often wish he worked harder to help us grow spiritually. I only see him once a week during mass, and students hardly ever interact with the community parish.\n\nSorry if I painted a bleak picture of my campus[.] Catholicism. It something that is incredibly hard for me to deal with since I want Catholicism to be the center of my life, but I cannot do it alone. It[.] difficult in a small school because it is hard to build up a significant mass of people, but I really am open to suggestions from you or anyone else on this subreddit. "}