{"doc_id": "1817", "name": "2013_11_humanities_student_major_1720_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2013-11-humanities-student-major_1720_philosophy.txt", "pub_date": "2013-11-27T00:00:00Z", "Sentiment": "-0.054", "Subjectivity": "0.45", "Score": "40", "Upvotes": "40", "Downvotes": "0", "Wordcount": "319", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rlkdv", "Reddit_id": "cdoqojo", "Subreddit_id": "t5_2qh5b", "Commenter": "[deleted]", "length": "1932", "content_scrubbed": "A while ago, I saw a video of theoretical physicist Michio Kaku claiming with confidence that humans are no longer evolving (because of plane travel or some crap like that).    Michio Kaku is not an evolutionary biologist, I found his reasoning nonsensical, and that week New Scientist produced research (a meta-analysis of existing research data) that proved this claim wrong.  So despite being a super smart theoretical physicist, Kaku was basically talking out his arse.\n\nSo I do appreciate that it must be annoying for them when people step out of their field to make comments on physics for which they don't have the proper understanding.  It[.] just that they shouldn't get any ideas that they're the only ones to fall victim to this.\n\nEveryone has a weakness for doing this, but it[.] not very interesting to talk about.  Hawkings et al hate philosophers because they typify philosophy as some monolith that it isn't. That suggests a lack of acquaintance with philosophy proper. \n\nIn philosophy, there have been great defenders of the scientific method and inductive reasoning in science, such as Popper, but there have also been complete boobs like some professors at my uni that will go unnamed but should stop talking about the colour of quarks before I throw something at them. \n\nRichard Dawkins is similarly a really great evolutionary biologist... you see where I'm going with this. \n\nThe only other explanation I can give from this comes from my current studies in a combined BSc/BA where I'm majoring in chemistry and philosophy.  The arts half seems really ridiculously easy compared to science and maths, and the workload is a lot lighter.  So maybe the physicists are pissed off that they spend years melting their brains away to do their PhD whilst imagining philosophy PhDs just writing a big long essay while sipping on Martinis in a dressing gown and slippers.    \n\nTL;DR Sour grapes for narcissistic physicists."}