{"doc_id": "1768", "name": "2013_11_humanities_student_major_1353_denver", "namespace": "we1sv2.0", "metapath": "", "pub": "Denver", "title": "2013-11-humanities-student-major_1353_Denver.txt", "pub_date": "2013-11-21T00:00:00Z", "Sentiment": "0.049", "Subjectivity": "0.394", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "266", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r5nfw", "Reddit_id": "cdk60rf", "Subreddit_id": "t5_2qn3i", "Commenter": "snoreee", "length": "1535", "content_scrubbed": "I'm a certified addictions counselor and familiar with most agencies. If your low income-no insurance you should call Arapahoe House. They're by far the largest sub agency in CO and have low income services. They have a 45-day inpatient program, but I don't  believe its free.  Salvation Army has a pretty good inpatient program, with good aftercare, but typically has a long waiting list. The key parts is has she applied or been approved for medicaid? Does she have SSI? Is she a vet? Do you know if she also has a MH diagnosis? Mental Health Center of Denver has a few inpatient dual diagnosis options if she[.] already setup with them. There[.] options, but if she[.] a homeless, no med coverage, and against going-you need all the luck cause there[.] very limited services. You can always take. him to detox at Denver Cares or Arapahoe House, and then review his needs then.\n\nPeople on probation or parole you have a few options, otherwise I hope you have high income. CeDar is one of the major programs, but very expensive. Also there is the ARTS program that is ran by CU-Denver but I don't think they do inpatient, but offer intensive outpatient and RX assistance (suboxone, methadone, Vivitrol). I think if she did Intensive Outpatient, along with possibly Vivitrol, that'd be huge. Then review any possible psych needs when she is sober. Sorry.... on mobile. \n\nEdit: my post applies better for gen info, i must've misread OPs post because some of this doesn't apply. PM me and I'll help a. lot more on a comp. Hate typing on mobile "}