{"doc_id": "1666", "name": "2013_11_humanities_student_major_361_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2013-11-humanities-student-major_361_politics.txt", "pub_date": "2013-11-06T00:00:00Z", "Sentiment": "0.015", "Subjectivity": "0.193", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "1899", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd8btce", "Reddit_id": "cd8czh9", "Subreddit_id": "t5_2cneq", "Commenter": "MGDarion", "length": "11871", "content_scrubbed": "I'll have to start this and come back to it later.  Such a long list.  So much to do.\n\n Religious speech for Christians.\n\nIn the public square.  Few Democrats are opposed to private religious speech.  You just don't get to force your opinions into schools.\n\n Religious symbols for Christians.\n\nSame as above.  Private property or your own time-fine.  Government property-not fine.\n\n Radio/talk show topics.\n\nSource?  They dislike certain talk shows.  So do Republicans.\n\n Forced sterilization. (i. e. vasectomy, and hysterectomy)\n\nWhere the heck are you pulling this from?  This may have fringe support, but I don't think this has major party support.\n\n Parent consent for birth control.\n\nYes, because a fourteen year old ought to get pregnant when she has sex and carry her child to term if that[.] what daddy wants.  Children are not property of their parents and they do not always behave as they should.  And they should not suffer life-long consequences for the pigheadedness of their parents. \n\n Medication at school.\n\nWhat do you mean by this?  Schools in most states can't medicate without parental consent forms on file, outside of basic things like motrin and Tylenol.  I didn't know this was any sort of issue.\n\n Immunizations for children.\n\nImmunizations are generally not effective unless the vast majority of the population receives them.  Numerous studies have shown them to be safe and effective.  However, parents may opt out via a religious exemption.\n\n Who colleges accept, and why.\n\nThe government has little to no control over this unless it is a state school.\n\n Homeschooling\n\nFalse.  I was homeschooled until tenth grade.  This varies very much by state.  In my state, we simply had to take the standardized tests (CATs).  We didn't even have to pass (though I always had 90th+ percentile in all areas).\n\n Literature must be non-offensive and politically correct.\n\nIn what sense?  I don't know many liberals in favour of censorship.\n\n Taking classes on Sex Education.\n\nActually, in many states, students or parents may choose to opt out of Sex Ed.  That said, I find that to be incredibly foolish.  But it is an option.\n\n Abstinence education\n\nMany schools still teach abstinence education.  However, since it has proved relatively ineffective in lowering the high school birth rate, there comes a time when you need to take a long look at the system and see if an alternative might work better.\n\n Intelligent design education\n\nIntelligent Design is not science.  It[.] religion.  Call it what you want, but it is not a scientific theory backed by the evidence.  I was raised a Creationist, then I lost it studying apologetics and skeptics.  Fully lost it when I became a Biology major.  Intelligent Design doesn't have evidence.  It doesn't have logic.  It doesn't have scientific validity.  So, no, we won't teach that in the science classroom.  Now, if you'd like to teach that in religious studies or in church, go right on ahead.  But don't play like it[.] science or like it deserves equal recognition with the theory of evolution.\n\n Size/weight of vehicles you can buy, manufacture, import, or use.\n\nGovernment[.] regulated trade for a long time.  That[.] not some new liberal thing.\n\n MPG of vehicles you can buy, manufacture, import, or use.\n\nThis a) protects the environment and b) saves you money.  What[.] the problem?\n\n Who you may like, dislike, hate, disagree, or agree with.\n\nWhat do you mean by this?\n\n Who companies can hire.\n\nI think you are confusing nondiscrimination with forcing changes in belief.  You shouldn't be able to hire or fire someone based solely on things which they cannot control, such as race, gender, or sexuality.\n\n Who owns and controls businesses.\n\nWhat do you mean by this?\n\n What companies may advertise,\n\nIf you mean the FCC, the Republicans set that up.\n\n What their advertisements can say.\n\nSee above.\n\n Minimum and maximum wage. Salary and benefits.\n\nAh, I see, we should let the poor starve on dollar a day wages, just like we did in the Gilded Age.  And I don't think I've heard many liberals calling for a maximum wage, much as I wish they were.\n\n Retirement and saving plans.\n\nWhat do you mean?\n\n Paying into Social Security.\n\nYep.  We should just let all the elderly live in poverty when they get old.  I mean, that[.] about what happened before (all is an exaggeration, but significantly more).\n\n Union membership.\n\nMandatory union membership?  Which liberals advocate this (and where can I vote for them?)\n\n Unions uses of dues, and their membership requirements.\n\nUnions usually set these, not politicians.\n\n Voting ID requirements.\n\nThat would be your friends the conservatives.  The liberals don't want this, usually.\n\n Club Membership/Requirements.\n\nWhat do you mean?\n\n What animals you may own, or eat.\n\nUm, yes, we have protections for endangered species.  Not sorry if this offends you.\n\n Where you can have certain animals, and how many.\n\nSame as above.\n\n Whether you spay/neuter your pets.\n\nI don't hear many liberals talking about this.\n\n Gun ownership.\n\nWith the recent outbreak of shootings, I think there[.] a case here.\n\n Gun registration.\n\nYou have to register everything else, and those things aren't deadly.\n\n Which types of guns, magazines, and ammunition.\n\nNot sorry for trying to minimize the impact of future shootings.\n\n Where and what you may hunt or fish, even on land you \"own.\"\n\nOverfishing can hurt everyone.\n\n Landowners use of property.\n\nWhat do you mean by this?\n\n Who you may sell or rent your house/apartment to.\n\nSource?  I don't see liberals too worried about this.\n\n Smoking, unless its marijuana.\n\nYes, because tobacco smoking has serious health problems which drive up everyone[.] health care costs.  Marijuana does not.  And they don't typically want to ban it.  They want to put warnings on it.\n\n Who can drink alcohol.\n\nDid you seriously argue that?  Do you think the government should allow feeding toddlers alcohol to be legal?\n\n How much alcohol you can drink.\n\nOnly if you're going to drive or act up in public.  No one cares how much you drink in your own home.\n\n Consumption of sugar.\n\nSource?  Not heard this one, either.\n\n Amount of salt in food.\n\nHealth issue.  Driving up health care costs.\n\n Number of calories in your meal.\n\nSource?  I haven't seen major legislation in this area pushed.\n\n The size of your soft drink.\n\nOne city is not all of the liberals in the country.\n\n Genetically modified food.\n\nGM foods are safe.  There[.] lots of evidence behind this.  I am sick of this debate.  Genetics and proteins are my specialty.  You're in no more danger from GM foods than if I went and selectively bred your food, which has been happening since farming began.\n\n Eating trans fats.\n\nSource?\n\n How food is handled/prepared.\n\nSource?\n\n How much your Doctor can charge.\n\nBecause health care costs in this country are reasonable...\n\n Required medical tests.\n\nHealth care costs.  Preventative medicine is usually cheaper.\n\n HPV shots.\n\nNot required.\n\n Immunizations.\n\nYou said this twice.  Do you hate biomedical science?\n\n Help the poor/homeless.\n\nWhat do you mean?\n\n Disaster aid.\n\nConservatives never support this.\n\n AIDS education as required class.\n\nWhat?  Where'd you hear this one?\n\n Funding AIDS research.\n\nWell, yes, we fund all sorts of biomedical research.  Why not AIDS research?\n\n If doctors can disclose if you have AIDS.\n\nThey can't.  It violates the very stringent privacy standards medical professionals are held to.\n\n Health insurance\n\nRight.  People without should just be a burden on the system or die, right?\n\n Taxpayer funded sex change.\n\nWhere'd you read this?\n\n How you may raise, discipline, and supervise your child.\n\nIf by this you mean that you cannot beat or psychologically torture your children, yes, most liberals want to stop that.  Otherwise, I don't think they want to invade your home and deal with it.\n\n Fireworks use/sales.\n\nSafety of users.  Common sense.\n\n What holidays you celebrate and how.\n\nWhere are you getting these from?  What?\n\n ATVs rider[.] age.\n\nBecause we protect children[.] safety.\n\n Where you ride ATV[.].\n\nJust like you drive your cars *on the roads*.\n\n Light bulbs (compact fluorescent).\n\nThis was for environmental sustainability reasons.  I'm of mixed opinions on that.\n\n Driver[.] requirements: age, time, and occupants.\n\nGod, I hope you're a troll.  This is for safety of children.\n\n How you commute.\n\nMeaning?\n\n Wearing seatbelts\n\nAlso torn on this for adults.  Children, though, should have to wear them.\n\n Wearing helmets.\n\nUsually not required for adults.\n\n Vehicle insurance\n\nThis is to protect you and the other person financially if you are in an accident.\n\n Baby car seats.\n\nYes, we do like protecting children.  You, apparently, do not.\n\n What you can say in political ads.\n\nSource?\n\n How much money you can contribute to a political candidate.\n\nYep.  If you want the top 1% to buy every election ever, stand opposed.  I, however, hope that one day they will not.\n\n Type of toilet, and how much water is used to flush it.\n Type of refrigerator, air conditioner, and windows.\n Type of thermostat, and its setting.\n What type of shower you may have, and its water flow.\n\nSource?\n\n If you can water your lawn/yard, and what type of landscape.\n\nThis may actually have to do with land classification and how much water is safe to add to the land in your area before it becomes hazardous.  My area was classified as swampland once.  It[.] not a good idea to add water.  Trust me.\n\n Ethanol/Biofuel subsidies.\n\nFor environmental sustainability.  You know, future generations matter (though, I guess if you quit protecting them, maybe they won't).\n\n Gasoline and diesel specifications.\n\nWhat do you mean?\n\n Electric solar panels, and wind generators.\n\nOh dear, how dare we make our energy safe, environmentally friendly, and renewable.  HOW DARE THEY.\n\n Burning/mining coal.\n\nWorkers' Safety and environmental protection.  There are reasons.\n\n Oil exploration and drilling.\n Fracking.\n\nI'm beginning to feel like a broken record.\n\n Co2 emissions\n\nAre you even reading at this point?  I've made this point over and over.\n\n Oil pipelines\n\nSame as the last few.\n\n Fur coats.\n\nliberals=/=PETA, unless you're talking about pelts of endangered species.\n\n Capital punishment/death penalty.\n\nBecause the best way to teach people that killing people is wrong... is by killing people.\n\n Mandatory sentences.\n\nThis is so major criminals don't get off based on wealth or influence.  Though it is a tad broken.\n\n Hospital admittance.\n\nWhat do you mean?\n\n Library admittance.\n\nTaxpayers fund libraries.  They are open to the public and ought to be.\n\n Pornography in libraries.\n\nWho[.] advocating *that*?\n\n The taxes you pay.\n\nYes, government normally sets those.\n\n Tax funding for the National Endowment of the Arts.\n Tax funding the National Education Association.\n\nGovernment also usually determines this (or lack thereof).  Part of their job, you know.\n\n Government subsidized home insurance.\n\nThose poor people shouldn't have homes and home insurance!\n\n Any speech against global warming.\n Any research against global warming.\n\n96% of peer-reviewed studies in the field support climate change.  When you have more than a tiny sliver of peer-reviewed studies, come talk to me.\n\n Tax funded pro-global warming research.\n\nI don't think you understand how scientific research works.  As a researcher, allow me to break this down:  We collect data and... draw conclusions from that (actually, it[.] a hell of a lot more complicated, but you get the point).  Science changes with the data.\n\n Publicly support Homosexual Marriage.\n\nWhat do you mean by this?\n\n Perform wedding ceremonies for Homosexuals.\n\nYour problem here is?\n\n Love Won Out ministries.\n Chick-fil-a\n\nIt[.] called voting with your dollars.  Social liberals often don't patronize these places.  But very few call for shutting them down or major action.\n\n"}