{"doc_id": "1724", "name": "2013_11_humanities_student_major_996_biology", "namespace": "we1sv2.0", "metapath": "", "pub": "biology", "title": "2013-11-humanities-student-major_996_biology.txt", "pub_date": "2013-11-16T00:00:00Z", "Sentiment": "0.009", "Subjectivity": "0.22", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "300", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qsotx", "Reddit_id": "cdg3ygz", "Subreddit_id": "t5_2qhn7", "Commenter": "Kenanihans", "length": "1765", "content_scrubbed": "Internships. Internships. Internships. Apply to any conservation program you even sort of qualify for, hell, even ones you don't. Talk to your professors, they generally know of someone or a program looking for interns. They'll also write letters of recommendations, which are HUGE advantages, especially if they personally know whoever is doing the research. Upperclassmen are of a similar caliber of resource, a lot of them have done internships and still have contact with people that make decisions.\n\nSeriously though, don't be afraid of applications. Fill them out. All of them. Even ones you don't think you'll get. And if you don't apply again at the next available opportunity. People that go over these apps recognize names if they see them frequently, showing a true desire is half of it. Don't shoot for Africa right away either, get some experience locally, helps pad your application to places like this.\n\nStudy abroad if you can. It looks amazing on an application to these types of groups when you have previous experience in other cultures.\n\nAgain DO NOT be afraid of applications. They can't accept someone who doesn't send one in. If you need help, find whatever office at your university/college helps with that sort of thing, or when they have seminars for it. Every school has one.\n\nI'm a bio student graduating this year from a small (5k students including graduate) liberal_arts university and two of my friends were interns for a Shark Week program because they were one of the only ones to even apply. And one of our professors was an assistant researcher so he put in a good word for them. So just apply!\n\nTL;DR APPLY TO ALL THE PROGRAMS! Also talk to your professors and upperclassmen, make friends with them if you can.\n\nedit for grammar"}