{"doc_id": "1827", "name": "2013_11_humanities_student_major_1797_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2013-11-humanities-student-major_1797_AskAcademia.txt", "pub_date": "2013-11-29T00:00:00Z", "Sentiment": "0.165", "Subjectivity": "0.4", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "421", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rp9u4", "Reddit_id": "cdpv2xi", "Subreddit_id": "t5_2sakj", "Commenter": "SnowblindAlbino", "length": "2520", "content_scrubbed": "I'm a tenured full professor and department chair at an SLAC. Three graduate degrees, all from top ten programs (humanities and interdisciplinary). Active in a half-dozen professional organizations over the last two decades; around 25 years total in academe if you count graduate school. Here[.] what I think are critical qualities for success in academe, at least outside the research-intensive world of the R1s (which I disliked).\n\n* self motivation: successful academics have to be able to work by themselves, without external motivation or reinforcement, and must be OK without lots of external validation\n\n* political savvy: academe is largely social, and thus largely political; to be successful you must be able to read people, to understand how to trade for favors, and know when to keep your mouth shut.\n\n* intelligence: this might go without saying, but I met a lot of people in grad school who were \"good at school\" but lacked the intellectual \"power\" of their peers. Most of them didn't make it through... they lost interest or were outmatched when things got competitive.\n\n* innate curiosity: academics have to remain curious about all manner of things; the best ones are curious about *everything* in fact (there is nothing so dull as the specialist who has no regard for anything outside her/his field)\n\n* a type A personality: most academics I know are workaholics and control freaks. Those that aren't get weeded out or walked on early in their careers.\n\n* willingness to sacrifice: academics generally make no money in their 20s and then work for less than their peers in industry/government; consequently they often have to forestall retirement by a decade or more. In most cases they also must live a student lifestyle well into their 30s, waiting to buy a house, a new car, or to start a family.\n\nI don't think socio-economic status or ethnicity play major roles (other than in determining who goes to college in the first place). Gender doesn't matter in *most* fields. Crazy won't help; it will hurt actually, since hiring committees don't want to spend the next 25 years working with anyone who is unpleasant or unpredictable.\n\nIn my department we have an unspoken rule that we won't hire anyone without a sense of humor. I like my colleagues and enjoy spending time with them; they are a smart, amusing bunch of people and uniformly clever. A dull, unfunny, or reclusive applicant would never make it through an initial interview with us because they would not \"fit\" into our departmental culture."}