{"doc_id": "1675", "name": "2013_11_humanities_student_major_474_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2013-11-humanities-student-major_474_changemyview.txt", "pub_date": "2013-11-08T00:00:00Z", "Sentiment": "0.065", "Subjectivity": "0.29", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "430", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1q5nop", "Reddit_id": "cd9jeto", "Subreddit_id": "t5_2w2s8", "Commenter": "IndependentBoof", "length": "2875", "content_scrubbed": "Sorry to hear that you are dissatisfied with your educational choice.\n\nLet me first clear up a false dichotomy. You seem to compare private liberal_arts colleges to public research universities. This is conflating two different dimensions of education: private vs public and liberal_arts vs research universities.\n\nLiberal arts institutions emphasize teaching. They tend to have smaller class sizes, more individual interaction with teachers, fewer (or no) TA[.], and requirements that involve broader education. There are both private and public liberal_arts institutions.\n\nOn the other hand, at research universities, conducting research is usually top priority. Much of their money comes from grants (opposed to from tuition), so faculty spend more time in research activities. Consequently, they also have larger class sizes and can't duplicate the liberal_arts in-class experience. However, they also usually provide more comprehensive specialization in education (opposed to broader education). There are both private and public research universities.\n\nOne isn't necessarily better than the other -- it depends on what kind of experience you're looking for as a student.\n\n I can't imagine why a well respected professor, particularly in STEM, would choose a spot at a small private school over a large, well-known public one.\n\nWell-respected professors (in all disciplines) choose liberal_arts or research universities according to what they want to concentrate on: teaching or research.\n\n I got just as much \"one on one\" time with professors at the public school as I did at the private\n\nThere shouldn't be much difference between public and private in this regard. The difference is size and focus of the school (again, liberal_arts vs research). Because of the size and emphasis of research universities, professors simply cannot devote as much time and effort to \"one on one time\" as their liberal_arts counterparts.\n\n There are SIGNIFICANTLY more connections and opportunities at the public school\n\nAgain, I think you're really thinking of large research universities, not just public schools. Large universities usually will have closer associations with industry and government labs when they collaborate on research. They usually have larger job fairs too.\n\nIf you are mostly soured by the price (but otherwise like the environment of liberal_arts education), then seek out public liberal_arts colleges. There[.] lots of them and they're sometimes even cheaper than public research universities. [Here[.] a list of the \"top 10\" ranked public liberal_arts colleges by US News & Report](http://colleges. usnews. rankingsandreviews. com/best-colleges/rankings/national-liberal_arts-colleges/top-public) but there are many more. However, if it is the size and environment of a large university that you're seeking, by all means look to transfer to a state university."}