{"doc_id": "1808", "name": "2013_11_humanities_student_major_1648_talesfromtechsupport", "namespace": "we1sv2.0", "metapath": "", "pub": "talesfromtechsupport", "title": "2013-11-humanities-student-major_1648_talesfromtechsupport.txt", "pub_date": "2013-11-27T00:00:00Z", "Sentiment": "0.001", "Subjectivity": "0.37", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "348", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdo3an7", "Reddit_id": "cdo3v88", "Subreddit_id": "t5_2sfg5", "Commenter": "RollCakeTroll", "length": "1949", "content_scrubbed": "In the US, a typical bachelor[.] degree is expected to take 4 years, though that would follow the traditional route, some students are able to finish in 3. Typically, the requirement is around ~120 \"hours\" of study, where each \"hour\" represents approx. 1 hour in class per week for a 16-week semester. Most students take around 15 hours per semester, for 8 semesters, one in the fall, one in the spring, with a few week[.] break for the winter holidays, and a few months for the summer, though a lot of times classes are held in the summer, though you will typically be working about 2-4 times the rate you would in a normal semester, as the classes are about 4-8 weeks in the summer. Naturally, 4 years generally means either not or almost never failing or dropping any courses, so some students may spend 5 or 6 years earning a \"4 year\" degree. \n\nAs far as the workload, there[.] typically like 50ish hours that everyone has to take (think: English 101, basic history, humanities, some form of basic science, etc.), and then we'll have a major that take up about 45-60 hours, depending on how hardcore it is, degrees designed for grad school will usually require more. The remaining hours are free for you to take something you'd like, such as a foreign language, or something else you want to learn. In my case, I took a networking class and decided I wanted to minor in IT. A minor is typically about 15 hours of coursework in a subject. We also have double majors so that you can work on two degrees at once, and it is sometimes possible to squeeze related fields (math/physics) in a very jam-packed 4 years because there is a lot of overlap in the major hours you have. \n\nNaturally, every university is different, but that[.] the most common pattern I see, and my alma matter was no different. Some colleges will have trimester or quarterly schedules, and some have different graduation requirements, but that[.] a typical 4 year degree in the US. "}