{"doc_id": "1769", "name": "2013_11_humanities_student_major_1355_sjsu", "namespace": "we1sv2.0", "metapath": "", "pub": "SJSU", "title": "2013-11-humanities-student-major_1355_SJSU.txt", "pub_date": "2013-11-21T00:00:00Z", "Sentiment": "-0.054", "Subjectivity": "0.327", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "517", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r5wsl", "Reddit_id": "cdk6nri", "Subreddit_id": "t5_2saah", "Commenter": "slumber42", "length": "3141", "content_scrubbed": "Just found this article: [San Jose State departments forced to cut classes for spring term](http://www. mercurynews. com/ci_24460539/san-jose-state-departments-forced-cut-classes-spring)\n\n\nSAN JOSE -- Budget problems at San Jose State have unsettled the campus as departments -- told to quickly adjust -- have canceled classes just as students begin to register for the spring semester.\n\nLate last week -- just days before registration began -- directors and department heads learned they needed to deeply cut their programs, immediately, to keep the budget balanced.\n\n\"That is an absolutely ridiculous way of running a business,\" said Shirley Reekie, head of the 1,000-student kinesiology department, who said she was instructed at 4 p. m. Thursday to cut $55,000 -- or 20 classes -- by 5 p. m. \"You don't tell people to make thousands of dollars of cuts in an hour.\"\n\nNews of the budget tightening caught students and faculty by surprise; it came a year after California voters approved Prop. 30, which promised relief from years of relentless budget cuts. The campus administration says it[.] merely asking its academic programs to live within their budgets and that this is not a midyear cut.\n\nTerminology aside, students will have a harder time getting into classes next term.\n\n\"It[.] scary,\" said graphic design major Brian Tamayo. \"I'm graduating next semester and I want to make sure I get the_right courses.\"\n\nSJSU spokeswoman Pat Harris said she didn't know how many programs or departments were in this position, or how many classes would be cut. She noted that adjustments are made each fall.\n\nWhen President Mo Qayoumi became president in 2011, he vowed to swiftly cut the campus[.] $32 million deficit, starting the 2013-14 academic year with a balanced budget. But by October, it became clear that the university[.] academic programs were on track to overspend $3. 8 million, Harris said.\n\n\"We went into the year with a balanced budget,\" she said. \"The challenge is to make sure we stay within that.\"\n\nIn the College of Applied Sciences and the Arts, it will mean larger -- and fewer -- classes, Dean Charles C. Bullock explained Monday in a letter emailed to faculty. \"Some of our part-time faculty will lose part or all of their usual class assignments,\" the letter said. \"In rare cases, part-time and full-time faculty may be asked to teach classes outside of their primary area of expertise.\"\n\nThe director of the journalism school said he is still trying to devise a plan. He worries that students will sign up for courses that will later be canceled or for writing courses that are far too big.\n\n\"We're all scrambling to try to meet those obligations but we're fearful it might damage the quality of our education,\" said Bob Rucker, director of the School of Journalism and Mass Communications at SJSU. \"That[.] troubling to me and all of our faculty.\"\n\nSJSU Freshman Blake Lonero said he and his classmates were shocked on Tuesday when an instructor told them about the cuts.\n\n\"We're paying all this money to attend this school,\" Lonero said. \"I feel like we should be given the opportunity to take the classes we want to take.\" "}