{"doc_id": "1795", "name": "2013_11_humanities_student_major_1546_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2013-11-humanities-student-major_1546_politics.txt", "pub_date": "2013-11-25T00:00:00Z", "Sentiment": "0.08", "Subjectivity": "0.351", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "731", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdmmql8", "Reddit_id": "cdms81u", "Subreddit_id": "t5_2cneq", "Commenter": "Skibxskatic", "length": "3957", "content_scrubbed": "it[.] not completely hopeless. \n\nI graduated with a BS in bio after doing four years at a state school. I think I graduated with somewhere around $50k in loans total. I had been on the pre-pharmacy/pre-health track so when I graduated, i came home and found a pharm tech job making 17/hr after having worked at cvs for 9/hr in the same position. \n\nI was so set on going to pharmacy school. I graduated with a 2. 63. I kept trying to convince myself that it was going to be pharmacy school or bust. I'm Asian so naturally, my first thought was, \"fuck. my parents are going to be so disappointed and they won't be able to save face.\" (my parents still tell their friends I went to umass Amherst instead of saying that I went to a state school.) I took classes trying to up my GPA and took relevant coursework and some more prereqs even this past spring semester. I gave pharmacy school apps another go (my third time)... and nothing. Out of 4 schools, 1 of which were known to be a little more lenient with grades and more extracurric heavy, not even one interview. \n\nAt that point, I was pretty frustrated and the little man complex in me came out and just said \"Fuck it. If even a shitty school like MCP won't have me, then I really know this isn't the career for me. Fuck those guys. Fuck the admission counselors who couldn't give me a better answer than \"You'll just have to apply and find out.\" I said to myself, \"I don't need your shitty school to be successful.\" I don't need your school to plateau at $105k a year (while that[.] a nice number, I would've had to undertake 6 more years of school minimum, graduate at 31, try and pay off hundreds of thousands in loans and then compete with every other 24 year old fresh-out-school for a job. not worth it.)\n \ntwo years after I graduated (now 24), I work for a company dealing with pharmacy automation equipment, I get to travel on the company dollar and visit a lot of places in the region (there[.] a 5 million dollar account in Dubai that I really want to get to) making ~$52k. \n\nEvery position that I take is a stepping stone with a possible end position of working as a consultant in healthcare IT/systems. Maybe if I get bored of this, I may eventually go back to school and pick up some kind of relevant license. (I really had to move out of my parents house, which I did this past September, and I wanted to start building a solid financial foundation independent of my family.) \n\nTrying to put the blame on the govt is kind of a cop out. While, yes, it[.] hard to find a job, lets redirect it back to what **you're** doing, who **you're** meeting and how **you're** accomplishing goals. Did you NEED to go to a $45k/year school? Did you pick the_right major? (they're stem majors, if you're still wondering. my personal opinion is that in the Information Age, liberal_arts are hobbies. you don't need schooling for that. you just need to know the_right people. I'm not paying $45k a year to have someone to validate my opinions or to mold me in some kind of direction.) Did you make the_right connections while at school? Are you aware of potential job postings and what you need to do to prepare yourself for them? **Are you hungry enough to go get it?** or are you expecting people to hand it to you? \n\nBe hungry, be ambitious, be bold and occasionally obnoxious (in quiet crowds, it makes you more personable) and don't you dare fucking settle for some \"shift replacement\" job. The only thing shift replacement jobs are good for is getting your foot in the door, to learn as much as you can in that position and move to that next big opportunity. Put in a solid year, make impressions and start looking for the next job. Build a solid relationship with your boss so that you can have open discussions about your ambitions and where you want to get to. \n\n\n**TL;DR read it, motherfucker. I just typed all that out on my phone over lunch.**\n\n\nedit: whoa kind internet stranger, thanks for the gold!"}