{"doc_id": "1630", "name": "2013_11_humanities_student_major_59_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2013-11-humanities-student-major_59_changemyview.txt", "pub_date": "2013-11-01T00:00:00Z", "Sentiment": "-0.138", "Subjectivity": "0.538", "Score": "26", "Upvotes": "26", "Downvotes": "0", "Wordcount": "236", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pps1z", "Reddit_id": "cd4qm14", "Subreddit_id": "t5_2w2s8", "Commenter": "runredrabbit", "length": "1812", "content_scrubbed": "It[.] a pretty mixed bag, looking at the statistics.\n\nFor the GRE:\n[Humanities dominate in this test, with philosophy leading the way on 2 out of 3 sections. STEM does better on Quantitative reasoning, but markedly poorer on verbal reasoning and analytical writing] (http://www. nmu. edu/sites/DrupalPhilosophy/files/UserFiles/Files/Pre-Drupal/SiteSections/Resources/GRE_Scores_by_Intended_Major. pdf)\n\nFor the LSAT:\n[Physics/Math beat out Philosophy. Philosophy still beat out Engineering](http://www. potsdam. edu/academics/AAS/Phil/upload/LSAT-Scores-of-Majors. pdf) \n\nFor the MCAT:\n[The humanities, rather bizarrely, actually beat out Bio. Phsyical Sciences beat Humanities, but just by an inch. Math took home the prize however] (http://www. degreepaths. com/mcat-scores-by-major/)\n\nFor the GMAT:\n[Physics, Math, and Engineering beat Philosophy, history, and art history. But even lowly little art history beat chem and bio. Philosophy managed to shoulder computer science out of the way] (http://www. nmu. edu/sites/DrupalPhilosophy/files/UserFiles/Files/Pre-Drupal/SiteSections/Resources/GMAT_by_Intended_Major. pdf)\n\n\nMy take away from this:\n\nCritical thinking isn't about what you study, but how you study, and the quality of the school, teachers, etc. There[.] no real clear indication that STEM is better than humanities, or vice versa, at teaching critical thinking.\n\nEdit: Since my original conclusion didn't really address your CMV, I will add that since Philosophy appears to be [one of] the most consistently high scoring major, so I think that would be a pretty good argument that the Humanities are doing something right.\n\nEdit: Linked to the wrong thing. Fixed link, and rewrote summary.\n\nEdit: Had a wrong source for the GRE - it was actually citing LSAT scores again. Fixed that, and rewrote the summary."}