{"doc_id": "1664", "name": "2013_11_humanities_student_major_342_iwanttolearn", "namespace": "we1sv2.0", "metapath": "", "pub": "IWantToLearn", "title": "2013-11-humanities-student-major_342_IWantToLearn.txt", "pub_date": "2013-11-05T00:00:00Z", "Sentiment": "0.059", "Subjectivity": "0.316", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "458", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pzjx6", "Reddit_id": "cd7x0de", "Subreddit_id": "t5_2rjo5", "Commenter": "R7F", "length": "2663", "content_scrubbed": "Since you didn't specify, I'll throw in my two pence in my area of expertise: humanities courses. \n\nRegardless of the class, good studying starts with good notes. \n\nBefore every class: ALWAYS refer to your syllabus. A well written syllabus will indicate course objectives, and really help you identify what is significant in the course. Ask yourself in every lecture, and every reading, \"How does this contribute to the point of the class?\" This will help cut out unnecessary, peripheral fluff. \n\nTake notes by the mantra: \"I would have written less if I had had the time.\" Notes are about taking LARGE amounts of information and making them SMALL. Less really is more. \n\n1. MULTIPLE MEDIUMS\nOnce you have a decent set of notes, start reading them ALL THE TIME. Not 24/7, but at all of the times. Different times, different places, via different mediums... These things all help stimulate and engage long_term memory. Print out notes in different colors, if you can. Engage the material by reading in your head, aloud, record yourself reading them... You get the idea. \n\n2. TURN OFF DISTRACTIONS\nSeriously. You might not realize it, but having a browser window open with Reddit, Twitter, Facebook, or whatever pinging you with notifications is more distracting than you may realize. Put our phone out of reach, and close down anything that might distract you. \nYour brain only has so much processing power, and multitasking is a myth. What you're really doing is rapidly task switching. Each time you switch back to a task you waste time and energy reengaging and shifting gears back into the task at hand. \n\n3. STUDY ALONE\nUnless this is for a class that benefits from raw fact memorization (such as history, where you're memorizing names and dates, or anatomy where you're memorizing bones) then you don't need another person. Quizzing each other is great, but it[.] no way to internalize information. It[.] a great refresher the night before. \n\n4. DON'T CRAM. IT WON'T FUCKING WORK. \nThis is coming from a guy who (if I studied at all) studied only the night before, and more likely than not while I was riding the bus to school. I got by in lower education, but once I hit the university reality of upper education bitch slapped the shit out of me. Even if I could (for a class) forget information after a test, I found out I really needed to internalize and understand all the material I was learning to succeed in my major. \n\nCramming does nothing to benefit long_term memory. \n\nAnyway, I hope some of this helps! I'll edit if I think of anything else useful... Good luck, friend! \n\nTL;DR Take good short notes, turn off distractions, get alone, don't cram. \n"}