{"doc_id": "1826", "name": "2013_11_humanities_student_major_1785_uva", "namespace": "we1sv2.0", "metapath": "", "pub": "UVA", "title": "2013-11-humanities-student-major_1785_UVA.txt", "pub_date": "2013-11-29T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.343", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "328", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1ro8nz", "Reddit_id": "cdpqqu9", "Subreddit_id": "t5_2rcav", "Commenter": "booyah777", "length": "1808", "content_scrubbed": "Darden grad here. I used to mentor McIntire students while I was a Darden student.  One of the things I used to coach students was that they had ensure they had a wide breadth of experiences to not just differentiate themselves for their first job out of college, but plant the early seeds that will and give them a sense of purpose and uniqueness that feeds the soul, especially when you're going to be working as an I-banker or other khaki/slacks uniformed job.\n\nIt[.] easy to get caught up in the immediacy of why you're doing what you're doing (and it should be a main priority to work hard now to lay the foundation of success in the future), but it[.] equally important ensure you ask yourself how this edifies how you want to view yourself what type of person do you want to be.\n\nI know that this type of advice is somewhat \"hippie\"-ish, but it speaks to something I saw that was very prevalent at UVA and Darden. There was this uber investment in the immediacy of their job out of school when if you asked these same people after they left, what they regret, it[.] taking the time to enjoy the period of life where your only responsibility is to learn.\n\nYou can find plenty of examples of folks that earn tons of money that studied liberal_arts and \"serious\" majors, but supplemented that fluffy education with a steel hard_work ethic.  You don't have to be as extreme, but it[.] important to have a mixture and balance your life.\n\nI'm not saying McIntire is a bad choice, in fact I think its a great choice and very commendable, however, I would strongly suggest those who attend McIntire to purposefully seek out those opportunities to grow as a person and take some fluff classes to broaden your perspective so this doesn't just become an expensive trade school to become a banker.\n\nThat[.] my 2 cents."}