{"doc_id": "1710", "name": "2013_11_humanities_student_major_780_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2013-11-humanities-student-major_780_TwoXChromosomes.txt", "pub_date": "2013-11-13T00:00:00Z", "Sentiment": "0.044", "Subjectivity": "0.432", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "413", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qjd58", "Reddit_id": "cddijn2", "Subreddit_id": "t5_2r2jt", "Commenter": "Victoria_Place", "length": "2365", "content_scrubbed": "This post made me face some prejudices I'm carrying around, and whether they remain valid. Disclaimer, prejudices and judgment are mostly a waste of time, but F-Bomb (our blogger) brought it up, so now I'm responding.\n\nWhile I appreciate F-Bomb[.] sassy, mildly crass yet hip blog-lingo, I can't help but roll my eyes a little.  Yes, she feels insecure about being a homemaker because that[.] not the thing to do in \"today[.] world\" (her words, not mine), but ultimately feels better because she is \"a homemaker, 2013 style bitches.\"  Okay.  Cool. \n\nBut here[.] the thing lady, when I see you roll up with your tattoos, backyard eggs, homegrown vegetables and Art Museum ticket stub, I'm not assuming you're a Stepford mom.  I'm from New_York.  I can recognize a Stepford mom, in all her glorious, 21st Century reincarnation.  No, I'm not assuming you're brain dead or lazy.  I know being a mom and/or nanny and/or au pair for two youngish kids is hard_work.  As hard as clocking in 14 hours at Big Law job?  Fuck no.  Definitely not as hard.  I'm ready to defend that POV any day of the goddamn week.  Getting off track...\n\nNo, my point is that to this day, after four years of uber-liberal_arts training, womens studies courses, countless Atlantic subscriptions, and some good old fashioned feminist sentiment, I still assume you are not working as hard as a single working parent or a two-parent household where both parents work and still want their kids to eat health, be exposed to culture, and avoid the TV.  In fact, I'm positive you're not working as hard as the parents in that situation.  I still assume that your choice to be a stay-at-home-mom is a luxury and a privilege.  I still ask myself *\"how the fuck are they driving a Subaru and raising chickens and going to the art museum on a single-parent salary?  Damn, someone[.] spouse has a nice job and/or trust fund.\"*\n\nSo, I guess my highly pointless conclusion is that perhaps F-Bomb, in contemplating your self-consciousness on a blog, you should reconsider your guesses of why feminists of the public may be judging you (which seemed to be the subject of her blog piece).  That judgement may have nothing to do with us perceiving you as lazy or not hard_working.  It probably has more to do with the fact that we're trying to figure out how you manage your (privileged) life on a single-parent income."}