{"doc_id": "1743", "name": "2013_11_humanities_student_major_1168_books", "namespace": "we1sv2.0", "metapath": "", "pub": "books", "title": "2013-11-humanities-student-major_1168_books.txt", "pub_date": "2013-11-19T00:00:00Z", "Sentiment": "0.21", "Subjectivity": "0.411", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "250", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qzgfy", "Reddit_id": "cdi39by", "Subreddit_id": "t5_2qh4i", "Commenter": "[deleted]", "length": "1518", "content_scrubbed": "Physics of the Impossible by Dr. Michio Kaku - A great, easy to read popular science book that[.] really well written about how much of the laws of physics really allows in terms of 'impossible' concepts, like faster-than-light travel, starships, psychokinesis etc. A really optimistic book, if you're interested in any sort of science.\n\nPale Blue Dot by Sagan is also really good, but depending on how much you're enjoying reading it you might find it gets a bit dry. If not you can pick up the audiobook, read by Sagan himself. Here[.] an extract: http://www. youtube. com/watch?v=m6ugFcwsgpE I always find it inspirational stuff as an engineering student.\n\nThere are also a few good popular mathematics books. Try 'The Golden Ratio: The Story of Phi, the World[.] Most Astonishing Number' By Mario Livio. I showed it to my friend who had no interest in mathematics whatsoever, and he loved it. 'The Infinite Book' by John. D. Barrow also portrays the concept of infinity in a historical, mathematical, philosophical and scientific sense. Definitely one which will make you think.\n\nIn terms of humanities books, Guns, Germs And Steel by Jared Diamond is another really easy to read book about the influences that make a civilization dominant. Wars That Changed The World by Charles Messenger covers many really interesting points in history, which you may well never have heard of. For contemporary history you can do worse than read 'Overlord' yby Max Hastings, which is an account of the D-Day landings.\n\nHope it helps!"}