{"doc_id": "1654", "name": "2013_11_humanities_student_major_286_askscience", "namespace": "we1sv2.0", "metapath": "", "pub": "askscience", "title": "2013-11-humanities-student-major_286_askscience.txt", "pub_date": "2013-11-05T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.317", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "357", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd79anq", "Reddit_id": "cd7a70d", "Subreddit_id": "t5_2qm4e", "Commenter": "protestor", "length": "2563", "content_scrubbed": "And all of them belongs to the same author, [Jeffrey Tomkins](http://creationwiki. org/Jeffrey_Tomkins), researcher at the [Institute of Creation Research](http://creationwiki. org/Institute_for_Creation_Research). ([institute link here](http://www. icr. org/jeffrey_tomkins/))\n\nIt[.] hard to believe there is scientific institute dedicated solely to creationism this large and structured. It even included a graduate school until 2010:\n\n The ICR Graduate School was an educational institution that fostered research and provided graduate-level training in fields of science that are particularly relevant to the study of creation apologetics. It was operated by the Institute for Creation Research from 1981 until June 30, 2010. Accreditation was provided by the Transnational Association of Christian Colleges and Schools through the U_S Department_of_Education, and students were able to earn M. S. degrees in Science Education with minors in the fields of Astrophysics/Geophysics, Biology, Geology, and General Science.\n\n However, after a lengthy legal battle, the Federal court in Austin Texas ruled against the Institute for Creation Research on June 17, 2010 preventing their Graduate School from offering degrees in the future. On June 25, 2010 the ICR board of directors voted to close the doors of the ICR Graduate School (ICRGS) indefinitely, effective June 30, 2010.[9]\n\n Despite this devastating court decision, graduate level apologetics education will remain available from ICR through the School of Biblical Apologetics. The ICR offers Master of Christian Education degrees through a new graduate program that was launched in 2009, which they will continue to operate and develop. Several minors are available (Genesis Studies, Creation Research, Christian School Teaching, and Sacred Humanities).[10]\n\nEdit: in any case, those articles may not be valid Wikipedia sources. Wikipedia sources should be secondary sources most of time, specially regarding claims that are contentious or may not represent scientific consensus. Attempts to summarize or interpret primary sources (such as articles published in scientific journals) is against [no original research](http://en. wikipedia. org/wiki/Wikipedia:No_original_research) policy. (This criticism is valid for the evidence of common descent from J. W. IJdo as well - if it is scientific consensus there should be secondary sources available, and if it is not then Wikipedia isn't allowed to claim this is \"evidence\").\n\nThere is also the question of the reliability of sources like \"Journal of Creation\"."}