{"doc_id": "1811", "name": "2013_11_humanities_student_major_1655_personalfinance", "namespace": "we1sv2.0", "metapath": "", "pub": "personalfinance", "title": "2013-11-humanities-student-major_1655_personalfinance.txt", "pub_date": "2013-11-27T00:00:00Z", "Sentiment": "0.129", "Subjectivity": "0.303", "Score": "38", "Upvotes": "38", "Downvotes": "0", "Wordcount": "328", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rk9c2", "Reddit_id": "cdo5qqq", "Subreddit_id": "t5_2qstm", "Commenter": "katrogen", "length": "1859", "content_scrubbed": "**Five years ago:** 20 years old, kicked out of my university for crappy grades freshmen year, attempted joining the military but failed miserably, working in a ghetto call center making $10 an hour, kicked out by parents and living with roommates in a pretty decent place, had just received a DUI from being stupid and had to deal with those repercussions, no car or license, hobbies included hanging out with losers at the hookah bar and house parties getting drunk. My life was in a downward spiral and very embarrassing and my parents thought I would not amount to much. Not to mention I was a smoker from 18 until 21. \n\n**Now:** 25 years old, lots of student loan debt due to parents not being interested in trying again on my education but have almost finished a Bachelors in Accounting and have an Associate in Liberal Arts, great job with government, happily married for four years, no kids still (feel way way way too young), good driving record and no tickets/infractions since DUI, a strong grasp on finances, hobby of running and had cold turkey quit smoking before hitting 22 as planned, have a nice dream car (nothing fancy smancy but its MINE!), accomplished dream of going to England, and life has been nothing short of amazing... and way way better then I ever thought it would be. Oh and I lost 70 pounds after gaining a ton of wait from 20-23!!! Aaaaand I have a great financial plan going with retirement accounts and emergency savings!!\n\n**Five years from now:** I hope to be a great runner, moved more up in my current company/agency, maybe a second degree or Masters/CPA, debts paid off or paid down, lots of savings stashed away, a couple trips to Europe (at least one), MAYBE planning for a kid....., still happily married going on 10 years, and hopefully will have lived a good humble life with many more years to look forward to. \n\n"}