{"doc_id": "1793", "name": "2013_11_humanities_student_major_1533_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2013-11-humanities-student-major_1533_news.txt", "pub_date": "2013-11-25T00:00:00Z", "Sentiment": "0.056", "Subjectivity": "0.431", "Score": "60", "Upvotes": "60", "Downvotes": "0", "Wordcount": "307", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rexfa", "Reddit_id": "cdmm7nz", "Subreddit_id": "t5_2qh3l", "Commenter": "teefour", "length": "1647", "content_scrubbed": "Student loans are absurd. First of all, giving unlimited student loans regardless of major or performance is the reason college cost has risen twice as fast as inflation every year for 40 years. Schools know they have no need to keep costs down, because loans will make up the slack, and fuck the students.\n\nSecond of all, the interest rate is set in stone. I recently went back to school for a second degree in comp sci. I own a home, have a good credit score, and am continuing to work full time for $45k per year. Yet my interest rate and loan amount is the same as someone just starting college in art history. \n\nThat[.] not to bash art history, but statistically they are not going to make as much money as someone in chemistry and comp sci. It is therefore a riskier loan at the amount that the typical private college currently costs. The overhead for art or liberal_arts school is not nearly as high as for a science school, since science equipment is extremely expensive. Therefore why should an art major have to pay $55k per year to get a degree when they will be lucky to make $35k in a year when they get out?\n\n It makes no sense, and the trend will continue until the availability of college money reflects the projected monetary value of the degree the loans are going towards. It may sound harsh, but it would be the best thing for the students. You should be able to go to art school if you want, but not for $55k. And so far the only solutions I've heard from government is to offer more loans, and to bring down the interest rate (which is effectively just allowing more money to be lent). These will only make the problem worse."}