{"doc_id": "1775", "name": "2013_11_humanities_student_major_1398_lostgeneration", "namespace": "we1sv2.0", "metapath": "", "pub": "lostgeneration", "title": "2013-11-humanities-student-major_1398_lostgeneration.txt", "pub_date": "2013-11-22T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.388", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "377", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdkjy74", "Reddit_id": "cdkl4rd", "Subreddit_id": "t5_2r40j", "Commenter": "SnowblindAlbino", "length": "2158", "content_scrubbed": "That[.] only partially true though. For example, tuition/room/board at my school is over $50,000 per year. But we have quite a few students who are paying essentially *nothing*, and the vast majority (88%) receive at least some institutional aid (which means grants, not loans). The average student is actually paying only 50% of that price tag, or $25K. Call it $100K for a degree; our four year graduation rate is 94%.\n\nThat sounds high, right? But the nearest state university charges about $16K per year. That[.] a lot less than $50K, until you realize that they *don't* offer anything like the need-based aid we do, and most of the aid they do give is either loans or work study. I don't have the data for their students but will simply estimate that their average student pays 75% of the list price, or $12K per year.  That makes it about 1/2 the cost of my private school, until you realize their four year graduation rate is only 43%, and their five year rate is 52%. That means the *majority* of their graduates are paying for at least one extra year, which puts the bill at $62K.  Keeping in mind their classes are often 250+ students while ours are 10% that size, our student-to-faculty ratio is 1/3 of theirs, and soon the decision to attend the \"cheap\" state school becomes less obvious.\n\nFinally, look at the earning potential for the graduate of the liberal_arts college who invested $100K in their education, as compared to the public school graduate who invested $62K. Which is more likely to get into medical or law school? Which has the better network of alumni to draw on? Which is better prepared for success in the work place? Which got a *better education?*\n\nThere[.] no single solution for everyone, and the $$$ private college isn't the universal answer. But far too many people don't even look, because they don't understand that the sticker price is only paid by wealthy students, and in many cases students who are *actually poor* are asked to pay very little at all. Sometimes, for some students, the \"I can't afford anything but the cheap local school\" approach is not only misguided, but a complete waste of opportunity and money."}