{"doc_id": "1789", "name": "2013_11_humanities_student_major_1512_cfb", "namespace": "we1sv2.0", "metapath": "", "pub": "CFB", "title": "2013-11-humanities-student-major_1512_CFB.txt", "pub_date": "2013-11-24T00:00:00Z", "Sentiment": "0.023", "Subjectivity": "0.358", "Score": "51", "Upvotes": "51", "Downvotes": "0", "Wordcount": "944", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rdoi3", "Reddit_id": "cdmbzfm", "Subreddit_id": "t5_2qm9d", "Commenter": "SmellsLikeFishDicks", "length": "6243", "content_scrubbed": "So you want to know about our rival. You being an Ohio State fan, I can assume you understand what a true rivalry is so I hope I speak to a certain tone that you can appreciate.\n\nI'll preface this by saying that I have nothing personally against the school itself. It[.] a good school and serves as the academic antithesis to us. Engineering/Agriculture vs. Business/Liberal Arts. Apples and Oranges. Also my girlfriend goes there and is a wonderful person ^^^^with ^^^^poor ^^^^judgement ^^^^skills\n\nThat being said, and also with the knowledge that I was raised an absolutely die-hard Red Sox fan from birth, there is only one team I hate on such a violent, expressive level. The [Tatertown Pussyfoots](http://fitsnews. com/wp-content/uploads/2010/12/pussy-foot. jpg). I hate how they think all their past glories overshadow anything we have been able to accomplish in just a few short years of glory. I hate how they think their traditions are better than anything else ever attempted by any team in history. I hate how the vast majority of their students believe their school is on par with Harvard. I hate [Dabo[.] face](http://media. orangeandwhite. com/media/img/vthumbs/2013/07/16/dabo1aft. jpg). I want to punch Dabo[.] [stupid,](http://www1. pictures. zimbio. com/gi/Dabo+Swinney+North+Carolina+v+Clemson+qK994wUUJrJl. jpg) [punchable](http://media. orangeandwhite. com/media/img/photos/2012/07/17/0718_dmsp_DaboSwinneyGolf03_t607. JPG) [face](http://i1. ytimg. com/vi/T6n5w3wXkeM/mqdefault. jpg). I hate how they took a cool animal as their mascot and bastardized it into an [unholy abomination](http://cdn1. sbnation. com/imported_assets/664362/clemson-tigers_medium. jpg) I hate how they named their stadium after the original location of their coaches doorstop when the name wasn't even their originally (yes I know there are arguments back and forth for if LSU or Clemson named it first, but it was clearly LSU since [Clemson fucking sucks](http://www. reactiongifs. us/wp-content/uploads/2013/08/science_bill_nye. gif)). Oh, and [that doorstop](http://img. gawkerassets. com/img/18qp93psw9qhhjpg/ku-xlarge. jpg)? Yeah [one of their own](http://3. bp. blogspot. com/-xMrZxUdE8Y4/UOSxoFR1l0I/AAAAAAAAETY/W8cPrY9YOII/s1600/im-retarded. gif) broke it this past summer. I hate how they think their stadium is more intimidating than the gates of hell when it feels more like a redneck county fair mated with a second-rate high school football school and everyone brought their cousin Billy Bob. I hate how \"the best college town in America\" has like 4 bars in it and virtually no good parties to have fun at (firsthand experience). I hate how the fans consistently shit on the city of Columbia when most of them have never even been. I will be the first to admit that Columbia used to suck a big bag of dicks, but now it[.] basically a much cooler college town within a big city (see a pattern of living in the past yet?).\n\nI can't wait for my girlfriend to graduate from there so I never have to step foot in and can thoroughly hate every last molecule in that shithole excuse of a college town. The act of typing this out is making me furious.\n\nI don't want to just beat them. I want to massacre them. I want to beat them so badly that they disband the entire football team. See, with other rivalries like Georgia or Florida (or to me personally the Yankees), I don't like them but I respect them. I want both of our teams to do well and us to edge past them in dramatic fashion.\n\nNo. Not Clemson. [I want to stomp in their heads until mashed potatoes come out of their ears.](http://gifrific. com/wp-content/uploads/2012/11/DJ-Swearinger-Hit-on-Andre-Ellington. gif) I want to see their fans screaming and running in terror from our stadium so they don't have to suffer through any more torment. I want them to consider burning everything orange or purple that they own for fear that Mike Davis will find them and run them over for even owning those colors. I want [Sandstorm](https://www. youtube. com/watch?v=_m-Jd_gV_oQ) to be stuck in their heads forever so they constantly believe that we are still scoring touchdowns on them, even when the game is long since over. I want them to have nightmares of Connor Shaw chasing them riding a giant gamecock hurling flaming footballs at them screaming \"WHAT'S [TATERS](http://media2. giphy. com/media/AxjfeKuEG4SK4/giphy. gif) PRECIOUS???\" I want them to shudder every time they see a clown purely because the word clown is close to Clowney and they don't want to summon him to cause them any more pain. \n\nIn my, and people I know on both sides of the rivalry[.], opinion, it seems like USC (yeah, the real USC. You can go fuck yourselves too University of Spoiled Children) has recently assumed the role of the villain in this rivalry. Scarier color uniforms, more \"swagger\" if you will, more intimidating stadium environment, villainous band music (frequently playing Darth Vader Imperial March, Rage Against the Machine, other fighting music), Spurrier being a general dickhead throughout his career... the list goes on. We are seen the bad guys. You know what I think?\n\nGood.\n\nWe are the ones who were held down for so long and now have come for our revenge. We have been hardened by consistently being the lesser football program and now have come full circle to being the epitome of their doom. Steel can only be hardened by flame and now that steel has been shaped into a pipe to be shoved straight up the collective asshole of the Tatertown Pussyfoot football program.\n\nSo come to Columbia Clemson. On November the 30th, Williams-Brice will welcome you with open jaws and spit you out a weeping pulp of a team who will question ever playing the sport to begin with. You ever notice that our stadium looks like a [Venus Fly Trap](https://encrypted-tbn0. gstatic. com/images?q=tbn:ANd9GcTWiMESiGee4NTo5EWrOBozXszyqz9IPMUkxA1kczF6n6RIrqoNqQ)? You are the flies who will be liquified by our collective digestive juices to allow us only to grow stronger and stronger until we beat you so consistently you disband the rivalry and the team out of respect.\n\nWhat should you know about my rival? Well, I personally don't think very highly of them and don't think you should either.\n\nGo. Motherfucking. Cocks.\n\n\nedited formatting"}