{"doc_id": "1790", "name": "2013_11_humanities_student_major_1513_china", "namespace": "we1sv2.0", "metapath": "", "pub": "China", "title": "2013-11-humanities-student-major_1513_China.txt", "pub_date": "2013-11-24T00:00:00Z", "Sentiment": "0.007", "Subjectivity": "0.162", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "263", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdmbslz", "Reddit_id": "cdmc2fj", "Subreddit_id": "t5_2qh2v", "Commenter": "[deleted]", "length": "1534", "content_scrubbed": "Call me crazy, but I think that the ability to analyze and objectively discuss differing and controversial opinions is a critical skill that should be a basic part of education, especially at the college level.\n\nThen we are in agreement. I just don't think that an exam is the correct setting. An exam is supposed to be testing your skills and knowledge in a certain area. I don't think being able to take a deep breath and write a succinct rebuttal is part of any language learning course. Maybe it should be, but it[.] not. An exam, mock or otherwise, should be focusing on the class.\n\n American universities constantly present their students with controversial topics that call into question American social identity and its role in the world. \n\nBut in a French exam? It[.] not a politics, philosophy or some other humanities class that this for. I doubt that the final exam for the students of Russian Language at Harvard asks \"Soviet Professor Ivan Ivanovic says that the Unabomber[.] actions were just a frustrated yell he was unable to express without violence\". \n\nI'm not saying that such topics should not be discussed in a University - they should. Everything should be discussed. It[.] how society grows. I'm just saying I don't think an English exam is the medium through which to have these discussions, because they aren't a medium of discussion. Nothing is discussed. You give an answer and are graded on it. Discussions and debate are for developing opinions, exams are not. There is no back and forth exchange in an exam."}