{"doc_id": "1644", "name": "2013_11_humanities_student_major_195_australia", "namespace": "we1sv2.0", "metapath": "", "pub": "australia", "title": "2013-11-humanities-student-major_195_australia.txt", "pub_date": "2013-11-03T00:00:00Z", "Sentiment": "0.047", "Subjectivity": "0.286", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "273", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1ptxmr", "Reddit_id": "cd60lq1", "Subreddit_id": "t5_2qh8e", "Commenter": "halfbeak", "length": "1640", "content_scrubbed": "Do you have specific questions or are you just looking for an overview?\n\nThe current model of universities in Australia is to subsidise the relatively cheap tuition of domestic (i. e. permanent residents and citizens) students by fee paying international students.  As such, you can expect to be accepted into a program as an international student if you're anywhere near qualified.  Tuition will run ~$20k per year, if I remember correctly, though this number will vary by institution and type of program.  Things like physical and life sciences and such cost more, humanities cost less.  \n\nIf you come with a masters, hopefully that means you have a decent publication record.  If that[.] the case, you can apply for a highly competitive IPRS (International Postgraduate Research Scholarship).  If you get one, it waives your tuition and pays you a stipend.  Used to be ~$20,000 but it goes up annually, so I imagine it[.] around $23,000-24,000 by now.\n\nIf you can acquire permanent residency, postgraduate research programs are free.\n\nAs far as the programs themselves, I can only speak for biology PhDs, but I imagine it[.] similar in psychology.  The biggest difference is that here, your PhD program is pretty much entirely your research.  There are no classes to attend, no teaching requirements, none of that other stuff.  You show up and do your research.  As such, you can complete in as little as 3. 5 years.  Of course, there are opportunities to take courses if you want and often these can be subsidised by your school/faculty, but they're not a requirement.\n\nLet me know if you have any specific questions and I can try to help.  "}