{"doc_id": "1725", "name": "2013_11_humanities_student_major_1002_pics", "namespace": "we1sv2.0", "metapath": "", "pub": "pics", "title": "2013-11-humanities-student-major_1002_pics.txt", "pub_date": "2013-11-16T00:00:00Z", "Sentiment": "0.09", "Subjectivity": "0.305", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "447", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdg0gi0", "Reddit_id": "cdg611c", "Subreddit_id": "t5_2qh0u", "Commenter": "nmrk", "length": "2870", "content_scrubbed": "Thanks for your insightful post. I recall when I was in art school, one of my art history courses went into detail about objective criterion used to judge the quality of any artwork. For example, you can examine the ideas in a work by considering its complexity, iconography and symbolism, representation vs abstraction, how they relate to other artworks, etc. Then on a strictly visual level, you can examine color, form, composition, etc. These works don't really show any consciousness of any of these things.\n\nBut let[.] consider something more interesting. \n\nart history is fascinating, it[.] a story of cultural struggles and finding new ways to express new ideas...\n\nThere was this guy who wanted to be a painter. He had some skills but was strictly an amateur. He made lots of watercolors and sold them as postcards to tourists, barely making a living. He tried to get into a prestigious art academy but they rejected him as unqualified. He became bitter and swore he would take revenge on the art world. He knew his vision of the arts were right, and the people that rejected him were wrong.\n\nThat amateur painter[.] name was Adolf Hitler. When he seized power, he began a ruthless cultural war to purge Germany of \"degenerate art,\" the modern art that represented the world that rejected him. He established his own mediocre, anachronistic style of \"Romantic Realism\" as the official State-sponsored style, and built national museums and schools to replace the Academies that snubbed him.\n\nThe reason I mention this is because a most fascinating case has occurred just days ago:\n\n[Phantom Collector: The Mystery of the Munich Nazi Art Trove](http://www. spiegel. de/international/germany/the-mystery-of-the-gurlitt-family-and-the-munich-nazi-art-find-a-932899. html)\n\nThe history of the world turned around the paintings in this rediscovery of 1400 lost artworks. Even today, the subject of repatriation of artworks stolen by the Nazis is a source of international diplomatic incidents like this case. And there is one more point. [Look at the artworks.](http://www. spiegel. de/fotostrecke/photo-gallery-treasures-of-the-gurlitt-collection-fotostrecke-103420. html) You know those \"objective criterion\" I mentioned, that are used to judge artworks? The artists who made those paintings, drawings, and prints, they knew all about this stuff. That[.] why their works are considered masterpieces, they knew how to use all the tools available to them as an artist. They are conscious of how to evaluate paintings, and use these ideas to improve their own works.\n\nBut I am wasting my time here. The \"friend who is an amazing painter\" will never read my message. He would have no interest in the Munich art treasures, or their history. He does not care about art, or artists. He doesn't know anything about art, but he knows what he likes. He likes doodling pretty pictures. "}