{"doc_id": "1825", "name": "2013_11_humanities_student_major_1783_thebluepill", "namespace": "we1sv2.0", "metapath": "", "pub": "TheBluePill", "title": "2013-11-humanities-student-major_1783_TheBluePill.txt", "pub_date": "2013-11-29T00:00:00Z", "Sentiment": "0.006", "Subjectivity": "0.468", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "282", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdpl8xg", "Reddit_id": "cdpo13r", "Subreddit_id": "t5_2vzvv", "Commenter": "lokidemon731", "length": "1563", "content_scrubbed": "A dissertation is not the same as 'new research'. It just means writing a long paper on a certain topic.\n\nResearch is most definitely required. STEM research looks different than research for a liberal_arts PhD, but both are research.\n\n on an opinion you hope to support\n\nIf your dissertation was an opinion you only hope to support you're not going to have a good time of it. You better have an observation with explicit proof to back it up.\n\nYou don't need a fellowship to get paid for a science major\n\nI don't know how it works for science, but for engineering if you want a stipend, you need a fellowship. Also, all the PhD programs I looked at(for liberal_arts) gave everyone they accepted fellowship, you didn't need to try to secure it. Getting into the school was work enough.\n\nHere it is you that is being disingenuous.\n\nSorry, I didn't remember exactly what you said, it was a couple months ago. I just remember you saying something to the effect that poor people make poor decisions(about money) and that money had a big impact on relationships, and it rubbed me the wrong way. To *me* it came across as \"if he[.] poor or bad with money the relationship[.] doomed\", although I accept that I probably misinterpreted it.\n\nAlso, while it may be more likely for a lower class person to be bad with money, I wouldn't be extra careful around them because there[.] no guarantee they're going to be bad with money or that a middle/upper class person won't be worse. Of course this is a typical RP vs. BP disagreement: you look at trends and I assess individuals. "}