{"doc_id": "1674", "name": "2013_11_humanities_student_major_454_geology", "namespace": "we1sv2.0", "metapath": "", "pub": "geology", "title": "2013-11-humanities-student-major_454_geology.txt", "pub_date": "2013-11-07T00:00:00Z", "Sentiment": "0.11", "Subjectivity": "0.262", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "263", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd9b3p3", "Reddit_id": "cd9blo9", "Subreddit_id": "t5_2qshr", "Commenter": "Fresh_Billionaire", "length": "1575", "content_scrubbed": "Because look at the courses offered in the sustainability stream. They are all just sociology classes. Maybe they are interesting, but what TECHNICAL SKILLS do they provide? How will you get a job when you have a glorified sociology degree? \n\nConsider what any career in sustainability requires. Clean energy alternatives like solar and wind and hydro? They need scientists to come up with ideas, not sociologists. Freshwater shortages? Geo scientists with knowledge of aquifers and hydro geology would likely be a little more useful to a company than someone who has taken a bunch of history and arts classes. White collar positions in these firms? They go to engineers who design the ideas, accountants and administrators, people who are trained to run a business . My advice is to enrol in the first year sciences next term and get to work on this program.\nhttp://www. geology. sfasu. edu/courses. html\n\nI am sorry if I come across as a prick, but don't think your university is looking out for your best interests here by offering this sustainability degree. They likely created it in order to prey on naiive young student who don't know better by throwing around words like environment and sustainability. By doing so, they draw students into an arts faculty that is likely seeing decreased interest from students who realize that a scientific background is more likely to lead to employment than one in the humanities. You made a good decision to come to this sub reddit to seek advice, and I really hope you consider the scientific route over the one you are on right now.\n"}