{"doc_id": "1709", "name": "2013_11_humanities_student_major_774_christianity", "namespace": "we1sv2.0", "metapath": "", "pub": "Christianity", "title": "2013-11-humanities-student-major_774_Christianity.txt", "pub_date": "2013-11-13T00:00:00Z", "Sentiment": "0.059", "Subjectivity": "0.369", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "842", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cddf04b", "Reddit_id": "cddg2ca", "Subreddit_id": "t5_2qh6c", "Commenter": "BigcountryRon", "length": "4525", "content_scrubbed": "Just a quick note, his revelation (?) has actually happened over the course of years and it was only recently that I spoke to him at length in an effort to reconnect us. I should have mentioned that to be honest. I think he[.] been born again for about 5 years or so now.\n\nbummer.  you may have to file him in the old friends from back in the day category that you rarely see anymore.\n\nI don't really see this as an educational issue because if I would have experienced what he claimed (healing the sick, feeling the presence of Jesus as you would another person, hearing his messages for you to spread), I'd probably believe in it too.\n\nwhat is his degree in?  I mean did he take logic and liberal_arts or some form of an eye opening positivism class?  All my friends who are this religious usually have less education, and while I am not saying its a correlation, it is very suspect to me.  His views on science and doctors SCREAMS ignorance, as if he was vulnerable and easily lead into that belief without really considering any other options.  I am not confusing education with smarts or intelligence, but with knowledge, the more you read and learn the better you become able to navigate thinking, and hopefully socially as well.\n\nthough I also don't want to nod along as I feel it[.] patronising to do so and dishonest of me.\n\nyou can disagree without calling him out, and you can not engage without nodding along.\n\nI'm of half a mind to engage in debate, but what if he does start doubting his faith? It[.] just cruel to take away something that he gets so much joy and motivates him to be such a good person.\n\nwell that is very nice of you, but it seems as if you are walking on egg shells and slightly patronizing him, as if his mental state needs tending too, like he is a child.  Faith is all about questioning.  I question it all the time, faith is not an absolute answer, as it is more-so a constant question.  It is doubtful he will loose his faith, but doubting it is healthy IMHO.  I've caught up my born again buddy, and he just stopped and said I don't know, and the debate was over.  Then in the next week he studied and asked many others in his church my question, and came back with and answer (which was still off), but I did get to see my old friend for one afternoon.\n\nAlternatively, I could offend him entirely to the point where we don't get on any more which is something that I'm desperately trying to avoid.\n\nThis is going to sound cold, but.... if that happens then that is how it was to be.  tough.  I mean you know this guy better than most people, so you probably know how he will take opinion that differ from his own, is he a bigot?  I would avoid confrontation if you thought the chance was high, but not debating him (in a civil and logical manner of course), because you fear for him seems rather patronizing.  \n\nOn the other hand you are definitely not happy with how things are, so you need to make a call and do something about it.\n\nThere[.] also the other awkwardness around this whereby I'm a bit interested in religion. Not so much on the spirituality front, I just find people[.] beliefs to be interesting.\n\nof course. and in fact I implore you to stick around this subreddit, and learn.  Grab your scarlet A, and get into it around here.  even practice with Ideas and hypotheses with the community here before you engage your pal.  I realize you are not christian, but you will find us extremely diverse and there is a lot to learn here.   BTW I'm not very spiritual either.\n\n I don't not want to go to his Church as it sounds like I'm drawing a line under this major part of his life and saying that \"that is you and this is me\" and being unsupportive \n\nexplain that to him when you do those things.  I always like to do something they consider slightly taboo, like drinking a beer when they all get tea, so they know I'm not on that front with them.  You can support a person without supporting their lifestyle, just as you can support troops without supporting the war.  For example my baptist pastor buddy has a number of gay friends, whom he supports as friends while not supporting a gay lifestyle, if your friend is intelligent I am sure he will understand.\n\nbut nor do I want him to think that I could join his big group of friends who walk through town centers trying to convert non-believers (and he is actually this evangelical).\n\nwow.  I have little to say about this, other than I couldn't do that either.\n\nThank you for replying.\n\nyou are very welcome, have a great day!"}