{"doc_id": "1773", "name": "2013_11_humanities_student_major_1373_srssucks", "namespace": "we1sv2.0", "metapath": "", "pub": "SRSsucks", "title": "2013-11-humanities-student-major_1373_SRSsucks.txt", "pub_date": "2013-11-21T00:00:00Z", "Sentiment": "0.086", "Subjectivity": "0.326", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "296", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdj69o1", "Reddit_id": "cdkbwgm", "Subreddit_id": "t5_2uuwv", "Commenter": "SaraSays", "length": "1995", "content_scrubbed": "It[.] just the case that philosophy is male-dominated. I went to a year of graduate school in philosophy and was the only woman in the program. That[.] just a fact. I didn't feel I was surrounded by people I didn't like and I didn't hear anyone say that in this thread - if anything, the [opposite](http://www. reddit. com/r/philosophy/comments/1qwaby/is_your_philosophy_department_a_sausage_fest_too/cdh6id4):\n\n Yep. Also nearing graduation as a female philosophy major. Lower-level classes weren't too unbalanced (thought probably still not 50/50), but upper level seminars were at most 20% female. I go to a small liberal_arts college and the philosophy department here is pretty small, but nonetheless I am currently the only female philosophy major in the college. **Personally, I've never really had any problems - I would like to see more women in philosophy in general, but I really like my department and I haven't run in to any issues as a woman in the department.**\n\n[And another comment:] (http://www. reddit. com/r/philosophy/comments/1qwaby/is_your_philosophy_department_a_sausage_fest_too/cdhkcy9)\n\n Agreed, from my experience. **Women in my philosophy department were nurtured and just as assertive as the men were. My (mostly male) professors never treated me any differently because I was a woman. I think women just don't tend to consider philosophy, but I don't know why.**\n\n----------------\n\nSo, your problem seems to be use of the term \"sausage fest\"?\n\n I wonder how well it would go down if I went into somewhere like /r/nursing and said I've just started a nursing degree and it[.] a real bearded clam fest.\n\nWell, it was said [right in that thread actually.] (http://www. reddit. com/r/philosophy/comments/1qwaby/is_your_philosophy_department_a_sausage_fest_too/cdhdtzj) No one lost it or claimed misogyny:\n\n I took a class over in Art_History and that place was a total clam jam.\n\nHonestly, you calling \"sausage fest\" misandry is way more SJW than anything I saw in that thread."}