{"doc_id": "1761", "name": "2013_11_humanities_student_major_1283_tumblrinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrInAction", "title": "2013-11-humanities-student-major_1283_TumblrInAction.txt", "pub_date": "2013-11-20T00:00:00Z", "Sentiment": "0.148", "Subjectivity": "0.363", "Score": "25", "Upvotes": "25", "Downvotes": "0", "Wordcount": "262", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdjbyy3", "Reddit_id": "cdjdh7u", "Subreddit_id": "t5_2vizz", "Commenter": "solowng", "length": "1484", "content_scrubbed": "Lol, I took an intro-WS class to fill in a humanities requirement and it was a *joke*. Granted, I expected it to be easy as I was a final-term senior and it was a 200 level, but it was even easier than I expected. \n\nIt was hilarious, mostly full of naive freshman sorority girls lacking in life experience having their conservative leanings offended (I attended an SEC school.). One of them accused me of lying when I said that tipped workers may well discriminate based on what they think a customer will tip them. I scored a 100% on a response while managing to squeeze in a penis joke and a reference about those sketchy condom dispensers in truck stop restrooms. \n\nBest of all, I managed to out-SJW the instructor, a final-term master[.] student. She wasn't aware that in America, women are around twice as likely to be diagnosed with PTSD as men. Given that we were discussing a reading where the victim had been gang-raped and was vividly describing symptoms of it, I'd say that[.] relevant information.\n\nEdit: Some of the discussions produced some ludicrous stuff as well. For example, we were asked if we felt safe on campus. Said campus is insanely well-lit and very heavily patrolled by police. Try being a pizza delivery driver in the ghetto. Another time, a girl said that she felt more likely to be pulled over because of the Greek letters on her car. Uhh, no. The problem is almost certainly that, like many students, she fails at driving: the cops here are super-lenient."}