{"doc_id": "1760", "name": "2013_11_humanities_student_major_1280_bujinkan", "namespace": "we1sv2.0", "metapath": "", "pub": "Bujinkan", "title": "2013-11-humanities-student-major_1280_Bujinkan.txt", "pub_date": "2013-11-20T00:00:00Z", "Sentiment": "-0.032", "Subjectivity": "0.351", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "252", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qrklm", "Reddit_id": "cdjayjh", "Subreddit_id": "t5_2qqxu", "Commenter": "[deleted]", "length": "1753", "content_scrubbed": "A brief Critique\n \nA questionable legacy\n\" Takamatsu[.] successor was a man named Ueno Takashi. This happened long before Hatsumi heard of Takamatsu. As some point later Hatsumi traveled to train with Takamatsu and was sent to Ueno[.] dojo. Shortly after, Ueno kicked Hatsumi out of his school. Hatsumi as this point went back to pay for private lessons with Takamatsu. After Takamatsu died, Hatsumi claimed that Takamatsu removed Ueno as his successor and placed Hatsumi there, a claim never confirmed by Takamatsu and not recognized by anyone other than Hatsumi and his students. Ueno later on passed his Sokeship to Kaminaga Shimegi who teaches the arts today. Lineage wise and scroll wise Kaminaga Shimegi holds the Sokeships, Hatsumi scrolls remain unverified.\"(http://www. bullshido. org/Bujinkan_FAQ)\n\n\"In August 1960, Masaaki Hatsumi said he had studied under Takashi Ueno from when he was 24 to 29 years of age.[21] He said he sometimes wrote letters to Ueno[.] teacher, Toshitsugu Takamatsu.[21] However, the certificate which Takamatsu gave to Hatsumi, that named Hatsumi the 34th head of \"Togakure ryu\" is dated March, 1958.[22] Furthermore, there is no documentation of the previous 33 holders of this title\"(http://en. wikipedia. org/wiki/Modern_Schools_of_Ninjutsu)\n\nHatsumi also has added extra Dan ranks which seems geared towards Money Making\n\n\nWatered down techniques which seem unrealistic for an art devoted to defense/offense/stealth.  Also very unrealistic.\nhttps://www. youtube. com/watch?v=91bW9BOqoyo#t=1m50s\nBujinkan for the majority lacks such training, although this is not always the case. Anecdote able evidence says Hatsumi gave up hard training for softer training (we saw this with Taekwondo) and membership skyrocketed.\n\n\n\n\n\n\n\n"}