{"doc_id": "1711", "name": "2013_11_humanities_student_major_782_frugal", "namespace": "we1sv2.0", "metapath": "", "pub": "Frugal", "title": "2013-11-humanities-student-major_782_Frugal.txt", "pub_date": "2013-11-13T00:00:00Z", "Sentiment": "0.201", "Subjectivity": "0.374", "Score": "33", "Upvotes": "33", "Downvotes": "0", "Wordcount": "309", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qjlph", "Reddit_id": "cddj6ge", "Subreddit_id": "t5_2qhbe", "Commenter": "hillsfar", "length": "1745", "content_scrubbed": "* If you have a house, do you have a yard? Borrow some garden tools (make sure to clean them nicely and dry them afterwards) and start getting things ready for spring planting. If you have a landlord who won't let you plant in the yard, look into putting dirt in free or cheap containers (find on Craigslist).\n\n* Your boyfriend needs to pay more. $100 is not enough to cover rent/food/utilities for one person. The same goes for you once you find a job.\n\n* Look here for more ideas on what you can do to earn extra money besides at a job: http://www. reddit. com/r/lostgeneration/comments/1q541i/ways_and_means_ideas_for_alternate_income_when/\n\n* Learn to cook and learn to cook from scratch on cheap but nutritious ingredients, like others here have said. You need to help the family save money if money is tight.\n\n* You need to start a \"homemaker\" job. Basically, your mother should not have to both work (when she finds a job) and then come home to do more work. All laundry, all cleaning, all chores, all dishwashing, and all cooking (if she'll let you) should now be your job. It will help her rest and allow her to do more at her job.\n\n* Continuing education: Math may not be your strong suit, but it looks increasingly that the kinds of jobs that will be more stable and pay more these days, will increasingly require some math. You might find it more enjoyable if you learn it in a new way. Visit www. khanacademy. com and start learning and playing math games. For college, even liberal_arts majors need to pass certain math classes. You don't want to pay the time and money to take math classes in college (where it[.] more expensive) if you can learn math on your own and pass assessment tests to skip out of taking remedial math classes.\n"}