{"doc_id": "1741", "name": "2013_11_humanities_student_major_1161_subredditdrama", "namespace": "we1sv2.0", "metapath": "", "pub": "SubredditDrama", "title": "2013-11-humanities-student-major_1161_SubredditDrama.txt", "pub_date": "2013-11-19T00:00:00Z", "Sentiment": "0.066", "Subjectivity": "0.475", "Score": "94", "Upvotes": "94", "Downvotes": "0", "Wordcount": "232", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdhy8bn", "Reddit_id": "cdi1hj6", "Subreddit_id": "t5_2ss5b", "Commenter": "FISSION_CHIPS", "length": "1474", "content_scrubbed": "Actually, [this series of comments from the top of the linked post explain it pretty well](http://np. reddit. com/r/ShitRedditSays/comments/1qy6eb/enough_efuckingnough_ive_had_it_with_you_fucking/cdht8zq?context=5).\n\nReddit is a site where young, affluent, tech-savvy, college educated white men are grossly overrepresented, and so you get a lot of bias in the comments. You rarely see people in that demographic being put down (unless it[.] in a very harmless, self-deprecating kind of joke), while people of all other demographics are fair game. You commonly see pretty mean-spirited comments on women, black people, liberal_arts majors, lower-class people, etc.\n\nSo SRS is like a complete reversal of that, almost a parody, where you're only allowed to make fun of the middle- and upper-class white dudes who dominate the site. The only catch is that in order to keep those guys from completely overrunning the sub the way they have with most of the rest of reddit, the mods have to be extremely strict about people toe-ing the party line. They usually delete any comment and ban any user who doesn't join in on the circlejerk wholeheartedly, but every now and then if someone posts something ridiculous enough that they find it funny they let it slide, as is the case with the post that was linked here.\n\nI'm oversimplifying things a little bit (for example, reddit[.] demographics aren't nearly as homogenous as they once were), but this is how I've come to understand SRS."}