{"doc_id": "1700", "name": "2013_11_humanities_student_major_652_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2013-11-humanities-student-major_652_explainlikeimfive.txt", "pub_date": "2013-11-11T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.43", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "304", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdbyhtr", "Reddit_id": "cdbyrv7", "Subreddit_id": "t5_2sokd", "Commenter": "lumpy_potato", "length": "1832", "content_scrubbed": "A note - money gained from the research department likely remains in the research department. Similarly with the medical school, or athletics - even if a profit is made today, there might be a net loss the next year.\n\nAs I understand it, money is earmarked and cannot be easily transferred from one division to another - at least thats how it seemed to be at the UC I went to. Money made from the medical school went back into the medical school, money from research went back into research, or was added to research-related endowments. \n\nI'm not arguing that there aren't universities who are profiting on the backs of students, but the expenses of a university are more complicated than what is released in the graphics. For instance, looking at their [revenue sources](http://f2. washington. edu/fm/uw-annual-report/content/financial/revenue-history), tuition has been roughly steady between 10-14% of their total revenue for almost 10 years, while state funding has steadily decreased. If they were aiming to purely profit from tuition, we would see that number increase to something much higher as far as the overall percentage of revenue associated to tuition. All of this is from graphs as well, no exact numbers, so a more precise analysis is a bit more difficult IMHO. \n\nAs a personal example, at the UC I went to, research and medical worked cyclically, and budgets allocated to each department were not re-distributed if there was more left over - so the Humanities department had severe cuts in order to stay under budget, while the engineering/CS departments secured grants/private donations to cover their costs and some new buildings that were put up. On the other hand, maintenance was cut back severely to make up for the lack of budget - tuition did go up, but it went up as state funding dropped to very low levels."}