{"doc_id": "1686", "name": "2013_11_humanities_student_major_551_linguistics", "namespace": "we1sv2.0", "metapath": "", "pub": "linguistics", "title": "2013-11-humanities-student-major_551_linguistics.txt", "pub_date": "2013-11-09T00:00:00Z", "Sentiment": "0.112", "Subjectivity": "0.384", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "231", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1q99jq", "Reddit_id": "cdakyhu", "Subreddit_id": "t5_2qhos", "Commenter": "Kativla", "length": "1463", "content_scrubbed": "While I totally encourage ambition, there[.] a lot of comments here that I fundamentally disagree with as to what might get high schoolers interested in linguistics. Formal, theoretical concepts without any guidance from graduate students or professors are likely to be frustrating rather than fun. \n\nAt a high school level, you need to be able to talk about things that students might find interesting. Not that *linguists* find interesting--the general populace. Many people (myself included) find their way into linguistics tangentially, either by learning another language or through another social science/the humanities. \n\nTopics that I think would be interesting/useful to high schoolers:\n\n* codebreaking and code making -- I got to theoretical phonology from here.\n* dialectal differences\n* language myths (the book with the same title is a good one)\n* aphasias\n* differences between languages; looking at languages radically different from English\n* learning IPA\n* language change\n* sign language\n* playing with Praat\n* *basic* theoretical concepts\n\nMy point here is not to disparage theoretical linguistics (I'd be disparaging myself) nor to discourage the truly motivated high schooler from pursuing them. That said, high school clubs are supposed to be fun. Plopping kids down with a sentence and having them try to do an X-bar analysis seems less likely to keep kids coming back than teaching them about McGurk effects or having them make up a cipher."}