{"doc_id": "1763", "name": "2013_11_humanities_student_major_1324_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2013-11-humanities-student-major_1324_AdviceAnimals.txt", "pub_date": "2013-11-21T00:00:00Z", "Sentiment": "-0.091", "Subjectivity": "0.35", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "261", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdjtbuh", "Reddit_id": "cdjuxty", "Subreddit_id": "t5_2s7tt", "Commenter": "Did_I_Strutter", "length": "1482", "content_scrubbed": "I posted about this the other day.  I'm just going to post it here as well.\n\n\"As a serious reply, I think they [extreme feminist] are few and far between.\n\nI've never personally encountered a woman who complained that I opened a door for her, but I do hear the occasional person complain in my college classes about the inherent misogyny in door-opening and how it[.] a signal of rape culture. Maybe it[.] because I'm in a liberal_arts program, but it comes up at least once a semester.\"\n\nSo I think there are very, very few people out there who are openly confrontational about feminism.  However, talking about feminism in a scholarly way tends to bring up some of these more extreme ideas.  For example, in many of my classes (I'm an English major) we've talked about the French Feminists and some of their radical ideas about feminism and language. Some of them assert that writing itself is a masculine-based structure and is part of the patriarchy that keeps women down.  Now, none of the people in my class will probably go around talking about how men are evil because they instituted writing, but it[.] an idea that is talked about for the sake of discussion.  So I think because some of these more extreme ideas are real and are circulated, they get tied into the erroneous notion that this is what feminists believe and what feminists are saying.  \n\nDoes that make any sense?  It[.] kind of a hard concept to get across.\n\nEDIT:  Downvotes for contributing to discussion?  K.\n"}