{"doc_id": "1816", "name": "2013_11_humanities_student_major_1718_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2013-11-humanities-student-major_1718_GradSchool.txt", "pub_date": "2013-11-27T00:00:00Z", "Sentiment": "0.051", "Subjectivity": "0.354", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "486", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rm9bc", "Reddit_id": "cdopusw", "Subreddit_id": "t5_2r4r8", "Commenter": "SnowblindAlbino", "length": "2779", "content_scrubbed": "No advice on the relationship front to offer, but on the workload front it sounds like she may be adjusting to grad school demands from a fairly light undergraduate program. It[.] entirely possible that her classmates (or most of them) did in fact write more and have greater expectations placed on them as undergraduates.  For example, my seniors every semester are writing papers in the 20-25 page range in at least a couple of classes, and their senior theses (which take a semester) are generally 40-60 pages; some of them are 75+ pages. Though I'm in history, expectations in our English department are similar. In my experience most programs in liberal_arts colleges like ours are more or less the same. If she went to a larger public university, for example, it[.] entirely possible that she has never been asked to produce on the same level that many of her peers did as undergraduates.\n\nA second factor may well be age. I don't know the demographics of her program, but my Ph. D. program had an average age of something over 30. I've been teaching for almost 20 years and my department *always* discourages students from applying to grad school until they've been out of college a couple of years and gained some life experience/maturity. Even a few years living outside of academe can make a huge difference in an individual[.] ability to handle stress, manage projects, and understand their own limits. It sounds like she went straight into grad from undergrad, so may have some growing to do in order to catch up with some of her peers.\n\nAll that said, it[.] also true that *most* humanities graduate students face at least some of the challenges she[.] facing this fall. It does get easier as you gain experience. Writing three 20+ page papers at the end of each semester is simply the way things are; once she[.] teaching there will be even *less* time to focus on classes. But people do it... and continue to do so as new professors, when 60-70 hour work weeks are normal.\n\nIf she[.] concerned enough to seek help on this, have her talk with her advisor. Faculty have every reason to support their grads and a simple conversation might help her figure out if her experience is \"normal\" for her program or if she is indeed struggling compared to her peers. If that[.] the case, she can get advice on how to pick up her game. For instance, if she[.] never been taught to read efficiently the basic workload of a first semester grad could be overwhelming; I had classmates who struggled simply to keep up with assigned reading (much less the writing assignments) because they had never learned to read efficiently as undergraduates. There are techniques one can learn to address that-- and other challenges --but one must identify the problem and ask for help in order to do so."}