{"doc_id": "1784", "name": "2013_11_humanities_student_major_1470_reedcollege", "namespace": "we1sv2.0", "metapath": "", "pub": "reedcollege", "title": "2013-11-humanities-student-major_1470_reedcollege.txt", "pub_date": "2013-11-23T00:00:00Z", "Sentiment": "0.149", "Subjectivity": "0.384", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "397", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rc3r3", "Reddit_id": "cdlpb56", "Subreddit_id": "t5_2s7mb", "Commenter": "squidgirl1", "length": "2229", "content_scrubbed": "Alright, here I go, as a sophomore physics major who is about to switch to biology:\n1. You're socially awkward, welcome. \n2. You care more about the material than finding a job, welcome. \n\nMath at Reed is, in general, pretty abstract. As a transfer student you'd still have to take Hum 110, the year-long intro humanities class, which is awesome. You'd probably end up graduating in four and a half years, including your time at UCLA, if you transfer starting as a junior. I haven't met a transfer student that[.] graduated without taking an extra semester. \n\nHum 110 will be the largest class you take. The largest math class  I've had has been ~25 people, not counting Jim Fix[.] intro computing with ~40/lecture or so. It[.] a popular class, Jim is awesome and his intro class is practically a requirement for a reed education in a STEM subject. \n\nYou get a ton of opportunities to engage with the professor, from asking questions in class (please don't do this in hum) to going to weekly or biweekly office hours. \n\nReed is hard. If you're struggling at UCLA, well, I might not recommend it. If you're just doing okay, I could see you coming to Reed and doing okay if you take advantage of free tutoring and professor office hours. But, then again, I've only ever experienced Reed, and there might be another reedittor who[.] a transfer student who will have a better insight as to comparative difficulty. \n\nEdit: you'll be able to express yourself without being belittled as long as you don't ooze privilege, some people can be a little jumpy with their privilege discourse. But yeah, the general consensus is \"fuck yeah math majors\" in the sense of \"fuck yeah pursuing your academic passion\" \n\nDouble edit as I reread your post and see what I forgot: \nGrades are un-emphasized at Reed. You get graded on things, but you have to specifically request to see your grades. Exams are totally up to the professor, I have a course with three midterms right now and three problem sets a week, and a course with one problem set a week and no exams other than the final. Pretty much do the work that[.] given to you and try your best to understand it, asking questions if you don't. \n\n\"A 2. 0 at Reed is like an A anywhere else,\" etc, etc "}