{"doc_id": "1771", "name": "2013_11_humanities_student_major_1359_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2013-11-humanities-student-major_1359_philosophy.txt", "pub_date": "2013-11-21T00:00:00Z", "Sentiment": "0.223", "Subjectivity": "0.353", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "415", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r5cax", "Reddit_id": "cdk7xk8", "Subreddit_id": "t5_2qh5b", "Commenter": "Polusplanchnos", "length": "2628", "content_scrubbed": "Reading for pleasure and studying for contemplation works of fiction is a much better and more accessible way of encouraging young people \"how to think.\" The more complex the fiction in terms of social interactions, especially increasing the orders of social knowledges, the more challenged a young mind is for developing the tools to model and virtualize other personalities and thinking patterns. Fiction is what guides people into trying to think how another thinks, and especially good fiction not only guides but instructs and motivates more advanced and complex modeling.\n\nThe best philosophers weren't that way because they got really good at a symbolic logic or writing in a more natural language an incredibly complex category theoretic argument. They got that way because they practiced their skills in works of literature. Philosophical methodology has *always* used the mechanism of story-telling to capture imaginative examples from the infinite sea of thinking about things and use them for abstraction towards structural features. Plato is one of the more imaginative examples, and he even upfront tells us this is what he[.] doing in the dialogues. But the mechanism is always the same even as it goes more rigid and less prose in the usual form: \"Suppose *so and so and such and such*.\" Learning how to imagine, how to think the thoughts of another, whether to critique or to refute or to support or to become, these are things one learns through *fiction* and *story-telling*. At the core of our attempts to figure out the_right way to think through a problem, whether political or emotional or social or mathematical or ecological or practical, it[.] virtualization and modeling procedures. Fiction and learning how to grow in studying it reveals a lot more about the narratival structures of reasoning, especially the philosophical kind, than analytically restructuring a conversation into something like a first-order logic with modal operators. \n\nThat[.] not to say one shouldn't learn mathematics and foundations of mathematics and then move into advanced logics and all the theories (graph, proof, model, category, &c). Students should learn those things, but philosophy is not something you can get *without* an immersion in the arts of fiction and mathematics.\n\nFiction, however, will help out a much greater number of people for whom the mathematics won't yet, since even the tools and habits to think without a material object underpinning those thoughts depends upon training the brain to think through the irreal world of imagination—the training that comes from story-telling and story-listening."}