{"doc_id": "1733", "name": "2013_11_humanities_student_major_1097_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2013-11-humanities-student-major_1097_TwoXChromosomes.txt", "pub_date": "2013-11-18T00:00:00Z", "Sentiment": "0.04", "Subjectivity": "0.479", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "476", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdh2f2b", "Reddit_id": "cdh589b", "Subreddit_id": "t5_2r2jt", "Commenter": "maria340", "length": "2803", "content_scrubbed": "The gender wage gap\n\nLargely due to women choosing to go into lower-paying fields like social_sciences, humanities and the arts. Choosing to be SAHM[.], choosing to work part-time, and just in general taking time off from work.\n\nCongress being 80% men; CEOs being 85% men\n\nThis is a result of the factors I addressed above. Both of these positions require immense personal sacrifice and time commitment.\n\ncatcalling\n\nIf simple catcalling is holding you back from being a productive human being, you need to take a look in the mirror. Sexual assault, harassment and rape are much more serious things. We haven't solved these issues in the Western World, but we are *much* better off than most of the rest of the world. Where in some nations, women are more likely to be raped than to graduate college. I won't cry over some random idiot[.] catcalling. We can't rid this world of disrespectful people.\n\n people passing over your application because they think the guy who applied can probably do the job better even though you're more qualified\n\nI'm sure this does happen. But when I apply for a job, it[.] illegal to be asked about my plans to have a family, and it[.] illegal to withdraw a job offer because of pregnancy. Not sure what else can be done.\n\nelementary school teachers, who themselves are overwhelmingly women (also sexism!)\n\nAnd the majority of construction workers are men. But I rarely hear feminists complaining about that.\n\npaying more attention to boys without even realizing it\n\nNot sure what you mean here. \n\npeople thinking women are \"heavy\" for not looking anorexic\n\n2/3 of Americans are overweight. Childhood obesity is a growing epidemic. Yes, anorexia and bulemia are also problems in Western Society, but not nearly on the scale that obesity is. This is a complex issue, and blaming it on people being superficial about looks is missing most of the picture.\n\nslut-shaming; mishandling of sexual assault cases; sexual harassment at work that is not taken seriously\n\nRegarding sexual assault and harassment, there are plenty of issues across our justice system. This, once again, is part of a bigger picture, and pointing to this single thing misses most of it. As for slut-shaming, once again, not sure what can be done about this other than giving society time to evolve. If just general everyday slut-shaming is hurting you so much, grow a thicker skin. Sorry, but bullying exists, for all kinds of reasons, and before we root every seed of meanness and negative thoughts from every person[.] head, maybe we should learn to cope a little bit.\n\nSexism exists, for sure. Maybe some women don't realize it, but some streams of feminism are too quick to cry \"sexism.\" Lets look at the bigger picture, stop seeing ourselves as victims so often, and focus on the things we *can* change."}