{"doc_id": "1805", "name": "2013_11_humanities_student_major_1638_truegaming", "namespace": "we1sv2.0", "metapath": "", "pub": "truegaming", "title": "2013-11-humanities-student-major_1638_truegaming.txt", "pub_date": "2013-11-26T00:00:00Z", "Sentiment": "0.085", "Subjectivity": "0.412", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "285", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdnv4rn", "Reddit_id": "cdnww1o", "Subreddit_id": "t5_2sgq6", "Commenter": "Spinyofdoom", "length": "1717", "content_scrubbed": "As a matter of fact, the main fighting game I play has a majority of its userbase on PC: [Skullgirls!](http://skullgirls. com/) It also happens to be a *fantastic* choice for players new to the genre, with in-depth tutorials and a very versatile, flexible combo system. I linked the official site here, but if you want to learn more, we have a subreddit (/r/skullgirls) as well. If that doesn't look like your cup of tea, Street Fighter IV is out on steam as well (although it[.] a *much* more technically-demanding game than Skullgirls and I'm not sure how big the PC playerbase is). On another side of things, you have 'anime-style' (that term refers to both the artstyle and the mechanics, which tend to be slower-paced and more deliberate than western ones) fighters like [Vanguard Princess](http://www. eigomanga. com/vanguard/index-us. html), [Melty Blood](http://typemoon. wikia. com/wiki/Melty_Blood), and [E[.] Laf](http://eslaf. main. jp/), all of which I've heard are quite good. If you want more specific advice, I'm afraid my area of expertise really only extends only to Skullgirls, but if that[.] one you choose to look into than by all means, hit me up! I can even PM you my steam and we could play sometime if you like.  \n\nAlso, quick note about a controller/stick: don't be afraid to buy a cheap/cruddy one first just to see if you like the feel of it before committing 100+ dollars towards something you may not ever use. Hell, I played on keyboard for my first few months, and while I'm by no means top-tier now, I'd like to think I'm somewhat competent. It really comes down to personal preference.  \n\nIf you've got any more questions, feel free to ask, and I wish you luck with whatever game you decide on!"}