{"doc_id": "1667", "name": "2013_11_humanities_student_major_370_adhd", "namespace": "we1sv2.0", "metapath": "", "pub": "ADHD", "title": "2013-11-humanities-student-major_370_ADHD.txt", "pub_date": "2013-11-06T00:00:00Z", "Sentiment": "0.072", "Subjectivity": "0.268", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "351", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1q27f7", "Reddit_id": "cd8guqk", "Subreddit_id": "t5_2qnwb", "Commenter": "pheonix991", "length": "1930", "content_scrubbed": "I'm in engineering right now.  It[.] rough.  I hope you've learned not to take anything you're not truly interested in.  I dropped out of biology this semester because of that.  The lectures were online, I couldn't go to the on campus lectures because I had scheduled work or another class at the same time, ended up with a B in the lab, but an F in the lecture because I didn't watch them.\n\nIt sucks, but, I'm doing much better mentally without the stress.  I'm taking Chemistry for engineers 2 next semester to replace the Science elective credit. \n\nIf you don't think you can sit down and study the math, I suggest not bothering with the degree.  This chemistry class, we went over everything I learned in a year in highschool in a month.  Now, it[.] basically an introduction to thermodynamics.  It[.] all math and conceptual ideas.\n\nI'm an ME student, so this thermodynamics stuff really interests me, which is what I attribute to why I'm doing so well in the class.\n\nAlternatively, you may want to look into a program where you are a CAD artist.  Our CAD guys at work are always busy modeling up machines and parts.  It[.] pretty neat stuff.\n\nOf course, in ME, I'll get to do the same stuff, and more.  Locally, you can go through the CAD program at the CC, 2 years later have an associates degree and be a CAD monkey making some decent cash.\n\nGo check out /r/engineeringstudents to get an idea of what sort of stuff we're learning.\n\nYou've probably taken care of all the general classes and all the humanities courses, so most degree programs you'll be going through should only be 2-3 years.\n\nI went to the air force instead of going straight to uni.  I still didn't know what I wanted to do with my life till about 2 years in when I finally decided I wanted to be a mechanical engineer.  So, I can't really relate to wondering around aimlessly.  But, I can tell you, a change of scenery will do wonders for your overall mood."}