{"doc_id": "1799", "name": "2013_11_humanities_student_major_1572_worldnews", "namespace": "we1sv2.0", "metapath": "", "pub": "worldnews", "title": "2013-11-humanities-student-major_1572_worldnews.txt", "pub_date": "2013-11-25T00:00:00Z", "Sentiment": "-0.063", "Subjectivity": "0.363", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "395", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdn1no8", "Reddit_id": "cdn268n", "Subreddit_id": "t5_2qh13", "Commenter": "jeRskier", "length": "2389", "content_scrubbed": "yes. Agreed. I guess my beef, if you will, is just within the phrasing of arguments. \n\nI'm Jewish. I'm not religious. My family cares very deeply about the state of Judaism and Jewish people today. What comes across to some as anti-Israel sometimes strikes a chord for people that lived through the holocaust, that remember their grandparents fleeing from pogroms, that have relatives that have died protecting their home from people who wanted to kill them simply because of the religion into which they were born. \n\nAs a student in a liberal_arts college, one of the key aspects of debate we learn in class is careful language and sensitivity of argument. Painting Israel, and the \"Jews\" as one big brush creates a sense of otherness. What the Jews in Israel are doing is wrong. It[.] just not that simple. Israel is a diverse country. Yeah, netanyahu sucks. Of course, settlement building is wrong and lots of steps should be taken to rectify and repay the palestinian people for what was done to them. \n\nBut - and I see a lot of this on certain subs - saying Israel this Israel that not only is insensitive, but it weakens arguments. Pointed criticism of specific policies is a much stronger stance to take than \"anti-Israel\" if you wanted to be taken seriously.\n\nLook, the other side of the coin is this. I'm not from the USA. I could only watch Glenn Beck, Bill O'reilly, look at the news about the tea party, christian evangelism, about Trayvon Martin, rick santorum, look at black/white criminality statistics in Chicago and say, \"Americans are fucked up. They stole the Native American[.] land. America is religiously intolerant. They marginalize black people, and cling to guns. Therefore, I will boycott all american products, disparage their reputation in global forums, and generally hold an anti-american attitude until proven otherwise, or they turn over Manhattan back to the native populations.\"\n\nNow, we all know this is an unfair characterization of America. You would likely be upset if someone spoke this way of your country because you know your country is a much more diverse place than that.\n\nIt[.] easy to be anti-Israel when you read about bulldozing bedouin settlements. It[.] a lot harder to criticize specific policies, or look at historical/sociological/economic factors that created the current situation. I argue simply against poorly constructed arguments. \n\n\n"}