{"doc_id": "1699", "name": "2013_11_humanities_student_major_639_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2013-11-humanities-student-major_639_changemyview.txt", "pub_date": "2013-11-11T00:00:00Z", "Sentiment": "-0.056", "Subjectivity": "0.248", "Score": "24", "Upvotes": "24", "Downvotes": "0", "Wordcount": "341", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdbtd5b", "Reddit_id": "cdbtvbm", "Subreddit_id": "t5_2w2s8", "Commenter": "yamsx1", "length": "2016", "content_scrubbed": "Two things: \n\n   1.) People who graduate with humanities degrees don't (and aren't really expected to) earn a job title that is parallel to their degree in the way that people with science degrees do. What I mean by this is that people with Philosophy/English/Theology degrees don't have to go on to work in the field of Philosophy/English/Theology, but now they are well-versed and read (qualified) and go on to do other things: I know a philosophy major who makes a killing reviewing scientific journals. His degree in philosophy qualifies him to meticulously pick out flaws in thinking and approve scientific progress, and disapprove of \"bad science.\" philosophy_major have been shown to start with lower salaries but tend to climb higher based on the way they have been trained to see the world (think.) Also, they tend to network and interview better than STEM degrees. You don't have to work in Philosophy/Theology because you got a degree in the field. You say people will still \"think\" about these things without university-level education, this brings me to my next point:\"\n\n  2.) By what standard would these things be held to if not academia? Yes, people will still think about these things, but what would guarantee them to think about these *correctly*? Think about how quickly false rumors spread and how hard they are to die? For example, I've been to parties where all of the people who didn't go to college still think that vaccines cause autism.\n\n\n\n   **Edit:**\n\n   A counter question: Your view ignores the plain fact that not everybody has an aptitude for science. Should those who don't possess the ability to learn science as well be forced with the ultimatum of: \"Suck it up, get a degree in something for which you have no talent and then enter a job market where you will be far less qualified than your competition\" or \"Don't get a degree at all, because those with Bachelor[.] Degrees and those with no college education are on the same level of intelligence (which is totally false)\"?\n\n \n"}