{"doc_id": "1774", "name": "2013_11_humanities_student_major_1387_femalefashionadvice", "namespace": "we1sv2.0", "metapath": "", "pub": "femalefashionadvice", "title": "2013-11-humanities-student-major_1387_femalefashionadvice.txt", "pub_date": "2013-11-22T00:00:00Z", "Sentiment": "0.298", "Subjectivity": "0.457", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "400", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdkfjeq", "Reddit_id": "cdkh00f", "Subreddit_id": "t5_2s8o5", "Commenter": "dagnedover", "length": "2187", "content_scrubbed": "I'll give you some context as to why I believed a MBA was going to be particularly valuable to me. First, the thought of going back to grad school of any sort had never even crossed my mind. My mentality has always been \"Experience is the most important thing and you can work your way up anywhere if you're good.\" Then in 2009, I was living in London working for Coach and my then-boyfriend-now-husband, Spencer, said to me \"Don't be like me and not think about business school until you're too old to be the ideal candidate. Look at what business school did for our friend.\" He was referring to our friend, we'll call her \"Barbara\", who had had a very similar sort of successful career as mine, but after she went to HBS it was a complete game-changer. She became the CMO of a very well-known start-up and was suddenly in a different league. I realized Spencer was right, and that I had to apply to business school that year. \n\nI had a liberal_arts major from undergrad. Everything I learned about business was on the job at Coach in NYC and London. I felt that I lacked formal training in business -- accounting, strategy, marketing etc. -- and I knew I was going to start my own business someday so I needed that knowledge. Wharton was the only school I wanted to go to 1) because of the Jay Baker Retailing Center -- the only of its kind at a top business school and 2) because of Wharton[.] recent focus on entrepreneurship. Also, I felt it to be the best of both worlds in terms of being close to NYC but not IN NYC (been there done that during undergrad at NYU). Penn[.] campus is gorgeous and I'm glad I got to have the campus and community experience that I missed in undergrad!\n\nMy goal in going to Wharton was to start a business while I was in school. While we were there, Dagne Dover won the Wharton Venture Award (previously won by companies like Warby Parker and Invite Media) and we were also the first MBA company funded by Dorm Room Fund, (funded by First Round Capital). Wharton has amazing resources that helped us get Dagne Dover off the ground! Also, the community was so supportive in participating in focus groups, surveys, etc. Love the entrepreneurial community."}