{"doc_id": "1755", "name": "2013_11_humanities_student_major_1253_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2013-11-humanities-student-major_1253_changemyview.txt", "pub_date": "2013-11-20T00:00:00Z", "Sentiment": "0.105", "Subjectivity": "0.288", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "299", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r2ybc", "Reddit_id": "cdj31ra", "Subreddit_id": "t5_2w2s8", "Commenter": "jcooli09", "length": "1579", "content_scrubbed": "I think maybe your definition of success may be a little too narrow.\n\nFollowing your dream means putting all of the effort you can into achieving a goal.  Working towards a goal is a process, it isn't like a foot race where the goal is a ribbon you run through.  The way to do this is to make every choice and take every action which puts you in a slightly better position to achieve the goal.\n\nI'm not sure what your dream is, since you're a student of the arts I suppose you're some sort of artist.  It sounds like you couldn't make a living at it so you had to do something else.  But life is long, and yours isn't over yet.  You may have had a setback, but abandoning the dream is something you choose to do.  That[.] the way you fail.\n\nIn the end, it isn't necessarily the passing the goalpost that makes you successful.  All those working class guys you talk about, they feel good about their lives because they don't let their work define them for the most part.  They understand that money isn't the only measure of success.\n\nIt[.] more about the effort, and doing whatever you can when you can.  Maybe you never achieve the goal you set out to hit in the beginning, but by the time your done chances are that won't really matter.  In fact, you might even actually achieve it and realize it wasn't really what you hoped it would be.\n\nIt[.] the fight that matters, not who wins.  All a person can do is continue to strive for whatever he feels is worth striving for.  If that changes so be it, but to keep fighting and reaching and stretching is what sets the value of a man."}