{"doc_id": "1716", "name": "2013_11_humanities_student_major_814_books", "namespace": "we1sv2.0", "metapath": "", "pub": "books", "title": "2013-11-humanities-student-major_814_books.txt", "pub_date": "2013-11-13T00:00:00Z", "Sentiment": "0.164", "Subjectivity": "0.342", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "315", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qk57x", "Reddit_id": "cddyi0l", "Subreddit_id": "t5_2qh4i", "Commenter": "TheAntiRudin", "length": "1642", "content_scrubbed": "I think your \"friend\" (ahem) comes off as a bit pompous in a few spots, but overall I think his heart is in the_right place, and I agree with the main thrust of what he said.\n\nI think that there has been far too much emphasis on STEM subjects in colleges and universities in the US over the last 30 years or so, and not enough on the humanities (which are more important, in my opinion). American culture is suffering for that. And I say this as someone with math and engineering degrees.\n\nThere are too many kids going to college today because they feel that they have to in order to get a \"good job,\" and they are often selecting majors that they have no real interest in other than the prospect of a job with high pay upon graduation. How happy are those people going to be trudging off every day to a job they hate but put up with because of the money? It[.] almost mercenary.\n\nI always advise young people to major in a subject that they like and have a genuine interest in, not to pick a major just because of job prospects. So many professions that were \"hot\" at one time fall out of favor, so people end up changing careers quite a bit these days. College should be about education, not job training. If you really enjoy a certain subject and are good at it, you'll find a way of making a living off it. It[.] also more likely that your education will stay with you forever that way.\n\nWe need more writers, artists, poets, and philosophers. Without all that we might as well be cows, just waking up and chewing cud to get through the day. I hope your friend sticks with English, he seems to have a real passion for it. Good luck to him."}