{"doc_id": "1678", "name": "2013_11_humanities_student_major_496_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2013-11-humanities-student-major_496_AdviceAnimals.txt", "pub_date": "2013-11-08T00:00:00Z", "Sentiment": "0.077", "Subjectivity": "0.322", "Score": "23", "Upvotes": "23", "Downvotes": "0", "Wordcount": "360", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1q6dvf", "Reddit_id": "cd9ri8i", "Subreddit_id": "t5_2s7tt", "Commenter": "ShmuelJudak", "length": "2055", "content_scrubbed": "Philosophy and history degrees get you in the law school door just as well if not better than being pre-law. A lot of law schools love the analytical skills you develop in the humanities that you don't get elsewhere. My family physician majored in English and fucking Jazz when he was in his undergrad and just took like 10 science classes over 4 years as electives and got into med school. You can do things like that and still have very present skills to advance yourself. BAs don't do a goddamn thing for you very often in the work place anymore. Everyone has a BA. We're all simultaneously over and under qualified. Graduate degrees separate you from the pack, or at least begin to. \n\nEdit to address the couple comments: I'm aware law school isn't a safe bet or even a good one at this point. The math folks throwing weight around misunderstood what I meant with analytical skills. (Philo majors have to do a healthy bit of modal logic typically to graduate, by the by.) There are concrete answers to a lot of the things in mathematically grounded fields. There are not always, i. e. rarely, concrete answers in the humanities. The style of argumentation used in academic discourse is particularly beneficial in legal debate. \n\nAs far as the graduate degree comments are concerned, we're aware. The advice given to undergraduates at every turn is \"If you aren't absolutely sure you want to go to grad school and/or it isn't fully funded, don't go.\" I'm lucky enough to be in a growth field in the humanities where fellowships and funding are easy enough to come by if you have a good idea. I understand this is not the case commonly. That[.] why I left an English and Philosophy double major track behind after 3 semesters of my undergrad. For every philosophy professorship position offered, there are something like 300+ applicants. It is, generally, a nightmare, but there are certainly paths in the humanities where you can get paid, even if it isn't 6 figures. Just like the general job market, you have to be skilled and target the_right market. "}