{"doc_id": "1833", "name": "2013_11_humanities_student_major_1834_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2013-11-humanities-student-major_1834_UofT.txt", "pub_date": "2013-11-30T00:00:00Z", "Sentiment": "0.048", "Subjectivity": "0.408", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "493", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rsby5", "Reddit_id": "cdqi6e7", "Subreddit_id": "t5_2rbaq", "Commenter": "ghostofdilla", "length": "2811", "content_scrubbed": "Do it ASAP. Like namehasyou said, you can contact the compsci undergrad office. It may be better to go see them in person on the 4th floor of Bahen. Unlike engineering where an appointment is necessary, you can always knock the door of the CS undergrad counsellors and ask a question if they aren't busy.\n\nBefore I get into the requirements for applying  to the program, let me tell you a bit about CS at UofT:\n\nA common misconception is that the CS program is 'all coding' but the coding past first year is mostly self taught and not the focus of lectures and tutorials. CS relies on math and methods heavily, specifically the abstraction of math and various methods. Math in particular generally requires a little less computation and a lot more intuition. If you feel your marks in 196 are average or below average, don't let that deter you from going into CS. I was horrible at engineering math marks-wise and didn't enjoy it one bit, but have an appreciation for the way they teach math in the CS department. The math I've learned in CSC165 this semester has in fact been applicable to my other courses.\n\nI've been told by students that the marking policies aren't the same as other departments within UofT, in that there isn't a target final mark for courses. I don't know if you're familiar with faculty policies for engineering but a first year course usually has a 67-69% average. If the average is too high the instructors and TAs will do whatever it takes to bring it down (by giving out a difficult test, final or assignment). If the average is too low, they'll bell-curve it up. So far my class averages for CSC207 and CSC165 have been high and there has been no attempt to bring it down.\n\nKeep in mind that the CS department is limiting enrolment for students starting in January. In ArtSci, you choose your major/minor/specialist (called subject Posts) after completing 4. 0 credits. You have to have a 67% average for CSC148 (Intro to computer science) and CSC165 (Math for CS), with a minimum mark of 60% in both courses if you want to do  a major or specialist in CS. The CS minor requires a 75% average in both. Read more here:\nhttps://csc. cdf. toronto. edu/mybb/showthread. php?tid=7240&pid=20740\n\nI got a transfer credit for CSC108 for APS105 (even though APS105 covers material in both CSC108 and CSC148). Make sure to ask the transfer credit office what credit you'll get for APS105 as they may have changed their policies on the transfer credit for that course and in case your mark in that course isn't satisfactory\n\nI suggest you take the time to look more into not only what the CS major entails, but the Arts & Science degree requirements as well. Look into what a minor, major and specialist is as I was not completely informed until I started school. \n\nThat[.] it and good luck!"}