{"doc_id": "1647", "name": "2013_11_humanities_student_major_218_atheism", "namespace": "we1sv2.0", "metapath": "", "pub": "atheism", "title": "2013-11-humanities-student-major_218_atheism.txt", "pub_date": "2013-11-04T00:00:00Z", "Sentiment": "-0.031", "Subjectivity": "0.27", "Score": "26", "Upvotes": "26", "Downvotes": "0", "Wordcount": "248", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pvba7", "Reddit_id": "cd6fhm8", "Subreddit_id": "t5_2qh2p", "Commenter": "dumnezero", "length": "1624", "content_scrubbed": "\"We explore how neuroscience and religion should inform and enrich each other,\" \n\nGetting that nausea feeling right about there...\n\n\"As a neuroscientist, I know that the human mind has a material basis, and that may cause even more cognitive dissonance for people\n\nOK, so he[.] an atheist?\n\nOne of Klemm[.] goals for the course is to show students that science and theology don't have to contradict each other.\n\nSo this is a course in apologetics. Must be a dirty word since he doesn't mention it.\n\n\"I am hoping that the students learn to be more introspective, open minded and mature about their spirituality,\" \n\nMaybe mature enough to stop believing in a supreme and invisible father/mother figure?\n\nDr. Donnalee Dox, director of the Texas A&M Religious Studies Program in the College of Liberal Arts. \"The relationship between science and religion is an up and coming field, and I'm very excited about this class.\"\n\nThis sounds like Discovery Institute crap.\n\nSpeaking to the BIMS majors in the class, she noted that the study of religion has more grey areas than they might be used to in some of their other courses, and advised trying to accept those ambiguities.\n\n\"faith in faith\"\n\nKlemm and Dox have also submitted a pre-proposal to the Templeton Foundation to enhance the course and to develop an academic discipline around the theme of \"Belief Neuroscience,\" with an emphasis on why humans — religious and otherwise — believe things even with incomplete evidence.\n\n[I knew it... creationism.](http://whyevolutionistrue. wordpress. com/2012/01/07/templeton-funds-dubious-center-for-christian-thought-at-biola/)\n\n\n\n\n\n"}