{"doc_id": "1818", "name": "2013_11_humanities_student_major_1722_iwanttolearn", "namespace": "we1sv2.0", "metapath": "", "pub": "IWantToLearn", "title": "2013-11-humanities-student-major_1722_IWantToLearn.txt", "pub_date": "2013-11-27T00:00:00Z", "Sentiment": "0.113", "Subjectivity": "0.35", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "608", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1rlv34", "Reddit_id": "cdorfyg", "Subreddit_id": "t5_2rjo5", "Commenter": "Sustain0", "length": "3450", "content_scrubbed": "Going along the lines of some of the other contributors but probably taking a bit more a general approach.\n \nThose people you see that have an immense amount of knowledge about a wide range of topics got there by reading and studying a broad range of topics. And it took them years. Maybe not years as in decades but certainly a handful, and there was no eureka moment of knowledge +1. They studied a variety of topics that they found interesting, and were thus inclined to continue to study. They were able to continue studying and reading because they learned how to learn. That is the key here. Learning how to learn.\n\nThis is the general goal of a good college education, and that[.] why some schools require general education credits or standards. Its not to keep you in school longer or bore you into getting sloppy. The reason a liberal_arts school requires you to take economics and art classes as a chemistry major is because you need to be able to learn about a broad range of topics, and do high quality work on each of those topics. When you take those \"elective\" classes you are diversifying your base for what you are able to understand later on.\n\nOh and the hands off/standoffish approach you may see from college professors is partially because they are busy people but because if they gave you all the answers your hunger would dry up and die. The search for a piece of knowledge makes you want it more. They are trying to get you to learn how to learn and reason for yourself.\n\nWhen you gain that base of knowledge I was talking about earlier you will come to a point when you realize that everything is connected. Connected in ways that not everyone sees. (I typed out some stuff after this but realize its a bit too grand in scope for your question). Its by seeing those connections that you are able to make educated guesses like /u/panzercaptain is talking about. \"I don't know why almond prices have tripled in the past 15 years?\" \"Well I know bees are dying off, and i read somewhere that a huge percentage of bees are in california to pollinate the almond crop each year.\" Thats probably a connection. Do I know that as fact? Absolutely not. For all I know there was a surplus of almonds for years before 2000 and suddenly Almond Joy ran a hugely successful ad campaign and consumes a much higher percentage of almonds than it did previously to the year 2000. (Did this happen? I don't know) But the educated guesswork comes from seeing those connections. \n\nPlease disregard /r/todayilearned. While it is really great for leaning factoids, that is incredibly useless information. My biggest beef with that subreddit is for the most part there are no connections made between topics. (My example about bee population came from there, but notice how I connected commercial bee migration, to bees dying off, creating a scarcity of pollinated almonds, and this increasing prices of available almonds, something you will never find on that subreddit because its modded to accept only factoid pieces of information). \n\nSo your best bet to having a general knowledge like most everyone else is saying is read. read. read. Get a library card and pick out some non-fiction books and read. Ask questions about what you are reading, and reason yourself to an answer. It can be a fun and exciting process to read and learn by reading, once you've learned how to learn.\n\n**TL;DR Learn how to learn, and enjoy it. Make connections. Read.**\n"}