{"doc_id": "1688", "name": "2013_11_humanities_student_major_565_latterdaysaints", "namespace": "we1sv2.0", "metapath": "", "pub": "latterdaysaints", "title": "2013-11-humanities-student-major_565_latterdaysaints.txt", "pub_date": "2013-11-09T00:00:00Z", "Sentiment": "0.163", "Subjectivity": "0.429", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "512", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1q94tz", "Reddit_id": "cdav446", "Subreddit_id": "t5_2uas2", "Commenter": "VottoLoco", "length": "3058", "content_scrubbed": "This thread seems to have become very defensive for no good reason.  The academy isn't launching an assault on genre fiction.  In fact, most of the faculty I work with sees a lot of value in so-called genre fiction.  Fantasy, sci-fi, YA, mystery, etc take on human issues in their own way for very specific audiences.  Those audiences respond well to the way these stories are written, and that[.] wonderful.  Why isn't more time dedicated to genre fiction in literature classes?  I have  a couple thoughts:\n\n1. Genre fiction is often geared toward a more casual reader. This isn't to say the audience is less serious about reading or any less voracious than a so-called literary scholar; in fact, many times the audiences for genre fiction are even more avid readers than their literary counterparts.  However, these types of readers are less likely to perform any critical analysis of the works they read.  Sure, they'll find plot holes, they'll speculate about subtexts, and they'll even create non-canonical works that they append to the world the author has created.  But the primary function of genre fiction is to entertain.  There is not as much meat there for the purpose of instruction as there is in more literary fiction.\n\n2. One of the primary purposes of an education in the humanities (and, more specifically, in English) is the development of the student[.] ability to perform critical analysis.  Sure, the joke is that english_major will always correct your spelling and grammar.  The truth is that we don't spend any of our time studying the mechanics of language--that[.] the editing or linguistics crowd.  We spend all of our upper-division coursework critically analyzing pieces of literature that have heaps of meaning that we can spend time unpacking.  Spending a unit on Moby Dick is going to develop those critical analysis skills much further than a unit spent on Master and Commander.  There[.] just more there to find.\n\nDoug Thayer used the Orson F. Whitney quote a lot when talking about LDS authors, and his fiction didn't shy as much away from the darker aspects of humanity.  However, he did have that tendency toward hope in his fiction that would be replaced by a bleaker outlook in more \"literary\" fiction.  I think the pressing responsibility we feel as LDS authors to \"let our light so shine\" pushes us toward that hopeful outlook that just doesn't find an audience in many secular literary circles today.  \n\nI wonder if there[.] a balance that LDS authors can strike between hope and despair that allows them to reach a broader audience with their work without appearing to promote behavior that runs contrary to gospel teachings.  I think it[.] possible for LDS authors to write about more of the darker facets of real life (not an LDS life) without a personal conviction to practice those types of behaviors, but audiences often get confused when they assume all fiction is a mirror image of the author[.] own persona.  That bridge between author and character is an unfortunate but seemingly unavoidable dilemma these days."}