{"doc_id": "1779", "name": "2013_11_humanities_student_major_1435_london", "namespace": "we1sv2.0", "metapath": "", "pub": "london", "title": "2013-11-humanities-student-major_1435_london.txt", "pub_date": "2013-11-23T00:00:00Z", "Sentiment": "0.017", "Subjectivity": "0.293", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "286", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r9xj2", "Reddit_id": "cdl4g32", "Subreddit_id": "t5_2qkog", "Commenter": "jimmy17", "length": "1464", "content_scrubbed": "By grad school I assume you mean you're going to do a PhD? I'm doing mine at Imperial College in Chemical Biology. There are a handful of Americans but most overseas students are from the EU due to the funding relationship we have. Are you thinking of STEM or humanities?\n\nMy understanding is that PhD[.] in the UK are a lot shorter and less intense than in the US because there is no mandatory teaching or lecturing. You can volunteer to do some duties but they are payed as an extra job and you are limited in the hours you can perform.\n\nThe quickest you might do it in is 3 years if you go for a straight PhD and write up as you go. The longest is 4 years if you go into a DTC (doctoral training center). This is what I am in. The format for this is a taught masters in the first year and then the usual 3 years of research. For both of these it is common to get funding for the whole period (although I'm not sure how this changes for overseas) except for the writeup period which is 6-12 months after the PhD. For this you are registered as a student but don't get payed and you are expected to complete your thesis and viva examination in this time.\n\nOne useful trick is that when you apply, look into becoming a Subwarden in the halls of residence. At Imperial this means that you supervise undergrad first years living in halls and arrange some events but you live rent and bill free in return. I can save you a LOT of money. It is hard to get in to though."}