{"doc_id": "1824", "name": "2013_11_humanities_student_major_1772_askmen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskMen", "title": "2013-11-humanities-student-major_1772_AskMen.txt", "pub_date": "2013-11-29T00:00:00Z", "Sentiment": "0.02", "Subjectivity": "0.501", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "733", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdphn59", "Reddit_id": "cdpiwpr", "Subreddit_id": "t5_2s30g", "Commenter": "yolakalemowa", "length": "4268", "content_scrubbed": "You know, being in the same position. I thought about this for a while and realized what \"could be\" wrong. What[.] much much worse than the problem you mentioned, is the fact that our own language is dying, or being killed by these people. As younger generations come forth, they are completely \"westernized\" and not even in a good way. No one writes in Arabic. \n\nI made it a point after realizing how dangerous this is to our culture and language, to write in Arabic when speaking Arabic, and English when speaking English. How ridiculous of me, you can imagine the uproar and pfffts and mockery this behavior raised. \n\nEverybody got so used to writing in that englishized arabic (they call it arabeezi here, cause arabic is arabi in arabic, and english is engleezi, so.. ya), that when I write in actual عربي, every single person was like \"wow man what[.] your problem?! pffft, hahaha, you sound ridiculous\" \n\nI swear this frightened me so much, how they blindly adopt **some** characteristics from the dominating western culture that[.] so loud and powerful right now it acquires the loudest voice in media, and everything in this world. \n\nI hate to generalize of course, but I feel safe to do so in this scenario. Kids are raised by their arabic parents to speak only English. I mean i bet even as an American this would sound shocking. They fail to pick up what[.] worthy of picking up by the west (which really is abundant if they just think straight... for ex: the organization, the open-mindedness, the technological development, the flexible education systems, the \"right amount of\" bureaucracy etc etc etc) \n\n\nInstead, they cut in lines, disrespect the elder and teachers, fellow humans, and most importantly themselves, and they pick up the very cool English language (and you'd wish they'd do so successfully too) also, they worship the almighty Macdonalds and KFC, oh and so knowledgeable they all are of latest celebrity news, and even worse, the terrible, degrading, meaningless it[.]-britney-bitch mainstream music.\n\nI wish, if they were to be followers, that they'd know who and what to follow. You want to follow and worship the west?! Then look for that which is worthy of admiration and adoption. For there[.] no doubt that they (US in particular for this example) are on the peak of their golden age, elites in the sciences, education, literature, the arts, press, and technology. (let no American start opposing this point listing what[.] \"wrong\" with their country, for if they visit us here, they'd know what I'm talking about and how incomparable the situation is, and how advanced and much well off they are than us here in the dark, busy with wars and bullshit basic human needs at the very bottom of Maslow[.] hierarchy.) \n\nAll I'm saying is (and I'm not sure how I ended up talking about this from where I began) I think the youth here, those you think are so lost writing in this uneducated, 12-year old teenage bubble-head manner, are so misinformed, and under so many factors leading to this unfathomable downfall of our beloved society. \n\nForgive me for venting all of a sudden, but your comment sparked deep thoughts which I often ponder. I guess my message is, that we should make sure to carry to them and our kids and students and lil uns especially. That they need be careful and reconsider what to follow and adopt from other greater cultures, and be not like fucking sheep herded around by what[.] so easy attractive, swag, nd kool. \n\nAnd most importantly, as we learn from their brilliant universities and try to join them in discovering the world and the space above, most importantly we should protect our own fucking culture and work so hard to revive our fast-dying language. CPR the shit out of it and start الكتابة باللغة العربية when we speak in arabic. \n\nTo teach our children the great english language, of course, and chinese and french and spanish and all that, but most importantly.. THEIR OWN MOTHER FUCKING LANGUAGE!!!! \n\n:( hoping for the best.. at least I've got my goal in life crystal clear in front of me.\n\nedit:forgive some grammar, punctuation, and spelling mistakes if found, for as you've guessed Engrish isn't my mother language; but hey at least I'm trying. Please correct me nicely so I can learn for future :)"}