{"doc_id": "1657", "name": "2013_11_humanities_student_major_312_egalitarianism", "namespace": "we1sv2.0", "metapath": "", "pub": "Egalitarianism", "title": "2013-11-humanities-student-major_312_Egalitarianism.txt", "pub_date": "2013-11-05T00:00:00Z", "Sentiment": "0.094", "Subjectivity": "0.342", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "335", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cd7k9ai", "Reddit_id": "cd7nxyn", "Subreddit_id": "t5_2sey7", "Commenter": "Troiseme", "length": "1871", "content_scrubbed": "We have years and years of history where women were homemakers and men were breadwinners. How do you know that men, at their core, are risk takers? How do you know that this wasn't simply \"the way things were\" and men had to adapt to that sort of thing? The fact of the matter is, we have a large history of men taking risks, and a smaller history of women taking risks. You can't extrapolate that men are \"better at taking risks\" if they have history on their side.\n\nSecondly, define \"risk taking behavior\"? There are more women in college than men. College can be seen as a risk, since you're sacrificing a large part of your time for a job you're not guaranteed to get, and you end up in mountains of student debt. \n\nGetting a BA in the Humanities (where most women are found) isn't a great idea if you want to get a well-paying job. In fact, majoring in a STEM field looks like it[.] the least risky. Howcome when men take risks, they're \"risk takers\", and when women take risks, they're \"too stupid and probably don't know how the world works\"?\n\nAlso, there[.] more than one face to politics, but there[.] more than one face to teaching and hairdressing as well. I've heard several times that men are better at visual-spacial things than women. Imagine the creativity men, who are innately better at visual-spacial things than women, can come up with for hairstyles! Is being able to make a visually appealing hairstyle not an integral part of hairdressing? And yet there aren't a lot of men who want to do that. Why?\n\nAs for boring work... Have you tried grading papers? Have you been in a PTA meeting? Have you been in a parent-teacher conference? There[.] plenty of unappealing, exhausting paperwork that goes along with being an elementary school teacher, and yet women are able to handle that. Why?\n\nThere[.] more than one facet to all these jobs, not just politics."}