{"doc_id": "1715", "name": "2013_11_humanities_student_major_805_tumblrinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrInAction", "title": "2013-11-humanities-student-major_805_TumblrInAction.txt", "pub_date": "2013-11-13T00:00:00Z", "Sentiment": "0.131", "Subjectivity": "0.444", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "1390", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qkwm4", "Reddit_id": "cddvi12", "Subreddit_id": "t5_2vizz", "Commenter": "kantbot", "length": "8307", "content_scrubbed": "Would magic survive Social Justice? This isn't the first time that I've actually seen tumblr \"Social Justify\" Harry Potter, but isn't the premise of Harry Potter that you go to school to learn to be a wizard? I actually never read past the third or forth book, and that was a long time ago so I'm not sure I completely remember the rules of the Harry Potter-verse, but isn't the idea that using magic requires you to acquire some knowledge of magical theory, by attending classes and reading books? Isn't Hermione the most magically adept of the main characters because she[.] the most bookish and hardest working?\n\nBelieve it or not magic used to exist, it was called art, and if you pay attention, if you stop and take the time to consider them from a figurative or symbolic perspective, the movies and books and fairy tales about magic and sorcery are actually, and keep this to yourself..., frequently about the production of works of high art and the experience of aesthetic Beauty.\n\nAnd what happened to art? In literature we find the most accomplished artists are very often scholars as well, there[.] always a prominent crossing over, or intersection, between their art and their reading and historical knowledge of literature. Some figures in the history of literature, like Dr. Johnson, are even more scholar than literary writer, and the boundary between the two practices is easy to lose track of. \n\nCreating literary art is a skill with many different dimensions to it, which is usually the case with anything. The naive conception of literary \"genius\" focuses primarily on the pseudo-poetic \"talent\" for euphony, or the ability for striking description, or the creation of novel analogies. The \"game\" of literary art involves many other distinct sub-skillsets though besides that, and as a particular chess player may excel in opening theory, or end game mastery, or generating novel ideas and possibilities to capitalize on, the literary artist can excel in all sorts of different ways.\n\nPsychological insight and characterization for example is a singular element of literary writing some writers are better at than others, Richardson springs immediately to mind, as does Dr. Johnson, who was admired contemporaneously as a biographer above all else. That Johnson would prefer Richardson to Fielding should come as no surprise on account of this. Certain types of reading knowledge, like history lend themselves especially well to the cultivation of psychological insight, and others, in turn, help the author develop himself along different fronts in a similar fashion. Logical metaphysics, to take another example, was instrumental in Schiller[.] development as a dramatist because he didn't conceptualize drama literally as a story in dialog, but rather abstractly as an exercise in Socratic logic essentially.\n\nMusic furnishes us further demonstration of what I'm trying to illustrate here, there[.] more to be a master of besides just melody, there are subskills like harmony and instrumentation to deal with as well. The most visionary and accomplished artists are usually the ones who possess mastery over multiple sub-skillsets, and furthermore have a highly refined sense of how each is to be exercised relative to the others. This is why Brian Wilson was such a dominative figure. He was superior to his peers, like Paul McCartney, who was primarily good at melody, in that he also had a firm grasp on arrangement and instrumentation and sound design and engineering as well.\n\nArt, like magic, requires study and self-development across multiple areas:\n\n\"It ['Genius'] might well be the first thing and the last thing, the beginning and the end; but in between there could be a lot lacking in the artist, unless education in the first place makes him into what he is intended to be, and what is more, education at the early stages; for perhaps the man to whom genius is ascribed is in a worse way than someone who possesses only ordinary capabilities; for the former can more easily be badly educated and more abruptly urged along false paths than the latter.\"\n\n\"But will not genius save itself,\" replied Wilhelm, \"and itself heal the wounds that it has inflicted upon itself?\"\n\n\"Not at all,\" the other answered, \"or at least only in a makeshift manner; for nobody should believe that they can get over first childhood impressions. If someone has grown up in a commendable freedom, surrounded by beautiful and noble objects, in the company of good people, if his masters have taught him the things he had to learn first, in order that the rest might be understood the more easily, if what he has learnt he never needs to unlearn, if his first actions were so directed that he can in future do good more easily and more conveniently, without his having to break himself of anything, this person will lead a purer, more perfect and happier life than someone who has misplaced the first energies of his youth in opposition and error. There is so much said and written about education, and I see only a few people who can grasp the simple but great idea that includes all else in itself and put this into execution.\"\n\n\"That may well be true,\" said Wilhelm, \"for every person is limited enough to wish to bring up the other man as a model for himself. How happy, therefore, are those in whom fate, which educates everyone in its own fashion, takes an interest!\"\n\n\"Fate is an elegant but expensive tutor,\" the other replied with a smile.\n\n-The Abbe to Wilhelm; Goethe[.] *Meister*, Book Two, Chapter Nine\n\nFew things seem to annoy people, especially young people, more than the suggestion that hard_work and study is the key to art. Many people dream of being writers who have hardly finished reading a single book. Today it[.] possible to be a musician without knowing anything about music. I have conversations like the above one between The Abbe and Wilhelm Meister all the time with people, and they always tell me how they don't need to read or learn or study or acquire real knowledge about anything, because it[.] more important to have \"experiences\", or because \"genius\" will compensate them for their own negligence, but that just isn't the case. This laziness has almost become institutionalized at this point, and sometimes, in some circles (especially among SJWs) you can really feel their outright contempt for art because they simply aren't able to understand it, they haven't done the work necessary to be able to really appreciate the level of aesthetic mastery present within classic \"high\" works. Nobody wants to confront the possibility that there[.] anything beyond their understanding, that there[.] a world of art and ideas that you have to work to gain access to that[.] significantly more profound than what we experience as default.\n\nWould SJWs \"radicalize\" the world of Harry Potter, or would they destroy magic like they destroyed art? I can't help but imagine them making Neo-Marxist criticisms of \"high\" magic as classist and unfairly exclusionary of inferior types in order to excuse their own laziness and lack of drive. SJWs don't read a lot or work hard in school. Gender Studies and Sociology departments aren't just dismissed for being intellectually bankrupt on a theoretical level, but because the students in those departments are held to a lower intellectual standard than is really proper, and because of this, they often appear to attract the less motivated and academically serious class of students.\n\nIf SJWs can't be bothered to take art seriously, to study it or respect the theoretical validity of the idea of aesthetic Beauty, if they can't pry themselves away from tumblr and social media long enough to read a book, if they think that \"beauty\" is socially constructed, and that the protestant work ethic furthers social inequality, if they try and convince us that \"intelligence\" is unfairly \"privileged\" by \"Society\" how could they ever possibly succeed as witches and wizards? They'd be twittering on their laptops in potions class just like they do in their humanities classes today.\n\nYou could only write an SJ version of Harry Potter as a parody of this fact, but SJWs don't have enough self-awareness to realize that they'd do no better in the fantasy world of magic than they're generally able to manage in the real world of art and ideas..."}