{"doc_id": "1719", "name": "2013_11_humanities_student_major_872_whowouldwin", "namespace": "we1sv2.0", "metapath": "", "pub": "whowouldwin", "title": "2013-11-humanities-student-major_872_whowouldwin.txt", "pub_date": "2013-11-14T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.392", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "628", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qmj64", "Reddit_id": "cdeo5h7", "Subreddit_id": "t5_2s599", "Commenter": "supergenius1337", "length": "3561", "content_scrubbed": "Round One:\n\nGoogle Headquarters:\n\n\"Sir, our preparations are complete. We can begin Operation Phoenix,\" said a man wearing a business suit. \"Are you sure you want to do this? Once we engage, there is no turning back.\"\n\nThe boss was sitting in his chair, facing towards the window in deep contemplation. He then slowly turned to face his employee with a serious look on his face, knowing that this plan would kill millions of people. He didn't want to do it, but it was humanities only hope. \"Yes. Engage Operation Phoenix.\"\n\n\"Very well boss. ... Boss, I don't feel too good about this.\"\n\n\"Neither do I, but it[.] for the greater good. You and I both heard what Schwartz said. It seemed like an unlikely story when we first heard it, but Schwartz came here from the future to try and stop humanity from destroying itself. We all knew that convincing people to stop being so selfish is impossible. We have to get them to cooperate with each other, to get along without regard for arbitrary divisions somehow. It may seem evil, but a robot invasion is the only way. Look at the Space Race. It took a rival to get the Americans off their asses and into space. It[.] a fact of life; people will unite when a common enemy shows up.\"\n\n\"This may seem like a far-fetched plan\", the boss continued, \"but we've planned this for decades. We'll have the Eagle Fliers, the Shark Ships, the Panther Prowlers, and the Mecha Militias move into position for our strike. They will strike every major city from all sides. After our first attack, we will have Giga Omega broadcast a message to the world. It will claim to be a robot sent from the future to conquer Earth. Obviously it will do the typical conqueror villain sort of stuff. You know, demand that humanity surrender before it and be its slaves. Obviously humanity won't go along with that. Humanity will fight the robotic invaders off and will eventually triumph after approximately 100 years. That is what Giga Omega calculated. By the time this war ends, the humans shall unite as one. Giga Omega shall make sure of it. After decades of research, the great Giga Omega, the most powerful and intelligent AI ever created, shall be put to its intended use. It shall utilize strategy and cunning greater than any human could ever conceive.\"\n\nMeanwhile, in a secret military base:\n\n\"Operation Phoenix is ready to be engaged. Perfect. After so long, my plan shall come to fruition. Though I may have lost the Genetic Wars so long ago - or in the future still for everyone one else not from the future - Earth shall belong to the superior beings. For too long, this planet has been infested with useless parasites. I was a man of vision, and I sought to cleanse this hopeless world. Unfortunately, I lost. Those pathetic insects managed to defeat the true masters of this planet! But not this time! I managed to go back in time and convince two optimistic fools to build me an army and a superior mechanical mind to ensure that the superior beings shall prevail this time around. Little do they realize that the Schwartz Army shall do more than attack some important buildings in major cities tomorrow; my army shall kill all beings not fit to exist in this world, including those two fools! The 10% who survive shall go on to build a better society; a society free of the stupid, the superstitious, the greedy, the selfish, the overpopulators, the polluters, the capitalists, the barbaric, the oppressors, the lazy, the ignorant, and anyone who would dare to serve those scum in any way! Giga Omega, engage Operation Phoenix!\""}