{"doc_id": "1633", "name": "2013_11_humanities_student_major_102_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2013-11-humanities-student-major_102_changemyview.txt", "pub_date": "2013-11-02T00:00:00Z", "Sentiment": "0.121", "Subjectivity": "0.44", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "477", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pps1z", "Reddit_id": "cd4zypf", "Subreddit_id": "t5_2w2s8", "Commenter": "BaconCanada", "length": "2585", "content_scrubbed": "As someone who pulled a B on my first major philosophy essay, This thread made me feel a bit better, and a bit more scared. The thing about philosophy is that it is a field that is at its core, the conclusions that one can get primarily from their own deductive reasoning. Going in it is necessary to do your best not to hold any preconceptions about what you believe to be true, while at the same time keeping your knowledge of empirical evidence firmly grounded. It can help and mess with your reasoning if you really want to understand things for yourself. The readings in philosophy... At best they are about your avrage University article, at worst they're a translated version of some guy rambling on about what he thinks reality is for many, many pages. I've learned that if your critical thinking skills aren't exceptional then you need to devote hours and hours to reread what you're scheduled and to treat it like many foods. You must digest slowly, chew quickly and look for that twinge of the flavor you like while taking notes to make sure you are engaged with the text (of course a lot of this applies to almost all humanities but it seems to be much more of a focus here). There are three parts. First you have to understand what the person is saying, and what their point is. Once you do that you can have a pretty strong string of logic. This logic feels so solid that you feel inclined to agree, especially after all that time decoding and breaking down the writing(the tone of your notes might not help, either) . To get a decent grade your job is now to counter the author, find chinks in their armour, exploit them and do it better than a class with a good percentage having a significantly higher avrage than you. All this isn't too bad, but the page limit will hurt. It can be tempting and you might have a lot to say and many chinks that add up well, but you have to be organized and your thoughts have to be concise because they stop reading after the second page. Sorry for the rambling, It[.] 4:00am here and I just got back home from uni, so I'm pretty tired and typing this on my phone. TLDR philosophy (and possibly humanities as a whole to a lesser degree) focuses on your ability to digest what people thought, look at things from their mindset, usually in some way you hadn't considered before, then counter it in a short space. Over and over. You are graded depending on how you compare to others. The resulting graduates I've seen so far are very, very good critical thinkers and are usually some of the best on the LSATS (not sure about other tests)."}