{"doc_id": "1645", "name": "2013_11_humanities_student_major_197_engineeringstudents", "namespace": "we1sv2.0", "metapath": "", "pub": "EngineeringStudents", "title": "2013-11-humanities-student-major_197_EngineeringStudents.txt", "pub_date": "2013-11-03T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.571", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1214", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1ptifw", "Reddit_id": "cd61ke3", "Subreddit_id": "t5_2sh0b", "Commenter": "[deleted]", "length": "7066", "content_scrubbed": "I just entered UC San Diego this fall as a ChE major after spending two years at community college. I had applied to UC Irvine, UCLA, and UC Berkeley, and only got into SD and Irvine.\n\n**Things I like**: I do rather like the fact that the school isn't quite as distracting with a strong social life compared to other schools (I am a non traditional student, and I don't much care for drunken college kids yelling at all hours of the night and slacking off). The engineering school is huge, so I don't feel out of place when on campus (at my housing on campus is a different story, however). It being San Diego, the weather is, well, pleasant to say the least (We can consider 55 F and windy during the winter cold and complain with light sprinkles). Coming from a non-engineering background before, it[.] a very nice change to go somewhere people casually discuss coursework and research over lunch or walking between lectures, and the professors are also nice and easy to approach despite classes being large. The quarter system is fast-paced, so this could go either way depending on the person, but I personally find that I enjoy the quicker pace and more finely-divided levels of coursework. The apartment I live in on campus is very new (built only two years ago), and I get a nice ocean breeze coming in (I also have a nice ocean view from my bedroom, which is a very welcome sight when I'm working on a problem and look up around sunset).\n\nIf you're interested in research at all or looking at grad school, there[.] a load of opportunities here and the professors are always willing to take on undergrads for research if you approach them. Side note on that, however: This school has a **lot** of premeds, many of who go to engineering (usually Biomed or ChemE because hey, biology and ochem part of the curriculum already). Premeds, as we all know, are the bane of a university, and the curves can get real vicious here at times, as well as competition for research or other opportunities.\n\n**Things I don't like**: While most of this school[.] engineering programs are fairly well ranked, it[.] sad to say that they left ChemE behind. The department for ChemE here is, put plainly, not very good. Very few electives in the department, all major-specific classes are only offered once a year, lack of funding towards labs or resources specifically geared towards our major, and there is absolutely nothing in the way of recruitment. This school is heavily geared towards CS/EE/BioE at any recruiting events, and at the tech fair this fall, out of 200+ companies, only ten were looking for ChemE majors. The school recently put ChemE under a new department geared towards nanotechnology, which sounds interesting on its own but means that the department[.] resources are going towards the new NanoE program which isn't ABET-accredited yet (the ChemE program itself is accredited, but having been put under such a newly formed department makes me wonder how suspect it will appear to employers). While the school makes a big show about how people are placed, from my feeling in the department as well with talking with recent grads and seniors, there aren't many internship connections to be made through the school in our major. There are also only two counselors for the entire department (NanoE + ChemE), despite there being 700-800 students between the two majors.\n\nBeyond ChemE though, the school[.] \"Six College\" system is plainly ridiculous. Each college having its own general education requirements makes some colleges far more difficult for engineering majors to fulfill requirements on time for no real reason. Furthermore, the colleges are not split up per major, so the colleges are not really geared towards giving assistance to engineering students. I feel that a school in which engineers are all put in their own college are more able to help struggling students in academic counseling. I respect the idea of intellectual diversity and bringing in different viewpoints, but it[.] definitely problematic when your college[.] staff can't really help you despite this school having a ton of engineering students because each college ends up focusing on social_sciences majors or arts/humanities instead.\n\nEach apartment/dorm building having a mix of all majors means that housing on campus is also evenly distributed, so I was placed in an apartment on campus with social_sciences/humanities_major who enjoy partying on weeknights. Furthermore, all transfer students to this school are only allowed to live on the north end of campus which is specifically designated for transfers. I feel this builds an artificial wall between the regular students and transfer students and makes it harder to integrate into the school, not to mention giving us a lot longer walk to an classes compared to people on the south or east end of campus.\n\nIf you live off campus, be aware that San Diego is very, very transit unfriendly. You need a car to go anywhere in this city, and considering that parking on campus here is very expensive (upwards of $600 a year for a permit, and considering the limited availability of parking, you probably won't find a spot except in the far lot across the freeway by the medical center), you're going to be paying a pretty penny to own one. Furthermore, the shuttle system they run is facing budget shortfalls and there may be routes cut entirely or at least pared down schedule wise, and there are rumors that the current, limited, bus pass included with tuition is going away after this year. Transit is really difficulty in this city, and while they are planning on extending the trolley system to UCSD, that isn't scheduled to be finished for a few more years. La Jolla (the city UCSD physically resides in) is also very expensive (rental prices: $1600 for a one bedroom apartment, $1800 at minimum for a two bedroom), very boring and full of rich people who apparently have no respect for transit or pedestrians or bicyclists.\n\nOne more thing about the city itself. San Diego is beautiful. San Diego, however, is also very boring compared to LA or the Bay Area. There[.] decent food, and if you enjoy Mexican food it[.] definitely a great place to be, but as far as entertainment goes, SeaWorld and the Zoo are lame tourist traps. If you come here, definitely find someone with a car or fork up the extra cash to bring your car and park and just drive up to los_angeles on breaks for fun, because you're not finding any down here.\n\nOverall, this school is in a beautiful area with nice weather, and if you are an Electrical, Computer, Comp Sci, or Biomedical Engineering major, definitely come here for their resources and their programs which are very well regarded with tons of elective options to choose from. Mechanical and Structural (there is no Civil Engineering program here) are also good programs here, but if you are a Chemical Engineering major like I am, **stay away**. Go to Santa Barbara instead if you don't get into LA or Berkeley - they might be a big party school but their ChemE program is very well regarded."}