{"doc_id": "1772", "name": "2013_11_humanities_student_major_1369_texas", "namespace": "we1sv2.0", "metapath": "", "pub": "texas", "title": "2013-11-humanities-student-major_1369_texas.txt", "pub_date": "2013-11-21T00:00:00Z", "Sentiment": "0.09", "Subjectivity": "0.342", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "270", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r6ng9", "Reddit_id": "cdkag4h", "Subreddit_id": "t5_2qho4", "Commenter": "T-Luv", "length": "1603", "content_scrubbed": "But the board removed a proposed algebra II requirement for students who choose all other diploma paths: arts and humanities, business and industry, multidisciplinary studies and public service. Students can also earn \"foundation\" degrees that don't include higher math or science requirements and don't focus on a particular discipline.\n\nBusiness and industry is also included? Math is pretty good to know for business. I majored in criminal justice, and math was definitely required, even though it[.] not obvious that it would be needed. I had to take a remedial math course in community college, even after taking algebra II in high school. \n\nI actually had a high school teacher tell me that I would never succeed in college. I'm a licensed attorney now. If I wasn't required to take algebra II, I wouldn't have because I never planned on going to college until after I graduated. That would have hurt my ability to progress in higher education. I guess if students actually begin their vocational training in high school, it would be alright to allow them more flexibility in what courses they take, but if students aren't making any proactive efforts towards a particular vocation, then the school should make sure they are prepared for whatever options may be presented. \n\nSometimes 17 and 18 year olds will just go with the path of least resistance. If they choose to go with vocational training so they don't have to take algebra II, then I'm ok with not requiring it. But if they aren't even getting positioned for a career, then they should get a well rounded education to keep options open. "}