{"doc_id": "1721", "name": "2013_11_humanities_student_major_950_udub", "namespace": "we1sv2.0", "metapath": "", "pub": "udub", "title": "2013-11-humanities-student-major_950_udub.txt", "pub_date": "2013-11-15T00:00:00Z", "Sentiment": "0.136", "Subjectivity": "0.38", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "477", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1qnudo", "Reddit_id": "cdfhrlp", "Subreddit_id": "t5_2razk", "Commenter": "energeticmater", "length": "3032", "content_scrubbed": "CSE 140 TA here! (Both last year and for the offering next quarter.)\n\nHere[.] an overview of the classes, presented in increasing order of difficulty/usefulness/awesomeness:\n\n**CSE 120**\n\nThis is described as \"fundamentals of computer science essential for educated people living in the 21st century, taught with two concurrent themes: Creativity and Principles.\" Creativity in terms of using programming as a tool to create simple images and games, and principles in terms of the basics of how computers, networks, information, and search engines work. \n\nIn this class, you learn to program using a very limited \"toy\" programming language. You mostly draw little images that move in limited ways. You spend the first two weeks learning to program by playing puzzle games that feel a little like code. You can show your assignments to your friends, and they'll say, \"that[.] cute!\" The assignments are very loosely-defined.\n\nThe purpose of this class is to teach you that code isn't as scary as you think, code can create fun little things, and that computers aren't magic.\n\n**CSE 142**\n\nThis is described as \"basic programming-in-the-small\". You use very simple programming constructs in reasonably complex ways to create what are typically fun, clever things. You use a heavy-duty, complex, industry-standard programming language called Java. \n\nThe assignments are challenging because they're detailed, tricky, and have extremely strict requirements. You are expected to solve every problem in a very particular way, and most deviations are looked down upon. When you show your assignments to your friends, sometimes they'll say, \"Oh, interesting,\" and sometimes they'll say, \"That[.] really cool!\".\n\nThe purpose of this class is NOT to make you an effective or competent programr, but to get you just interested enough to take the next class(es).\n\n**CSE 140**\n\nThis is described as teaching you to \"solve real data manipulation tasks from science, engineering, business, and the humanities.\" You use complex programming constructs in complex ways to do statistically-sound analyses of large datasets. You use a user-friendly, heavy-duty, industry-standard programming language called Python.\n\nThe assignments are challenging because the topics, data, analyses, and programming is hard. The algorithms you should use are sometimes not well-defined; it[.] up to you to decide how to solve a problem. We don't care how you do it, as long as it produces the correct result and it[.] well-written. Every assignment is a complete analysis of a real dataset. When you show your assignments to your friends, you'll spend several minutes explaining it, and they'll be astonished and impressed.\n\nThe purpose of this class is to be a first (and possibly last) course in computer science for technically-inclined students. You'll learn and use all of the topics from CSE 142, many from CSE 143, and some from CSE 332, CSE 331, and CSE 312. \n\nIn many ways, the designation \"CSE 140\" is a misnomer. It would be more accurately titled \"CSE \"24x\". "}