{"doc_id": "1650", "name": "2013_11_humanities_student_major_235_tumblrinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrInAction", "title": "2013-11-humanities-student-major_235_TumblrInAction.txt", "pub_date": "2013-11-04T00:00:00Z", "Sentiment": "-0.028", "Subjectivity": "0.297", "Score": "109", "Upvotes": "109", "Downvotes": "0", "Wordcount": "291", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1pw5t0", "Reddit_id": "cd6oskn", "Subreddit_id": "t5_2vizz", "Commenter": "OrangeJuliusPage", "length": "1682", "content_scrubbed": " I am a student at a private liberal_arts college in the U_S. I am also the first in my family to attend college straight out of High School, and my family is nearly crippled by the debt obtained through this education. \n\nCry me a fucking river.  Were there no less expensive public school or community college options available, through which you could have amassed less debt and earned a more marketable degree?\n\n It is because of these two factors, that I know I am not better than any American who has not benefited from the type of education that I have had the privilege to.\n\nSo, this great revelation about how much student debt sucks came from taking out an unnecessary amount of student debt?  Something about a fool and her money...\n\n  The last problem I will emphasize (though I encourage you all to find more issues with this) is that the family, as well as the girl just expected me to humbly give them room to sit with me. \n\nThat[.] how public transit generally works.  \n\n My subordinated status allowed these 3 people to assume they could sit with me, and didn't have to be gracious toward me for it. \n\nNo.  The open seats next to you fueled that presumption.\n\n Ask \"Why wasn't I included in this conversation?\" or \"Why did you begin talking to this other person without second thought, yet held your tongue for me?\"\n\nThis is a terrible idea, which will only serve to further marginalize and ostracize you.  Better solution, say something like \"Excuse me, I couldn't help but overhear your conversation, and I believe...\"  Throwing people on the immediate defensive isn't usually the winning attitude to overcome their biases and expand your social circle.  "}