{"doc_id": "1707", "name": "2013_11_humanities_student_major_771_australia", "namespace": "we1sv2.0", "metapath": "", "pub": "australia", "title": "2013-11-humanities-student-major_771_australia.txt", "pub_date": "2013-11-13T00:00:00Z", "Sentiment": "0.032", "Subjectivity": "0.41", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "500", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cddebzq", "Reddit_id": "cddeyc0", "Subreddit_id": "t5_2qh8e", "Commenter": "TheNossinator", "length": "3017", "content_scrubbed": " *\"Well we'll see won't we? Seems to me like you're ruling out the possibility that they'll have an impact at all, which seems cynical.\"*\n\nI'm only clarifying on behalf of what[.]-his-username. I'm not trying to say anything about the future or what might happen, only what that-guy said.\n\n *\"The Libs claim that they need to raise the ceiling because they stopped the Labor government raising it after Labor under-estimated their costs. So I'd say both parties are guilty in this respect.\"*\n\nThis still ignores the fact that the ***Budget EmergencyTM*** we heard so much about has now mysteriously disappeared. It[.] almost as if Labor *didn't* ruin the economy completely and the Coalition... lied?\n\n *\"You're making a lot of risky calls in your post.\"*\n\nI'm generally talking about the more reasonable posters because they are the majority. There are a few rabid frothing-at-the-mouth types on both sides but it[.] best to just ignore them.\n\n *\"I think you're downplaying the effect the position Howard placed Rudd in...\"*\n\nIt was great to have that money in the bank but let[.] not delude ourselves and somehow try and credit Howard as the person who had the most positive impact re: Australia[.] position in the GFC. We know Abbott and the Coalition wanted to put in austerity measures - the same measures that threw a great lot of other nations into complete recession (and in some cases, ruin).\n\n *\"I think Right-wing voters have Australia[.] interests at heart and Left wing voters have 'humanities' interests at heart.\"*\n\nI think *all* voters have the interests of Australia at heart. It[.] just different perspectives on how to best go forward that creates a difference. The notion that you've regurgitated, that all Lefties are basically hippies and all right_wingers are sensible, pragmatic individuals is complete bullshit.\n\n *\"A lot of Labor[.] policies did very little to benefit Australia, and in some cases I'd say hindered it, they were about symbolism and appealing to humanitarian concepts.\"*\n\nPlease explain how the NDIS, NBN, education reform, dealing with Climate Change and many, many other things \"did very little to benefit Australia\"? You're as blatantly partisan and making as many \"risky calls\" as you accuse others of doing.\n\n* **Disabled people can get fucked** - if you're disabled you should pay for it because it[.] your own fault...?\n* **Anyone with an Internet connection can get fucked** - if you wanted fast, reliable connections into the future you should pay for it because why didn't you inherit more mines...?\n* **Children can get fucked** - if you wanted to learn, don't. You'll do what the government tells you to do.\n* **Humanity can get fucked** - if you didn't want global warming you shouldn't have driven to work today.\n\nDoesn't sound like anyone[.] interest to me.\n\nIf you think Direct Action, FTTN, turning boats back ~~where safe to do so~~ where Indonesia lets us and the rest of the Coalitions suite of policies are \"for Australia,\" we must be living in different countries."}