{"doc_id": "1787", "name": "2013_11_humanities_student_major_1503_gradadmissions", "namespace": "we1sv2.0", "metapath": "", "pub": "gradadmissions", "title": "2013-11-humanities-student-major_1503_gradadmissions.txt", "pub_date": "2013-11-24T00:00:00Z", "Sentiment": "0.056", "Subjectivity": "0.418", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "272", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cdm8ms9", "Reddit_id": "cdm8xfs", "Subreddit_id": "t5_2tn62", "Commenter": "PhD_8Ball", "length": "1729", "content_scrubbed": "Personal statements/statements of purpose (make sure which one this is; some institutions have a statement of purpose [research], a personal narrative/statement [more for diversity purposes than anything) are probably the hardest piece of writing you'll undertake at this point in life. And it doesn't help that there really is no golden rule.\n\nI would say that you should keep it formal, but don't interpret that to mean you should stuff your document full of jargon. Personal anecdotes don't have a place in a research statement of purpose, ideally. Do try to trace a chronology of your intellectual/scholarly development, and try to show how your future interests/plans have evolved from your past work. Provide specifics of past projects that have earned you distinction, or have given you basis for future research. Careful name-dropping can help (i. e. if you've worked with, say, Krugman or Stiglitz), but do ensure it isn't arbitrary.\n\nIn my case, I opened out by summarizing a currently-emerging sub-field and its major questions, then linking my own interests to that. This helped situate myself, as in, \"Okay, if we admit this person, they're potentially going to intervene in this nascent sub-field and make X Y contributions.\" After that, I retraced relevant courses/projects from my undergraduate and MA periods, showing how my present interests evolved. Discussed my writing sample, since for humanities applications that[.] of paramount importance. Next paragraph was a brief outline of how X program in particular could help me advance my interests, etc. Done.\n\nI would also suggest you read some statements that \"worked\" (i. e. from current PhD students), and if possible, have a trusted faculty member review it. "}