{"doc_id": "1780", "name": "2013_11_humanities_student_major_1441_korea", "namespace": "we1sv2.0", "metapath": "", "pub": "korea", "title": "2013-11-humanities-student-major_1441_korea.txt", "pub_date": "2013-11-23T00:00:00Z", "Sentiment": "0.029", "Subjectivity": "0.287", "Score": "20", "Upvotes": "20", "Downvotes": "0", "Wordcount": "264", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_1r9w3k", "Reddit_id": "cdl67a0", "Subreddit_id": "t5_2qiog", "Commenter": "szp", "length": "1645", "content_scrubbed": "A Japanese-communist-American-beef-importer-human-rights-activist-and-humanities-professor was teaching a class on Kim Il Sung.\n\n\"Before the class begins, you must get on your knees and worship Kim Il Sung and accept that he was the most patriotic being the world has ever known, even greater than Yi Sunsin!\"\n\nAt this moment, a brave, patriotic, pro-surveillance ROK Marine who had served 1500 months on the DMZ, and understood the necessity of propaganda and fully supported all military decisions made by the Park Administration, stood up and held a pile of dirt.\n\n\"How nutritious is this dirt?\"\n\nThe arrogant activist smirked quite imperially and smugly replied, \"you can't eat dirt you stupid nationalist.\"\n\n\"Wrong. This dirt comes from native Korean soil. If it came from Japan it would be racist radioactive goo, but I fed on this dirt and became a strong Korean soldier.\"\n\nThe professor was visibly shaken, dropped his chalk and statue of Juche Idea, and stormed out of the room crying North-Korea-sympathizer crocodile tears.\n\nThe students applauded and all registered Saenuri on that day. A tiger named \"Dokdo is Korean\" walked into the room and knelt before the photograph of Park Cheonghee, shedding a tear on the chalk. The Patriot[.] Song was sung several times, and Cheon Duhwan showed up to approve of shooting all liberals across the country.\n\nThe professor lost his tenure and was fired the next day. He died of the radioactive Japanese prostitute syphilis and was tossed into the lake of fire for all of eternity.\n\nDeahan Minguk Manse\n\np. s disband unified progressive party\n\nEDIT: And that Marine[.] name? King Sejong the Great."}