{"doc_id": "1387", "name": "2014_05_humanities_student_major_902_canadapolitics", "namespace": "we1sv2.0", "metapath": "", "pub": "CanadaPolitics", "title": "2014-05-humanities-student-major_902_CanadaPolitics.txt", "pub_date": "2014-05-13T00:00:00Z", "Sentiment": "0.093", "Subjectivity": "0.276", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "338", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25gdme", "Reddit_id": "chgzkoe", "Subreddit_id": "t5_2s4gt", "Commenter": "CanadianHistorian", "length": "2268", "content_scrubbed": "I was a bit confused by this paragraph:\n\nThey weren't asking for people who code more lines per hour, or those more facile with spreadsheets, or any other so-called \"job-ready\" skills. They wanted employees prepared for the 21st century knowledge economy in which communication, collaboration, and creativity are the most valuable commodities – precisely those skills a liberal_arts education provides\n\nand then:\n\n Canada is first in the OECD in postsecondary participation rate, but near the bottom in employer investment in worker training. The assumption that universities should provide these services is deeply misguided. If we turn our universities into job-training centers, while the rest of the world is opening the minds of their best students and cultivating their creativity with a liberal_arts and sciences education, our ratio of GDP to population is headed for a steep decline.\n\nIn fact the author seems to be arguing that universities are job-training centers, but employers/universities/someone? are not recognizing what job skills an individual gains in the Arts.  History programs (from which I draw my experience) teach students the skills he outlines, but does not tell them that they have these skills or how to sell them to employers.  I think that universities should be job-training centers... But ones that offer a variety of skills for a range of positions.  Arts can offer as much as the Sciences in this regard, even if the exact position it[.] for is less clear-cut.  If anything this flexibility should be an advantage.\n\nMany of these [articles](http://www. theglobeandmail. com/globe-debate/universities-should-educate-employers-should-train/article14078938/) on university-job-training fail to confront the biggest problem with this discussion: how do you change these systems? There[.] many people involved in the process.  You have to talk to employers, university administration, faculty, students, and probably now high school teachers advising students about which degree to take at university.  All of these stakeholders need to at least understand what skills an \"Arts undergraduate\" can/should possess.  My experience has shown very little desire to reform the purpose of an Arts education from all levels involved in imparting it."}