{"doc_id": "1377", "name": "2014_05_humanities_student_major_812_askphilosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "askphilosophy", "title": "2014-05-humanities-student-major_812_askphilosophy.txt", "pub_date": "2014-05-12T00:00:00Z", "Sentiment": "0.023", "Subjectivity": "0.319", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "1356", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chfj5zl", "Reddit_id": "chfxmaa", "Subreddit_id": "t5_2sc5r", "Commenter": "univalence", "length": "8321", "content_scrubbed": "Oh but why would I refrain from dragging down all science with philosophy? Physics and biology are roughly 30% trash and 10% poison.\n\nMost human endeavors are filled with trash and poison. I have a hard time believing this is the fault of the field itself, and not a problem with humanity in general. But that[.] getting a little too close to philosophy...\n\n Like a minority of people in the sciences, I care about accuracy exclusively.\n\nAnd how do we determine that? We can't do that with logic; since it can only turn true things into true things. Logic is garbage in, garbage out. So what principle do we use to determine metaphysical truths?\n\nI was confused for a very long time between the correct interpretation of Goedel[.] theorems and the absurd one. Because everyone kept saying it was a deep result and I didn't find it terribly so.\n\nIn retrospect, it[.] not a terribly deep result, at least conceptually. But it was the first proof to do two things:\n\n* Encode logical symbols, formulas and deductions as integers. (This is now ubiquitous, but at the time was incredibly novel)\n* Seriously question whether an axiomatization of arithmetic was possible.\n\nGiven the philosophical climate at the time, both were indeed deep and surprising things to do. I should point out that no amount of logic could convince you to come up with the that proof. It requires creative insights and more importantly *philosophical convinction*.\n\n(no need to drag in Maxwell[.] name, is there?)\n\nI'm glad we're so keen on honoring the people who've helped us reach our current level of understanding...\n\nPhilosophy has no relation to physics at all.\n\nPopper and Quine may have some words on that...\n\nIts closest relation is to the Building Code enacted by different cities. \n\nFrank Lloyd Wright[.] views and all the trivialities, annoyances and arcana of building codes aside, I'd rather stand in a building I know to be built to code than one I know not to be. And I'd also prefer there to be people thinking about safe and effective ways to construct buildings, rather than have everyone blindly follow one method because it seems to work.\n\nYeah, and kindergarten fingerpainting class gives you a background in the arts. Philosopher[.] takes on analysis and logic are respectively remedial education and special ed.\n\nYes, I'm sure Per Martin-Lof, Saul Kripke, Steve Awodey, Joan Bagaria, David Copperfield and Graham Priest all have remedial understandings of logic.\n\nIn fact, I once saw a textbook OF symbolic logic published by a professor TEACHING the course who clearly wasn't capable of logic himself as the whole thing was incoherent and his attempts at \"simplification\" by Anglicizing the names of operations was completely missing the point.\n\nI've seen more than one professional analyst butcher the calculus courses they teach. I've seen an algorithms researcher make a mess of both red-black trees and matroids. Being able to teach and being able to do are not the same thing. Beyond this, An anecdote is a *terrible* way to reach a conclusion and you know this.\n\nEver heard of automated theorem provers?\n\nI'm writing my thesis with one, so... yes? Still, if you think that this means we don't need peer review, you're mistaken, or at least going against [consensus](http://math. andrej. com/2013/08/19/how-to-review-formalized-mathematics/).\n\n I SCOFF at your claim that ANY mathematician in the history of the world would accept the proposition that the truth or falsity of a mathematical theorem is determined by consensus.\n\nEh... I'll let you have that one since I'm too lazy to dig up sources otherwise, but whether or not a given proof is *accepted by the community* is determined by consensus (essentially by definition of \"accepted\"). The level of rigor deemed \"rigorous enough\" is socially constructed and based entirely on consensus. The difference between \"acceptance of a proof is by consensus\" and \"truth is by consensus\" is a philosophical distinction at best, and doublethink at worst. And that[.] in *math*. What about science? Where accepted truth *really is* reached by consensus.\n\nIf you seriously believe this, you are not only a retarded idiot but also a liar and a hypocrite, \n\nI don't seriously believe this, but your response here fails to distinguish between the level and the meta-level. I think you said something about that. ;)\n\n Infinite regress isn't a sign that you should bask in your own insignificance in helpless awestruck wonder.\n\nYou've missed my point. Logic is completely silent on accuracy, completely silent on truth. Logic is a way to derive new statements from old statements.  The way you slay infinite regress is by determining a starting point using extra-logical means. At any rate, [truth is undefinable](http://en. wikipedia. org/wiki/Tarski[.]_undefinability_theorem) without appealing to a meta-system, and then it[.] still turtles all the way down.\n\nAre you seriously arguing that mathematics and physics are matters of convention?\n\nThe use of ZF (+AC + your favorite large cardinal axioms)-- in place of ETCS, NF, KP, HoTT or OTT (or any of the other proposed foundational systems)-- is a convention. The use of first-order classical logic-- instead of f. o. intuitionistic logic, intuitionistic type theory, some many-valued logic like Łukasiewicz or some non-monotonic logic-- is a convention.\n\n\"Theorem of ZFC\" is not a matter of convention, but the identification of this statement with \"Mathematical theorem\" *is*.\n\nI'm also unconvinced that science is really about \"truth\". Nor, for that matter, am I convinced that is something we have the capability to distinguish. I *am* convinced that science tends towards an accurate model of reality, which for lack of a better candidate, we may as well call \"truth\". But *now* (that is, any fixed point in time), what we regard as \"scientific knowledge\" is, quite explicitly nothing more than scientific consensus.\n\nIt[.] worth pointing out here that the \"logic of scientific truths\" is non-monotonic: new information can invalidated old truths.\n\nYou believe that philosophy is useful because the consensus on the topic says so.\n\nI am an unthinking drone who is a slave to consensus. How astute of you to notice.\n\nMeanwhile, physics and mathematics ACTUALLY ARE useful,\n\nLet[.] step back and talk about the foundational crisis for a minute; hear me out here: around the turn of the 20th century, a bunch of mathematicians and philosophers had a big cat fight about what sorts of things mathematicians were allowed to study (and still say they were doing math), and how they were allowed to study it (and still say they were doing math). The argument really centered around infinite sets and \"ineffective methods\" (that is, usually, proofs making use of choice principles or induction principles over infinite sets). Take a moment to appreciate how utterly useless the question \"Are ineffective methods justifiable?\" is: infinite sets have limited applicability in the real world, and it[.] a rare theorem which makes use of these methods and also has immediate relevance to *anyone* outside of math.\n\nMost mathematicians then or since know little about this debate besides \"it happened\", and have gained very little from it (knowingly at least; it[.] changed the face of mathematics quite a bit, but that[.] another tale). Much of the math done by physicists and engineers isn't even formally justifiable (much to the chagrin of their colleagues in math departments who try to shove a shaky foundation under this stuff), but it still gets the job done, formal correctness be damned. In short, philosophical questions about certain esoteric techniques with limited real-world applicability are the epitome of useless navel-gazing.\n\nFrom the fallout of this truly pedantic question, we get Godel, Tarski, Church, Kleene, Von Neumann (and others) working on what later comes to be known as \"theory of computation\". You may know about this; it[.] why we can have a stupid argument over the internet, and is easily the most world-changing development of the 20th century. Call me naive, but I'm wary of flushing a whole *branch of knowledge* down the drain; I've seen too many diamonds get pulled out of the piles of shit.\n\n****\nIt[.] been fun, but this is probably my last post on the topic. Feeding trolls is hard_work and I'm out of practice."}