{"doc_id": "1429", "name": "2014_05_humanities_student_major_1221_personalfinance", "namespace": "we1sv2.0", "metapath": "", "pub": "personalfinance", "title": "2014-05-humanities-student-major_1221_personalfinance.txt", "pub_date": "2014-05-18T00:00:00Z", "Sentiment": "0.208", "Subjectivity": "0.382", "Score": "17", "Upvotes": "17", "Downvotes": "0", "Wordcount": "806", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25wzyb", "Reddit_id": "chlkwnu", "Subreddit_id": "t5_2qstm", "Commenter": "GoodMorningRedditt", "length": "4291", "content_scrubbed": "Good for you for recognizing the problem and pulling out all the stops to better yourself and save your marriage.  Even if it can't be saved, you'll never regret these positive steps you are about to take! So, congratulations on the first step into your new life!\n\nOK, here[.] a few ideas off the top of my head. I hope something here sparks your interest or gets your creativity flowing:\n\n1) In some states you can become a teacher or a substitute under an emergency certification program. Think about becoming a music teacher at a public school.\n\n2) If you had a 4 year degree, more and better jobs would open up to you. Consider taking out loans or grants to finish school. You could get enough to pay your share of rent, etc, and try your damndest to finish in less than 2 years by taking summer courses, etc.  Not sure where in EU she[.] going, but there[.] some American universities there, and there[.] always online universities. Just make sure you major in something more employable than liberal_arts. You said you liked computer science... This route has potential for you to be the majority breadwinner in time, especially if she[.] planning working in academia.\n\n3) I think you'll regret taking so much out of your mutual fund. $6k won't be that much once you have a real job. In your shoes, I'd pull out all the stops to make some cash.\n\n4) Summer is about to start and lawns are growing like, well like weeds, haha. Can you borrow a mower for a weekend? Starting a few days before the weekend, Make some flyers advertising your new lawn mowing business with phone number. Make it clear you only take cash and you just mow, no weedwacking, etc. Or just knock on as many doors as you can and give them your phone. Take orders for the weekend so you make the most of your borrowed mower.  Then take the cash and buy a used mower on Craigslist. Next weekend take that cash and buy a used weedwacker. I found mine at a yard sale for $10. If you are getting full days work on the weekends, find a highschool kid who is responsible and will mow for $12/ hr. Then you can continue to drum up business while he mows.  Ask happy customers to be a reference on your flyer (\"My lawn looks great and John is friendly\" - T. H.)  I swear this works. I know people who do this!\n\n5) Knock on doors and offer to clean houses. I did this in college. Yes, people not only let me in their homes but sometimes would leave for work, leaving me alone!\n\n6) Also in college, I used to find a nice looking neighborhood where the builder put in metal handrails along front steps. I'd offer to scrape the rust off, add a layer of Rust protection, and then glossy black spray paint. Once you get one customer, you tell the next guy that he can check out your work at the house next door. Often people would see me working and I'd line up the next three jobs with no effort. I'd charge $100 cash and I could do two or three daily. Tax free. Startup cost is low: I'd buy a tarp and painter[.] tape, a good metal brush, a few cans of spray rust protection, and a few of glossy black, and sometimes a clear glossy top coat. Tell people you are paying your way through school and they'll feel like they are doing a good deed.\n\n7) While I painted fences, my boyfriend used to seal driveways. Same deal as #5 & #6.\n\n8) You will almost always get paid more for brainwork which is usually salaried with benefits than for body work which is usually hourly.\n\n9) Can you type moderately well? Do you know Word? Even better Excel? Apply through a temp agency to be an executive assistant. Once you have some references through good temporary work you can apply for full time positions. Its not hard, pays decently with benefits, and you spend your days in an air conditioned office. If you can't type, there[.] free sites that teach you. Most agencies give you a typing test and test you in Word Excel and Power Point, and if you ask nicely they'll probably let you take a tutorial to learn them. Sign on with as many agencies as you can. Don't get sexist on me, its a great gig for men and women. Plus it can open other doors if you are a good worker. Show up 10 minutes early for all interviews.\n\nImportant Point: Make sure you have her buy in with whatever your plan is! The plan should belong to both of you!\n\nGood luck!"}