{"doc_id": "1342", "name": "2014_05_humanities_student_major_562_law", "namespace": "we1sv2.0", "metapath": "", "pub": "law", "title": "2014-05-humanities-student-major_562_law.txt", "pub_date": "2014-05-07T00:00:00Z", "Sentiment": "0.115", "Subjectivity": "0.43", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "593", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_250eto", "Reddit_id": "chcjnm4", "Subreddit_id": "t5_2qh9k", "Commenter": "[deleted]", "length": "3303", "content_scrubbed": "Cal grad here. UCLA is a great school to be going to for the sort of substantive background that you're looking for in IP. \n\nI will say that you really don't need to be worrying about this kind of crap right now. Try to get internships with law offices so that you can have a sense of what it[.] like--not big law firms, but actually local practitioners who do IP licensing agreements and that sort of thing. \n\nAlso try to get internships in areas that are of substantive interest to you and try building networks with folks in the GC[.] office, express to your superiors that you're interested in the IP side and usually they'll be happy to set you up to talk with those folks so you can at least start developing a network/relationship, and then you never know--they can bring you on the following summer or whatever. I had a friend who was a tox major at Berkeley who interned with J&J in one of their labs. He did exactly this, went to a pretty good law school after crushing the LSAT, and is going to start practicing IP litigation after graduating this May.\n\nBottom line is that you don't really need to worry about \"legal\" internships. That[.] not what law schools care about. What they care about is 1) grades and 2) LSAT. To the extent that you can put together a great, tailored application about your interest in bioinformatics/MIMG and how it relates to the law, that[.] perfect for schools like Berkeley and Stanford, who both send a lot of folks into the IP market every year, and who definitely like to see students with a \"story\" to tell. But again, that[.] not the most important part--grades and LSAT, that[.] what counts. \n\nRather than focus intensely on trying to get experience in IP firms or IP jobs though, start with the basics. Go work in a lab, work for a company, work in research, etc. You might also try talking to professors at UCLA[.] law school who work in that space or have a similar background to you, and just sitting down for a conversation with them (10-15 minutes) about the state of the law in that field, get a sense of what hot button issues are. And of course, take the time as an undergraduate to not just focus on science courses, but to also hone your writing skills. Definitely helps coming into law school to have some substantive writing experience under your belt. If you have profs who are dual appointed in some humanities and science role (you'll find a lot of folks who are in the public policy field) you should talk to them.\n\nLastly, target \"clinical professors\" or \"lecturers\" at UCLA Law. Full-time faculty tend to have law students or fellows working under them to do their research for them, and also tend to publish on substantively different areas. Keep an eye out for research roles on UCLA[.] job boards for stuff that nabs your interest, and don't be afraid to just send your application to places that you seem underqualified for. Don't pigeonhole yourself into only IP in the private sector. UC has a GC who definitely handles tons of IP licensing on behalf of the school. UCLA med school also likely has a GC or AGC who handles just the legal goings-on for the hospital. That[.] another great place to look into. \n\nSorry this was so long and ramble-y, I'm procrastinating studying for my (law school) finals and roughly delirious as fuck :)"}