{"doc_id": "1334", "name": "2014_05_humanities_student_major_504_berkeley", "namespace": "we1sv2.0", "metapath": "", "pub": "berkeley", "title": "2014-05-humanities-student-major_504_berkeley.txt", "pub_date": "2014-05-06T00:00:00Z", "Sentiment": "0.167", "Subjectivity": "0.361", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "2427", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chbii15", "Reddit_id": "chbmywn", "Subreddit_id": "t5_2qh9w", "Commenter": "cs70student2014", "length": "13893", "content_scrubbed": "A student asked:\n\n \"Sahai has been accepted at the University_of_California, Berkeley, and has also applied to the California Institute of Technology, the Massachusetts Institute of Technology and Stanford University.\"\n\n http://articles. latimes. com/1990-03-20/local/me-599_1_state-academic-decathlon\n\n Why did you and your brother choose Berkeley instead of some other school? What about Berkeley stood out to you?\n\nSahai replied:\n\n Berkeley is the best, of course! Why else? Berkeley essentially has more top ranked departments than anywhere else in the world. That was true then as it is true now. Berkeley is the number one choice of winners of the National Science Foundation fellowship for graduate study. Despite being smaller than MIT as far as science and engineering go. This is true now, but I didn't think about this when I was in high school. I just knew that when it came to academic reputation, nobody really tops Berkeley. I had also heard the reputation of Berkeley as a place that didn't pull any punches or coddle students. It expects the best and doesn't care if people suffer. That no-compromise stance appealed to me as compared to places like Stanford. \n\n I also was drawn to Berkeley[.] comprehensive excellence. It isn't just the best in Engineering and Science, it is a powerhouse in the humanities, social_sciences, and the arts. In my mind then, that was one of the main negatives of MIT. CalTech was just too small for my taste. In hindsight, I think that I expected too much interaction across the humanities and engineering. So while I took a full year of Sanskrit at Berkeley and attended a few courses outside the Northeast Quadrant of campus, my connections to the rest of campus were mostly through attending the occasional seminar or evening talk. (MIT has those too and when I was there, I actually took Sanskrit literature courses at Harvard for a bit before deciding that I was too busy and riding the #1 bus a few times a week was too much commuting for me.) Stanford is also well rounded but I didn't perceive it as such when I was in high school. \n\n I had visited both Berkeley and Stanford in the summer --- and the intellectual vibe and intensity at Berkeley really hit me. The city around campus was also different for me --- having grown up in SoCal suburbia. \n\n Honestly, I don't think there was ever a day that I ever regretted going to Berkeley as an undergrad. I got the best possible education in every possible dimension. And looking back, it made sense. I was Berkeley[.] type. \n\n As a faculty member, I have come to increasingly feel that while Berkeley is spectacular for super strong students like I was (and most of my friends who were all in HKN, etc.), **lots of weaker students would be better off elsewhere at places that are generally more supportive.** Our EECS model (and 70 in particular) of high expectations tempered with high levels of support is a bit of the exception on this campus. And even our support presumes that students have ample capacity in reserve after doing very well at high school. (Again, like me. In high school, studying schoolwork more than an hour or so per day after school was rare. I studied other stuff for fun, hacked computer programs, did origami, etc.) **The student who was firing on all cylinders and only then able to hit high marks in high school --- the pain that awaits them here makes me shudder at times. It isn't the party line, but I have to say it out of compassion for students: I think that this university doesn't always support all the high-striving students that it admits. And that isn't fair. If we take someone on striving, we should have supportive paths for people who are striving. But we largely don't. So students make heroic efforts. And maybe that grows their character and makes them better people. But there is a pretty wide stream of tears that flows through Strawberry Creek into the Bay.**\n\nA student asked:\n\n \"The student who was firing on all cylinders and only then able to hit high marks in high school --- the pain that awaits them here makes me shudder at times. It isn't the party line, but I have to say it out of compassion for students: I think that this university doesn't always support all the high-striving students that it admits.\"\n\n +1. I studied my hardest in high school to get into Berkeley, which has been far harder than my high school. I try my hardest and frequently score below the average (sometimes a standard deviation below the average) on tests.\n\n I sometimes wonder whether it would have been better to study somewhere else. Less rigor and less pain, more support and hopefully better test scores.\n\n What would you recommend Berkeley do to support students in this situation?\n\nSahai replied:\n\n It is because of students like you that I wrote what I wrote. \n\n I think that for students in your shoes, the most basic thing that Berkeley can/should do is provide an on-ramp. A recognition that not everyone gets through material at the same pace and that some people just need more time to get up to speed. Firstly, the unit minimums are just insane. Why not let someone take 6-7 years through the system? If they aren't just taking lots of courses, then who are they hurting? It[.] not like they are taking seats away from someone else. This way, students can choose whether they want to take the slow and steady path where they could work hard to build themselves up. Yes, it[.] a few more years of your precious youth and $100K or more in lost income. But for some, the sacrifice is worth it. For others, not so much. Let people make that choice. Second, the campus should support the development of self-paced companions to core courses --- this way, there would be a more structured set of resources available for students who want to spend more time on a course. Third, students should be able to self-declare an incomplete in a course if they want to take it spread out over two semesters --- or a semester and a summer. Since this does take up extra seats, instructor permission should be required. But looking at the distributions in 70, we would be talking about at most 30% max of the students taking this option. This could be compensated for by giving such students lower priority in their choice of section times, etc. \n\n More controversially, I think that Berkeley should offer two options that are not offered now. (1) Slow-start admission --- where students are told that we would love to have them here, but only after they complete a couple of years of courses somewhere that can help bring them up to speed in an environment that is a better transition. This could be a CC or it could be another UC or a CSU or even a place like Harvey Mudd. As long as they meet the required grades at this less competitive place, we should tell them that they are in. We know how to deal with transfers, but some people should be pre-emptive transfers. This combined with the on-ramp ideas above should probably take care of many cases. The transition will be smoother for many if it is less abrupt. For many, it could simply be a matter of style. There are plenty of other ways to teach people the basics.\n\n (2) Berkeley should have a system that is the equivalent of the \"minor leagues\" in baseball. For many students, they don't know that they would've been better off elsewhere until they actually show up here and experience it. But by then, all their other offers have evaporated. They're stuck. And if they leave, there is no clear way back. I think that at the very least, the other UCs should participate. A lot of students who struggle here could be stars at Riverside, Merced, Davis or Santa Cruz. Confidence matters and if there was an easy path to another UC, a lot of people would/should take it. Then, after they have built up their basic skills and rebuilt their confidence, let them have an honest shot at transferring back if they want it and feel they would benefit. Let them visit for a semester. Try it out again. Then (if they do well), let them decide if they would rather complete their degree here or back where they were sent.\n\n Basically, the system needs to be built to help people succeed rather than just giving them a shot. \n\n What I would actively oppose is simply reducing the intensity of the Berkeley education in an effort to be more inclusive or supportive. The world needs many different kinds of places just like it needs many different kinds of people. Harvey Mudd exists. They have a kinder gentler approach to CS. That is good for many. Kudos to Harvey Mudd for supporting that. But I think that Berkeley[.] style of uncompromisingly intense education is also something that is important to have in the world. What does \"access\" even mean if you take away the very thing that people want to access?\n\nA student asked:\n\n \"I think that at the very least, the other UCs should participate. A lot of students who struggle here could be stars at Riverside, Merced, Davis or Santa Cruz.\"\n\n Wouldn't this be offensive to those other UCs though? It[.] like saying if you can't make it at MIT, you should go to Berkeley. Those other UCs would become the \"backup schools\" and serve like CCs that you try to transfer out of rather than institutions where you get your full undergraduate learning.\n\nSahai replied:\n\n If someone can't make it at MIT, they'd get wiped out here. MIT is better at supporting weaker students. For many students who are struggling here, they would be better served at MIT. For others, even MIT[.] support model can't help them. Many of those would be better served at Stanford which has yet a different model. Harvey Mudd is another place that is very good about supporting students who would struggle here.\n\n What I am saying is that there are different styles of teaching that work well for different students. Intensity is only one dimension. We believe it is very important for making the \"special ops ninjas\" that we like to train. But not everyone wants to be a \"special ops ninja.\" When they were choosing Berkeley, they had no idea what that even meant. Many people had very little idea what they were getting into. (Not everyone has PhD parents and family friends who know what different schools are really like.) There are even people out there who (shudder) actually believe that the US News and World Report rankings for undergrad places overall mean something. (They don't realize that most of the faculty members in the most of those places would rather be at Berkeley than where they are.) What matters is how well students do in terms of getting something out of the courses and how well they contribute to the campus community. \n\n If someone is mismatched at Berkeley and finds a better learning environment at Riverside, that shouldn't be bad for either Berkeley, the student, or Riverside. Nobody should accept slackers. I am talking about the hard-working students who just find themselves mismatched. Helping students is more important.\n\nA student wrote:\n\n I keep hearing that Berkeley doesn't support students, but professors and TAs have weekly office hours and student groups like HKN have tutoring sessions. There doesn't seem to be a lack of support here. You and a lot of other people say MIT, Stanford, Harvey Mudd, and other UCs provide more support than Berkeley.\n\n What kind of services/support do they provide that Berkeley doesn't provide?\n\nSahai replied:\n\n We in EECS support students pretty well. It is not clear other departments here do as much as we do. But as I said before, all of our support is predicated on students being able to put in the time. We currently have no real mechanisms to support students who are simply hitting their maximum waking hours limit. At most of our competitors (MIT is a possible exception for certain courses where they are pretty much like us), there is simply less stuff in the courses at less depth. So there is more headroom in which support can be activated. That is the main advantage that other UCs can provide. A pace that is more manageable for many people.\n\n I love Berkeley. But it isn't for everyone.\n\nA student wrote:\n\n Oh, so you're saying that Berkeley covers material at much more depth and at a faster pace while other universities don't? Is there any hard evidence or studies for this, or is it just anecdotal? It[.] difficult to believe that MIT, CIT, or CMU (for example) aren't as challenging (or more challenging) than Berkeley.\n\n Is it also because Berkeley is on the semester system so covers more material and most of the UCs aren't? Would changing to a quarterly system make the pace more manageable for more people?\n\n \"there is simply less stuff in the courses at less depth. So there is more headroom in which support can be activated.\"\n\n What kind of support do they activate that we at Berkeley can't activate because of more depth? Andrew of 61A and Mona of 61B do Guerilla sections. Is that the kind of support they activate—more help from the TAs at a more individualized level?\n\nSahai replied:\n\n I know only from courses that I have taught personally as well as from courses that I saw when I was an undergrad vs when I was a graduate student, and conversations with my colleagues at other schools. MIT, CMU, and CalTech are pretty close to us in general. But for example, compare the old 126 (before 70 became a required prereq) to MIT[.] 6. 041. There was a pretty big difference in depth. (And there had to be --- 6. 041 serves more majors than just EECS.) New 126 has 70 required so the comparison isn't even fair anymore.\n\n But in general, the following is a representative comment from faculty elsewhere (not MIT/CalTech/CMU): \"I wish we could teach that here, but we don't have Berkeley students. Our kids won't put up with that sort of intensity.\" as well as \"I don't have the TAs that could pull that off.\"  \n\n Like I said in the first lecture, I like Berkeley students. :-)"}