{"doc_id": "1338", "name": "2014_05_humanities_student_major_527_mensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "MensRights", "title": "2014-05-humanities-student-major_527_MensRights.txt", "pub_date": "2014-05-07T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.373", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "291", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24zapx", "Reddit_id": "chc74ff", "Subreddit_id": "t5_2qhk3", "Commenter": "lazlounderhill", "length": "1605", "content_scrubbed": "Here[.] one reason why, based on my own personal experience.  A few years after I got my BA, I decided to look into possibly returning to get a degree in primary school education, after hearing about the shortfall in male primary school teachers.  I went back to my alma mater (a small, but highly regarded liberal_arts college - which shall remain nameless) and I set up an appointment with the head of that department (primary school education).  She all but stonewalled me - I mean she actually seemed embarrassed that I was there.  I was dumbfounded.  \n\nShe just directed me to the secondary school department head, with the added caveat that I might have more luck at another fucking school!  I remember saying, \"but I was under the (naive) impression that schools were looking for more male primary school teachers, that there was a shortfall, a demand\".  I'll never forget the look on her face when I said that.   There was this huge elephant in the room, and I had no idea at the time what it was, but it was palpable.  I left completely confused and discouraged (I did very well at that college) but I just ditched the whole idea.  It took me years to figure out what the hell that was all about.  It[.] a damn shame, because I think would have made one hell of a good elementary school teacher.\n\nI was raised in a single parent home (one among many at that school who had limited or no contact with his/her father) - I was fortunate enough to have 2 male elementary school teachers growing up, and I think every student in that school benefited from having a positive male influence to look up to."}