{"doc_id": "1307", "name": "2014_05_humanities_student_major_158_science", "namespace": "we1sv2.0", "metapath": "", "pub": "science", "title": "2014-05-humanities-student-major_158_science.txt", "pub_date": "2014-05-03T00:00:00Z", "Sentiment": "0.089", "Subjectivity": "0.261", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "671", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_ch8hssh", "Reddit_id": "ch8qqk2", "Subreddit_id": "t5_mouw", "Commenter": "ParanthropusBoisei", "length": "3985", "content_scrubbed": " In scientific texts gender and sex are separate words that do not mean the same thing.\n\nThat is quite a broad brush you're painting. In different scientific fields different texts will define gender in different ways. I know this partly because I've had to read many texts that will acknowledge other definitions of the term before explaining precisely which definition will become the working definition of the term for the rest of the text.\n\n As for you sourcing Wikipedia, it[.] not a valid source of anything, anyone can edit the source material.\n\n Articles on Wikipedia can be changed at any time by anyone who feels the need that the information isn't meeting their set of standards.\n\nAs I tried to explain before, this is a strength, not a weakness when it comes to gauging the existence of multiple definitions of a word. If someone comes to the page expecting their definition to be represented there, and since anyone can edit the source material, those people will edit the page to *include* their definition if it[.] not there. If they happen to choose to remove other definitions as well then the other people who are expecting that definition will edit the page again to include their definition alongside the other definitions. Either through peaceful agreement or compromise or \"edit wars\" between passionate editors, you will inevitably end up with a page that represents the definitions of everyone involved.\n\n If you would have sourced Wikipedia in a works cited paper in any of my medical school classes you'd be laughed out and never be able to return.\n\nAgain, definitions are not like scientific facts that are discovered. Definitions (in English) exist for no other reason than because people agree to them, and there is no better demonstration of this than a single webpage that is accessed by millions of people who want or need their own definition to be represented there. Wikipedia should be the most compelling source to you about definitions (even more than dictionaries) because it is a source of sources that has emerged through a consensus of different editors. What would you have had me done otherwise, cite a source from a single person who may or may not be biased? If I cited a source that an alternative definition of the word \"tomato\" were what is normally called a potato, would that make it an accurate definition? No, because nobody expects anyone else to call a potato a \"tomato\". That[.] why I didn't cite a source that proves my point about the definition, because you could just deny it and say it[.] biased. Instead I cited a source of sources that could only represent either everyone[.] biases or none because it[.] edited by so many people, and yet it still seems like you're in denial. In that case I'll just cite one \"definitive source\" you're looking for and quote it to highlight the varying definitions of gender.\n\n[The inexorable rise of gender and the decline of sex: social change in academic titles, 1945-2001.](http://www. ncbi. nlm. nih. gov/pubmed/15146141)\n\n More than 30 million titles of \"academic\" articles, from the years 1945-2001, were surveyed for occurrences of the words sex and gender. At the beginning of this period, uses of gender were much rarer than uses of sex, and often used in the sense of a grammatical category. By the end of this period, uses of gender outnumbered uses of sex in the social_sciences, arts, and humanities. Within the natural sciences, there was now more than 1 use of gender for every 2 uses of sex. The beginnings of this change in usage can be traced to Money[.] introduction of the concept of \"gender role\" in 1955 (J. Money, 1955). However, the major expansion in the use of gender followed its adoption by feminists to distinguish the social and cultural aspects of differences between men and women (gender) from biological differences (sex). **Since then, the use of gender has tended to expand to encompass the biological, and a sex/gender distinction is now only fitfully observed.**"}