{"doc_id": "1356", "name": "2014_05_humanities_student_major_694_iama", "namespace": "we1sv2.0", "metapath": "", "pub": "IAmA", "title": "2014-05-humanities-student-major_694_IAmA.txt", "pub_date": "2014-05-10T00:00:00Z", "Sentiment": "0.067", "Subjectivity": "0.356", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "332", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chem8he", "Reddit_id": "cheowt3", "Subreddit_id": "t5_2qzb6", "Commenter": "Jrodicon", "length": "1799", "content_scrubbed": "I'm a physics major about to finish my sophomore year. I'm only halfway through my undergraduate degree but here is the advice I can give:\n\nPhysics is hard, and if you don't enjoy doing math and working on difficult problem sets for hours at a time, you will likely have a tough time in an undergrad physics program. If you do make it through with a BS in physics you have 3 options. \n\n1 option is try your luck in the job market. You will be more employable than someone with a liberal_arts degree, but less employable than someone with an applied science degree like engineering (however you can apply to a much wider range of jobs than an engineer). programming experience increases employability significantly so I recommend either a CS minor or at least a few CS classes.\n\nOption 2 is go to grad school in something else technical. I've seen people chose physics for their undergrad because they know they want a technical degree, but are still unsure of the direction they want to take. BS in Physics is a good broad degree which covers many subjects and forces you to be good at math so it allows you to keep a lot of options open\n\nthe last option is to go into physics professionally as a researcher either at a university or a laboratory like the LHC, and/or become a professor. This will likely require a PhD in physics. I've heard good and bad things about this path so proceed with caution. You really need to have a deep interest and love for physics to make it through the trials of a PhD but for those who are motivated, it can be very rewarding. \n\nI can't really say more than this since I haven't even finished my BS but I figured I would tell you what I have learned in the last 2 years from grad students, professors, and the internet about pursuing physics at a university level."}