{"doc_id": "1439", "name": "2014_05_humanities_student_major_1293_askanamerican", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAnAmerican", "title": "2014-05-humanities-student-major_1293_AskAnAmerican.txt", "pub_date": "2014-05-20T00:00:00Z", "Sentiment": "0.1", "Subjectivity": "0.369", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "678", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_260uvj", "Reddit_id": "chmp4c2", "Subreddit_id": "t5_2uah7", "Commenter": "cdragon1983", "length": "4439", "content_scrubbed": "After high school, students who want additional formal education have several options:\n\n* vocational/technical school (e. g. the [Newport News Shipbuilding Apprentice School](http://www. as. edu/)). These typically offer trade skills or other specific training for a career. Often they may offer an associate[.] degree. This is still similar to the traditional sense of going off to be a tradesman[.] apprentice, but perhaps with a bit more breadth and classroom instruction mixed in with the practical experience\n* community college (aka junior college). These typically offer a mix of terminal academic programs (e. g. medical technician, assistantships, etc.), life skills programs (continuing education in technology, language, home economics, and academic subjects), and pre-university track academic programs. The pre-university studies have become an attractive option for students who aren't adequately prepared for university or who can't afford to attend university full time, but who want to continue their education with hopes of attending university soon.\n* university (aka college, unlike in most of the rest of the world). These typically offer a wide array of programs leading towards a bachelor[.] degree.\n\nAt university, most schools have general education requirements that inject an element of breadth into the program. So unlike some places where a computer science student will nearly exclusively take math and science courses, at most American universities CS students will also have to take at least one or two courses in each of a range of fields like history, literature, philosophy, lab sciences, economics, arts, etc.\n\nAs far as why people would bother for more generalized or esoteric undergraduate degrees (e. g. literature versus journalism, or physics versus engineering or business versus accounting or philosophy versus ... anything), the general idea is that university is a time when you learn how to think. And broad liberal_arts are considered valuable in that they expose a student to a variety of different fields (many of which are things that adults should know at least something about, however shallow) while at the same time developing critical skills such as diverse ways of thinking about problems, public speaking, and several different facets of writing. These general skills are thought to be applicable to most fields.\n\nAnd thus it is possible for someone with a BA in English to go to law school, or graduate school in English or a related field, or become a professional in writing-heavy fields like marketing, communications, journalism, etc. Further, because the student with a BA in English also has some interaction with various other disciplines, it[.] totally possible to end up choosing a job unrelated to one[.] degree. (By way of example, tech companies love hiring humanities grads who took enough CS courses to get sufficient skills, because their humanities courses likely made them better writers than most engineers, and give a different outlook than the majority of the math/CS/engineering-prepared employees. Similarly, medical schools admit a high percentage of those who apply with philosophy, math, CS, and other non-lab-science degrees -- the rationale is that all students must have the required lab-science preparation, but beyond the absolute requirements, breadth and diversity are considered valuable.)\n\nFinally, as far as \"why would anyone do the more general first\", one must also remember that this is a carry-over from the US secondary education system. Most US high schools offer a broad pre-university curriculum (math, science, social_studies, English, foreign language, and an elective like art or music or psychology) for all students up through high school graduation. This is quite different from many other countries, where as early as age 10 or so students track into \"pre-business/pre-engineering/pre-science/pre-vocational\" and never really get off those tracks -- these students by the time they reach university, then, will already know what they're doing, rather than just starting to decide what they're interested in studying. Further, they will likely be better prepared to do university level work straight away in their discipline (with 3-10 years already concentrating on it) than will American students (who may never have taken a single course in their chosen major before coming to university).\n\nFeel free to follow up with any other questions!"}