{"doc_id": "1475", "name": "2014_05_humanities_student_major_1648_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2014-05-humanities-student-major_1648_college.txt", "pub_date": "2014-05-26T00:00:00Z", "Sentiment": "0.226", "Subjectivity": "0.501", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "462", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chrnm1u", "Reddit_id": "chroc4t", "Subreddit_id": "t5_2qh3z", "Commenter": "ComradeBrosefStalin", "length": "2653", "content_scrubbed": "In practice that is not true for better paying jobs in business out of college. For \"average\" paying jobs, then yes where you went to college doesn't really matter.\n\nFor all the \"best\" jobs in business (that pay close to 6 figure salaries w/ bonuses straight out of undergrad), like investment banking at a bulge bracket bank like Goldman Sachs or Morgan Stanley, an elite boutique bank like Lazard or Moelis, or consulting at Mckinsey, Bain, or BCG, these companies will recruit pretty much exclusively at the Ivies, Stanford, MIT, Chicago, Duke, Northwestern, etc (they also recruit at other schools as well like Michigan Ross, NYU Stern, Berekely Haas, etc.). Getting a job at one of these companies from a college where they don't recruit at is nigh on impossible without some REALLY good connections. In fact, most of the colleges that I listed above don't even offer undergraduate business schools, and English and history_major at those schools will get routinely picked over finance majors from less prestigious schools.\n\nI think that one of the main reasons for this is that for things like finance or consulting, what you actually learn in college really isn't that important. Unlike say a STEM field where if you want to be a biology professor or an engineer you absolutely need a degree in that relevant field, if you go to a top investment bank and look at the undergrad majors of the new analysts there, liberal_arts majors like history, English, etc. will not be a particularly rare sight. What[.] more important for business related fields is you need to be \"smart.\" You need to be analytical, intelligent, good at solving problems, etc. It[.] sort of like chess, you can teach a four year old how to play chess, but someone in Mensa is probably going to be a better chess player than a four year old. The top companies only recruit at the top schools because they know that the average student at one of these top schools is \"smart\" (3. 8 GPA, 2200+ SATs, amazing extracurriculars, etc.) That[.] not to say that all of the students at say UVM are \"dumb\", there are probably students at every university in the US that would have no issue fitting in at Harvard.  However for in the eyes of an employer, a Harvard alum is a much safer bet since they've already proven themselves by getting into Harvard, so top companies usually take the \"safer\" route by focusing their energies on hiring the students at these universities.\n\nAnother reason is that these companies are already filled with alums from the top schools, so its easier for students at the top schools to network, as well as a hiring bias towards people from their own alma mater."}