{"doc_id": "1492", "name": "2014_05_humanities_student_major_1859_gamingsuggestions", "namespace": "we1sv2.0", "metapath": "", "pub": "gamingsuggestions", "title": "2014-05-humanities-student-major_1859_gamingsuggestions.txt", "pub_date": "2014-05-29T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.391", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1070", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26qppl", "Reddit_id": "chu4yj6", "Subreddit_id": "t5_2sxyv", "Commenter": "AfterShave92", "length": "6453", "content_scrubbed": "Here[.] a short list of games that I think are pretty different. The info will be pretty brief though. How experimental or different they are is of course up to you. But I think they're interesting and different enough.\n\n[The Last Federation](http://store. steampowered. com/app/273070/): It[.] an empire building game with a twist. You have one super advanced ship and you have to influence the species to accept a federation. You're a major player behind the scenes. Assist the planets you like and ruin those you don't like. You require allies to work through to get results. The weakest part is the combat which interestingly is a turn based SHMUP mode.\n\nIt has a straighforward objective. But how you get there is very open and it will play out at least slightly different each time no matter how much you try to make it the same.\n\nThe other games by Arcen are also usually ambitious and slightly weird. But this is one of the more open ones.\n\nI'll second [Antichamber](http://store. steampowered. com/app/219890/) even though you already said you looked at it. It[.] a great mindbender worth recommending twice.\n\n[E. Y. E Divine Cybermancy](http://store. steampowered. com/app/91700/). It[.] a sci-fi/fantasy FPS with RPG stuff in it like stats. While it has clear objectives and levels it also tries to do a lot of things. Guns, magic, hacking, cybertech/implants and more which makes it feel pretty experimental. The game has branching paths and the story is pretty confusing but might make more sense as you get through the NG+ in different branches.\n\nI love it because of all the stuff it tries to do. Some things are OP like nothing else, some barely work at all but that[.] ok to me because how interesting it is. Jumping several stories high, running at super speeds, while cloaked, while hacking an enemy to somehow steal his energy through cyberspace to keep running and cloaking is pretty cool.\n\n[AaAaAA!!! - A Reckless Disregard for Gravity](http://store. steampowered. com/app/15520/): It[.] a game about base jumping. You kiss and hug buildings, thumbs up the fans and flip off the haters, tag buildings, aim for bonuses and earn teeth to buy new levels. Features a great soundtrack and all that wonderfully weird stuff I mentioned earlier along with some seriously odd \"levels\" you just have to see for yourself.\n\nFun fastpaced highscore game basically.\n\n[Surgeon Simulator 2013](http://store. steampowered. com/app/233720/): You've probably heard about this one but if you haven't. It[.] a game about performing \"surgery\" using incredibly weird controls. That[.] all there is to it really, fumble around and kill your patients while enjoying all the physicsy fun of dropping your instruments all over.\n\n[Rock of Ages](http://store. steampowered. com/app/22230/): Be a god or something and fight other gods and heroes through the ages. By rolling rocks to break down their wall and placing obstacles to save your own wall.\n\nFeatures Monthy Pythonesque animations for cutscenes and weird gameplay. As you roll your rock past towers, turrets, elephants and weirder things trying to knock you off the track. Has multiplayer so you can challenge your friends to rock rolling competitions. Wonderfully weird but the game never truly captured me even though I enjoy it.\n\n[Psychonauts](http://store. steampowered. com/app/3830/): An older 3D platformer about a young boy who goes to a camp for psychics. Weird characters, levels, story and everything. This game is an absolute trip with the artstyle and themes of the mind it presents. Features levels set in the minds of mad characters with a world that fits the theme, like paranoia for instance. The setting is more interesting than the gameplay in my opinion but it[.] worth playing for even only that.\n\n[The Void](http://store. steampowered. com/app/37000/): You're a spirit who ended up in The Void. A bleak place inhabited by naked women and gruesomely imaginative antagonists. The game is centered around color. It[.] your health, it[.] your money, it[.] your weapon, shield and tool. You grow it, gather it, conserve it all while having enough to fight and advance the story. The game uses a mouse gesture system for using color and doing spells. Doing the gestures wrong can cost a lot of color. If you mess up your first harvest of the game I strongly recommend you redo the tutorial until you get it right to not lose too much time.\n\nThis game is hard. You'll get stuck with too little color and have to reload an earlier save. You can realize a few cycles (basically days) later that your poor harvest of color screwed you over and have to redo potentially hours of play. But it[.] very interesting and beautiful. I've never finished it myself, I got stuck too many times and gave up. But I loved it while it lasted and I definitely got my money[.] worth.\n\n!!! NOTE !!!! This game has an issue where it requires the proper PhysX driver. This driver comes with the game if you buy it from Steam and is in one of the folders. You have to uninstall your current physx driver and replace it with the old one to get it to not start as a black screen and crash. !!! NOTE !!!\n\n[Papers Please](http://store. steampowered. com/app/239030/): You're a border control man. You look at people[.] papers and make sure they are in order. That[.] it, you look through more and more documents as time goes on and see if the information is consistent on all of them and with what they say and how they look. There[.] an interesting story going as well. Highly recommended, features several endings good and bad.\n\n[SpaceEngine](http://en. spaceengine. org/) isn't really a game though it kinda wants to become on later on. Fly around in the universe and marvel at how immensely FUCKING HUGE it is. Go to planets and watch the terrain, go to their moons, their stars and everything. You can control time however you want so you can sometimes find great alignments of the planets, eclipses and loads of cool stuff. It takes a lot of computer to run and like to crash often. Play it for the screenshot opportunities.\n\nMost games from game jams end up being experimental. [Ludum Dare](http://www. ludumdare. com/compo/) for example ends up with tons of games centered around a specific theme. There have been 29 of them so there[.] plenty of games to look through. Since it[.] timed many are unfinished or low quality, but that[.] something of the magic about it. \n\nI'd love to add more, but I did say it'd be a short list. There you go though."}