{"doc_id": "1434", "name": "2014_05_humanities_student_major_1263_askfeminists", "namespace": "we1sv2.0", "metapath": "", "pub": "AskFeminists", "title": "2014-05-humanities-student-major_1263_AskFeminists.txt", "pub_date": "2014-05-19T00:00:00Z", "Sentiment": "0.091", "Subjectivity": "0.274", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "447", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25xoa4", "Reddit_id": "chm9nm5", "Subreddit_id": "t5_2sode", "Commenter": "EnergyCritic", "length": "2680", "content_scrubbed": "Taking a global, macroeconomic and historical perspective on society; women have always been cared for more than men.\n\nNot at all.\n\nCrying baby girls are attended to faster than baby boys, homeless women are cared for better, women (and children) are always the first to be rescued, wars are almost entirely fought by men, men take the vast majority of dangerous jobs, etc, etc.\n\nEven if this was quantified, throughout all of human civilization, men were allowed to have possession over their lot. Women were practically never allowed to be independent until modern history. Even now, oppression of this sort remains.\n\nHow is it truly better to be treated as an object and possession than to be able to earn and practice your autonomy as an individual? \n\nWhat benefit is there in all your accomplishments in science, mathematics, art, literature, and politics being systematically forgotten and punished in favor of remembering men[.] accomplishments just because *women are supposed to be possessions of men and encouraging them to be independent is unfitting*.\n\nIn what world is it a privilege to have to author books with a man[.] name in order for people to read it?\n\nWhen is it better to be burned at the stake for pursuing your sexual interests while men that did the same thing were slapped on the wrist?\n\nA longer life, better health, and more \"care\" for you sounds great, but if you only get it if you're kept locked in a cage of oppression, it[.] not worth it.\n\n The majority of students in technical/scientific courses are men, whilst the majority of those in social_sciences/liberal_arts are women. Why? Because science degrees lead more directly to a career, and that[.] more of a priority for men than it is for women.\n\nBecause patriarchal values put pressure on women to go into particular fields and men to go into others, and the collectively observed results of this sorting reinforce patriarchal values. It doesn't mean that women are getting treated better than men, but instead demonstrates how patriarchy is bad for *men and women* both because it restricts autonomy.\n\nThey use the concept of 'privilege' to underpin everything in gender discussion, when really privilege is just one outcome how our society treats the genders.\n\nPrivilege is a core concept of feminism. Why are you surprised that it keeps being brought up?\n\nbut we are simply more disposable.\n\nNo. Women are disposable, too. Perhaps women are less likely to be in dangerous situations, but women are incessantly objectified, treated and pawned off like possessions, and stripped of their ability to make decisions for themselves in order to support and maintain the privilege of men over women."}