{"doc_id": "1499", "name": "2014_05_humanities_student_major_1927_iwantout", "namespace": "we1sv2.0", "metapath": "", "pub": "IWantOut", "title": "2014-05-humanities-student-major_1927_IWantOut.txt", "pub_date": "2014-05-30T00:00:00Z", "Sentiment": "0.105", "Subjectivity": "0.285", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "276", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chuvm9n", "Reddit_id": "chuwqrm", "Subreddit_id": "t5_2r5hw", "Commenter": "zero-1", "length": "1563", "content_scrubbed": "I work at a community college in admissions state side and here is what I would suggest she does if she[.] sincerely interested in this. \n\nLet[.] say she goes with the liberal_arts degree overseas, then she still wants to get into social work state side after she graduates. The next step after she gets her B. A. Degree from a foreign university would be to get her masters degree state side. I think most states require a M_A For this type of work.\n\nBest thing to do right now is call a few program advisors and admissions advisors at large state colleges that offer what she plans to take for her Masters. Tell them her plans and ask about how her foreign undergraduate degree will transfer into their program. \n\nPro tip, keep every single syllabi for every single class she takes, if there is any question about what transfers into what, they will only be able to award credit based on what the syllabus claims the class covered. This shouldn't be needed if she graduates, but if she transfers state side before she completes her undergraduate degree it will be vital.\n\nAnother advantage of her going this route, she will have low debt but like most full time students she won't have significant income either. By the time she begins her Master[.] program her financial aid package will be based off HER income, not yours. This is true state side too, except she would likely have significant debt before her M_A Program begins.\n\nSorry if I rambled too much, but the key right now, talk to advisors both program specific and admissions for the masters degree.\n\n"}