{"doc_id": "1500", "name": "2014_05_humanities_student_major_1931_contemporaryart", "namespace": "we1sv2.0", "metapath": "", "pub": "ContemporaryArt", "title": "2014-05-humanities-student-major_1931_ContemporaryArt.txt", "pub_date": "2014-05-30T00:00:00Z", "Sentiment": "0.128", "Subjectivity": "0.419", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "752", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26vqq2", "Reddit_id": "chuyui9", "Subreddit_id": "t5_2s6lg", "Commenter": "downbyflow", "length": "4248", "content_scrubbed": "Not from the US, but I considered studying there when going for a MA (I'm European as well) so I thought I might pitch in about my experience. What I am about to say is general advice for when applying to a MA/MFA program. I looked into SVA, Hunter, Yale, SAIC (Chicago) and CalArts, more or less in that order. There[.] also RIISD, Cornell, Columbia, and a bunch of others. Ended up not going because tuition costs and offers from London universities. \n\nYale is a very good school -some very big people came out of there and it is associated with a lot of very important publications as well-  but in the arts things do work a bit differently (for instance, Oxford[.] art school isn't that stellar when compared to other specialised art schools). \n\nYou want to find a school that is a fit for your practice, not necessarily the best-ranked one or \"the best\". You need to look into the programs, see who you'd like to work with, what school produces the sort of work you like, does research on themes that interest you, etc. Who is tutoring you is a major factor on whether your MA experience goes smoothly or not. I've seen people get rejected from certain programs because the university didn't feel that their program was a match for the candidate (and they ended up going somewhere else). The 'fit' is very important when it comes to art school, as the majority of big institutions have a large pool of high quality candidates to choose from. Also, whereas you can argue that coming from a big school is an advantage in terms of exposure, graduating from Yale/CalArts/RCA/Slade is not a guarantee of instant success. Many, many people go to a certain school in hopes that it'll make things easier but you'll realise that there[.] a lot of competition out there and that there also excellent artists coming from smaller schools.\n\nRegarding the rest of your question: I've met plenty of people coming from economics/finance/management backgrounds, some more successful than others. It seems to be a common occurrence these days, so you're not alone. However, I do have to say that from my experience I did notice that most of the people who got accepted into MA programs that didn't come from a BA in a creative field (fine arts, design, illustration...) or art related (history of art) had some limitations in terms of thinking about art (namely when writing about art or in terms of visual culture) and were sometimes doing the sort of experiments that in a way they should've done during their BAs. It[.] not that their work was bad, it was just that it needed more time to 'grow' before starting an MA, and thus they struggled a bit. There are obviously exceptions, of course, and I'm not saying this because of your work in particular.  So if you do get a place, start doing your homework, get up to date in terms of theory and what is going on currently in the art world and who are the artists that you think might help you situate your practice in contemporary terms. Studio-based MAs are still about learning, experimentation and about producing a solid body of work which is supported by theory.  \n\nArt education can be pretty great and if studying art is your dream, by all means, go through with it. There are self-taught artists that made it but I find that education is very helpful for most people. I wonder, however, if you should consider also going into a BA program instead, especially if you want to experiment with different media. This doesn't mean, obviously, that you can't go straight to a MA, but remember that the MA is a terminal degree unless you want to go into research, and you're still pretty young. Do remember, also,  that money in the arts is mostly very scarce at the moment, and that getting paid jobs (even internships) in the field is extremely competitive as well. Consider finding ways of using your management education in some way that will allow you to make money WHILE studying or practising as an artist at the same time, because having no money is.. pretty bad and the amount of money you actually need to spend to produce work to exhibition standards is very hard to come up with if you're on a minimum wage job. For some people, this is a deal breaker, especially as they become older.     "}