{"doc_id": "1336", "name": "2014_05_humanities_student_major_516_bayarea", "namespace": "we1sv2.0", "metapath": "", "pub": "bayarea", "title": "2014-05-humanities-student-major_516_bayarea.txt", "pub_date": "2014-05-07T00:00:00Z", "Sentiment": "-0.003", "Subjectivity": "0.311", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "417", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chbu7bq", "Reddit_id": "chby756", "Subreddit_id": "t5_2qjyy", "Commenter": "YoohooCthulhu", "length": "2495", "content_scrubbed": "Well, I have to admit, I don't really have a dog in this fight, because I'm in a category of extremely high-skill/education workers that makes a midrange salary.  So my comments often piss people on both sides off, but it[.] because I can really see both sides of the issue.\n\nAs a grad student (not too long ago), though, I did survive reasonably well in San Francisco on substantially less than $30k/year.  I spent money on some things and not others, and of course I have no dependents, so that helped a lot.  But it[.] completely doable without living in an SRO or making extreme sacrifices.\n\nBut I also see the other side of an issue; working in a similarly high-skilled field to tech/software that is also SF-centric (biotech) and *hasn't* recovered/grown in the same way--I regularly see the way in which explosive growth in tech salaries has bid up rents and made things a lot more unaffordable for me.  \n\nUnlike the people in lower wage less specialized professions, moving away isn't as much of an option, because all the jobs are here.  And contrary to the frequent tech refrain of \"go to school! get educated! learn skills!\"--that also isn't the solution, because I've already got education and skills up the wazoo.  \n\nIn my case, I only hope that a few more years of this and Baumol[.] cost disease bids up salaries in my profession a bit.  But the anger is also completely *understandable*.  In the meantime it[.] tough, and I can't blame people for feeling frustrated by the very *unequal* growth in job opportunities and salaries with the tech industry in the bay area.  \n\nYeah, the anger is completely misguided--other people doing well is neutral to mildly beneficial to your salary in the long run.  But tech employers have been extraordinarily generous in the way employers in other sectors are not being right now, and in the short term there are clear negative aspects due to disposable income competition.\n\n**edit: the anger is more than *wrong* it[.] what genuine pinko leftists (who were right about more things than people like to admit) used to call \"false consciousness\".  Namely, that workers fail to identify with people like software engineers or research scientists--who are ALSO their industry[.] version of \"labor\" and subject to a lot of the same economic pinching and douchebaggery from management (and vice versa).  And as far as culture goes, it[.] also bullshit--there[.] huge overlap between highly/skilled/educated people and the arts and activist communities. **"}