{"doc_id": "1393", "name": "2014_05_humanities_student_major_943_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2014-05-humanities-student-major_943_Economics.txt", "pub_date": "2014-05-13T00:00:00Z", "Sentiment": "0.047", "Subjectivity": "0.309", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "528", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25i54j", "Reddit_id": "chhfg4d", "Subreddit_id": "t5_2qh1s", "Commenter": "laboringjoe", "length": "3481", "content_scrubbed": "I don't think this guy knows much about current undergrad programs. \n\nThere[.] very little math involved in economics courses. There are equations here and there, a little bit of derivation and integration, but they're meant to represent the logic behind the economic theory. Not sure how big of a change it is at the graduate level but I'd assume it[.] similar for them with the exception of econometric courses. \n\nI'm not sure he understands what economic history studies. It doesn't provide \"knowledge of the actual workings of the economy\", whatever he means by that. Economic historians go over the general question of how economies have gotten to the point they're at now. So in the US, technological advancement has played a prominent role in our growth. But economic historians might not care so much about the ins-and-outs of the R&D that go into those advancements and instead focus on the driving forces behind the diffusion of innovation. \n\nNot sure what he means by economic organization either. I'm going to assume he means Industrial Organization. That goes over case studies of markets and market players and doesn't give \"knowledge of the actual workings of the economy.\"\n\nIn the open letter, the students argue that an economics degree \"should include interdisciplinary approaches and allow students to engage with other social_sciences and the humanities\"\n\nThere are economic subfields that are interdisciplinary approaches. Economic History and Demography are two examples. They combine sociology, anthropology, biology, etc. No administrator is holding a gun telling students they cannot explore other social_sciences. If you think sociologists can explain prices better than economists, take a sociology course that goes over social value theory. \n\nThe letter calls for students to be exposed to \"a variety of theoretical perspectives, from the commonly taught neoclassically-based approaches to the largely excluded classical, post-Keynesian, institutional, ecological, feminist, Marxist and Austrian traditions—among others. Most economics students graduate without ever encountering such diverse perspectives in the classroom.\"\n\nNow that[.] just bullshit. Mainstream economics, which is what the majority of universities teach, is composed various schools of thought. Advanced courses will even go over why other theories were left in favor for the ones they believe to be true. There are some colleges that teach Austrian economics. But most economists are empirical researchers because they would like to have credence to their claims. So you're probably never going to see widespread Austrian econ classes. \n\nNobody should be allowed to graduate in economics without at least a rudimentary knowledge of statistics. Exposure to theories of finance, such as the capital asset pricing model, explains a good deal about Wall Street and the business world that would otherwise remain mysterious. But economics should surely aspire to more than providing foot soldiers for the financial industry and Big Data companies.\n\nI don't think the majority of economics program (not a concentration in a business degree) have anything less than a course in regression analysis as a requirement for the degree. Basic stats isn't that helpful for understanding modeling anyway. I haven't seen any economics courses going over investment management stuff either because that[.] delegated to the finance departments (even though the professors are financial economists). \n"}