{"doc_id": "1501", "name": "2014_05_humanities_student_major_1936_contemporaryart", "namespace": "we1sv2.0", "metapath": "", "pub": "ContemporaryArt", "title": "2014-05-humanities-student-major_1936_ContemporaryArt.txt", "pub_date": "2014-05-30T00:00:00Z", "Sentiment": "0.19", "Subjectivity": "0.377", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "1024", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26vqq2", "Reddit_id": "chuzunp", "Subreddit_id": "t5_2s6lg", "Commenter": "KochiraChiRah", "length": "6281", "content_scrubbed": "Addressing your questions one by one...\n\n\n1.)\t Typically, no, graduate schools do not have the same system of majors and minors that undergraduate programs do.  Graduate degrees are much more specialized, and many expect you to dedicate your full attentions to the area you have chosen.  The exception that comes to mind is that some schools offer double masters programs, or a masters accompanied by a certification in something else (but this happens almost never in fine arts programs).  These double masters or certificates are usually in complementary subjects, though, so I don't think there are many (if any) instances of programs that would give you accreditation in things as different as fine arts and economics—at least not simultaneously.   However, if you aren't looking for additional certification in economics, there are some fine arts programs that encourage students to take courses from different departments to broaden their perspective, but the level of flexibility is dependent entirely on the specific program.  So, short answer: it mostly depends on the school you choose, but in general, they will expect you to be primarily focused on your area of practice.  And for MFA programs, you will usually choose a specific area of specialization—be it sculpture, photography, graphic design, painting, interdisciplinary, video, etc. –and for the most part they will expect you to deepen your practice in that one area, as opposed to dabbling in multiple.\n\n\n2.)\tYes, post graduate arts programs do take people from different academic backgrounds—very rarely is an undergraduate degree **in fine arts** a requirement for admission.    I do not think your background in economics would count against you at all—on paper.  However many of those pursuing an MFA *do* have undergraduate art education, and many people that are accepted into MFA programs also have this distinction.  Why?  Not because they are given preference; it is usually because they have a stronger practice, and have had more years to hone their conceptual and technical skills in an academic environment—they know the language, they know the culture, they know the history.  Also, their level of artistic development is usually at a farther point.  It doesn't mean they are better artists, per se, it just means that they are further along in their journey.  *That* makes them more attractive to admissions boards.   But, breaking it down, the most heavily weighted aspect of your application isn't your undergraduate degree, it is your portfolio and your artist statement.   In the portfolio, admission boards will be looking for technical skill and understanding; conceptual strength and continuity; and originality and vision.  In the artist statement, they will be looking for the level of commitment to or investment in the field in which you are applying, and they really want to understand why and how you believe admission in their program *specifically* will advance your work and your practice.  Typically, they will pass over artists who are still 'figuring out' what kind of artist they want to be, or still learning the technical aspects of their craft.  A good MFA program will provide you the space, the time, and the support to seriously delve into your work.  Accordingly, (selective) admissions boards look for students with a strong sense of vision.  If you are still developing your own, a BFA (undergrad fine arts degree) might be an excellent choice.  You will have more room to explore other media, and also will have more of a 'typical' American college experience.  But, again, MFA programs and their expectations can vary greatly—so it comes back around to finding the best fit for you and your practice, be that an MFA, BFA, or neither.  \n\n\n3.)\tUh...I don't think that scholarships are refused to foreign students.  Government sponsored loans and grants are not open to non-citizens, but that is only one source of funding.   Outside of that, some *specific* scholarships might require US citizenship, but not all scholarships do.   In fact, there are usually scholarships specifically for foreign students.  Also—a lot of your funding would come through your school of choice---and some schools offer more funding than others.  This, again, depends on the program you choose.   Some very small programs will practically fund your entire education, as long as you maintain a certain level of quality in your work.\n\n\n4.)\tWell, the most highly regarded schools for photography are generally the schools that are most respected for fine arts in general.  As you mentioned, Yale, of course, and the NY School of Visual Arts.  Also: Rhode Island School of Design; Art Institute in Chicago; CA College of the Arts; and Columbia—to name a few.  But, *definitely* don't just pick a school on its reputation.  Really learn about the different programs, learn about the faculty, and the arts environment surrounding the school.  Also different schools have different cultures: some are very conceptually rigorous, while others are less structured and more creative; some will always be very competitive, while others may be more collaborative.  No one can tell you what your ideal program is, because it is a personal decision.   The best school for you might not be the most prestigious, but it might be exactly what *you* need to advance and deepen your practice.  That is the most important aspect of an MFA, after all.  The networking, the involvement in an artistic community---you don't need an expensive degree to do any of that.  \n\n\n5.)\tFinally, I honestly can't tell you whether or not you should pursue formal arts schooling or continue on your own.  I really do believe that it is a very personal decision based on your goals and your work.  However, I will say that among US based artists, there is a lot of debate on whether or not an MFA is a good thing for artistic development.  So...what kind of artist to you want to be?  Really think about whether or not an MFA is the best avenue for development.  If yes, great—really, *really* learn about the programs that interest you.  If not, also great—find other ways to expand and grow.  I think it is a great idea to shadow and work with other photographers.   \n\n\nBest of luck with whatever avenue you decide to pursue!\n"}