{"doc_id": "1480", "name": "2014_05_humanities_student_major_1684_premed", "namespace": "we1sv2.0", "metapath": "", "pub": "premed", "title": "2014-05-humanities-student-major_1684_premed.txt", "pub_date": "2014-05-27T00:00:00Z", "Sentiment": "0.112", "Subjectivity": "0.368", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "248", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chrx2k1", "Reddit_id": "chs2mqb", "Subreddit_id": "t5_2rlp9", "Commenter": "dalejn", "length": "1549", "content_scrubbed": "I think attributing the lower acceptance rates to reverse affirmative action might be too hasty and oversimplified. This is pure speculation as an Asian, but I have a suspicion that it[.] less about reverse affirmative action and more about cultural pressures on Asians to conform to certain ideals, which results in a largely homogenous applicant pool.\n\nAll premeds need to jump through certain hoops and to a certain extent check off boxes (e. g. ECs, shadowing, volunteering, etc.), but Asians might  feel more pressured than other races to try certain activities. For instance, there[.] the stereotype that Asian parents will force their kids to play violin or piano (anecdotal support: my parents forced me to play violin and piano). There[.] also a pressure to major in \"something employable,\" like a field in the hard_sciences, as opposed to some other field of interest, like in the humanities. Combined with mostly being from a similar socioeconomic background, this cultural/parental pressure might result in less interesting backgrounds and ironically less diversity despite being a minority. \n\nIt[.] a complicated issue, but I like to see it as further emphasizing the idea that high grades and standardized test scores aren't the only things that matter. That[.] not to say that there isn't some element of reverse discrimination involved, but it seems more productive to focus on things that we can control (our stats and activities), rather than lament about things that we can't (our race and whatever injustices might exist in the world)."}