{"doc_id": "1424", "name": "2014_05_humanities_student_major_1181_creepypms", "namespace": "we1sv2.0", "metapath": "", "pub": "creepyPMs", "title": "2014-05-humanities-student-major_1181_creepyPMs.txt", "pub_date": "2014-05-18T00:00:00Z", "Sentiment": "0.087", "Subjectivity": "0.385", "Score": "394", "Upvotes": "394", "Downvotes": "0", "Wordcount": "372", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25vghl", "Reddit_id": "chl3ej6", "Subreddit_id": "t5_2ug83", "Commenter": "[deleted]", "length": "2046", "content_scrubbed": "Aaaand rant:\n\nA little background: I'm a Korean-American college student studying abroad in Shanghai right now, and there[.] a lot of expats, primarily from Europe and America, here. \n\nSo last night, I went out and met a guy from New_York. Really sweet when I first met him, funny and seemed genuine, so I gave him my wechat (kind of like kik but for China). But as soon as we start texting.... that[.] what happens.\n\nI'm so done with this \"my dick is bigger than yours\" competition between some East_Asian guys and Western guys. I'm sick of being told that I need to be with a real man, one with a \"properly-sized dick.\" It[.] astonishing how some guys think that makes me want to drop the panties.\n\nWhy do some guys judge their \"manliness\" based off the size of their penis? It[.] not size, it[.] how you use it that counts. I'd rather have an average sized man that knows how to make me feel good rather than a dude with a ginormous penis that pumps and dumps, usually just leaving me in pain. (To answer this question, a couple of users told me that saying this is like saying \"Why do guys have body image issues?\" Very valid point.)\n\nI'm also sick of being treated like a child sometimes because I'm Asian, sometimes because I'm a girl, sometimes because I'm both. \"Just marry a rich Chinese/American/Korean boy, you'll never have any problems!\" \"Oh sweetheart, it[.] okay, did you understand what that big, scary, American man was saying?\" \"Wow, your English is *so good!*\" I am FROM AMERICA. And no matter how I stress the fact that I am American, that even though it[.] my second language I speak/read/write it like it[.] my first (Korean is my first language - grew up there, although I was born in NY), and that I am a Humanities major at an American university, therefore I'm pretty fucking good at English - it[.] all to no avail. They treat me like some kawaii little kitten who[.] lost in a place far above her paygrade. I'm really fucking tired of it. \n\n***SIDE NOTE*** My post was removed by twox with no warning and I'm kind of irritated..."}