{"doc_id": "1413", "name": "2014_05_humanities_student_major_1105_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2014-05-humanities-student-major_1105_college.txt", "pub_date": "2014-05-16T00:00:00Z", "Sentiment": "0.131", "Subjectivity": "0.398", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "871", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25qqxz", "Reddit_id": "chjwqp2", "Subreddit_id": "t5_2qh3z", "Commenter": "sirziggy", "length": "4874", "content_scrubbed": "Just finished up my AA in Social and Behavioral Sciences at Pasadena City College and I am transferring to UC Irvine in the fall. Started as a music major and took 3 semesters of the required classes for it. That[.] like 10 units a semester because of co-requisites, which left 9 (if I didn't petition for more) to do other classes. My first year there I completed English 1A, the only GE I could get. \n\nMy second year I started an acting class at school and got into my first play! I also was able to knock out the Humanities and Arts by taking Intro to Theater, History of Theater, and my English 1B class. First and only C on my transcript was in English 1B (we had to read Hegel and Fanon for this class and the teacher didn't like student[.] opinions on the text that didn't coincide with her own). I also took my first Psych class, which I was always interested in taking. Sparked my interest, but I wouldn't want to go into Psychology now unless it was Social Psych. Lastly, I finished up my prerequisites for transferable math courses by taking intermediate algebra. The teacher really put math in perspective to the real world. He had a masters in math and a bachelors in engineering and always shared stories about how math was so useful in his field of work. Really fun class. Was in a set of one act plays as well and also was in the school opera. \n\nThe summer after my second year I took both sessions (some administration crap was and is still going on at PCC) to finish much needed GEs. Took my first Sociology class and found out it was more geared to my interests than Psych was. Took a really fucking easy math class (its name was Math for Liberal Arts Majors) to fulfill IGETC requirements. Performed in another play and my scene was used to present the new Center of the Arts on campus to the donors of the building. \n\nMy third and final year I began (and ended) with some of the most interesting classes I have ever taken. I'll get the less interesting ones out of the way. Finished up a bio psych class, the second acting class, and another set of one acts and it was the final time I took the musical theater class (teacher played mad favorites). \n\nMy Environmental Science class was the first in my sequence of really cool classes that tied everything together. It was a lab science requirement that also served as a natural science too (Bio Psych filled in the biological science requirement on the IGETC). It was also a hybrid class, so tests and other notes were online while field days were in the field. I felt like a fucking scientist doing this class. We met up with engineering students from Cal Poly Pomona and completed a bio reactor to try to filter nitrate from water. We visited the Riverside flood control district, where we learned about the different types of asphalt they are testing there that cleans water as it seeps through the cracks. The final project was a sustainability project. We were supposed to go to places like the farmers market and a place that sells fish to see how we can make that sustainable for Southern California. Really challenging and stressful class but I would love to do all of the field work again. After the semester ended, I went to see \"Peter and the Starcatcher\" and lo' and behold the set was entirely sustainable and made from recycled goods. Really connected environmental science with theater at that moment.\n\nSecond interesting class was Physical Science: Scientific Method as Critical Thinking. It was a bioethic class and the teacher was incredible. He used to be a catholic priest but when he came out he left the clergy. He has a Masters in Divinity (required degree to become a priest) and a PhD in Biology. Learned all about ethics in a medical world. I used my knowledge of theater and sociology in that class. Such a comfortable atmosphere.\n\nMy spring semester I took 3 sociology classes, 2 of them were the same teacher and he was amazing. He really reinforced my decision to become a sociology major because of the subject matter. We learned about immigration, white privilege (and not in a harsh way), dropout factories, and how poverty affects people. Such a fucking mind boggling class. I sort of became a cynic in that class since everything we learned was so depressing.\n\nFinal class I took was Political Theory. She was a great teacher, and challenged everyone (liberal or conservative) who would speak and not in an attacking kind of way. Learned more about my ideology (I consider myself a socialist) and others, like facism, conservatism, and liberalism. At the end of the semester I was  awarded a \"superior achievement in acting\" from the theater department and left with a 3. 81\n\nI wouldn't change a damn thing.\n\nTL;DR Had a lot of cool classes over my 3 years before I transferred. Some were awesome and connected very well with each other. Loved my time at this place.\n\n\n\n "}