{"doc_id": "1337", "name": "2014_05_humanities_student_major_524_socialism", "namespace": "we1sv2.0", "metapath": "", "pub": "socialism", "title": "2014-05-humanities-student-major_524_socialism.txt", "pub_date": "2014-05-07T00:00:00Z", "Sentiment": "0.04", "Subjectivity": "0.248", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1115", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chc5wwf", "Reddit_id": "chc5ymf", "Subreddit_id": "t5_2qjii", "Commenter": "TheSecondAsFarce", "length": "7193", "content_scrubbed": "... conclusion of post:\n\n**A Phony \"Verdict\": The Pabloites Endorse the Cover-up of Stalinist Crimes**\n\n166/ Despite the evidence uncovered by the ICFI, all the opportunist and Pabloite organizations opposed the Security and the Fourth International investigation. In September 1976, virtually every leading figure in the Pabloite movement issued a so-called \"Verdict\" denouncing Security and the Fourth International as a \"Shameless Frame-up.\" Depositions taken by Gelfand of SWP officials responsible for the publication of the \"Verdict\" established that none of its signatories had reviewed any of the evidence gathered by the ICFI before affixing their names to the denunciation of \"Security and the Fourth International.\" Repeated calls by the International Committee for the establishment of a commission of inquiry to examine the evidence went unanswered. Political interests played a decisive role in the Pabloites' response. They had no interest in revisiting the issue of Trotsky[.] assassination and bringing to the attention of a new generation of workers the history of Stalinist crimes. Nor did they object when the SWP went into court in 1982 in support of GPU murderer Mark Zborowski[.] efforts to quash a subpoena obtained by Gelfand, compelling Zborowski to answer questions relating to the infiltration of the Socialist Workers Party. Zborowski, who was living in comfortable retirement in San Francisco, challenged the subpoena on the grounds that testimony contributing to the exposure of agents inside the SWP would constitute a violation of the recently passed Intelligence Identities Protection Act. The court upheld Zborowski[.] appeal.\n\n167/ In the quarter century that has passed since the completion of the Security and the Fourth International investigation, many of its findings have been substantiated by the release of official Soviet documents. The so-called \"Venona Papers\" — decrypted files from Soviet intelligence sources — have definitively identified not only Caldwell, but also Robert Sheldon Harte — an SWP member sent down to Mexico to serve as a guard — as a Stalinist agent. When the ICFI initially published information incriminating Harte, this, too, was denounced by the SWP and the Pabloites as a slander. The validation of the charges made by the ICFI has produced no retraction by any of the Pabloite organizations of their denunciations of Security and the Fourth International.\n\n168/ Another peculiar set of facts emerged as a byproduct of the Security investigation. Virtually the entire central leadership of the Socialist Workers Party — including a majority of its political committee — had attended Carleton College, a small liberal_arts school in the Midwest. There was no record that the SWP had conducted any systematic work on the Carleton campus during the period between 1960 and 1964, when so many of its students, including Jack Barnes, entered the party and were rapidly promoted into its leadership. The medium of their transformation from conservative Midwestern students (Jack Barnes had been a Republican) into leaders of an ostensibly revolutionary organization was the Fair Play for Cuba Committee, which was manipulated by, and riddled with, FBI agents. No credible explanation has been provided by the SWP leadership for the Carleton College phenomenon.\n\n169/ As the International Committee[.] investigation uncovered ever-more incriminating evidence implicating Hansen as an agent, the counter-campaign of the SWP and the Pabloites assumed an increasingly provocative character. On January 14, 1977, the Pabloites held in London a public meeting of their supporters to denounce Security and the Fourth International and, in particular, Gerry Healy. Among those addressing the assembly were Ernest Mandel, Tariq Ali (leader of the British Pabloite organization), Pierre Lambert (leader of the OCI), and Tim Wohlforth. Prior to the meeting, the Workers Revolutionary Party sent a letter addressed to the leaders of the Pabloite organizations, calling for the establishment of a parity commission, consisting of an equal number of members from the ICFI and United Secretariat, to examine the evidence that had been uncovered by the investigation. The letter was not answered, nor was it acknowledged at the January 14 meeting. Instead, the meeting was given over entirely to vituperative denunciations of Healy. When Healy rose from the audience to request that he be given an opportunity to respond to the attacks, he was refused.\n\n170/ Despite the Pabloite stonewalling, the investigation continued. In May 1977, the ICFI located Sylvia Caldwell in a suburb outside Chicago, living without a fixed address in a trailer park. She had, since leaving the SWP, remarried (her first husband, Stalinist agent Zalmond Franklin, had died in 1958), and was now Sylvia Doxsee. She claimed to have no recollection of having been a member of the SWP, while at the same time declaring that James P. Cannon was a man of no particular importance. The ICFI published photos of Doxsee and portions of the transcript of its interview with her in June 1977. The SWP responded to this with a public campaign that sought to label the Workers League as a \"violent\" organization. This campaign was spearheaded by Hansen himself who, while warning that the investigation would have \"deadly consequences\" for the International Committee, wrote that \"the Healyites are quite capable of initiating physical violence against other sectors of the labor movement...\"[103] It had long been the modus operandi of the Stalinists to denounce the Trotskyist movement as \"violent\" even as they prepared physical attacks against it. Four months later, on October 16, 1977, Tom Henehan, a leading member of the Workers League, was shot in New_York City while supervising a public function of its youth organization, the Young Socialists. He died of his wounds in hospital, just a few hours later. Henehan[.] murder had all the characteristics of a professional assassination, carried out by skilled gunmen, who entered the premises where the function was being held and, without any cause, fired on Henehan. The New_York City press immediately labeled the assault a \"senseless killing,\" and the police refused to conduct any investigation. Though the two killers had been identified by eyewitnesses, no attempt was made by the police to apprehend them. The police inaction was abetted by the Pabloites, who refused to either report or denounce the murder of Tom Henehan. The Workers League conducted an independent political campaign to mobilize public support behind the demand for the apprehension of the assassins. In the course of this campaign tens of thousands of workers, and the representatives of trade union organizations representing several million workers, signed petitions endorsing the Workers League[.] demand. Finally, in October 1980, the police acceded to this public pressure and arrested the killers, Angelo Torres and Edwin Sequinot. Their trial was held in July 1981. They were found guilty and sentenced to lengthy prison terms. However, the defendants did not testify and they provided no explanation for their actions.\n\n(Edit: formatting)"}