{"doc_id": "1419", "name": "2014_05_humanities_student_major_1147_emory", "namespace": "we1sv2.0", "metapath": "", "pub": "Emory", "title": "2014-05-humanities-student-major_1147_Emory.txt", "pub_date": "2014-05-17T00:00:00Z", "Sentiment": "0.055", "Subjectivity": "0.414", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "264", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25sa6c", "Reddit_id": "chko97o", "Subreddit_id": "t5_2rscc", "Commenter": "piercedj316", "length": "1538", "content_scrubbed": "Graduated from undergrad a few years ago, but I'd be surprised if much of what I'm about to type has changed.\n\nAcademically rigorous but not cut-throat unless you make it that way.\nMany students live by the \"work hard play hard\" mantra, but if you want to be a homebody, there[.] a crowd for that too.\n\nRacially and ethically diverse and politically not super welcoming to conservatives but not overly hostile either. Emory is probably least diverse socioeconomically due to the high cost of tuition.\n\nStudent life is as active as you want to make it. Plenty of clubs, groups, and events. Greek life is pretty active, especially for a smallish liberal_arts college/research institution. Also, some really awesome speakers and professors come to visit. Also have an active relationship with the Dalai Lama and Tibetan monks. A few of them attend classes here, and the Dalai has visited quite a few times.\n\nNestled in the Druid Hills neighborhood, Emory is in a suburban environment (a quite beautiful and historic neighborhood, actually), but only a 10-15 minute drive to midtown/downtown (without traffic). For going out on the town, Uber/Lyft will be your friend if you don't like taxis or riding MARTA. The surrounding area has plenty of places to eat within a walk or a drive, but I highly recommend getting out to visit the city and downtown Decatur. There is a bit of an Emory bubble; as someone who has crossed that bubble, definitely go explore, Atlanta is a pretty cool place.\n\nAlso, go to a Braves game. Super chill, lots of fun.\n"}