{"doc_id": "1441", "name": "2014_05_humanities_student_major_1303_personalfinance", "namespace": "we1sv2.0", "metapath": "", "pub": "personalfinance", "title": "2014-05-humanities-student-major_1303_personalfinance.txt", "pub_date": "2014-05-20T00:00:00Z", "Sentiment": "0.03", "Subjectivity": "0.181", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "252", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chmucxu", "Reddit_id": "chmvky3", "Subreddit_id": "t5_2qstm", "Commenter": "wijwijwij", "length": "1491", "content_scrubbed": " I consider it a victimless crime.\n\nThe students you are helping are the victims. They are not learning the skills about writing and rewriting that they should be.\n\nThe parents of those students are the victims. Their children are not getting full value out of their education, because they are not doing the work. \n\nThe people reading the essays are the victims. They spend time evaluating the work and the writer[.] merits, all the while not knowing that the material was not written by them and does not reflect their actual capabilities. They may unwittingly advance a candidate who is not worthy.\n\nThe other student seeking admissions are the victims. Those who take the time to write honest but less polished work may lose out to the fraudulent student. \n\nAcademic integrity is the victim. You devalue the pursuit of knowledge and truth, and personal improvement, when you allow your clients to sidestep the work involved. This in turn abases the values that liberal_arts education espouses. \n\nYou are the victim. Even if no one gets caught and even if you think you are unscathed, you are not. \n\n~~One last point. You want to go to FILM SCHOOL. You plan a career, perhaps, in the CREATIVE ARTS, where you will be creating INTELLECTUAL PROPERTY, which you will be able to protect by COPYRIGHT, which allows you to profit from your creativity by controlling the formal creation[.] production and reproduction. I find it almost unfathomable that you do not see the irony here.~~ Nevermind."}