{"doc_id": "1442", "name": "2014_05_humanities_student_major_1304_saskatoon", "namespace": "we1sv2.0", "metapath": "", "pub": "saskatoon", "title": "2014-05-humanities-student-major_1304_saskatoon.txt", "pub_date": "2014-05-20T00:00:00Z", "Sentiment": "0.121", "Subjectivity": "0.438", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "306", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25zahr", "Reddit_id": "chmxe7m", "Subreddit_id": "t5_2rbq2", "Commenter": "tatania199", "length": "1745", "content_scrubbed": "I often think those who complain about the traffic, the \"danger\" and so on are those with nothing to compare to. I mean, it[.] a city. Odds are crime will happen. And given our current level of social connectivity, you hear about every last incident. Makes the bad seem more prevalent because the good doesn't make an enticing headline. \n\nHaving recently moved back from a major US city, we are happy to be here. It[.] a lovely city. \n\nSchools are different here than in many areas of the US (and some in Canada). There[.] less of a \"good school/bad school\" dichotomy. All schools will differ in some ways, but there[.] not the same coveted good school district decision making that can rules house shopping as it does in some areas of the US. Centennial High School is surrounded by some very nice 'burbs - Silverspring, Erindale and Arbor Creek are all established neighborhoods, but still young and family-filled. Willowgrove and Evergreen are brand new. I have family that drove from the North End of the city to Aden Bowman because of the focus on the arts - it would be worth looking into whether Stonebridge busses to Bowman. Stonebridge is a Dundee built suburb, and while it wouldn't be my first choice of neighborhoods (we did live there), it[.] new, finally has green space and if it fed into an ideal high school for you and Dundee made a good deal part of the package, it might be ideal for you.\n\nOtherwise, the winters are bloody cold, but everywhere has it[.] downfalls. The city is very pretty, summers are lovely, we're surrounded by lots of outdoor activities (lakes and camping, the river valley, etc), the food scene is getting better (more independents, less hype over cheesy chains) and so on. It[.] a perfectly lovely small city."}