{"doc_id": "1358", "name": "2014_05_humanities_student_major_715_outoftheloop", "namespace": "we1sv2.0", "metapath": "", "pub": "OutOfTheLoop", "title": "2014-05-humanities-student-major_715_OutOfTheLoop.txt", "pub_date": "2014-05-10T00:00:00Z", "Sentiment": "0.065", "Subjectivity": "0.24", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "553", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_258ftc", "Reddit_id": "chetdtm", "Subreddit_id": "t5_2xinb", "Commenter": "Skitterleaper", "length": "3061", "content_scrubbed": "If i may weigh in...\n\nI used to study Physical Geography at university. This is, despite what most academics tell you, a science. We follow the scientific method to study the physical world, use computer simulations to reach conclusions and build hypothesizes, and apply our knowledge to the world at large. There is also a lot of algebra and formulas involved, which always made my brain melt.\n\nHowever, as i was attending a university that had a very large Physics department, a lot of the people you'd meet around campus were studying Physics, often doing Master[.] degrees in this. This meant that in any group of students you had a high chance of encountering what i'm going to call a \"physics snob\" - the sort of person who looked down on other degrees as \"not being as good\" or \"not being as pure\" as physics. All subjects were subject to this, but Humanities in particular seemed to earn their ire.\n\nAs I stated previously, Physical Geography is a science - you earn a B/Sc at the end of it. However, my colleagues from the other side of the School of Geography, the Human Geographers, earned a B/A. So often the whole School of Geography would end up lumped in with the Faculty of Social Sciences, which the snobs from Physical Sciences declared \"not a real science.\" \n\nThere is nothing intrinsically wrong with this, but when you know a good dozen people or so who look down on Humanities, you can get defensive when you get lumped in with those your peers declare inferior.\n\nIt always frustrated me when people would say Geography is \"Just colouring in\" or \"all field trips\" when i sit up late at night writing massive essays and papers, or when i spent the last several hours wrestling with calculations to make my models work. I don't dismiss your work, you elitist pricks, despite the fact that you sit in a lab all day playing with imaginary numbers, despite the fact that you just dropped 80K on a new laser when Geography is using Flowmeters from the 70[.].\n\nAll irrational, i know, but hey, you're in the first year of University. You're still basically a kid. Besides, it[.] not like it was always first years - or even all students - making those claims...\n\nNow let[.] look back to XKCD. I will admit I don't read XKCD regularly, so what i'm exposed to is what i'm shown. And I've been shown plenty of XKCD strips that have this same elitist, looking down on the other fields viewpoint. One in particular springs to mind where they compare the purity of fields (\"Biology is just applied chemistry\") all the way up to Mathematics. So in my head, XKCD just got lumped in with those elitist assholes. The author is clearly a mathematician, works with computers by the looks of things, and in my first year head they just became another one of those people who thinks you lesser for not getting the injoke they just spouted.\n\nI've cooled off a bit now, but i'm still yet to see an XKCD that made me properly chuckle. More than a few I've had to had my friends from the School of Computing explain to me. But I guess they just have a target audience."}