{"doc_id": "1291", "name": "2014_05_humanities_student_major_8_rolla", "namespace": "we1sv2.0", "metapath": "", "pub": "Rolla", "title": "2014-05-humanities-student-major_8_Rolla.txt", "pub_date": "2014-04-30T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.362", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "418", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_2478vw", "Reddit_id": "ch6hosa", "Subreddit_id": "t5_2rvtz", "Commenter": "baconistic", "length": "2578", "content_scrubbed": "This is all from personal experience:\n\nOn the ballot for most local seats you'll barely see someone even running as a democrat. It[.] Usually a Republican, a Constitutionalist, and a Libertarian.\n\nThe city (townies) by and large is made up of your Freemarket, what was traditionally known as 'moderate' Republican business owners(some of whom may lean towards American style Libertarianism),  alongside an impoverished conservative majority that are more fundamentalist in their religious rhetoric coupled with a  fear of socialism mentioned in any form, even if its just an autoworkers union.\n\nThe Student body I would say is far more right_winged than your typical college, especially liberal_arts schools. That being said, there are still a very large amounts of the_left represented here.\n\nWithin the student body fundamentalist conservatives usually change their tune or simply drop out by the end of freshmen year.\n\nDelving even further into stereotyping because I've met people from all over this town, you'll see pretty even splits in Fraternities on Rep and Dem. Most Frat guys who are republican are typically the free-market kind; not really interested in protecting traditional marriage but not gonna jump up to defend gay rights either. They'll be about the same on weed as well. Of course there[.] always exceptions. They're proud as hell Americans and they think that a purer capitalism would work just fine for them, and therefore everyone.\n\nThe typical frat Dem will be an adamant supporter of Gay rights and Marijuana legalization so far as they have bullet points provided to them by Jon Stewart[.] Daily Show. Most of them don't vote because of a disenchantment with the political process. You'll see this in frat Reps too, now and then.\n\nA lot of the non-frat Dems who are vocal about their stance will oftentimes be in anti-establishment organizations; such as GDI, KMNR and Student Secular Alliance Et Cetera. \n\nMore Stereotyping: The Mining Dept. and Petroleum Dept., at least the U_S citizens, are notoriously known for being VERY Pro-2nd Amendment, and ultra-nationalist. There[.] some of these guys in Mechanical, Aerospace, and Nuclear as well.\n\nIn general with the students, you aren't going to catch too much flak for being gay and there is in fact a thriving LGBT community (The Da Vinci Society, for one). The majority of Republican students care very little about homosexual marriage, or weed legalization but mainly gun laws and free market. If you're in their organization they could care less about your sexuality  (not all the time, but most). "}