{"doc_id": "1454", "name": "2014_05_humanities_student_major_1404_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2014-05-humanities-student-major_1404_college.txt", "pub_date": "2014-05-22T00:00:00Z", "Sentiment": "0.059", "Subjectivity": "0.405", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "311", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_2652ni", "Reddit_id": "cholag3", "Subreddit_id": "t5_2qh3z", "Commenter": "[deleted]", "length": "1628", "content_scrubbed": "Do you have an academic adviser at your school who can help you out? One nice thing about community college is that it[.] cheaper, so you have the option to try new things and not worry about wasting as much money as you would in a regular university. \n\nAre you in your first year still? There is always a huge learning curve, especially with the humanities and transitioning from writing for high school to writing for university. I think anthropology or archaeology are both very exciting majors, or even history, and if you work hard I am sure you can keep up. My first history class in university I wrote an amazing (or so I thought) paper that ended up with a C. The next history class I got a B+ and then finally, three semesters after my first history class, I finally got an A. So there is definitely a learning curve and I would say don't give up after your first class! I have switched my major 5 or so times so far, and the one I am sticking with now (history) is very close to what I had started with originally. I had my one bad class (my C class) and I was like, I never want to take any humanities classes ever again! And then I realized that that[.] where my interests and skills are, so I went back to it, and figured out how humanities classes work and how to get better grades with certain professors and so and so forth...\n\nAnyways, if you find what you love to do, archaeology, anthropology, history etc. then do it! You will learn how to do better and you will get the hang of it and the thing is, doing the hard_work won't be so bad because you'll actually enjoy what you are studying!\n\nI hope that helps..."}