{"doc_id": "1379", "name": "2014_05_humanities_student_major_834_askscience", "namespace": "we1sv2.0", "metapath": "", "pub": "askscience", "title": "2014-05-humanities-student-major_834_askscience.txt", "pub_date": "2014-05-12T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.393", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "336", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chg4fp4", "Reddit_id": "chg5h4g", "Subreddit_id": "t5_2qm4e", "Commenter": "thechristinechapel", "length": "1978", "content_scrubbed": "Those are the exact questions I had initially. I'm not sure how your school is, but my undergrad institution was a liberal_arts school and it doesn't grant PhDs. Therefore, I really had no clue as to what graduate school at a research institution would be like.  \n  \nIf you do end up pursuing a masters or a PhD at a research institution, probably 50-80% of your time will be spent reading papers. As a student just starting out, it will be closer to the 80% end. Papers are the primary way scientists present the results of their research to other scientists. As an undergrad, most of what you are probably learning is many years old and very well-established. As a graduate student, you will begin to shift into learning about the cutting-edge research that is going on in your field. That[.] where papers come in. So yes, you'll be expanding your vocabulary and knowledge of the field. That said, it is also important to be exposed to the \"classic papers\". Meaning papers that are very well-known in the field and are referenced and cited often. I realize this might seem a bit overwhelming at first, but I would suggest going to one of your professors and asking, \"I'm interested in studying XYZ, what papers should I look at?\" If they don't know, hopefully they will know another professor to direct you to.  \n  \nAs for what programs to look for, honestly the best thing to do is to just google planetary science grad programs or some other combination of words. The major programs should pop up.  \n  \nAnother thing I forgot to mention is that you should definitely do at least one [Research Experience for Undergraduates](http://www. nsf. gov/funding/pgm_summ. jsp?pims_id=5517&from=fund) if you haven't already. This will give you research experience that will look good on applications and it will also help you nail down the path you want to take. Sorry for the lengthy response, but I hope that answers your question.  \n  \nEDIT: Indeed, feel free to PM at any time. :)"}