{"doc_id": "1295", "name": "2014_05_humanities_student_major_36_nursing", "namespace": "we1sv2.0", "metapath": "", "pub": "nursing", "title": "2014-05-humanities-student-major_36_nursing.txt", "pub_date": "2014-05-01T00:00:00Z", "Sentiment": "0.073", "Subjectivity": "0.299", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "510", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24ffh7", "Reddit_id": "ch6wav4", "Subreddit_id": "t5_2ra72", "Commenter": "Flatlander22", "length": "2735", "content_scrubbed": "Much of the disdain comes from med students or relatively newly minted MDs. They have 200K-300k of debt and are understandably a bit hypersensitive to anything that could impinge on their livelihood.\n\nHonestly, deep down, I would probably be a bit bitter too.\n\nI decided to enter into nursing in my mid-twenties and now onto NP school in my early thirties because I knew I wanted a career where I could help people live healthier lives. I took a look at medical school and realized that it would take me 1 year for a post-bac/pre-reqs, 4 years of med school, 4 years of residency, and most likely 300K of debt (I'm poor).\n\nNursing took me 1 year of pre-reqs (my previous degree was in liberal_arts), 2 year of nursing school for BSN (again, already had a BA), 3 years of practice as an RN, then another 2 years of graduate education as an MSN. I will most likely have 100k of debt because I don't have a trust fund and I'm going to an expensive ivy league school. \n\nWill I be as well prepared as my physician counterparts? I think so - for a variety of reasons. I for one am always curious and eager to learn and do more than the bare minimum to get through. \n\nHowever, I do see some RN colleagues who are looking to just enroll in the easiest/fastest online NP program so they can make more money. But then again, I know plenty of MDs in the profession that are just in it for the money too. A friend who graduated literally #2 in his class was about to drop out of medschool in his 2nd year to enroll in an MBA program. Now, he[.] finishing up his residency in Plastics.\n\nShills are everywhere, mediocrity is everywhere. I'm all for tightening up NP standards and I blame much of our \"leadership\" for these issues. \n\nBut I can't help but feel that the most vocal of MD[.] who are so against NPs/midlevels gaining more autonomy don't come from a place of wanting whats best for patients. They're not concerned primarily about making sure that clients have better access to care. They have an underlying attitude of \"how is it fair for these people that made less of a sacrifice and have less debt than me, to gain more autonomy?\" This is not good ground for solid healthcare public policy.\n\nNo one forced you to go to med school. You could have been a nurse. But be honest - most MDs probably never could have conceived of this option because of their ego. \n\nMe, I don't give a fuck about being called a doctor, or people seeing me as a semi-god. Hell, I hate it when NPs wear white coats. I still wear scrubs or street clothes when I can. What I care most about is building relationships with clients and helping them attain the best state of health they can. Lets stop being silly - lets get back to work and focus on whats important."}