{"doc_id": "1420", "name": "2014_05_humanities_student_major_1153_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2014-05-humanities-student-major_1153_Economics.txt", "pub_date": "2014-05-17T00:00:00Z", "Sentiment": "0.091", "Subjectivity": "0.412", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "471", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chkqttl", "Reddit_id": "chkrnye", "Subreddit_id": "t5_2qh1s", "Commenter": "[deleted]", "length": "2893", "content_scrubbed": "I'm not saying business degrees are worthless. An MBA from the_right university *and also at the_right point in your career* (as in, not immediately after a BA in Business Mgmt) will do wonders for your advancement in the management ladder. In fact, another redactor above pointed out the same thing and got a lot of agreeing voices echoing how the real value of an MBA is best realized with 4-6 years of work experience preceding it.\n\nI'm also not saying that non-STEM degrees have no inherent value. They do. They explore topics that I consider just as essential to broadening the boundaries of human knowledge as any STEM degree. I know researcher colleagues in these liberal_arts and social science fields who are some of the most intelligent people I've had the pleasure of meeting. I find some of these subjects fascinating in their own right. Just not fascinating enough for me to personally devote my life to.\n\nSimultaneously, however, the simple fact of life that *you* have to admit is that not all college degrees are **economically** equal (last I checked, that[.] what this subreddit was supposed to be about). The inherent natures of our various industries and their respective contributions to national and global economies create a demand pattern in the job markets that lead to a situation where some degrees *significantly* increase odds of employment while others do not. Graduates in possession of some degrees will have an easier time finding *careers* (note: not just any job) than others. And historically speaking, those \"some\" degrees have mostly been comprised of STEM degrees.\n\nThe point here being that going $100k in debt for *some* degrees is actually a sound economic decision, because the returns you are statistically likely to reap from that investment far *far* outweigh the amount you go under debt for. There've been a few recent studies on the matter, [one of which is cited here by The Atlantic](http://www. theatlantic. com/business/archive/2012/10/going-to-college-not-just-a-good-investment-but-the-best-investment/263304/), that uniformly show this. Yes, the price of attending college has been rising. But the price of *NOT* attending college has been rising even faster alongside it, to the point where despite some of the structural student debt problems we have today, the_right kind of degree is still quite worth it -- once again, *economically speaking*.\n\nIf an expression of this *economic reality* offends you somehow enough to call me a STEM jerk, that[.] your own damn problem. Your willful ignorance is a detriment only to yourself and your kids. But it behooves me to point out the natural conclusion from it -- that not all but at least a significant part of this debt problem has to do with society, parents and counselors leading students towards making poor economic decisions. A problem that you seem to be very willing to be a part of."}