{"doc_id": "1340", "name": "2014_05_humanities_student_major_540_intp", "namespace": "we1sv2.0", "metapath": "", "pub": "INTP", "title": "2014-05-humanities-student-major_540_INTP.txt", "pub_date": "2014-05-07T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.331", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "807", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chbld4e", "Reddit_id": "chccfsp", "Subreddit_id": "t5_2qhvl", "Commenter": "dunnoyabassa", "length": "4602", "content_scrubbed": "ok why the hell not:\n\nESFJ peaked in high school, getting laid constantly by a string of now-chunky ex-girlfriends, most of whom work at bahama breeze and olive garden.  He has a steady, low paying inside sales gig and likes to bro out at pro sporting events and Dave & Busters.\n\nISFJ is an overworked EMT who likes playing league of legends and masturbating.  He has been pining for the same girl since his senior year of high school, a very attractive bipolar redhead who likes leading him on and subsequently making out with his more outgoing friends.\n\nESTJ is an eagle scout who married his girlfriend from marching band.  He wears white socks and likes to travel internationally, less as a cultural experience and more for the personal challenge and bragging rights.\n\nISTJ has a masters in chemical engineering and a secure job in the oil industry.  His wife is a stay at home mom and at the age of 28 he already has two well-scrubbed children who are almost old enough to start resenting him.\n\nESFP has chlamydia again and won't stop stealing his roommate[.] adderall. He is a communications major at Arizona State University and plans to get some antibiotics when he goes to get his hand x-rayed after whatever happened at the bar last night.\n\nISFP is a jazz pianist who works at a bakery, which has caused him to recently gain 40 lbs-- he is trying to lose it with cigarettes.  His ex-girlfriend recently got engaged to someone taller than him and he[.] toying with the idea of joining the peace corps.\n\nESTP just started dating a lands end model, an achievement he ranks somewhere above his USC political science degree and below his Shelby Mustang.  He[.] planning to get a golden retriever puppy whenever the two of them break up and he[.] learning how to juggle; both plans with the same ends in mind.\n\nISTP joined the misfit frat his freshman year of college because the nerdy guys who lived there had great pot and netflix and a 50 inch TV.  His grades began slipping and his meek, yet ultra religious parents let him move back home with them where he still gets high with his female friends from high school and decides which major to switch to.\n\nINFP accidentally fell for his fuck buddy-- a blonde who drives a pink VW bug, who is the antithesis of his typical blue haired anime-loving femme-bisexual girlfriend preference.  He[.] trying to decide if this uniqueness about her means she[.] \"the one\" or if he could ever truly love someone who doesn't like Neutral Milk Hotel.\n\nENFP is finally about to graduate from his small liberal_arts college after 6 long years (though he spent one abroad in scotland studying the celtics for his archeology minor).  He[.] applying to community colleges to become a physical therapy assistant in attempts to eventually start paying off his already colossal student loans...\n\nENFJ has been gearing up to propose to his girlfriend for the past year, but can't quite pull the trigger.  Instead they've bought an italian greyhound together and he joined the Big Brothers Big Sister[.] program while he continues to convince himself he[.] still shopping for the perfect conflict free diamond.\n\nINFJ moved back in with his parents after failing to find a grant writing job with his master[.] in English.  He recently met a girl that he likes and is torn between taking a miserable sounding insurance sales job to move out on his own or going back to school in elementary education.\n\nENTP is three years out of college and has lost a couple friends who resent his ability to find a girlfriend, get promoted twice, and day drink every weekend.  He smokes weed with his boss[.] cousin and can't remember where he parked his car last night.\n\nINTP is trying online dating, but it[.] not going well and he[.] pretty sure he[.] just going to get a goldfish, some pot, and read the anthology of William James.  He goes back to his studio apartment with all three things and opts to get drunk and watch Leonard Susskind lectures on youtube instead.\n\nINTJ is getting his PhD in biochemistry and watches a LOT of Stephen Colbert.  Things aren't going very well with his girlfriend, but he[.] pretty sure as long as he books them a vacation on Martha[.] Vineyard this June she'll shut up about how unromantic he is.\n\nENTJ is 25 and head of his distribution company[.] continuous improvement division.  He recently bought himself a house and is trying to decide if he[.] willing to tell the girl he[.] been seeing he[.] willing to be exclusive.  His mother is worried he has a drinking problem, but can't seem to come up with enough evidence to convince him to do anything about it."}