{"doc_id": "1326", "name": "2014_05_humanities_student_major_404_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2014-05-humanities-student-major_404_funny.txt", "pub_date": "2014-05-05T00:00:00Z", "Sentiment": "0.122", "Subjectivity": "0.429", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "323", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chaqixz", "Reddit_id": "char8l8", "Subreddit_id": "t5_2qh33", "Commenter": "Anzat", "length": "2033", "content_scrubbed": "I was unfortunately exposed to a lot of literary criticism, and a fair bit of over-interpretation of poetry, while fulfilling my distribution requirements. I came to realize universities are spending millions of dollars funding departments full of people who professionally know very few useful things, but are good at patting each other on the back. They write papers and teach classes and go through the motions of being intellectuals, but their papers are grounded in nothing real... only the equally vapid works of their colleagues. They try to impress and one-up each other with catchy metaphors and fancy vocabulary misappropriated from the sciences (their references to quantum mechanics made me want to vomit), but they have no objective standard for what is or isn't good work, and no body of real knowledge that grows and solidifies over time.\n\nPerhaps this will be seen as science snobbery, but it[.] justified. Science learns real things about the world. I'm sure there are bubbles of usefulness in the humanities, but there[.] also way too much aimless, meaningless pseudo-intellectual babble. It consumes not only financial resources but also students' valuable (and expensive) time, by mandate, even if they'd rather avoid it. \n\nUltimately, I think academia places way too much value on studying the creative works of other people. I don't see what[.] particularly valuable about that. I think academics should focus on studying the natural world, or on more concrete social_sciences like history. Art and literature are fantastic, but their study should be focused on learning how to better *create them*... not endlessly debating bullshit over-interpretations of things created by people with actual talent. When was the last time anything useful came from academics writing about other peoples' art or literature? And was it really useful enough to justify spending hundreds of millions that could instead go to cash-strapped sciences, or wasting the time of students who will forget it and never think about it again?"}