{"doc_id": "1309", "name": "2014_05_humanities_student_major_172_videos", "namespace": "we1sv2.0", "metapath": "", "pub": "videos", "title": "2014-05-humanities-student-major_172_videos.txt", "pub_date": "2014-05-03T00:00:00Z", "Sentiment": "-0.018", "Subjectivity": "0.467", "Score": "20", "Upvotes": "20", "Downvotes": "0", "Wordcount": "260", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_ch8td8p", "Reddit_id": "ch8wr86", "Subreddit_id": "t5_2qh1e", "Commenter": "[deleted]", "length": "1601", "content_scrubbed": "\"The beauty of concision is that you can only repeat conventional thoughts.\"\n\nThis is simply wrong.  Historically, literature, poetry, music, and the arts in general are rife with examples of very unconventional thinking expressed in both concise and elaborate ways.  \n\nThe fact is you need both.  Verbosity is good for trying to be precise and explore new ideas, but, ultimately, you need concision in order to make those ideas both accessible and widely communicable.  This is not at all a new constraint introduced by mass media, either.  That[.] a bizarre assertion made by people who were, at the time, struck by the fact that they had found modes of communication that departed from full length books, but the heyday of books was always a historical anomaly.  Traditionally, people shared complex ideas through song and allegory.  Socrates doesn't need ten minutes just to get around to the point, and much of what he had to say was way more insightful and revolutionary than anything Chomsky ever said.\n\nAnyway, every movement needs its symbols and slogans.  Chomsky[.] mistake is seeing that the vast majority of symbols and slogans *currently in existence* express conventional thoughts and then concluding that[.] all they are good for.  But it should be obvious that, at one time, those concisely stated ideas were once new and revolutionary.\n\nI find this sort of \"guilt be association\" thinking very common among anarchist types (those who have attempted to think through their beliefs at all, anyway).  It[.] a silly mode of thought that permits you to draw some truly ridiculous conclusions."}