{"doc_id": "1346", "name": "2014_05_humanities_student_major_584_tumblrinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrInAction", "title": "2014-05-humanities-student-major_584_TumblrInAction.txt", "pub_date": "2014-05-08T00:00:00Z", "Sentiment": "0.084", "Subjectivity": "0.388", "Score": "41", "Upvotes": "41", "Downvotes": "0", "Wordcount": "281", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chcu5gs", "Reddit_id": "chcx0jm", "Subreddit_id": "t5_2vizz", "Commenter": "realigion", "length": "1705", "content_scrubbed": "Okay so I'm a student at an engineering school that[.] overwhelmingly white and overwhelmingly male. Shocker. \n\nIn recent years my school has put quite a bit of emphasis on the ethics of engineering and my major in particular (I'm a dual technical + humanities) focuses on the idea of responsible innovation. \n\nI didn't read the article, but the headline *does* at least allude to an important question that[.] hard to recognize without experience in these circles. That is, \"how can engineers, a group overwhelmingly comprised of upper class white males, devise solutions that account for the people not *involved with* but ultimately *affected by* the processes of innovation?\"\n\nIt is indeed a difficult and important question, and it[.] also not without precedent. For example, forgotten diseases. In huge parts of the world, there are easily-curable/treatable diseases that absolutely ravage entire communities and will continue to do so because those diseases don't affect the people who have the power/money to solve them. Another example which is more clearly absurd, the antiGMO movement. Here you have a bunch if rich well fed white people rallying to ban GMOs or more strictly regulate them. The fact is, GMOs have saved billions of lives. The antiGMO crowd doesn't have much scientific ground to stand on, but *even if they did,* what kind of responsible science is that to outlaw GMOs that might cause sleep problems for rich white people but keep literally millions of people breathing day by day?\n\n\nThese ARE important questions and as science gets better, it gets more expensive. This gap will grow and we DO need a way to include the voices of people who don't have input on these processes. "}