{"doc_id": "1453", "name": "2014_05_humanities_student_major_1396_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2014-05-humanities-student-major_1396_politics.txt", "pub_date": "2014-05-22T00:00:00Z", "Sentiment": "0.046", "Subjectivity": "0.21", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "325", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chogo13", "Reddit_id": "chohsu2", "Subreddit_id": "t5_2cneq", "Commenter": "whitefalconiv", "length": "1929", "content_scrubbed": "The solution, in my opinion, is to do a few things.\n\n* Reduce the number of people going to universities by promoting trade and vocational schools and apprenticeships (There is still a shortage of skilled tradesmen in many areas.  Nobody wants to be a plumber, or a mechanic, or an electrician anymore, even though they're high-paying jobs.)\n* Automatic student loan forgiveness for in-demand fields of study, determined at the time of college enrollment.  This will allow people who go into a program that[.] in demand to, at the very least, not be screwed over by the 4 billion other kids graduating from the same program (see Nursing, Computer Networking, etc. where a field was in demand but completely saturated by the time people started graduating from their \"in-demand\" programs)\n* Free college courses that don't award official degrees.  There are tons of these available, but mostly in technical fields.  Expand these to the arts/history and people who WANT to study, say, 14th-century German agriculture have that option.  Let them also come back, pay for the course they've already taken, and get an official degree in their field of study if they decide that[.] what they want to pursue as a career.\n* Redefine \"entry level\" positions for job-finding services.  One of the major complaints from college grads is \"entry level positions require 5 years of experience\", which is rather absurd when you look at it from their perspective.\n\nI don't see government college grants coming back anytime soon, as long as we've got those in power who want to cut anything that benefits the public as a whole.  I think that, if we can get the government to back my second point, we can push other systems into backing the others.\n\nReducing tuition across the board needs to happen, but that[.] a much tougher sell to college boards that both need the funding (for research) and want the money (for increased salaries, bonuses, etc.)"}