{"doc_id": "1433", "name": "2014_05_humanities_student_major_1259_asianamerican", "namespace": "we1sv2.0", "metapath": "", "pub": "asianamerican", "title": "2014-05-humanities-student-major_1259_asianamerican.txt", "pub_date": "2014-05-19T00:00:00Z", "Sentiment": "0.024", "Subjectivity": "0.316", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "263", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25zgva", "Reddit_id": "chm84px", "Subreddit_id": "t5_2rfyw", "Commenter": "Lolfulevil", "length": "1603", "content_scrubbed": "There is a line in the Philip Roth novel *The Human Stain* where two members of the WASP academic old guard are lamenting the influx of Jewish students at their Northeastern liberal_arts college because \"they make things competitive.\" Your situation might be analogous. \n\nI imagine that many admissions officers and interviewers are not exactly comfortable with using a wholly meritocratic system to gauge exactly who gets to attend their alma mater and what exactly needs to be done to get there. Self-motivation, leadership, love of learning these are vague cues and yet many of the gatekeepers believe they can parse them out after the baseline of exceptional grades have been met. It[.] debate worth having between a completely transparent and implicit system where hard_work and sacrifice are duly rewarded against an instinctual system affirmed by those who by virtue of attending and excelling at their institution understand it[.] purpose and who belongs there albeit by going about it in an opaque way.\n\nAs for your Korean friend her white-passing name might in a vacuum be a boon or at least a non-issue which in our world is itself an advantage.\n\nThe affirmative action aspect of your question is a difficult one to answer in part because of the contentiousness of the issue especially among Asians. Consider the situation not in such an adversarial way but as a result of policy decisions that have the aim of remedying centuries of institutional prejudice and increasing the presence of blacks, natives, latinos etc. at universities. I understand though that might be of little consolation.\n\n"}