{"doc_id": "1494", "name": "2014_05_humanities_student_major_1890_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2014-05-humanities-student-major_1890_AskReddit.txt", "pub_date": "2014-05-29T00:00:00Z", "Sentiment": "0.027", "Subjectivity": "0.384", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "704", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26t60c", "Reddit_id": "chuctt9", "Subreddit_id": "t5_2qh1i", "Commenter": "TexasRadical83", "length": "3615", "content_scrubbed": "I'm sure it[.] already been said, but I'm going to say it again: GO TO CLASS. I fucked up college so badly by skipping tons of class, and it is one of the major regrets of my life. Nobody will be holding your hand, there is no truant officer, you don't have to go to class if you choose not to. Choosing not to, however, is really stupid.\n\nHere[.] the fact: if you are studying some sort of liberal_arts degree and you attend all your classes except when serious illness or emergency makes it impossible, you will pass every class and get at least a B in most of them. If you do the readings and study you will get As and Bs. If you do the office hours thing and really buckle down, you will get As. For science/math/engineering degrees there is more work and it is an objective you get it or you don't thing, but there too if you don't go to class you will very very quickly fall behind and not be able to keep up with tests and quizzes. That[.] the difference between As and Bs and failing and Ds and Cs. GO TO CLASS.\n\nThe best way to ensure that you go to class is to get up at the same time every morning and to keep  drugs and alcohol to a minimum. If you don't have morning classes still get up at 8 or 9 every morning and spend your mornings running errands, studying, whatever. Don't get in the habit of sleeping until 11 or 12 or 1 PM on days when you don't have class or only have something late in the day or whatever. It'll make you a lazy bastard and it makes saying \"fuck it\" a lot easier. If you are getting drunk or blazing up every night (or one or the other every night, or one or the other a bunch of nights) you will HAVE to sleep like this. Learn how to have a drink or two if you can (I'm an alcoholic, so I have to go with nothing--if you are too, do likewise and there[.] help there if you need it), and I personally recommend staying away from pot except perhaps on special occasions. I'm also the guy who thought that blazing all the time, sleeping until the afternoon, skipping weeks of class at a time and failing left and right was really cool. I managed to pull my life together years later, but I wasted time and a lot of money fucking around. Don't do that.\n\nFinally, fuck all the careerist bullshit: do what makes you happy. If you are studying business so you can get a good job but you are bored or aggravated, fuck that. Study what you love, what interests you and things will work out. You know what happens to people who study things they don't like in order to get a job after college? They get jobs they don't like, they live lives they don't like and they are fucking miserable. Study what you love and you might end up in a dream job, but at least you won't be locking yourself into something you hate. This extends to college as a whole. If you really don't like academic pursuits but you really like working with your hands, kick around a trade school. An education is a good thing, and it can give you options, but if what you want to do doesn't require a degree, don't feel compelled to get one. That being said, if someone else is paying for it, you might as well. If you are being expected to borrow lots of money, you might be better off taking your time in community college, testing out of courses and otherwise minimizing your costs. Avoid debt if you can.\n\nI could go on all day, but I'll leave it with what I've said here. Go to class, take it easy on the intoxicants, get up in the mornings, follow your interests and don't get forced into doing things (and spending tons of money) that you don't want to. You do all that and you'll be ahead of most of your peers."}