{"doc_id": "1330", "name": "2014_05_humanities_student_major_459_latin", "namespace": "we1sv2.0", "metapath": "", "pub": "latin", "title": "2014-05-humanities-student-major_459_latin.txt", "pub_date": "2014-05-06T00:00:00Z", "Sentiment": "0.087", "Subjectivity": "0.282", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "400", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chb3si7", "Reddit_id": "chb7x8r", "Subreddit_id": "t5_2qloa", "Commenter": "waldowv", "length": "2213", "content_scrubbed": "Since this has become the DO SOMETHING ELSE thread, I'll add my two cents:\n\nI graduated with an MA in Classics in the mid-2000s and my first few jobs out of school were as a handyman, then electrician.  My first \"real\" job I got into by sheer dumb luck: I had my classics degrees on there and my resume had to be *literally picked out of the garbage can* by the CEO of the company who just happened to have an undergrad minor in Latin.  Since then I've moved up to a professional/management position but my education is at the very bottom of my resume, and I do NOT list what my major was.\n\nThese days a lot of my friends are graduating with PhDs/dropping out ABD, and after a year or two trying the soulcrushing VAP/adjunct course, they go out into the wild to try to get a non-academic job.  After no success, I offer to look at their resumes for them and it is absolutely soul crushing.  Their resumes are three pages full of publications, dissertation title, name-dropping their professors, a list of their research interests, courses taught, what they did on their Fulbright, etc. etc. etc. and *it all has to go*.  They don't believe me at first, but after more and more failure things start coming off, leaving behind a vacuum to show an employer what went on for the past ten years.  One of my friends is currently delivering pizzas and his resume is now written as if he were still an undergrad comp sci major (he[.] taken a couple classes) looking for a paid internship, complete with subtle grammatical errors inserted on purpose.\n\nDon't get a PhD in Classics.  You're much better off taking your nondescript liberal_arts BA, finding something that will pay you $30k initially but progress to enough to buy a house 7-10 years.  *I* know how useful my MA has been: my writing and basic communication skills are lightyears ahead of everyone else in my field, and my experience teaching has been incredibly useful, but all employers see is someone who hasn't done anything at all in their 20s and early 30s but probably wants to be paid more than everyone else.  When hiring someone, the goal is to get to the short list as quickly as possible and grad school in Classics is an easy cut for most employers."}