{"doc_id": "1370", "name": "2014_05_humanities_student_major_775_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2014-05-humanities-student-major_775_AskHistorians.txt", "pub_date": "2014-05-11T00:00:00Z", "Sentiment": "0.165", "Subjectivity": "0.423", "Score": "39", "Upvotes": "39", "Downvotes": "0", "Wordcount": "1244", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chfkcek", "Reddit_id": "chfkclv", "Subreddit_id": "t5_2ssp3", "Commenter": "Ambarenya", "length": "7445", "content_scrubbed": "**Part II:**\n\nAs you can see, a detailed understanding of the traditions and philosophical beliefs of the ancient Greeks and Romans were very important to Byzantine thinkers, but Psellos seems to be one of the first ones to attempt to rationalize their thinking, rather than to just take them at face-value, and this is part of the reason why Psellos is considered one of the key founders of the Neo-Platonist movement, as well as one of the most important scholars in Byzantine history. \n\nIn addition to his contributions to the development of Neo-Platonism and the laying of a foundation of the modern scientific method, Psellos wrote many extensive works which sought to educate those in power on the physical sciences. His work *De Aurum* outlines some of the important contemporary principles of alchemy, and highlights a sophisticated understanding and attempt at explaining effects of various chemical elements in a -controlled- manner, which again highlights Psellos' contribution to the foundation of modern science. Some of his other works, including a number of astronomical treatises, seek to correct problems with the ancients' line of thought, such as Ptolemy[.] system of epicycles and deferents, a notion which was challenged by Psellos' time and was expanded upon by his students. There is at least some evidence that points to the idea that heliocentrism was argued for and even accepted by scholars of Psellos' generation and beyond. Dedicated and meaningful exploration of the sciences lasted for centuries afterwards. Anna Komnene herself (a student of Psellos in her childhood), seems to have been heavily influenced by the man, and she herself took to the arts of science and philosophy, and even assembled a think-tank to challenge the deductions of Aristotle and other ancient philosophers. Anna certainly was well-read and very aware of things such as astronomical phenomena and the physical sciences, since she mentions and explains various processes extensively in the *Alexiad*. I will reproduce her statements on the Comet of 1106 here:\n\n*\"Directly the men of the western provinces heard that the Emperor had arrived in Thessalonica, they all assembled round him there, exactly as heavy bodies are drawn by gravity to the center. This time, indeed, a locust did not precede the advent of the Franks as it did before; but a large comet appeared in the sky, the largest of all that had ever been seen before, and some pronounced it to be a beam-meteor, and others a javelin-meteor. For it was only right that some unusual signs, predicting the strange things that were shortly to happen, should be sent from above. And this comet was to be seen shining brightly for a whole forty days and nights ; and it seemed to rise in the West and travel across towards the East. All who saw it were dumbfounded and asked of what this meteor was the portent. The Emperor did not as a rule pay much attention to such matters, for he was of opinion that they arose from some natural cause, yet even he questioned the men who understood these things; and summoned Basilius (this man showed great devotion to the Emperor), who had lately received the honourable post of Prefect of Byzantium, and consulted him about the comet which had appeared. Basilius said he would defer his answer till the next day, and he returned to his lodging (which was a chapel built long ago in honour of the evangelist John) and watched the comet when the sun was about setting. While he was thus worried and wearied with calculations, he happened to fall asleep, and in his sleep beheld the saint dressed in priestly robes.\"*\n\nNote, Anna[.] confident understanding of the processes of gravity, as well as what seems to be a standardized system of classifying astronomical phenomena, which is also supported by entries in the Byzantine Suda Lexicon/Encyclopedia of the 10th Century. Also keep in mind the calculations made by the Emperor[.] consultant, as well as Anna[.] comment about the Emperor[.] beliefs and attitude. All very important details in showing Byzantine sophistication in astronomy and science in general by the time of the Komnenoi.\n\nIn conclusion, I think the greatest barrier that prevents many people from realizing the contributions of Byzantine science is that many of the Byzantine works have historically gotten very little attention, and only in very recent times have groups such as Dumbarton Oaks sought to publish these ancient and forgotten texts into English. I know that there are thousands of texts that have gone unpublished that could reveal so much about what the Byzantines knew. One great example which I am working on myself is Psellos' *De Omnifaria Doctrina*, a scientific/philosophical work written to educate the Emperor and his attendants on matters of science and philosophy. But even existing works, such as Constantine VII[.] *De Administrando Imperio* and *De Ceremoniis*, Psellos' *Chronographia*, and Anna Komnene[.] *Alexiad* cursorily reveal that the Byzantines knew a lot more than popular history gives them credit for. In the coming years, I hope to see a revival in appreciation for the knowledge of the Byzantines, so that the current narrative of the \"Arabs preserving all of the knowledge, while Europe was in the Dark Ages\" goes away for good in favor of a more truthful and inspiring narrative.\n\n**BONUS: Anna Komnene[.] rant about astrology in the Alexiad**\n\n*\"A certain mathematician named Seth who boasted much of his knowledge of astrology had forecast Robert[.] fate by an oracle, after his crossing to Illyria, written this forecast on a paper, sealed it and entrusted it to some of the Duke[.] intimates, bidding them keep it till a certain time. After Robert[.] death they opened it by the astrologer[.] order and the prophecy was as follows: \"A great enemy from the west, who has stirred up trouble, will die suddenly.\" This caused everybody to marvel at the man[.] knowledge; and in truth he had delved very deeply into this branch of \"science\", and if I may be allowed to make a short break in the course of my history, the following are the facts about astrological prophecies. The \"discovery\" is fairly recent, and the science of it was not known to the ancients. For this method of divination did not exist in the time of Eudoxus, the greatest of all astronomers, neither did Plato have any knowledge of it, and even the astrologer, Manetho, had not brought it to perfection. Now these (astrologers) observe the hour of the birth of the persons about whom they intend to prophesy, and fix the cardinal points and carefully note the disposition of all the stars, in short they do everything that the inventor of this science bequeathed to posterity and which those who trouble themselves with such nonsense. I, too, at one time dabbled a little in this science, not in order to cast the horoscopes (Heaven forbid!), but to gain a more accurate idea of this vain study in order to utterly confound the experts. I do not mention this for the sake of boasting, but to prove that during my father[.] reign many of the sciences made great progress, as he honoured both philosophers and philosophy itself, but towards this teaching of astrology he showed some hostility, I believe because it diverted the more simple-minded folk from hopes that comes from above with a blind belief in the influence of the stars. This was the cause of the Emperor[.] waging of war against the teaching of astrology.\"*"}