{"doc_id": "1310", "name": "2014_05_humanities_student_major_176_howtonotgiveafuck", "namespace": "we1sv2.0", "metapath": "", "pub": "howtonotgiveafuck", "title": "2014-05-humanities-student-major_176_howtonotgiveafuck.txt", "pub_date": "2014-05-03T00:00:00Z", "Sentiment": "0.114", "Subjectivity": "0.431", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "409", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24iwt2", "Reddit_id": "ch8y6wf", "Subreddit_id": "t5_2tna8", "Commenter": "pdawes", "length": "2215", "content_scrubbed": "It sucks to feel like everyone[.] moving forward but you. I have been there both socially and academically/professionally. It[.] important to realize that there isn't a roadmap for your life. Even if you did blow a year, waste a semester, whatever it was, it[.] not going to derail you permanently.\n\nFurthermore, other people aren't always as successful as you think they are. A lot of my friends from high school went to ivy league colleges and got high-powered internships, while I went to a small liberal_arts school and didn't really prepare for my future career-wise. I felt super insecure because they had summer jobs in financial offices and elite degrees and here I was totally lost and barely scraping by trying to graduate. Fast forward a year or two: I have a decent job, live on my own, and most of them are living with their parents. When it comes to comparing your place in life to other people, you never gauge it accurately. You will usually downplay your accomplishments and upsell everyone else[.]. You will feel like the only one who doesn't have his shit together, an \"impostor\" who will be found out at any moment by the successful people around him. The sooner you understand that this is just a natural insecurity and not a meaningful reflection on your character, the more you will enjoy life. So many people, honestly I think almost all of them, feel like that.\n\nA few months ago, I went to a party and I met a lady who was 30 and had basically floundered in her life the way I had from 19-22 except for her it lasted until she was 28, but by the time I met her she was basically where I aspired to be in the future, having a successful and fun, fulfilling life. If someone can fuck up badly for almost a decade and come out being someone others look up to, there[.] definitely hope for you. It[.] not a race. You didn't miss the boat, not by a long shot. \n\nYou do you, focus on your goals, and make the most of your time in college. I have some friends who took a fifth year, and honestly I'm jealous of them. They're having fun, having a little more freedom to take interesting classes vs. my scramble to complete my majors, and they're on track to kick ass in life. Why can't that be you, man?"}