{"doc_id": "1463", "name": "2014_05_humanities_student_major_1566_personalfinance", "namespace": "we1sv2.0", "metapath": "", "pub": "personalfinance", "title": "2014-05-humanities-student-major_1566_personalfinance.txt", "pub_date": "2014-05-24T00:00:00Z", "Sentiment": "0.208", "Subjectivity": "0.345", "Score": "29", "Upvotes": "29", "Downvotes": "0", "Wordcount": "432", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26e124", "Reddit_id": "chq5y5p", "Subreddit_id": "t5_2qstm", "Commenter": "MinNonMEC", "length": "2347", "content_scrubbed": "If you want to go into business, this is your first big business decision. I'm guessing most people on here will tell you to save the money, and they might be right. I can give you a few things to think about as to why its worth the extra cost.\n\nSome majors (like business) it could be 10X worth it to attend a more prestigious school, but not for the reasons you might think. Getting ahead in life is more about who you know, than what you know. I know its cliche but its the truth.\n\nWhen I went to school I was trying to find a good deal on housing. My uncle, who is extremely wealthy (self-made) recommended that I pick one of the nicest places available. \"But its an extra $100/month?\", I cried.\n\nHis advice, which I'll never forgot was \"If you want to be wealthy you need to associate with wealthy people. Who knows what kind of connections you will make in that area and how it will impact you the rest of your life.\"\n\nIn my case he ended up be right. I moved to the nicer area and made some lasting friendships. The extra $1200 a year landed me friends with high net worth parents who helped me land a premium internship, then later capital for starting a small business, and now some extremely lucrative opportunities as my friends have developed more into their careers.\n\nWill you have the same experience? Maybe, maybe not. I'm not advising you to go to a more expensive school. What I'm saying is that IF you decide to go to a more prestigious school it will only pay off if you take advantage of the opportunities there by building friendships with the type of people who can afford to go to prestigious schools and integrating into their networks.\n\nThe level of education should be \"better\" at more expensive universities, but the real payoff is taking advantage of the social circles and mentoring opportunities. Its why people go to Harvard for their MBAs. Of course they have some of the best teachers in the world, but more importantly you're rubbing shoulders with some of the best business families in the world. If you got to harvard and don't take advantage of that you are wasting your money.\n\nNow that being said, if you want to be a humanities major like another poster on here, the more expensive cost is not worth it. Decide first what it is you want to do, then look at the costs - scholarships, then make your decision."}