{"doc_id": "1417", "name": "2014_05_humanities_student_major_1135_tiadiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "TiADiscussion", "title": "2014-05-humanities-student-major_1135_TiADiscussion.txt", "pub_date": "2014-05-17T00:00:00Z", "Sentiment": "0.069", "Subjectivity": "0.326", "Score": "21", "Upvotes": "21", "Downvotes": "0", "Wordcount": "306", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25sxj0", "Reddit_id": "chkg72a", "Subreddit_id": "t5_2zsos", "Commenter": "[deleted]", "length": "1791", "content_scrubbed": "Reddit is the home to a LOT of STEM-ers, specifically engineers. So a lot of them naturally tell others that they should go into stem because they've enjoyed it/think it[.] great. \n\nThis conflicts with a lot of the other redditors who have liberal_arts-related degrees. So you have this tug of war going on between both fields on reddit (of course, there[.] a silent majority who just don't give a shit at all, but nonetheless), which causes the results you see below;\n\n lel a history degree? enjoy making latte[.] at starbucks\n\n omg stem? we dont need more neckbeards\n\nSo it[.] this shitty back and forth jerking, meanwhile no points are being made. To reach a good middle ground solutions for a lot of society[.] problems, we need both \"sides of the brain\" (heh, remember that illustration of one side being artsy and the other scientific?) to work together. Otherwise, we end up with this back and forth nonsense. \n\nAnyways;\n\nWhat is wrong with people in a STEM program?\n\nNothing. A lot are just annoyed at Reddit[.] general push to go into STEM over other programs. Still no reason for anyone to get mad at those studying the program. \n\nShouldn't we be encouraging more women to enter these programs in the first place?\n\nWell yep. We should be encouraging more people to have the opportunity to join STEM. Just like we should be encouraging more males in fields like nursing and teaching. More diversity in more programs just leads to a healthier society quite frankly. Why SRS is against this notion and just circlejerks back, is stupid and short-sighted. Can't really expect much more from them though. \n\nWhy do people think TiA users are studying STEM?\n\nSame reason why anyone who speaks up against cultural appropriation is automatically white. It fits their stereotype view of the world. "}