{"doc_id": "1364", "name": "2014_05_humanities_student_major_755_berkeley", "namespace": "we1sv2.0", "metapath": "", "pub": "berkeley", "title": "2014-05-humanities-student-major_755_berkeley.txt", "pub_date": "2014-05-11T00:00:00Z", "Sentiment": "0.072", "Subjectivity": "0.29", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "286", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chf4cbb", "Reddit_id": "chf948h", "Subreddit_id": "t5_2qh9w", "Commenter": "shmittywerb", "length": "1575", "content_scrubbed": "1.) I studied business. Almost every RA takes a slight hit to their grades, unless they are in a major with notoriously high grades or they are extremely good at planning their time. \n\n2.) Surprising no one, most RAs are humanities/social_sciences majors. This includes all the majors people like to make fun of. Surprising everyone, the next largest group I have seen is life sciences, like MCB and people who are pre-med in general. I never really understood why. We still have a good number of engineers/CS folk, but they usually don't stick around. I know of very  few engineers that did RA for 2+ years. I'd have to say business majors are one of the least likely RA candidates. Maybe we are too competitive to let our grades slip a bit? Maybe we are cold and callous to the plight of freshmen? Who[.] to say.\n\n3.) I applied to be an RA for two main reasons. I had a near-useless RA my freshman year, and that sorta screwed with my first year here. I wanted to be better. The second motivation was definitely money. This job is demanding and can really grate on you, but free housing in a city like Berkeley is a savings of around 10k a year. Because of my years as an RA, I graduate with much less debt than I ever thought possible (I'm first gen college student.) I enjoy the job. I like helping people through tough times and creating a fun experience for new Golden Bears. The biggest downsides are time commitments and the bureaucracy of being an RA. You will spend hours doing paperwork and attending pointless meetings. I guess I'm prepared for the business world!"}