{"doc_id": "1392", "name": "2014_05_humanities_student_major_928_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2014-05-humanities-student-major_928_changemyview.txt", "pub_date": "2014-05-13T00:00:00Z", "Sentiment": "0.054", "Subjectivity": "0.379", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "351", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chh8rx3", "Reddit_id": "chhazw0", "Subreddit_id": "t5_2w2s8", "Commenter": "[deleted]", "length": "2083", "content_scrubbed": "You said this: \n\n If you can point to a time when history and creative writing majors were rolling in cash and then a downturn hit and the market became saturated, I'll pay off your student loans.\n\nSo I indicated a time when it made economic sense to major in these subjects before market conditions changed.  I answered your question.  \n\nAnd remember that the amount that someone is paid isn't contingent on the value added by that person: it[.] determined by supply and demand forces.  If the number of engineers graduating from college doubled in 2015 (or if we altered H1B visa restrictions to allow more foreign engineers in to glut the labor market), engineering salaries would plummet even if each individual engineer added as much value as before.  Lawyers ten years ago were not more productive than lawyers today; it[.] just that today there are fewer law jobs so lawyer salaries have fallen.  If we had a better labor market, there would be more entry positions for liberal_arts majors which would pay livable salaries.  And if we could have this labor market if we paid people in general higher wages, which would goose domestic demand, increase GDP growth and tighten the labor market..\n\nI mean, if someone has $200,000 in debt for a BA in jazz guitar and is unemployed then he/she probably made a bad choice.  But the relevant information here is that s/he had self-finance a college degree (which most people in the western world do not have to do) and encountered a labor market that simply isn't producing enough middle-class jobs for everyone to create higher levels of sustainable consumer demand.\n\nI generally agree that you need a good plan if you major in a humanities subject right now, but chortling at the indebted people with less salable degrees and their individual decisions instead of focusing on the overarching economic problems which are responsible for these situations and are hurting everyone is just myopic.  It[.] dumb.  It won't solve any problems.\n\nAnd ignoring fundamental economic problems is how we got into this recession in the first place.\n"}