{"doc_id": "1425", "name": "2014_05_humanities_student_major_1184_teachers", "namespace": "we1sv2.0", "metapath": "", "pub": "Teachers", "title": "2014-05-humanities-student-major_1184_Teachers.txt", "pub_date": "2014-05-18T00:00:00Z", "Sentiment": "0.138", "Subjectivity": "0.458", "Score": "25", "Upvotes": "25", "Downvotes": "0", "Wordcount": "1060", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25vf3z", "Reddit_id": "chl4jyq", "Subreddit_id": "t5_2qqcs", "Commenter": "souverianwerewe", "length": "5726", "content_scrubbed": "First of all, congrats! Landing a social science job in CA in this market is a huge accomplishment, starting your first year will be exciting :)\n\nOkay now, to get a bit negative. Sorry but just want to give you an honest heads up. I worked for a charter high school for three years and was part of the hiring team since I was department chair for the last two I was there. Every charter school is different, but I can tell you as a general rule: new teachers are in no position to negotiate contracts or salaries and doing so will either have your position rescinded or lead to resentment from admin which  in turn will make your first year difficult. Sorry to be the bearer of bad news but I want to be upfront and honest. Charters are not teacher friendly and as a first year teacher, you have to tread carefully before you get a feel of the school and earn your stripes.\n\nObviously every charter school is different and admin team is different, your organization could be super cool and regularly negotiate contracts all the time. However I wouldn't count on it, charter schools are a business and teachers are viewed as commodities; especially for humanities positions, there are a lot of people vying for your position and I'm not saying you aren't valuable or wonderful, but they don't know that yet. You haven't proven how integral you are to their mission and therefore, you have very little to negotiate with.\n\nThat does mean you can't make sure you don't get steamrolled. Talk to their HR (if they have one) and ask for a salary schedule. Most places have it but they're not published. If they don't, take the salary schedule for a nearby district and use that as a discussion tool. Don't think of this as a negotiation but as a puzzled oh I'd like to clarify the salary, you can explain why it[.] this much. Forcing the higher ups to detail WHY they give you the salary they give you and have them explain the steps up with experience makes you look smart, not hostile. You can ask questions like what happens if you go back to school for professional development, how many credits do you need to move up the steps? Take detailed notes but don't fight, just listen and question. Honestly, the fight comes later and picking a battle now will sabotage you long_term, and I'll explain why. Admin and co-workers are catty and if they hear you asked for a higher salary than them, automatically you're in their cross-hairs. Your classroom observations will be more frequent, your struggles more obvious and expectations will be higher. Unless you're 100% confident you're going to be super successful out the gate (which I'm sure you are but first year teaching is hard so prepare to struggle, we all did), it[.] best to play nice with the team while you get your feet wet. \n\nAfter your first year, see where your place is on the totem pole. Did you kick ass in class your first year? Did you involve yourself in a variety of team positions? All in all, did you prove that you're an amazing teacher, a helpful team player and important to the school? Are you buddy buddy with admin? Now you negotiate because you have a better understanding of your boss, the school and the staff.\n\nIt[.] all politics and you have to emotionally prepare yourself to play. In the beginning, don't look to be a bump in the road or someone who will cause them any trouble. You're too green and too vulnerable, in their eyes you literally have nothing to offer and everything to prove. Once you proved yourself, gained allies and have scoped out enemy lines, you can battle harder and have a higher chance of winning. \n\nAlso don't think salary is the only thing to negotiate, often times budgets are tight and a quantifiable number like salary is more obvious. You might have multiple preps, large classes, dated textbooks, no technology, meetings every other day, yard duty, etc. basically a lot of crappy little things that make teaching difficult or your job more burdensome. I'm not trying to brag but just to give you a point of reference, my last year I negotiated a 100% pay contract for only a 60% teaching load, I didn't have duty, and I had a simplified home room curriculum and had permission to pick my students. This is because I was willing to give up a classroom, teach multiple preps with after school tutoring, was school data lead and department chair and counseled kids for college. I also got a class set of iPads since I ask for a split on a grant pretty quickly. This made my job easier and even though I was being paid the same as the teacher down the hall, my job was more bearable (at least for me, the things I did I didn't mind as much as a full teaching load). I talked to my principal at the end of every year to adjust my job description to suit my own needs and I was only able to do that because I got chummy with admin and because they knew to replace my job they'd have to hire three people. But coming in my first year? I had no say. But just to let you know, I got so much shit from other teachers it was ridiculous. I wasn't even paid more and I was doing more and they could only complain about how I had iPads and they didn't or that I only taught 3 periods. I get it, it doesn't look fair, but by that time I had a tiny bit of seniority (the longest a teacher lasted at this school was 4 years, so my 3 was very respectable) to hide behind. \n\n**TL;DR** Clarify your salary for the upcoming year but don't rock the boat, it[.] just going to be breed difficulty and resentment. Do a good job, get on good terms with your admin team and at the end of your 2nd year, see where you stand and then negotiate. Don't just factor in salary but also how to adjust the job description to make it easier on your life."}