{"doc_id": "1489", "name": "2014_05_humanities_student_major_1834_circlebroke", "namespace": "we1sv2.0", "metapath": "", "pub": "circlebroke", "title": "2014-05-humanities-student-major_1834_circlebroke.txt", "pub_date": "2014-05-29T00:00:00Z", "Sentiment": "-0.073", "Subjectivity": "0.541", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "331", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chtk0tk", "Reddit_id": "chtxgbc", "Subreddit_id": "t5_2tnz9", "Commenter": "OneTimeIsAll", "length": "1844", "content_scrubbed": "Don't sweat over it dude. Everyone commenting shit like this is clearly jealous and insecure. That[.] why they post this kind of stuff. I'm going into a STEM degree, it[.] what I love doing. Why has it been labelled as \"wrong\" just because a few people let it get to their heads? All of my friends doing STEM/Science degrees are very well rounded and nice people in general. There are a few shitheads, but you can't base judgment over an entire group of people because one STEM guy said your major was useless once. \n\nThe very fact that this image was posted here shows just how sad and jealous these guys really are. They are doing **exactly** what \"STEMlords\" supposedly do. They're putting themselves on a pedestal, talking about how shit they think your degree is and insulting you for no apparent reason. Not to mention the fact that in the image the liberal_arts student goes on about how well rounded they are, and how they get the girls. Sorry, how fucking low-lifed do you have to be to post that online? They're so insecure and jealous of STEM/Science students that they have to sit and make comments and pictures all day about how \"STEMlords\" are Satan[.] minions and liberal_arts students are going to be making 10x the bank of STEM students all while getting the girls etc. They're basically making themselves look like their own hero and depicting anyone who does anything to do with Science or Maths/Technology as a no-life retard who is angry and smells.\n\nIt[.] just attaching a name to a trait. I could do it easily, I could simply say \"all liberal_arts students are rapists with genital warts\", paint a picture of it and post it here. Then everyone would flip their shit trying to disprove the stereotype I just drafted out of thin air. \n\nDon't let this shit get to you, everyone here is just jealous and too insecure to admit it."}