{"doc_id": "1317", "name": "2014_05_humanities_student_major_249_politicaldiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "PoliticalDiscussion", "title": "2014-05-humanities-student-major_249_PoliticalDiscussion.txt", "pub_date": "2014-05-04T00:00:00Z", "Sentiment": "0.083", "Subjectivity": "0.332", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "533", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_ch9tqwh", "Reddit_id": "ch9u26g", "Subreddit_id": "t5_2sfmf", "Commenter": "caesarfecit", "length": "3286", "content_scrubbed": " That was clearly not their point: clearly, things other than math and science have value. The balance between MST and humanities favored by corporate interests is skewed far in the direction of MST. Ideally, everyone would get more of everything but the share of educational resources devoted towards MST would still increase. Whether they have any intellectual value outside employment is irrelevant: there are things that the humanities teach that are vital important that you can never get from MST courses.\n\nHere[.] my answer, in part:\n \"I must study politics and war that my sons may have liberty to study mathematics and philosophy. My sons ought to study mathematics and philosophy, geography, natural history, naval architecture, navigation, commerce, and agriculture, in order to give their children a right to study painting, poetry, music, architecture, statuary, tapestry, and porcelain.\"\n-- John Adams\n\nWhat subjects we study is a function of our educational goals (i. e. what we plan to do with our education). Corporations do not dictate what people choose to study, nor what universities offer. Some degrees simply have more value in the labor market than others. The humanities may have real value, but they don't have to be studied in a university, in order to be learned. The argument that people are not getting enough liberal_arts in their education sounds more and more like butthurt liberal_arts profs are having trouble justifying why they should get tenure, when they don't publish anything of value, and nobody is taking their classes. \n\n That[.] half the story at best: declining public funding creates no counterweight for widely available government subsidized loans.\n\nElaborate on that please.\n\n When public institutions cost less upfront and provide comparable educational services private institutions have to lower their prices to compete.\n\nThe reason why private insititutions can charge such a premium is because they don't offer comparable educational services, either in reputation or fact. So you won't be seeing them lowering their prices to compete with public institutions anytime soon. \n\n The entire thing is a massive bubble waiting to pop, but the reason you don't see substantive policy changes is, for better or worse, because there[.] no political will to fix the issue. Student loans create willing employees — that much is common sense.\n\nNo argument. I've been saying for years the student loan bubble will pop and it will be ugly. If anything, we should stop making it bigger. But that will never happen. \n\n That[.] more a question of economic history. Real wages have been stagnant for the past thirty years and real compensation has grown by a marginal amount. Productivity has skyrocketed in the same period but the income and wealth gains have gone disproportionately to the already wealthy. It[.] not true to say that prices have generally grown in excess of income but productivity has grown while income has not grown at anything approaching a similar pace, by any metric.\n\nWages don't track to productivity. They work by supply and demand. You seem smart enough to know this. Why we should distort the market, just so McJobbers can have a few extra bucks (the ones that don't get laid off at least). Either way, this is a diversion. "}