{"doc_id": "1368", "name": "2014_05_humanities_student_major_773_circlebroke", "namespace": "we1sv2.0", "metapath": "", "pub": "circlebroke", "title": "2014-05-humanities-student-major_773_circlebroke.txt", "pub_date": "2014-05-11T00:00:00Z", "Sentiment": "0.046", "Subjectivity": "0.435", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "246", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25b8qm", "Reddit_id": "chfii28", "Subreddit_id": "t5_2tnz9", "Commenter": "[deleted]", "length": "1477", "content_scrubbed": "The weathered fisherman of the harsh seas of reddit, Jamie dean, shows us another hugeass haul from the treacherous waters of /r/askphilosophy. I think he just loves his job, which may explain why he doesn't ask to be paid or maybe he is just too BETAHAMSTERINGMANGINA.\n\n I didn't scoff, nor did I say philosophy wasn't exact. I said all philosophy is bare opinion. And it[.] true. Philosophy is an important discipline, just like literature is. But philosophy and literature have more in common than philosophy and physics. Physics is evidence based, while philosophy is creative and not evidence based.\n\nAs if creativity is to be confused with subjectivity or that evidence is in opposition to creativity! Philosophy is indeed a creative discipline but that doesn't mean your idiotic beliefs are as valuable as the truth.  \n\n  I've been having to read a lot of philosophy in my first year of grad school (lit.) and the majority of it boils down to \"here[.] a really simple, straight-forward argument you already agree with or at least can appreciate told in the most long-winded, complex, untranslatable gobble-de-gook.\" The nicest way I can say it: philosophy isn't a science, it[.] an art.\n\nWell I could agree with him if that was a summation of the philosophy of religion and apologetics. Also, notice how contemptuous he is of art and the humanities; willing to dismiss it all without argument, only with assertion - this idiot is anti-intellectual at heart. STEM jerk 101. "}