{"doc_id": "1299", "name": "2014_05_humanities_student_major_51_rosehulman", "namespace": "we1sv2.0", "metapath": "", "pub": "rosehulman", "title": "2014-05-humanities-student-major_51_rosehulman.txt", "pub_date": "2014-05-01T00:00:00Z", "Sentiment": "0.161", "Subjectivity": "0.33", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "320", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24fm0c", "Reddit_id": "ch71cos", "Subreddit_id": "t5_2s3z6", "Commenter": "80b", "length": "1735", "content_scrubbed": "My experience is more than a few years old, but I would recommend taking it. I imagine my siblings, who also took FTC, would recommend the same.\n\nIt is the full year of calculus in 5 weeks, it is a lot of work. I always made sure to take off Friday evening, but for the most part the rest of my time was working on homework or being in class.\n\nThere are huge benefits.\n\n* Calculus is required for everyone and was (is?) a 5 day per week course. I think it was mostly taught in the morning, but I remember it always being a pain for my friends to fit in their schedule.\n* You will be free to get a jump start on other Math classes - I ended up taking differential equations and discrete & combinatorial algebra throughout my freshman year. My freshman schedule had so many more interesting classes than did my non-FTC friends.\n* It had the benefits of opening up more classes because of pre-reqs. I graduated with a double major*, were I not on scholarship (and interested in taking more electives), I could have easily graduated 2 terms early without much effort (I actually had to choose to not take a humanities course, so that I wouldn't accidentally graduate).\n* It doubled as an intensive course in Maple (mathematics software, not sure if Maple is still the program of choice).\n* You make friends and get to know the campus before everyone else.\n* war stories?\n\nIf they have accepted you and think you can do it, I recommend going for it.\n\n\\* Edit/Caveat: My double major was CS and Math, so there was a fair amount of overlap already (you couldn't minor in Math if you were getting a CS major because it was already built into the CS major requirements). This may not be reproducible with all combinations of double majors. "}