{"doc_id": "1488", "name": "2014_05_humanities_student_major_1829_germany", "namespace": "we1sv2.0", "metapath": "", "pub": "germany", "title": "2014-05-humanities-student-major_1829_germany.txt", "pub_date": "2014-05-29T00:00:00Z", "Sentiment": "0.133", "Subjectivity": "0.328", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "379", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26ro10", "Reddit_id": "chtw0z3", "Subreddit_id": "t5_2qi4z", "Commenter": "geierseier", "length": "2174", "content_scrubbed": "I have a few places for you in mind. When you say \"living inside the city\", are we talking about +1. 000. 000 in population? Because you can have two of those at the same time, if you have a little time for commutes.\n\nThe lower rhine area with Dusseldorf and Koln. Dusseldorf to the north is just under a million people, but both cities are a huge deal in everything that is A) culture: the concert scene, rich history, folklore, party, the arts... etc. B) employment, as a few people here mentioned is best in densely populated areas. And the big C) Housing. Pick any decent sized city between the two and see the rent for nicely sized apartments drop significantly. \n\nThey are just 40km apart and supremely well connected, infrastructure-wise. Public transport takes 25 minutes if you catch the_right train and other lines connect the smaller cities in between. Both can be packed at rush hour, but I'm pretty sure the german railways (DB, Deutsche Bahn) is frequently cited as europes most dense and punctual railway transport system. Hell, you can even ride your bike in between them, takes about 2,5 hours if you don't mind a little sweat. The cities themselves sport the most efficient and dense public transport in europe.\nWant to save time and not die in the hellish urban traffic sprawl? The municipal roads are surprisingly pleasant to drive and far more stress-free than the Autobahn at rush hour. It is really just driving in a straight line and then finding a place to switch to public transport. \n\nBoth cities have high ratings in overall quality of life and are chock-full of students, which makes for a very alive and vibrant urban landscape. Two top universities, the diverse job market that comes with it, and the demographic makes the lower rhine my favourite place to live. \n\nSo, if you rank cheap housing before proximity to the population center, go for Neuss, Dormagen, really any place next to the river and do a quick check where the next train station is. Or just dive straight into some of the coolest places in germany and go for the inner cities. Anywhere, really, because seriously public transport is  *all over the place*. Be sure to update us!"}