{"doc_id": "1476", "name": "2014_05_humanities_student_major_1661_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2014-05-humanities-student-major_1661_news.txt", "pub_date": "2014-05-26T00:00:00Z", "Sentiment": "0.114", "Subjectivity": "0.418", "Score": "130", "Upvotes": "130", "Downvotes": "0", "Wordcount": "273", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26kel6", "Reddit_id": "chrvvh2", "Subreddit_id": "t5_2qh3l", "Commenter": "Hayek_", "length": "1697", "content_scrubbed": "Many college presidents said a rating system like the one being considered at the White House would elevate financial concerns above academic ones and would punish schools with liberal_arts programs and large numbers of students who major in programs like theater arts, social work or education, disciplines that do not typically lead to lucrative jobs.\n\nWhich is the point—it[.] a huge problem when students shell out tens of thousands of dollars for unremunerative degrees. This would simply give us a better understanding of how bad the problem actually is. \n\nIf that[.] where your money comes from (i. e., consistently raising tuition, getting fat from student loans and milking parents) you've got a problem when your information asymmetry goes away. \n\nPlenty of \"marketable\" programs have much to fear, too. Heck, plenty of graduate programs, even at reputable schools **don't even keep track of their graduates**. \n\nLaw schools are one example. How is it that a field—centered around information and justice—doesn't even provide much in the way of stats on its graduating students or justification for its costs? It took bloggers to put pressure on law schools to become more transparent, and they're still fighting tooth and nail. \n\nOver the past couple decades, higher ed has taken the attitude of: \"Has your last check cleared? Great, here[.] the door and your sheepskin; be sure to join the alumni association and give us money in donations.\"\n\nAt first I hated the idea, but it[.] definitely grown on me. Make these administrators squirm for selling what often amount to expensive credentials. They'll just hide behind the \"life of the mind\" and making \"informed citizens\" nonsense as usual."}