{"doc_id": "1320", "name": "2014_05_humanities_student_major_286_theatre", "namespace": "we1sv2.0", "metapath": "", "pub": "Theatre", "title": "2014-05-humanities-student-major_286_Theatre.txt", "pub_date": "2014-05-05T00:00:00Z", "Sentiment": "0.049", "Subjectivity": "0.321", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "350", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cha1c74", "Reddit_id": "cha4r7y", "Subreddit_id": "t5_2quc9", "Commenter": "spchina", "length": "1997", "content_scrubbed": "If that guy on the softball team was getting paid to play, yes. that[.] unprofessional.  He[.] also being inconsiderate and a jerk, but that[.] still unprofessional behavior.  As a guy getting paid for this, there are probably stipulations and clauses in his contract that would make it super difficult to fire him.  If that same guy was on a community team, he[.] still unprofessional.  The default argument in this scenario is 'but i'm not getting paid for it'.  You may not be a 'professional' and getting paid to do this, but you still are bound to a professional code of morals and standards.  \n\nNot everyone is in a profession for the money.  Especially when you're talking about the arts.  I think that your take on 'professionalism' is entirely skewed towards those college students and community theatre folks.    \n\nBut no matter where you are, there are standards that need to be applied... \"Professional standards.\"  Especially when it comes to safety standards and backstage/technical practices.  There is a reason the pros do it they way they do.  They've been at it much longer than say a college student has.  So in reference to the little boy backstage, whether or not it[.] a paid gig, he should be held to the same standards as if he were paid.  Money should not be that essential a driving factor in the arts, that[.] when it stops being fun. \n\nBut besides that, the incentive in acting is for the love of it.  So many actors, famous and otherwise, who do it for a living have commented on how lucky they are to get to do what they love, while getting paid for it.    \n\nWithout the pay incentive, \"professional\" as it is used is to refer to a set of standards that were set by the true professionals.  Now, that doesn't mean that you have to do it this way to be correct, that[.] the beauty of theatre.  No two productions of *Annie* are going to be the exact same.  But both productions will likely respond to the same backstage etiquette, stage manager[.] calls, actor etiquette, etc."}