{"doc_id": "1343", "name": "2014_05_humanities_student_major_569_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2014-05-humanities-student-major_569_explainlikeimfive.txt", "pub_date": "2014-05-08T00:00:00Z", "Sentiment": "0.04", "Subjectivity": "0.284", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "471", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chckr1y", "Reddit_id": "chcosxs", "Subreddit_id": "t5_2sokd", "Commenter": "Reganato", "length": "2624", "content_scrubbed": "Almost nobody, white or blue collar, is making that kind of money anymore.  These discussions are a bit depressing, they always turn into shouting matches between carpenters and people with their BA in BA.\n\nThe question is a loaded question in general, but leave it to the mods of ELI5, one of the most poorly moderated subs on reddit, to let that one whoosh right by them.\n\nAnyway, labor is not frowned upon in the US.  That[.] a stupid way to ask the question.  Lots of people don't want to do it for lots of very good reasons.  Maybe you don't like showing up to work at 7 am.  I work very hard and get lots done, but I do it between 9 and 5, some people do it between 7 and 3.  Some people don't like working in the elements because it causes physical discomfort.  I'm fairly confident that the discomfort some people would feel doing construction on a hot day is roughly equivalent to the discomfort some people would feel doing math under fluorescent lights in a climate controlled room.  Some people think (or formerly thought) that getting a degree was their ticket up and out of their class or position in life.  Some people just really like doing math, some people really like fitting pipes.  Some people just did what their parents wanted them to, and some people rebeled.\n\nIn short, nobody can see into the future and chances are you're just going to get screwed no matter what you pick, but the only professions that are really frowned upon in the US at this point are fast food, retail, and janitorial staff.  Cue the troll janitor redditor.  \n\nAnyway, Blacken11, if you're fishing for advice, and it seems like you might be, here[.] mine:  Do decide to either 1. Get an apprenticeship, 2.  Go to a community college to learn a skilled trade, 3.  Go to an affordable state university in the state you live in and major in something super practical like applied math, education, or something with a defined career path and certification program.  Do NOT 1.  Go to any vocational school (Vaterot, ITT Tech - half of them are under investigation for financial aid fraud.), 2.  Go to a community college to \"take your gen-eds\" before going to a 4 year university, 3.  Become a fast food or retail worker and assume that is going to be your job forever or that future employers will care about that experience, and 4.  Do not get a degree in communications, social work, liberal_arts, business administration, art history, history, ... 5.  Get a master[.] or PhD in anything really - if an employer wants you to have that degree make them pay for it, having It when you go into the market takes away all your leverage."}