{"doc_id": "1471", "name": "2014_05_humanities_student_major_1601_lostgeneration", "namespace": "we1sv2.0", "metapath": "", "pub": "lostgeneration", "title": "2014-05-humanities-student-major_1601_lostgeneration.txt", "pub_date": "2014-05-25T00:00:00Z", "Sentiment": "0.113", "Subjectivity": "0.542", "Score": "20", "Upvotes": "20", "Downvotes": "0", "Wordcount": "362", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26g2cl", "Reddit_id": "chqt5aw", "Subreddit_id": "t5_2r40j", "Commenter": "LWRellim", "length": "2190", "content_scrubbed": "I was going to protest that this statement:\n\n\"Warning: This place exists to **enforce** class distinctions.\" [emphasis added]\n\nWas going a bit far... I was *going to argue* that -- while certainly Ivy-League Universities and the Prep-School & Fraternity system **enable and even facilitate** the separation of an upper-class \"elite\" -- to say that they **enforce** such class distinctions...\n\nBut then I kept reading...\n\nAnd quite frankly the author makes a good case here:\n\nThis **power over admission** to the bourgeoisie is the reason why tuition goes up constantly even as the university successfully transforms professors into low-wage freelancers (the subject of last week[.] column)—because what those professors teach doesn't matter. This is also why people who fake their college degrees often lead long and successful corporate lives without being detected—because the stuff you actually learn to get a liberal_arts degree isn't important in the corporate world. **Only the diploma** *[i. e. the \"Ivy League Brand\" and the associated Alumni network]* **itself has real meaning** in the marketplace, and only the marketplace has real meaning in America. This is a situation that clearly requires highly visible warnings, and lots of them.\n\nThe place I think he goes slightly awry is that THAT really isn't a \"marketplace\" -- rather it is a sign of an \"old boys club\".\n\nMoreover, what he doesn't really talk about is that the Ivy League degree -- in and of itself -- is not some \"silver bullet\"... there are still \"cliques within cliques\" within the Ivy League as well (not that an \"outsider\" cannot breach those; serve as a \"yes-man\" or \"puppet\" to TPTB, there is plenty of evidence that CAN be done... but even still {even among those who achieve that and attain \"high office\" or significant wealth} will not necessarily be \"in charge\" {though they may delude themselves and others that they are}).\n\nThe whole point of the latter is that far too many students DO manage to achieve the \"ivy league\" admission... and then take on a huge burden of debt to do so... but ultimately (degree or not) they cannot capitalize on it because they will STILL not be a member of that \"class\"."}