{"doc_id": "1406", "name": "2014_05_humanities_student_major_1068_fit", "namespace": "we1sv2.0", "metapath": "", "pub": "fit", "title": "2014-05-humanities-student-major_1068_fit.txt", "pub_date": "2014-05-15T00:00:00Z", "Sentiment": "0.122", "Subjectivity": "0.344", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "291", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25od5v", "Reddit_id": "chjaddx", "Subreddit_id": "t5_2s2bx", "Commenter": "CyberTractor", "length": "1692", "content_scrubbed": "When comparing FIT to UCF/FSU/UF, you have to realize you are comparing a private university to public universities.  At FIT, depending on your major, you have smaller classes and more opportunities for research.  I will go ahead and tell you that if you are an underachiever or lazy, do not bother coming.  You will be weeded out in the first two years or regret sticking around beyond that.  FIT generally carries merit if you do well, but if you get C[.] or below in a class, it can reflect much more negatively upon you than if you did the same at a public school.\n\nResearch opportunities are generally afforded to students who have a good relation with a professor and/or can get good grades in their classes.  Work study position (which are offered through financial aid) can evolve into college roll (college-paid positions) if you merit the department actually employing you, which can then evolve into graduate research or a GSA position after graduation.  That said, if you don't qualify for financial aid, you may find difficulties acquiring a campus job unless you actually prove yourself to a professor.\n\nOverall, I would suggest going to a public university or a community college for your general education classes (things like humanities and math classes not directly related to your major).  Why bother paying $3000+ for an English class when your local college will offer the same course for a fraction of the price?  If you do well in a community college (and let[.] face it, if you're considering going to FIT you SHOULD do well in a community college), FIT will have no issue with accepting you as a transfer student.\n\nIf you have any further questions, feel free to PM me."}