{"doc_id": "1344", "name": "2014_05_humanities_student_major_571_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2014-05-humanities-student-major_571_AskHistorians.txt", "pub_date": "2014-05-08T00:00:00Z", "Sentiment": "0.078", "Subjectivity": "0.232", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "669", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_251hy1", "Reddit_id": "chcrkih", "Subreddit_id": "t5_2ssp3", "Commenter": "restricteddata", "length": "3691", "content_scrubbed": "Big question. Is Digital Humanities, in its present form, worth a damn? [This essay came out in the New Republic](http://www. newrepublic. com/article/117428/limits-digital-humanities-adam-kirsch) a couple days ago and basically concludes \"no.\" I've been on the fence about this for a long time. Most of what goes under the DH heading seems to be either a) self-referential navel-gazing to no useful end; b) run of the mill digitization projects that happen to be in the humanities; c) network graphs that tell us nothing new; d) maps that tell us nothing new; e) citation or note-taking software; f) massive word or image analyses that by themselves don't tell us much. \n\nOf those I think e) is great but hardly worth calling its own discipline, b) is great  (e. g. JSTOR) but really just about adding more tools to our quiver, and the rest I can kind of leave unless the tools in f) are actually something that can be generalized to new projects and are easy to use (e. g. Google Ngrams, which I find very useful and generative of thought even if it has problems). \n\nI say this not as a luddite, but as a humanities scholar who has been developing websites, databases, and digital tools for over a decade. I very much disagree with Kirsch that the humanities' response to the changes wrought by the digital world should be \"to resist it and to critique it\" — I think we can do so much more than that, and should — but I still have an inherent distrust of anything that calls itself DH, just because DH has been applied carelessly to so many things that it has become overused and empty.\n\nWhat would help me change my mind about this? Riddle me this: Is there any Big Idea or Big Thesis that has come out of DH that satisfies these three conditions: a) seems true, b) was not already known or obvious, c) did not reveal itself except under the lens or tools of DH? I mean, I want some meat here, for all of the money that has been spent on this. I want to know what the payoff is. Has there been a payoff? I have looked high and low and not yet found one. \n\nAs an aside, even though I blog and make simulation maps and do all sorts of other internet things that seem like they might be labeled DH (I am sometimes lumped into this by other people, even though I personally think my map tools are really \"science communication as processed through the concerns of a humanist,\" which is not quite the same thing), the part of my own work that is most throughly \"digital humanities\" in my mind is my boring, print, written scholarship. That is, my articles, my (in process) book. The output here is just plain old text (and maybe one graph!). But that text is born digital — my method of using archives, of dealing with data and metadata, of writing itself, it is all tailored around databases and digital tools that I developed for my projects, and to me the digital mode of construction has very much influenced the manner of the output. (Dumb, obvious example: for any given aspect of a story I am telling, I always find if there was discussion of it or the people involved in any major newspapers. This is obviously enabled by the ProQuest Historical Newspapers database. If that database wasn't there, and full-text searchable, there[.] no way that kind of thing would be worth the time it takes to look into. So I can routinely do something today that would have been time-prohibitive when I was an undergrad and all of this stuff was still just on microfilm. The database is not the DH component — it[.] just a tool — but my practice of using it is the DH component.) But I feel we don't talk about that nearly as much as DH as we do all of the network graphs, pointless maps, etc.\n\nThoughts? "}