{"doc_id": "1490", "name": "2014_05_humanities_student_major_1843_askfeminists", "namespace": "we1sv2.0", "metapath": "", "pub": "AskFeminists", "title": "2014-05-humanities-student-major_1843_AskFeminists.txt", "pub_date": "2014-05-29T00:00:00Z", "Sentiment": "0.08", "Subjectivity": "0.32", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "720", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chtyett", "Reddit_id": "chu0mue", "Subreddit_id": "t5_2sode", "Commenter": "FeministBees", "length": "4790", "content_scrubbed": "The list might not be very good (I haven't read it), but I really hate the claims of:\n\nalmost all of college and university courses are men[.] studies programs.\n\nand:\n\nthe rest of the UN is ostensibly dedicated to men.\n\nYou might hate it, but in a lot of ways, these statements are really quite accurate. Let[.] take them one at a time.\n\nFirst, the claim that almost all college and university programs can be characterized as \"men[.] studies.\" This response, is in part, because the development of women[.] studies programs was prompted by the obvious marginalization of women[.] work and scholarship in higher education and popular culture.\n\nWomen have historically been marginalized from participation in the sciences, and when they do gain access, their work is marginalized or coopted by the male dominated establishment.\n\nThere is a broad history of women being excluded from mathematics and philosophy education, thus outright limiting their ability to contribute to the disciplines. Unless your participating in graduate level mathematics work, you will not learn almost any mathematics that was established by women mathematicians (*sans* Noether for senior level algebra). In a very similar way, philosophy students have to labor long and hard to reach the point where they can begin accessing the scholarship of women philosophers. In the cases where their have been women participating in the loosely tied together history of western philosophy, their contributions have been ignored by the male dominated establishment. This has subsequently produced the state of philosophical history, where there are no women philosophers in the western canon.\n\nThis problem is well characterized within the \"exact\" sciences. In fact, we have an even more robust case here because the participation of women in these fields was demanded by the need for labor. But their contributions were often coopted by men, or dismissed as trivial because all the intellectual work was attributed to men. It wasn't uncommon for women to publish under their husbands name because their work would not be taken seriously (for example Maria Winkelmann, a 18th century German astronomer). Of course, there is also the infamous instance of Rosalind Franklin[.] significant contributions to the study of DNA were erased or dismissed from the writing of Watson and Crick.\n\nOf course, we ought not forget the humanities. Even here, we can see how male dominance permeates these fields. Consider the [Guerrilla Girls](http://guerrillagirls. com/), and their response to the 1984 Museum of Modern Art exhibition \"An International Survey of Recent Painting and Sculpture.\" Of the 169 artists featured, only 13 were women, prompting protest art like [this](http://www. guerrillagirls. com/posters/1985thesegalleries. shtml) and [this](http://www. guerrillagirls. com/posters/1986reportcard. shtml). Or take a look at the speech of UT literature professor David Gilmour, who states quite unironically,\n\nI'm not interested in teaching books by women.... Except for Virginia Woolf.... I say I don't love women writers enough to teach them, if you want women writers go down the hall. What I teach is guys. Serious heterosexual guys. F. Scott Fitzgerald, Chekhov, Tolstoy. Real guy-guys. Henry Miller. Philip Roth.\n\nLol, I suppose when you're a white heterosexual man, it[.] easy to disqualify well over half the population from \"serious\" consideration. And don't simply take this as a isolated account, because you can look around and see this kind of sentiment reflected in major pieces of humanities writing. Harold Bloom, Yale Professor and \"[probably the most celebrated literary critic in the U_S](http://www. theguardian. com/books/2002/oct/12/featuresreviews. guardianreview14),\" wrote *The Western Canon: The Books and School of the Ages* as a defense against the addition of work by women and people of color by feminist, historicist, African American Studies and marxist scholars. Bloom explicitly affirms the idea that those authors who are most worthwhile of filling the western canon are almost exclusively white men.\n\nNow, of course, many people often respond: \"Well, wait up there *Bees*, these disciplines may be dominated by men, but that has no baring on the knowledge produced by these scholars, especially scientific knowledge.\" However, this rebuttal is incorrect. The fact is, whether your contemplating philosophy of *love*  or engaging primatology field research, the dominance of male heterosexuality constitutes the matrix of knowledge in the humanities and sciences. Despite the many instances of women contributing significantly to the arts and sciences, the legitimacy of their work is predicated on the gender politics of their peers and the heterosexual, male dominance of disciplined knowledge."}