{"doc_id": "1296", "name": "2014_05_humanities_student_major_38_truegaming", "namespace": "we1sv2.0", "metapath": "", "pub": "truegaming", "title": "2014-05-humanities-student-major_38_truegaming.txt", "pub_date": "2014-05-01T00:00:00Z", "Sentiment": "0.072", "Subjectivity": "0.371", "Score": "116", "Upvotes": "116", "Downvotes": "0", "Wordcount": "724", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24ggwz", "Reddit_id": "ch6x79w", "Subreddit_id": "t5_2sgq6", "Commenter": "Proditus", "length": "4202", "content_scrubbed": "In the film world, you will find that most of the really big studios have \"Art House\" subsidiaries (Sony Pictures Classics for Sony, Fox Searchlight for Fox, Focus Features for Universal, etc). These are branches of the big studios that allow smaller ventures to make films with a bit more production (but not financial) independence. \n\nYou'll see a lot of the \"big name\" indie films published under these sorts of venues. However, you'll find that most indie filmmaking is still done outside of this spectrum. Almost nonexistent budget, no famous actors, probably written, directed, and filmed by one dude, etc. \n\nWhat these Art House branches serve to do is essentially bridge the indie world and the high budget world and allow some transitioning and interactivity between them. When an indie film maker becomes popular, the Art Houses allow them to try making bigger budgeted movies with their vision, maybe with some famous names attached and guaranteed broader publishing. Likewise, big name content producers might have an idea that they know no major studio would take up, so they move to an Art House publisher to make their vision without too much publisher involvement, but not as much support.\n\nThis ends up creating some golden opportunities for content creators who have great visions but lack the means. Most of the Best Picture nominees at the Academy Awards each year come from these sorts of origins, and directors who are famous for their \"indie\" style (like Wes Anderson) work almost exclusively in these operations.\n\n~~Now, what does all of this mean for gaming? Well, when you boot up Child of Light, the first publisher splash screen shown is \"UbiArt\". This is unmistakably related to Ubisoft, which is then shown about 2 seconds later, but nonetheless they choose to have two different brands presented as separate. Ubisoft is implying that UbiArt is a different sort of entity with its own criteria of gaming.~~ Apparently UbiArt is just a game engine. Tragic, my argument is less valid now. But anyways, I'll leave the rest up to read, because I still like the idea.\n\n***\n\nWe can also look at the production and origins of Child of Light. It has a big name behind its production, but it was given a smaller budget and work force to create the game. The sort of game that the director wanted to make when not restricted to a popular franchise. What we're left with is a high-quality indie \"style\" sort of game, but it is still attached to a big publisher, and developed internally by said publisher.\n\nTo me, this looks like an accurate parallel to the Art House branches of publishers that developed in the film industry. A larger publisher making a separate brand of itself to promote smaller, near-indie works in order to participate more in the artsy sort of market. \n\nOverall, I think this is a positive change for the industry as a whole, as it allows more opportunities for content creators to make what they want under a stronger safety net. The only problem is that game makers don't have as much horizontal movement opportunity as the film industry provides. If you work for Ubisoft, you're restricted to what they provide. If a big developer at 2K wants to make a smaller title but 2K doesn't provide an equivalent venture, you're stuck unless you suddenly decide you want to work for Ubisoft and quit your 2K job.\n\nI think studios like Obsidian, who bounce back and forth between publishers but earn large names for themselves for the work they do, will become more popular in the future as the current indie movement reaches a solid plateau. There are a lot of very rich indie devs out there now who aren't ready to really sell out for a single publisher yet. They'll acquire reputations, come to various publishers for financial and IP opportunities, make a single title, and move on. Likewise, if a publisher has a game franchise they want to keep offering but don't want to waste resources creating a new internal studio for this one title, it will be easier to approach an indie studio and give them the assets necessary to provide it.\n\nI'm liking this change at least, and it will be interesting to see if other studios start following a similar sort of trend."}