{"doc_id": "1396", "name": "2014_05_humanities_student_major_979_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2014-05-humanities-student-major_979_AskAcademia.txt", "pub_date": "2014-05-14T00:00:00Z", "Sentiment": "0.162", "Subjectivity": "0.339", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "249", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25igsf", "Reddit_id": "chhv5hf", "Subreddit_id": "t5_2sakj", "Commenter": "[deleted]", "length": "1581", "content_scrubbed": "First, I'd welcome /u/SnowblindAlbino to contribute here since they have been doing this for a long time and always provides excellent contributions.\n\nThere are jobs in the humanities, and people are getting jobs. We placed well this year. We're also a top-3 program in the field. You'll note that a lot of the people who obtain good postdocs or TT positions tend to graduate from the top programs. By no means is it a guarantee that graduating from a top program assures you a job, but there are clear advantages (proximity to big-name faculty, ample resources, networking...). I made a bargain with myself: I'd pursue my ambition of a tenured life IFF I managed to get into a top-tier program. I'd urge you to do likewise.\n\nPhilosophy and History are both exciting fields. Both offer options for non-tenure-track employment that also call upon your specialized training (archives, museums, major libraries, academic libraries, various institutes, etc.). The financial analysis company Morningstar is famous for hiring Philosophy people. \n\nRead [this](http://philosophy. uchicago. edu/prospective/admissions. html) closely. It is an excellent overview of admissions processes at top departments like the one at Chicago. You may expect similar treatment at History departments.\n\nLast point about further debt. A good PhD program likely won't leave you with any debt. I have a very decent funding package. My wife also works so we have nothing to complain about. However, were I doing this alone, I still wouldn't have to accrue debt unless I ended up taking unusually long to defend. "}