{"doc_id": "1438", "name": "2014_05_humanities_student_major_1290_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2014-05-humanities-student-major_1290_news.txt", "pub_date": "2014-05-20T00:00:00Z", "Sentiment": "0.11", "Subjectivity": "0.364", "Score": "68", "Upvotes": "68", "Downvotes": "0", "Wordcount": "253", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chmk7d4", "Reddit_id": "chmoa81", "Subreddit_id": "t5_2qh3l", "Commenter": "j_ly", "length": "1471", "content_scrubbed": "Yes, but finish the thought.\n\nOur federal government makes student loan money cheap and easy to get for pretty much everyone, and pretty much everyone is taught that they \"need to\" take out student loans because they \"need to\" go to college.\n\nIf student loans were made available by the free market you'd see student loan rates fluctuate based on the type of degree you wanted to pursue, your grades, and the institute of higher learning you attend.  A \"C\" student pursuing a humanities degree from the University of Pheonix would be considered a \"high risk\" for repayment, and the interest rate for the loan would jump to an unGodly high amount... which would in theory discourage one from burying oneself in debt just to obtain a humanities degree from the University of Phoenix.  That same student might be able to get a relatively inexpensive loan to go to auto mechanic school with a solid record of job placement (for example) because the risk for repayment would be lower.\n\nBut with pretty much everyone going to school on the same comparatively cheap student loan rate pursuing careers that won't repay the debt in a timely manner... universities have truck loads of money to spend, so why not spend it on presidents and administration staff that will work to bring in more students with student loan money to spend?\n\nTL;DR:  Our government fucks a lot of shit up... including student loans.  The next \"bubble\" to burst in this country is the student loan bubble."}