{"doc_id": "1384", "name": "2014_05_humanities_student_major_898_elpaso", "namespace": "we1sv2.0", "metapath": "", "pub": "ElPaso", "title": "2014-05-humanities-student-major_898_ElPaso.txt", "pub_date": "2014-05-13T00:00:00Z", "Sentiment": "0.025", "Subjectivity": "0.222", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "306", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25f0s8", "Reddit_id": "chgxw7c", "Subreddit_id": "t5_2rp61", "Commenter": "perdit", "length": "1774", "content_scrubbed": "Try the [Osher Lifelong Learning Institute](http://www. olliatutep. org/home. html) at UTEP.  I don't think enough people know about this program. The classes are free or at an extra low cost. My mother-in-law LOVES the one she goes to in California. She attends the Shakespeare and play-reading classes and has lots of friends. She hangs out with some of her fellow students after class- I think they go to a Panera for coffee and there[.] at least one other student she[.] always going to plays with. I only mention it because I imagine that[.] the kind of social life your mom could have if she started going to the senior classes they offer here.\n \nI was looking at the website for the senior college here and they have some art and literature classes. Since she[.] a crafter, maybe she'd like some of the arts classes. You'll probably find Spanish speakers in the repujado class (punched tin pieces, $20 for 12 sessions on Mondays).  There[.] also a Don Quijote class if she likes to read and another one that sounds like its about the history of Mexico in this and previous centuries.\n\nAlternatively, if she[.] into being artistic I am teaching two classes at the end of the month. I come home to El Paso periodically for family reasons.  While I'm here I teach art classes. I'm actually in a Starbucks in the Northeast working on the fliers I'm gonna post around town.\n\nThe afternoon class is covers portraiture, Mon-Fri (May 26-30) from 1-4pm. It[.] an advanced class, so far the students are mainly English speakers but I speak Spanish. $75 for the week.\n\nAnd the evening class covers drawing from live models, Mon-Fri (May 26-30) from 7-10pm. $10 a session.  This class if more for beginners and about half the people who came to my last workshop were Spanish speakers.\n  \n\n"}