{"doc_id": "1345", "name": "2014_05_humanities_student_major_580_neu", "namespace": "we1sv2.0", "metapath": "", "pub": "NEU", "title": "2014-05-humanities-student-major_580_NEU.txt", "pub_date": "2014-05-08T00:00:00Z", "Sentiment": "0.139", "Subjectivity": "0.343", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "603", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_251x8j", "Reddit_id": "chcvcu6", "Subreddit_id": "t5_2r47x", "Commenter": "KingsRaven", "length": "3224", "content_scrubbed": "I would be the buddy in question: I just finished up the Masters in Criminal Justice at NEU and, despite some difficulties, I had a blast doing it.  \n  \nIn terms of the demographics, I can say that it was a relatively diverse group of people. I actually had the opposite concern that you did, given that I was one of maybe two other members of my cohort that actually worked, much less had full time jobs. Despite that, I managed to come out at the end with a pretty large group of new friends, from a bunch of different backgrounds, both on the PhD and Masters level. In terms of making friends and hanging out with people, it[.] the same strategies you used in undergrad. Just be friendly and outgoing, try to talk to new people as much as you can, etc. There are a couple of the core classes that have group projects, so even if you're not the most sociable of people you'll be able to get to know at least 4 or 5 other people.  \n  \nIn terms of the program itself, it all depends on what you want to get out of it. Since you're not working full time (I assume at least, based on your post) then you'll probably get a lot more out of it than I did. I didn't have the luxury of taking several of the classes that I wanted, simply because they started anywhere from 1PM to 3PM in the afternoon, while I was still at work. You'll have a lot of the more specialized classes, like Psychology and the Law, and Biological Theories of Crime open to you, which I didn't.  \n  \nThere is a bit of advice that I can offer you, regarding professors and the like, but I'd rather not just toss out names. If you'd like, you can PM me and I can give you a list of professors that are awesome, as well as a much shorter list of professors you might want to avoid. Generally speaking, the faculty at Northeastern is awesome. They're there to help you, and pass on what they've learned to the next generation of policymakers, federal law enforcement, researchers, etc. There are two though that I can think of off the top of my head that are definitely not there for that reason at all, and I'd be happy to let you know which ones those are if you'd like.  \n  \nA bit more about the course offerings. Talk to Laurie Mastone, the graduate advisor, about taking classes outside of the Crim program. Trust me, you won't regret it. Generally speaking, if you can demonstrate that another course in the college of Social Sciences and Humanities is relevant to your academic interests or career path, you can get permission from the Dean to substitute it for one of your Crim electives. There are a lot of great courses in the different SSH schools, and it shouldn't be difficult at all to build a course load that[.] tailored specifically to your interests. It[.] an option I didn't realize I had until very nearly the end of my career there, so I missed out on that.  \n  \nIf you have any more specific questions about the program, by all means PM me. I enjoyed my time in the program tremendously, despite a few hiccups due to my less than studious habits, and I know for sure that if you take the time and the effort to really plan out your time there, and take advantage of all the resources available to you, it will be a great experience for you."}