{"doc_id": "1397", "name": "2014_05_humanities_student_major_980_todayilearned", "namespace": "we1sv2.0", "metapath": "", "pub": "todayilearned", "title": "2014-05-humanities-student-major_980_todayilearned.txt", "pub_date": "2014-05-14T00:00:00Z", "Sentiment": "0.147", "Subjectivity": "0.344", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "332", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25j2g4", "Reddit_id": "chhw4x0", "Subreddit_id": "t5_2qqjc", "Commenter": "MissTastiCakes", "length": "1745", "content_scrubbed": "I have heard about this before and have come across it so many times. I am a Martial Arts instructor. I do work for a chain, and while I have seen some instructors put up students that weren't ready to test, I feel that the majority of us use good judgement and stay true to the values. I have seen some sketchy instructors come through that tried to swindle money out of their students, but they didn't last long and are no longer with the company. \n\n I would say our monthly rates are high, but at the same time there is a lot of value to be had there. I have seen other schools charge more and not give the same amount of lessons or individualized attention to students that we do and run their dojos like a belt mill. We test frequently but we would not put up a student that isn't ready, and if they don't do well, they just don't pass and that[.] all there is to it. \n\nMartial arts is a weird industry because someone could just make up their own arts and then open a school, and normal people won't know that they are full of bullshit simply because they don't know about the arts. There is the flip side of that too, sometimes someone will belong to a brand and don't represent it well and are a poor teacher/ business person.  Martial Arts is a business though, so be aware of that. Us instructors also need to pay the overhead on the building, the utilities, supplies and get paid for our time (I went months without getting paid when I first started).\n\nMy best advice for people looking at getting into the martial arts is try some free classes first, look up reviews, and be aware of contracts. If you are looking to try it out do month to month programs first and then decide if you really love it and get along with the instructor. "}