{"doc_id": "1316", "name": "2014_05_humanities_student_major_247_politicaldiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "PoliticalDiscussion", "title": "2014-05-humanities-student-major_247_PoliticalDiscussion.txt", "pub_date": "2014-05-04T00:00:00Z", "Sentiment": "0.122", "Subjectivity": "0.376", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "297", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_ch9t5lv", "Reddit_id": "ch9tqwh", "Subreddit_id": "t5_2sfmf", "Commenter": "anotherdean", "length": "1873", "content_scrubbed": "Disclaimer: I'm not the guy you replied to.\n\n what makes you think math and science have no intellectual value outside of securing employment?\n\nThat was clearly not their point: clearly, things other than math and science have value. The balance between MST and humanities favored by corporate interests is skewed far in the direction of MST. Ideally, everyone would get more of everything but the share of educational resources devoted towards MST would still increase. Whether they have any intellectual value outside employment is irrelevant: there are things that the humanities teach that are vital important that you can never get from MST courses.\n\n Everyone knows now that the real reason for rising university costs is the positive feedback price spiral caused by government funding.\n\nThat[.] half the story at best: declining public funding creates no counterweight for widely available government subsidized loans. When public institutions cost less upfront and provide comparable educational services private institutions have to lower their prices to compete. The entire thing is a massive bubble waiting to pop, but the reason you don't see substantive policy changes is, for better or worse, because there[.] no political will to fix the issue. Student loans create willing employees — that much is common sense.\n\n Well its definitely clear now that you have no understanding of economics.\n\nThat[.] more a question of economic history. Real wages have been stagnant for the past thirty years and real compensation has grown by a marginal amount. Productivity has skyrocketed in the same period but the income and wealth gains have gone disproportionately to the already wealthy. It[.] not true to say that prices have generally grown in excess of income but productivity has grown while income has not grown at anything approaching a similar pace, by any metric."}