{"doc_id": "1458", "name": "2014_05_humanities_student_major_1474_exjw", "namespace": "we1sv2.0", "metapath": "", "pub": "exjw", "title": "2014-05-humanities-student-major_1474_exjw.txt", "pub_date": "2014-05-23T00:00:00Z", "Sentiment": "0.115", "Subjectivity": "0.185", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "326", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chp1vby", "Reddit_id": "chp6pcx", "Subreddit_id": "t5_2qp5l", "Commenter": "mobius_sp", "length": "1982", "content_scrubbed": "You are quite right, the ripples that those people made yesterday are being felt today, and will continue to rebound for some time into the future.\n\nA good understanding of history will give a person a lot of insight into the modern world and why humans do the things they do. It will not, however, make a person happier for the knowledge.\n\nI used to watch the History channel almost religiously when it showed actual programs dealing with *history* and not reality shows, or pseudo-science shows about aliens. I miss those shows.\n\nMy favorite courses in college were general psychology, sociology, world humanities (art history from prehistoric man until the modern era circa 1940), and early American history (from about 15,000 BCE until around WWI) - I would have gone for world history, but the class was full when I selected my sections. Although, American history was about both North and South_America, not just the history of the U_S; the course took us from the Bering land bridge, the migrations of primitive Siberians into North_America, and the development into the various indigenous tribes (the Native American tribes of the north, the Olmec and Aztecs of Mexico, the Mayans and Incans of South_America - more is known about the Central American and South_American peoples due to the permanency of their empires, whereas the Northern American tribes by their nature (with the exception of certain groups like the Iroquois nations of the northeast) were more ephemeral and thus harder to track throughout history. Of course we also went into the invasions and colonizations of the European nations, and the eventual rise of the colonies and the Revolution, then spun into the Spanish-American war and then the Civil War...\n\nI digress. Yeah, I love history. A couple of my subscribed subreddits here are /r/AskHistorians, /r/askscience, and /r/HistoryPorn (not, as some of you sickos might think, pornography - it[.] links to historical pictures and articles.) "}