{"doc_id": "1349", "name": "2014_05_humanities_student_major_620_uvic", "namespace": "we1sv2.0", "metapath": "", "pub": "uvic", "title": "2014-05-humanities-student-major_620_uvic.txt", "pub_date": "2014-05-08T00:00:00Z", "Sentiment": "0.203", "Subjectivity": "0.622", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "595", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_253p4s", "Reddit_id": "chdek3n", "Subreddit_id": "t5_2ru8r", "Commenter": "darwinfinch", "length": "3185", "content_scrubbed": "I don't know anything about architectural studies, though I am pretty sure UVIC doesn't have the program at the undergraduate level. It may have a few relevant classes, so you will want to do your research and talk to an advisor about what kind of classes or path you should take if you do come to UVIC. \n\nGoing off a friend who is in the graduate architectural program at U of T, it seems you can major in just about anything in your undergrad and then take architecture later in a post degree program, from what I know only a few schools have an undergrad program so you may want to do your research and see what way fits you best. You may also want to find out if certain undergrad programs will make you a better candidate if you end up doing it as a graduate program.\n\nthe application deadline for UVIC is super easy to find, I did a quick google search and found this \n\n http://www. uvic. ca/future-students/undergraduate/admissions/deadlines/\n\nWhat I do know lots about now that I'm done my degree is university studies in general, and I will tell you something that might seem weird since I'm assuming you're coming from highschool, but you get all the days off you want and all the free time you want, but taking them won't get you anywhere worth going. \n\nUniversity is almost entirely self directed. The prof will likely not care, and definitely not babysit you. All of your marks are going to come from work that you base on information you learn in class and your own self directed studying or research. Professors are mostly willing to help, but they will never do the work for you. \n\nIf you did all the readings and all the work for a full courseload? you're going to be spending a lot of time studying- it[.] not going to be impossible to have a life but you will be doing school as a full time job. \n\nIf you do it for 2 or 3 classes at a time, you'll have a bit more free time but your degree will take longer (people do this most of the time so they can work simultaneously).\n\nHowever, do minimal work/skip class and you might have lots of free time and you might even pass but won't actually learn anything, which is not something you want to do if you're going into something like architecture, since the technical skills you learn in school would directly influence the success of you career\n\nMy advice is don't worry too much about the free time, you can make it happen with good time management. Do the research, decide what you want to do and go for it. Undergrads are not supposed to be easy, they're supposed to be about learning what you need to know to succeed in the life you choose for yourself, and learning valuable work ethic habits along the way. \n\nat the end of the day it is all about you and the effort you are willing to put into it, because at the end of the day that is what you will get out of a degree and your career. \n\nTo put it harshly, I'd start by researching your own deadlines and organizing all of your options and what you need to do for admissions on your own, it will be good practice for University. I'm happy to pass on advice but a prof won't give you the answers they'll only send you in the_right direction, the rest is up to you. "}