{"doc_id": "1372", "name": "2014_05_humanities_student_major_788_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2014-05-humanities-student-major_788_explainlikeimfive.txt", "pub_date": "2014-05-11T00:00:00Z", "Sentiment": "0.049", "Subjectivity": "0.309", "Score": "24", "Upvotes": "24", "Downvotes": "0", "Wordcount": "235", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25b85a", "Reddit_id": "chfpsw3", "Subreddit_id": "t5_2sokd", "Commenter": "muffledvoice", "length": "1428", "content_scrubbed": "Colleges and universities started out mainly as finishing schools for gentlemen.  The goal was to receive a classical education so that you would fit in with others of your social class.  Technical universities started with the Ecole Polytechnique in Napoleonic France two hundred years ago.  Today in the U_S virtually the entire focus is on future earning potential.  Students really don't care about using their college experience to better understand the world, study history, etc.  \n\nI would say the major sea change came in the 1980s during the Reagan era, although other stages of this change came about earlier as well.  The decline of industry in the U_S after the 1960s meant that those who wanted an upper middle class salary had to seek an advanced degree in a business or technical field.  \n\nBut the downside is that this has brought about a general change in public sentiment.  Fewer people with college degrees have even an inkling about literature, history, cultural relativism, etc.  As a human being, there[.] a lot to be gained from a liberal_arts education, which is why universities still (much to students' chagrin) require them to have two semesters of U_S history, etc., before they can graduate - regardless of their major.  If the students had their way, they'd only take courses within their major, since they see all other subjects as useless.  \n\nWitness the rise of philistinism.  It[.] not pretty."}