{"doc_id": "1426", "name": "2014_05_humanities_student_major_1185_cfb", "namespace": "we1sv2.0", "metapath": "", "pub": "CFB", "title": "2014-05-humanities-student-major_1185_CFB.txt", "pub_date": "2014-05-18T00:00:00Z", "Sentiment": "0.205", "Subjectivity": "0.492", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "408", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25v5xr", "Reddit_id": "chl4k4q", "Subreddit_id": "t5_2qm9d", "Commenter": "OhioBornSoonerBred", "length": "2155", "content_scrubbed": "TL;DR Schools want to make money, recruit everyone with a pulse, cream rises to the top, what happens to everyone else doesn't matter too much as long as the school gets their money for a semester or two.\n\nI played Division III athletics myself, and it is pretty interesting/sad to see how some of all of this works.\n\nFirst off, recruiting:\nI didn't play football myself, but I saw tons of campus tours with recruits and saw many of the players that came through the system.  Many of these guys that end up at the school come to campus with the idea that now that they're a \"college football player\", they are now a big shot, even though they play at ______ University nobody has heard of.  But..... it works to get people on campus and makes the school money (at least for one semester).\n\nOnce they get to school, there[.] about 140-160 guys on the team with about 50% of the whole team being incoming freshman.  A large majority of the class quits the team/leaves school during or after the first semester of school because they now see that they will never play or that this \"college football\" dream isn't what they thought it'd be.  \n\nIts also kind of funny when I look at the roster before the year and see some 5'6'', 130lb guys on the roster.   I can't see how they were ever thought of to be potential college football players.   In the end though, the school wants to make money, and the football team can keep enrollment up by selling this dream.  A lot of guys transfer from the school and end up elsewhere, but in the end they are out of a bunch of money, because most of these DIII schools are going to cost you more than going to a larger school from the get go, and with a lot of them being liberal_arts, you have a lot of classes that won't transfer for anything useful at all as well, so these people end up having to go to school more than 4 years, spending even more money.\n\n-EDIT-  This may not be true at every DIII school, but where I went, the school actually set a quota for how many players each team has to bring in every year to fill enrollment numbers.   I don't know if that may be a shock to some, but it is true where I went.\n"}