{"doc_id": "1401", "name": "2014_05_humanities_student_major_1022_japan", "namespace": "we1sv2.0", "metapath": "", "pub": "japan", "title": "2014-05-humanities-student-major_1022_japan.txt", "pub_date": "2014-05-15T00:00:00Z", "Sentiment": "0.079", "Subjectivity": "0.292", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "429", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chikcua", "Reddit_id": "chiqosy", "Subreddit_id": "t5_2qh2u", "Commenter": "ixampl", "length": "2335", "content_scrubbed": "Thing is, you cannot study by being at school alone. You need to put in your own time at home or the library. When I went to classes in Japan, people came in, signed their name, half the people listened, the other half slept. The class did not make sense without having read the relevant book etc. but the exam was not really graded anyway. Everyone got an A, mostly just for attendance. And how else would it work? I see what you mention a lot, people leave and go party or do baito. If the classes actually were hard people would not be able to do baito etc. And why do they do baito if their parents are paying for their expenses?\nRight, to go drinking and buy expensive shit. And in my experience they do so quite excessively.\nNext time your gf complains tell her about STEM students in the US who basically have to spend all their free time on semester projects and looking for internships. Even where I am from, humanities_major didn't catch a big break. People had to read several books for a single class back to back. Then write a report / research paper, properly sourced (something I haven't seen in Japan very often, more like summaries essays without any citations) 20+ pages, about as much as many of the bachelor theses in Japan.\n\nI really think undergrad in Japan is a waste of time for almost everyone involved. There are exceptions, I assume, but it seems the vast majority of graduates won't leave school with any real knowledge acquired. And they don't really need to. Companies don't expect specific knowledge. Company entrance exams can be mostly covered by high school knowledge and some targetted studying. Once in the company they'll get their actual training. The company plans for that.\nIt seems to me going to uni is just a socially expected thing. If you don't you won't get a job at a proper company.\n\nAll my info is anecdotal and hearsay, so take it with a grain of salt. I actually hope I am wrong about my assessment, but sadly it *appears* as uni is not actually providing much education at all, at least at the undergrad level.\n\nI do believe motivated minds can learn a lot at Japanese unis if they want to. But they have to motivate themselves. Given the choice many people don't do that.\n\nAnyway, things still seem to work for Japan, so it[.] cool I guess. I am not going to tell people what to do."}