{"doc_id": "1469", "name": "2014_05_humanities_student_major_1589_adelaide", "namespace": "we1sv2.0", "metapath": "", "pub": "Adelaide", "title": "2014-05-humanities-student-major_1589_Adelaide.txt", "pub_date": "2014-05-25T00:00:00Z", "Sentiment": "0.097", "Subjectivity": "0.288", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "322", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26fcya", "Reddit_id": "chqnhjd", "Subreddit_id": "t5_2r1ca", "Commenter": "oyagoya", "length": "1841", "content_scrubbed": "Here[.] my recommendations, based on my last few years as a postgrad research student in the humanities:\n\nFirst choice: the State Library Mortlock Wing, for all the reasons /u/nagrom71 mentions. Be there before 10:30 if you want a table. It[.] generally very quiet, though there are tour groups through a couple of times a day. There are occasional closures, and I think you can check the State Library website for these, but they're rare.\n\nSecond choice: Adelaide Uni Hub mezzanine (level 5), but only not during semsester, otherwise I'd put it third. You'll need to be an Adelaide Uni student to get in after hours but you'll have access most of the time even if you're not a student. Find a table and drag it away from everyone else. There[.] an ambient chatter, but since it[.] away from most of the other study areas, you can often avoid being distracted by loud conversations.\n\nThird choice: the State Library Spence Wing. Free wi-fi access if you need it (though that can be a distraction in itself), usually lots of tables but often you'll need to share. That[.] not really a problem, though, as the tables are large and people know to be quiet in libraries. Except when they don't. Expect to listen in on occasional loud phone conversations if you sit on the west side of the library near the couches.\n\nFourth: Adelaide Uni Hub (level 4). Generally good for the same reasons as the mezzanine, but to a lesser degree. Also, good luck finding a table during semester.\n\nFifth: Adelaide Uni Reading Room. Very quiet, but packed in the weeks before exams and with a really tense atmosphere. Probably much better not during semester, but I can't speak to that personally.\n\nThere are also other places worth a try: UniSA libraries, the new City Library, the new hub place where the old City Council Library used to be (under the State Library)."}