{"doc_id": "1359", "name": "2014_05_humanities_student_major_729_berkeley", "namespace": "we1sv2.0", "metapath": "", "pub": "berkeley", "title": "2014-05-humanities-student-major_729_berkeley.txt", "pub_date": "2014-05-10T00:00:00Z", "Sentiment": "0.172", "Subjectivity": "0.392", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "604", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_2572da", "Reddit_id": "chex38j", "Subreddit_id": "t5_2qh9w", "Commenter": "mcsia", "length": "3356", "content_scrubbed": "As a graduating senior, one thing I've learned about this school is that it has a very specific vibe and if you don't fall into it than you're SOL. If you're fratty then go greek, if you're druggy then join the co-ops, and if you're 100% on top of your game academically/career-wise then meet people in your classes/organizations.\n\nIf you don't happen to fit into these categories then you're going to have a harder time.\n\nBerkeley does not pride itself on its blossoming undergrad culture. It prides itself on research and helping academically-motivated kids get their moneys worth. Berkeley could care less about \"college experience.\" Are you a humanities major with no interest in business or law? Fuck you. Are you transfer? Fuck you harder. Honestly, the best friends I have made at Berkeley have been people I met in my hall who feel exactly the same way as I do and some coworkers.\n\nBerkeley[.] workload/scheduling/dispersed student population make it a difficult place to meet people. Have friends that live on northside but you live on southside? You'll see them about 4 times a semester (if you're lucky). Have friends that aren't in your exact major? Oh wait, all of your friends have different majors? No one will ever be able to coordinate schedules.\n\nMy advice? Don't care about what other people are doing. Some of your friends from UCLA post pictures of some house party with lots of good looking people? Don't worry about it. Three of your best friends who go to UCSB post a video of them having drunken great time? Call them up and talk about it but don't be jealous (this example is obviously pretty personal, but still).\n\nBerkeley does not offer a traditional college experience but it offers something else: proximity to the bay. There are so many cool things to do here that if you haven't ventured deep in SF or Oakland then you are doing Berkeley wrong. Find a couple cool people and visit Japantown in SF. Have a picnic at Tilden. If someone you know has a car then hike Mt. Tam. Eat at one of the many great places to eat in Oakland. Also, get into live music. The bay is crazy good for big name and low key shows. The Fox, The Greek, Great American Music Hall, (and if you're into electronic) Public Works, 1015 Folsom, Mezzanine, Audio Discotech to name a few.\n\nFor the most part, my experience of Berkeley has been a means to an end. I am not happy with this (or saying this is the best way to do it) but it is reality.\n\nI want to end this rant on a happy note (by saying something cheesy like \"Oh and I am better off because of it! Though the Berkeley experience is nontraditional, isn't that just what the true Berkeleyan seeks, to break away from tradition?\") but I can't really will myself to do it.\n\nMore and more I hear people admit that Berkeley just isn't/wasn't for them. Once the allure of \"BEST PUBLIC SCHOOL IN THE WORLD! WOOHOO!\" wears off and you realize that what makes a college \"best\" for the individual is something that you feel in your gut and not something you read in an article, then the Berkeley experience becomes a disappointment. Ehh, I don't know what else to say.\n\nSorry for the rant, I am procrastinating writing an essay. I am sure someone will read this and disagree with me point by point but (disclaimer!) this has been mine and many of my peer[.] experience of the school.\n\nBest of luck to you."}