{"doc_id": "1369", "name": "2014_05_humanities_student_major_774_evopsych", "namespace": "we1sv2.0", "metapath": "", "pub": "evopsych", "title": "2014-05-humanities-student-major_774_evopsych.txt", "pub_date": "2014-05-11T00:00:00Z", "Sentiment": "0.159", "Subjectivity": "0.51", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "747", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chfgu33", "Reddit_id": "chfj9z4", "Subreddit_id": "t5_2qsg3", "Commenter": "trias_e", "length": "4413", "content_scrubbed": "I pointed out that women HAVE evolved to be extremely attractive to men, but mainly only in their teenage years because that[.] when they would have been subjected to the fiercest sexual selection.\n\nAttraction is a two way street:  Men have likely also evolved to find certain traits in young women attractive.  But yes, some markers, like breast size and firmness, likely were influenced by sexual selection of men.  \n\nMen do have bigger penises than other primates but women seem to prefer penises a bit bigger than the average. How can this be if they've been shaped by female selection?\n\nBut that[.] precisely how sexual selection works.  One gender has a preference for something above or below the norm.  If such a preference didn't exist, sexual selection wouldn't exist.  If such a preference didn't exist in women today, it would be evidence against sexual selection.  Similarly, men like breasts that are very firm and large.  Such a combination does not exist in the vast, vast majority of women, but it does give evidence for why the breasts of women are unnecessarily big:  Sexual selection.\n\nIt[.] really not true that women in HGs have lots of sexual freedom. In the most primitive HGs, which are presumably the most representative of our prehistoric ancestors, women are treated like property and have little choice in which men impregnate them. The men beat their wives and use them as domestic slaves. It seems that the males in our species have evolved to subjugate the females and control their reproduction leaving them with little reproductive control of their own. This is why I claim that female choice hasn't been a big factor in recent human evolution.\n\nSexually selected how? Women in prehistoric societies had little say in who they got married to at a young age and were closely guarded by their husbands from other men. The cuckoldry rate in modern HG societies is typically less than 5% so it doesn't look like cheating on their husbands would've given them much reproductive control either. So how did they sexually select men and shape their evolution as much as people like Miller claim?\n\nDo you have citations for this?  This seems like an oversimplification that generally goes against what I learned in anthropology, and in basically all of the reading I've done on the subject (stuff like Sex at Dawn and The Mating Mind).  The Yanomami are one people that comes to mind that are somewhat similar to what you are saying, although I highly doubt the cuckoldry rate is only 5% in that tribe. Tribes such as the Hadza operate nothing like what you are saying.\n\n\nAnother problem with this whole idea is just how rare artistic ability is. If the arts are kinds of sexual ornaments that have evolved to attract women then why are most men useless at them? All peacocks have beautiful tails and all bowerbirds are expert bower builders but few men can paint or compose music well. Do you see the problem? It[.] more likely that these abilities are just unintended consequences of brain systems and haven't been specifically selected for.\n\nFirst, I don't think artistic ability is that rare.  Remember that any artistic ability at all is non-productive.  Miller isn't saying you have to be a genius to be attractive (although if you are a genius, it probably would be quite attractive). So yeah, I don't think most men are 'useless' at all artistic endeavors, especially if we extend it to the creation of interesting objects/tools/buildings.  Men making shit for women is pretty damn common, in one form or another.  Second, creativity and showing off extend beyond art, while having a similar drive.  A guy making women laugh through creative jokes is displaying creativity and skill, simply in a way different than an artist or poet.  A guy showing off an impressive vocabulary and speaking style is doing something similar.  As far as other animals go:  Human beings are massively more complicated with adaptive brains that go far beyond any other animal on the planet.  Comparing them behaviorally to other species isn't appropriate.  Expect human beings to be far less uniform than other species when it comes to complex behaviors.\n\nYou may very well be right that art is simply a side-effect of the development of the human brain.  But we still remain with the question:  Why did the brain evolve as it did?  Natural selection doesn't seem to give us an answer to that question.  "}