{"doc_id": "1371", "name": "2014_05_humanities_student_major_783_todayilearned", "namespace": "we1sv2.0", "metapath": "", "pub": "todayilearned", "title": "2014-05-humanities-student-major_783_todayilearned.txt", "pub_date": "2014-05-11T00:00:00Z", "Sentiment": "0.139", "Subjectivity": "0.309", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "301", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chfmo5u", "Reddit_id": "chfn3x7", "Subreddit_id": "t5_2qqjc", "Commenter": "strazdana", "length": "1824", "content_scrubbed": "Okay, so perhaps STEM jobs *are* dying for women to join the industry - I won't argue against that.\n\nBut your sexist claim that \"women are just more interested in dealing with children and being mothers\" doesn't explain why fewer women are studying STEM fields to then work in the STEM job industry.\n\nIt would seem, then, that you're arguing that young female students (anywhere from elementary school to graduate school) are more interested in being mothers, and that[.] why they're statistically more likely to study humanities or social_sciences?\n\nThere[.] a lot written about how males are taught to be more confident and aggressive in school, which leads them to like subjects where they can be objectively right. (Math: 2+2 must equal 4, a frog is an amphibian, cells divide by mitosis, etc etc. These are all just facts.) Girls, on the other hand, tend to prefer subjects that allow for more subjective discussions, such as those found in literature, philosophy, anthropology, etc, where they have an opportunity to express themselves and assert their opinions without fear of immediately being wrong. Boys tend to *dislike* these types of subjects for that same reason: there *is* no right answer, so they tend to feel uncomfortable and gravitate towards subjects where they can be sure they can be right. Like I said, there[.] a lot of literature on this. If you're actually interested I can dig it up and show it to you.\n\nTL;DR The difference between female and male participation in STEM fields can be attributed to the dynamics in a classroom combined with social expectations of each gender, which often lead to boys participating in and enjoying STEM subjects and girls participating in and enjoying humanities and social_sciences. Not because women just want babies.\n\nEdit: switched a word (objective/subjective)"}