{"doc_id": "1373", "name": "2014_05_humanities_student_major_791_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2014-05-humanities-student-major_791_explainlikeimfive.txt", "pub_date": "2014-05-11T00:00:00Z", "Sentiment": "0.062", "Subjectivity": "0.299", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "269", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chfpo9k", "Reddit_id": "chfqm2h", "Subreddit_id": "t5_2sokd", "Commenter": "clayisdead", "length": "1569", "content_scrubbed": "my algebra 2 teacher would tell us that you stop learning anything you would realistically use in real life in geometry. anything past that, as far as math goes, is basically to strengthen critical thinking skills, and to hone in on specialized math courses that student need for certain majors or careers.\nthis is basically the same with high school English. you basically know all the grammar you need by the time you reach ~8th grade. beyond that they begin, as they put it, \"exercising cognitive abilities\" that aren't necessarily essential to the real world, but make you an all around more intelligent person. this begins with teaching students how to write persuasive essays and goes into examining classic literature, language, and to an extent, philosophy. this goes along with the courses you can choose to take, students who aren't planning to go into any English or humanities_major in college will stick to basic English, while students who are looking to specialize will go to AP Lang, AP Lit, and other such classes. \nthe basic idea is that educating students beyond the basic necessities will reap a positive influence on society as a whole, that educated people won't commit crimes or acts of injustice or any other bad things, as they will be too smart, too civilized, and working too hard on bettering themselves and society. whether or not that[.] the case is up for debate, but that[.] a very broad summation of what I consider to be the educator[.] manifesto, and at the very least the reason I desire to go into education myself in the humanities. "}