{"doc_id": "1381", "name": "2014_05_humanities_student_major_856_futurology", "namespace": "we1sv2.0", "metapath": "", "pub": "Futurology", "title": "2014-05-humanities-student-major_856_Futurology.txt", "pub_date": "2014-05-12T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.398", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "927", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25benw", "Reddit_id": "chgh0q7", "Subreddit_id": "t5_2t7no", "Commenter": "throwingawayanxiety", "length": "5948", "content_scrubbed": "Semi-throwaway because, as many here have already mentioned, many women avoid admitting that we're female, online. On my main, I mostly keep my replies generic because I don't want my gender to become the subject where it[.] completely unrelated and irrelevant.\n\nReplies like [**this**](http://www. reddit. com/r/Futurology/comments/25benw/gender_in_futurology_or_where_are_all_the_chicks/chfn3s7) are partially why. As someone else already said, no one is asking to \"lower the bar\", nor to invite members that do not have the knowledge nor skills to contribute. The point is to encourage those who already feel at home in this and other STEM-centric environments to not be assholes to those who, within only the last few decades, had to *win* the_right to participate. \n\n[Another member here says](http://www. reddit. com/r/Futurology/comments/25benw/gender_in_futurology_or_where_are_all_the_chicks/chfpytd): \"I haven't seen any studies as yet which demonstrate that there are any discrimination based barriers to it, I suspect it is just something that does not interest women as intensely or commonly as it does men.\"\n\nHow about [**this one**](http://www. npr. org/2012/07/12/156664337/stereotype-threat-why-women-quit-science-jobs?ft=1&f=1007)? \"How Stereotypes Can Drive Women To Quit Science\". In short, womens' awareness that we might be prejudged just for our gender can actually lead to worse performance, because we're not only thinking about our work, but also about how our colleagues are responding to us.\n\nHere[.] great article: \"[**Why are there still so few women in science?**](http://www. nytimes. com/2013/10/06/magazine/why-are-there-still-so-few-women-in-science. html?pagewanted=all&_r=2&)\"\n\nNow for some personal anecdotes, which of course aren't as good as studies, but relevant just the same:\n\nI grew up with interests in STEM and Humanities. I chose a humanistic field as my major in college because I was good at it and had received praise, awards, etc. my entire life for my work in that practice. Despite the humanities-major-barista stereotype, I graduated into a high-salary job.\n\nNow I'm in school again, for a completely opposite field in STEM, because I have a raging passion-boner for this field and realized that it[.] much more important to me (and more important *objectively*) than what I was doing prior. Just the other day in [**Alex Filippenko[.] IAmA**](http://www. reddit. com/r/IAmA/comments/25830r/i_am_alex_filippenko_astrophysicist_at_the/), one of his pieces of life-advice was to choose a job that you'll be happy doing, rather than counting down the hours and the days. That[.] what this is for me. And I really wish I could have this career without worrying about the \"women in STEM\" stuff, just *do my work* without having to talk about my gender or justify myself. But even if you try to ignore it, it occasionally knocks on your door.\n\nI know that, because I'm a woman, there will be some hurdles: for one, it may be more difficult to participate in male-dominated groups, just like it can be on reddit and in online games. But I can't hide my gender in person. *Of course* it makes me nervous that I might have to deal with the kind of trolls that exist here, but to my face. \n\nWorse, if a woman happens to be somewhat attractive, some people take that as an invitation for more-than-friendly and less-than-professional behavior. I hope I won't have trouble finding mentors because of that. Most professors in STEM are currently male. Mentors and students spend a ton of time together, so any hint of attraction would create unnecessary tension, which takes away from the work.\n\nIn one of my courses I had made acquaintances with a male classmate, purely platonically. Naturally, I had asked him what his major was. He answered (another STEM/hard_science). I've actually had some interest in that field for some years, so it was cool to be able to talk it. *That[.]* the kind of stuff I want to talk about, and what I usually write about and partake in on my own time. Thing is, this person never asked me about *my* major, nor my scientific interests, etc. He usually said things like \"Oh don't make it too difficult for yourself\" and \"Do you like my haircut?\". Nothing to do with what we're in school for, but rather inappropriately-timed questions that subtly undermined my abilities or related to *him* or how I thought of *him* in some way. I've always been polite, but my frank, mental response is something more like \"I actually don't give a fuck about your haircut when you can plainly see that I'm trying to work on a problem.\" \n\nNow, in that case, it could just be that individual[.] personality. But I react to it a certain way because I've encountered pure sexism on other occasions: e. g. imagine talking to someone about a scientific topic, only to have them continuously interrupt you mid-sentence with \"you're sexy.\" Believe it or not, that[.] not a compliment. It just indicated that you weren't listening, and there[.] only *one* thing you're interested in. Does anyone want to spend time with people like that? Unfortunately, those experiences and ones that I've heard about from other women can color future encounters and create new stereotypes.\n\nThere[.] also the whole nature-nurture and sociological argument to be aware of. Women are more often encouraged to do \"feminine\" things, especially if their parents/families are not progressive. It[.] not as black and white as women simply being less interested. Even given the argument for biological differences, there are still outliers. Those who have the interest and skills in STEM simply want to be able to join the ranks without further needless discouragement, sexism, etc. There are a ton of variables at play in this issue. \n\nOverall, just reporting in to say, \"We're here. We're interested. We're skilled and talented. But we're also very likely hiding because some people are assholes and we don't want to deal with it.\""}