{"doc_id": "1328", "name": "2014_05_humanities_student_major_422_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2014-05-humanities-student-major_422_AskAcademia.txt", "pub_date": "2014-05-06T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.547", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "388", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24t79r", "Reddit_id": "chatifc", "Subreddit_id": "t5_2sakj", "Commenter": "Solivaga", "length": "2197", "content_scrubbed": "•Flexible hours: In my university some professors are almost never there for many reasons (working from home, just having no reason to be there so they're not, being evening people so they don't come in the morning, etc...).\n\nThere is flexibility, though I think you're exaggerating it quite a lot.  Plus there[.] a flipside, that you inevitably take the job home, and end up working in evenings and weekends as well.  Flexible doesn't mean you sleep in, take the afternoon off etc., it means you can work from home - you're still working.\n\n•Choosing what to work on: Are professors really free to choose what to work on? I realize that you are still assigned things to do like classes to teach and all but you get to choose your own research, don't you? I simply don't want to be assigned a project to work on in a company.\n\nYes you can choose your own research fields/projects, but you're constrained by funding and by publishing.  You need to bring in money, and you need to produce high impact research - as long as those can be done then you're *relatively* free.\n\n•Job security: I've seen some crazy professors stay in my school just became they are tenure and cannot be fired.\nThe obvious flip side of this is that your position is hugely insecure until you reach/attain tenure\n\n•Pays well: Every single professor in my department gets over 100K/year.\n\nI don't know what field you work in, but that[.] next to impossible in the humanities, and I'm pretty sure it[.] not reflective of most academic fields.  If you're seriously considering a career in academia I'd recommend doing some actual research into things like average salaries (they're a hell of a lot lower than you seem to think).\n\nI'll be honest, if the above is your reason for wanting to go into academia I would *seriously* reconsider and do a lot of research into academic jobs in your field.  It reads as if you know next to nothing about it and view it as some sort of glorious halcyon career completely detached from reality.  The success rate of PhD students making it to postdoctoral academic positions is very low - put simply there[.] far more people coming out of university with PhDs than there are positions to go into."}