{"doc_id": "1411", "name": "2014_05_humanities_student_major_1102_abcdesis", "namespace": "we1sv2.0", "metapath": "", "pub": "ABCDesis", "title": "2014-05-humanities-student-major_1102_ABCDesis.txt", "pub_date": "2014-05-16T00:00:00Z", "Sentiment": "0.17", "Subjectivity": "0.457", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "445", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chjtwbs", "Reddit_id": "chjv1gu", "Subreddit_id": "t5_2yfr0", "Commenter": "darthrevan", "length": "2442", "content_scrubbed": "I have degrees in the arts and friends who did arts programs as well.  \n\nWhat you do NOT want to do is the typical/expected/traditional routes of art (auditioning in big cities, trying to get published by big houses, etc.)  There is just WAY too much competition, and often the ones who can persevere and succeed on these routes are privileged children/trust fund kids who don't have to work and can just commit to artistic pursuits 24/7.  They can fail over and over because they don't have bills to pay and can wait.\n\nIf you're not one of those kids and do need income right away, one route is: look for *related* fields to what you do.  For example, I had a friend who studied to be a Broadway/opera singer in college.  She then discovered music therapy and went back to school to get certified in that as well.  It was an unexpected turn in her career plan, but she[.] employed now and happy in it.  Another friend did English Literature, and worked for a textbook company as a staff writer and then for a major fashion store chain as a copy editor for their website.\n\nAnother route is: combine your artistic talents with technology somehow and do your own business.  A mobile app of some sort, or something innovative showcased on a YouTube channel, etc.  This is if you can maybe live at home or don't need money right away, and can wait for your business to slowly grow over a year or two.\n\n\nIf neither of the above can sustain you financially, you'll just have to do whatever job you can get while you keep looking for something more related to your field or while you work on your own projects on the side.\n\nOh and if you're thinking to teach in the arts: more brutal competition for those jobs, too.  Scoring a full time teaching position in the liberal_arts is like winning the lottery at this point.  More likely you'd only get a part-time lecturer position that pays peanuts and you'd have to commute between 2 or 3 different schools teaching classes just to barely make ends meet.  And that[.] if you're lucky, most likely you won't find much at all and have nothing.  Or you could do this while you live at home and work on your projects.\n\nThis is just my take on what I've seen though.  Definitely ask as many people as you can to get different perspectives.  I'm by no means an authority and perhaps others have found more successful routes than I've seen.  Most of all: don't give up!  The arts are more vital than ever today."}