{"doc_id": "1348", "name": "2014_05_humanities_student_major_614_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2014-05-humanities-student-major_614_college.txt", "pub_date": "2014-05-08T00:00:00Z", "Sentiment": "0.046", "Subjectivity": "0.259", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "965", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_2533d4", "Reddit_id": "chdbnle", "Subreddit_id": "t5_2qh3z", "Commenter": "sirziggy", "length": "5557", "content_scrubbed": "What is the difference between University and College.\n\nA University is a collection of colleges. A college is a school that focuses on a certain thing. When you look up UCs or CSUs to apply to, many of them have separate schools for different disciplines. UC Riverside, for example, has CHASS ([College of Humanities, Arts, and Social Sciences](http://chass. ucr. edu/)), CNAS ([College of Natural and Agricultural Sciences](http://cnas. ucr. edu/)), and BCOE ([Bourns College of Engineering](http://www. engr. ucr. edu/)). \n\n\n What[.] the purpose of Majors and Minors? \n\nMajors and Minors are usually what discipline you focused on studying in a College. A major in Sociology will primarily focus on Sociology and other social science classes, while a degree in Biology will focus on subjects pertaining to Biology and natural science. \n Are UC[.] and CSU[.] hard to get into?\n\nThis depends on how you treat your education and what school you are applying to. UCLA is one of the most competitive schools in the country, and you can bet that it will be a lot harder to get in there than it will be to get into UC Davis or UC Riverside. Acceptance also depends on the major, too. \n What does the acceptance rate say about a school?\n\nIt could say that there are a lot of applicants. I don't think it really signifies the rigor of the university or college you apply to at all. It also could signify impacted majors (like Psychology) and how competitive the school is in regards to wanting students. EDIT* The last thing I will say about this is the school requirements. I recently got into Irvine, Riverside, and Davis as a Sociology major but *didn't* get into Merced because I didn't complete a pre-calculus course, which the other schools didn't need.\n\n I'm not A-G, but I plan to go to community college and transfer, do I have to start over my A-G in CC?\n\nAs in A-G in high school? This is a better question to ask an academic adviser or counselor, but you do have requirements to get into Universities and specific Colleges. UC Irvine, for example, has a set of requirements you need to do before you can transfer ([Here is the link](http://www. admissions. uci. edu/applicants/transfer_admission. html)) and each college has requirements as well. You can find those specific requirements for Irvine [here](http://www. admissions. uci. edu/applicants/transfer_preparation. html).\n My parents aren't up for paying big colleges, how hard is it to get scholarships?\n\nThere are easier ways to get money. The most important thing you should do is your Free Application For Student Aid (or FAFSA). Depending on your income, they offer grants and Stafford loans if you need it. Scholarships at a university level might require you to fill out FAFSA as well. [Here is the link for FAFSA](https://fafsa. ed. gov/). \n\n I had bad grades in HS up until this last semester of Senior year, as in my average GPA was in the 2[.] and now I have a 3. 8, how will this affect me?\n\nBeing that you're considering going to community college, not very much for admissions purposes. You performance in these classes might affect how well you do on placement tests and consequently put you in remedial English or Math, but you really shouldn't worry. Just be aware that the rigor in college level classes is higher than in high school and you will have more work to do. \n\nWhen applying for college, how many colleges do I apply to?\n\nWhen my dad was transferring from a community college, he only applied to one (and got in). I applied to 4. It[.] a lot safer to follow this pattern when looking at college:\n\nSafety school: A University you know for a fact you'll get into. \n\nTarget School: A University you want to get into\n\nReach School: A University that might be a stretch to get into. Could be because its acceptance rate is low or that it costs a lot of money.\n   \n I have no extra-curricular, how will this affect my eligibility?\n\nExtra curricular activities don't necessarily have to be you going to do charity work for some non-profit for 100 hours. Choir, theater, ASB, any club, sports, etc could all be listed as an extra curricular. I only had choir and theater under my belt when I transferred this year and I got into all the schools that I wanted. It might affect you getting into reach schools, but that doesn't mean you're shit out of luck.\n\n Should student loans be my last resort?\n\nYou will most likely need loans when going to a 4-year university. However, going to a community college will help because classes are cheaper than at a university level. My grants easily covered my tuition and books here (I also had a Board of Governor[.] Fee Waiver so my classes were free essentially). If I can estimate my loans after I finish my bachelors, it will be about $21K. There are payment options for academic loans, so until you finish your degree you wouldn't have to pay anything (though you should save a little)\n\n I have no teachers that are willing to write me a letter of Rec, is this bad?\n\nI didn't need letters of rec for any college I applied to. It[.] not bad that you don't have letters of rec.\n\n How do notes work in college?\n\nGo to class every day, listen to the lecture, and take notes. There is usually some extra work outside of class (like reading books) so keep that in mind. In my opinion it[.] a lot more independent than a high school class and it will be your own fault you fail a test because you didn't take notes. Make sure you get to know people in your class and get their numbers so if you do miss a lecture you have a way to get notes.\n\nHope this all helped."}