{"doc_id": "1483", "name": "2014_05_humanities_student_major_1773_shreveport", "namespace": "we1sv2.0", "metapath": "", "pub": "shreveport", "title": "2014-05-humanities-student-major_1773_shreveport.txt", "pub_date": "2014-05-28T00:00:00Z", "Sentiment": "0.207", "Subjectivity": "0.363", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "331", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26p891", "Reddit_id": "cht8l41", "Subreddit_id": "t5_2sd75", "Commenter": "bombjon", "length": "1796", "content_scrubbed": "Here[.] the best part of Shreveport. How close it is to everything.\n\n* Big Cities with tons to do:\n* 3-4 hour drive = Dallas, TX\n* 4 hour drive = Little Rock, AR\n* 4-5 hour drive = New Orleans, LA\n* 6 hour drive = Houston, TX\n* .\n* Like the outdoors? \n* Woods - everywhere\n* Lakes - everywhere\n* Ocean - 6 hours for a good beach (weekend trip)\n* Mountains - 6 hours for northern Arkansas Ozarks\n\nAs far as culture in Shreveport, it[.] a bit of a try-hard city. There is a bit of a digital and artistic renaissance going on for the past couple of years, but it[.] still very fledgling. Theater exists, and isn't bad. The vast majority of the population doesn't support the arts, unfortunately, which is why the funding isn't there for significant change.\n\nSocial activities find the most exposure with bars and churches. There are other things that involve meeting new people, but these are the 2 most prevalent. \n\n If you like classic rock there are gobs of cover bands playing in bars. If you like country there[.] plenty of those guys running around too. If you'd rather hear solid electric/trance/techno, there[.] the internet. I know some form of rap scene exists, but can't speak to it[.] legitimacy or quality.\n\nLots more, most covered by others. Ultimately in most larger cities \"something to do\" is always easy to find, here you have to dig a bit or travel a little, but it[.] there.\n\nBiggest pro: The food in Lousiana is the best in the country. There aren't many full blown cuisines that the US can boast, but this place has it.\n\nBiggest con: I'm not sure which is worse, the lack of education among most of the population, or the humid hot swampy weather. \n\nWould I move to Shreveport? Not without a very good reason ($$$). But, the scarcity increases the value of what you do find and enjoy."}