{"doc_id": "1506", "name": "2014_05_humanities_student_major_1985_explainlikeiama", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeIAmA", "title": "2014-05-humanities-student-major_1985_explainlikeIAmA.txt", "pub_date": "2014-05-31T00:00:00Z", "Sentiment": "0.052", "Subjectivity": "0.263", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "417", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26uh7u", "Reddit_id": "chvx0ci", "Subreddit_id": "t5_2t5iz", "Commenter": "Rhodoferax", "length": "2313", "content_scrubbed": "Hello, Mr. Bond. I've been expecting you. Don't try anything. I have twenty rifles trained on you - even if your pistol is already loaded, my men will perforate you with bullets before you can even point your weapon at me.\n\nYou know Mr. Bond, it[.] amazing what nature can do if we simply let it. Why, Mr. Darwin has even suggested that plants and animals naturally arise from lower organisms by a process not unlike how a farmer improves his stock! It[.] clear that the same process applies to man, which is why great men like me and yourself invevitably arise above and dominate the lower classes.\n\nOr take this boat we stand upon, sir. Mr. Boyle showed many decades ago how, if the temperature of a gas is increased, then the pressure it exerts on a containing vessel must also increase. An interesting curiosity to be sure, but of little practical purpose until Mr. Newcomen invented that pump scant decades ago, in which the volume increases instead of the pressure. Truly, humble steam is a wonderful tool for the engineer! Alas, Newcomen insisted he could use the pump to aid and save the lower classes, instead of culling them as would have been proper.\n\nHowever, where Newcomen failed, I will succeed. Newcomen tried to design a vessel such as this, but could not get it to move with a mere pump. However, just last year Mr. Watt divined that he could change the shape of the device to effect circular motion, I realised that *this* concept could be used to propel a boat without the need for slaves or wind!\n\nSo you see, Mr. Bond, this is just the prototype. With a fleet of these boats I shall dominate the rives and seas of the world. The lower classes, starved of work pulling oars, will be easy prey for my expert marksmen... wait, what happened to my guards? What was that explosion? Why you... you're not Mr. Bond at all! You're actually Mr. MacGyver, aren't you?\n\nA pleasure to make your acquaintance; it[.] always pleasant to converse with a fellow student of the natural sciences, and you, sir, are a true connoisseur of the arts of the engineer. Well, it would appear you have won this round, but rest assured Mr. MacGyver, I *will* emerge victorious. Until then, there is only one lifeboat, so unless you can rig a raft from my guards' corpses, it would appear you are to rest in a watery grave."}