{"doc_id": "1366", "name": "2014_05_humanities_student_major_759_geegees", "namespace": "we1sv2.0", "metapath": "", "pub": "geegees", "title": "2014-05-humanities-student-major_759_geegees.txt", "pub_date": "2014-05-11T00:00:00Z", "Sentiment": "0.105", "Subjectivity": "0.48", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "591", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25afrd", "Reddit_id": "chfbvcs", "Subreddit_id": "t5_2st6x", "Commenter": "amberpomme", "length": "3803", "content_scrubbed": "Whoa, a psych student! Finally my expertise is relevant, haha.\n\nIf you do a search of this subreddit you will find many a thread with popular electives, so I'll focus on general advice from a psychology point of view. I assume that you are in the Arts stream, because the Science stream has a full course load of compulsory courses in first year. If you don't know what I'm talking about, check out the recommended course sequences here: [Arts](http://socialsciences. uottawa. ca/sites/default/files/public/undergraduate/course/sequence/specialization_ba_psy. pdf) and [Science](http://socialsciences. uottawa. ca/sites/default/files/public/undergraduate/course/sequence/bsc_psy. pdf) and any others including majors/minors can be found on the uOttawa website [here](http://www. registrar. uottawa. ca/Default. aspx?tabid=3961).\n\nAlright, so the Arts stream has 4 electives for every year essentially. What courses you take will depend on lots of factors, some out of your control like the time/semester they are offered. I would recommend considering the following elements:\n\n* Possible minor/prerequisites: I wish I had paid more attention to this in earlier years. In first year psych, there aren't any psychology electives, you have to complete 1101 and 1102 first. So you should check out courses related to what you want to minor in and/or topics you'd like to explore. Now is the time to take intro classes so that you can take upper year classes in those topics, and perhaps more importantly find out if you like or dislike them. My suggestions: if you have interest in pursuing studies in any Science, Health Science, Criminology, Economics, Business, French/other second language, Anthro/Sociology, etc. take the relevant first year course. It will generally be called 'Intro to [insert department here]' and have the course code 1101.\n\n* Professor/style: This is more for upper year psych courses, but also in general- the professor will strongly affect the course material and how it is taught. Different profs will have different styles, and many in the psych department are renowned for shall we say eclectic teaching styles. Look them up on rate my prof (taking reviews with a grain of salt) and talk to other students who have had that prof. For PSY 1101/1102 I strongly recommend Prof Haddad if you can get her! Another good resource is the [Psychology Students' Association](http://psaep. ca/)- they are your student representatives, take advantage of that! (They'll also be hosting a 101 week in September for incoming students, I highly recommend it!)\n\n* Scheduling: you are making your own schedule, so don't take a class at a time you know you won't be productive. 90min vs 3h classes, am vs. pm, friday/saturday vs week day. Find what works for you, and also pay attention to what is only offered one semester so you can plan around that. Some psych courses are offered in the summer, but not many, so keep that in mind.\n\n* Fluff/bird courses/personal interest: In first year, it[.] perfectly fine to take a course you know is completely irrelevant to your degree. There are lots to choose from, but the popular ones fill up extremely quickly, so act fast.\n\n* General Rabaska tips: Do your research ahead of time on the [timetable](https://web30. uottawa. ca/v3/SITS/timetable/Search. aspx) and mock up a schedule you're happy with. Have a few options if your first choices for electives fill up, and prioritize which sections of the compulsory courses you prefer. Don't underestimate people and dawdle signing up for courses, or you might be disappointed. There[.] a function that lets you know when space is available, use it but don't count on someone dropping.\n\nSorry about the novel, got a little too into it oops. If you have questions about the above or stuff I didn't cover, let me know.\n"}