{"doc_id": "1374", "name": "2014_05_humanities_student_major_796_uci", "namespace": "we1sv2.0", "metapath": "", "pub": "UCI", "title": "2014-05-humanities-student-major_796_UCI.txt", "pub_date": "2014-05-11T00:00:00Z", "Sentiment": "0.146", "Subjectivity": "0.268", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "312", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25bqu7", "Reddit_id": "chfrarr", "Subreddit_id": "t5_2r7xu", "Commenter": "rpgrocks", "length": "1668", "content_scrubbed": "IIRC, when you turn in your housing application online, there is a section for preferred roommates (i. e. People you already know and want to live with).\n\n**Things to Consider About Middle Earth**\n\n*  Middle is Actually on Campus, so you can literally get to class in 5-10 minutes if you happen to wake up late. You are located near Social Sciences, which is actually where a lot of first years have classes due to GEs. In addition, you are WAYYY closer to the ARC than Mesa is.\n* The better food is closer. Brandywine (mostly ideal for lunch) and Pippin (better for dinner) is located in Middle. Mesa Commons is okay in my opinion, but has gotten a lot better over the years\n* You get Keycards instead of Keys. Probably easier to carry around over a set of keys.\n\n**Things to Consider About Mesa**\n\n* Rooms are generally bigger than Middle. E. g. The Triple in Mesa is a lot better than the Triple in Middle.\n* You have to cross a street/bridge to get on campus. Mesa is located by the Arts side, and is closer to the Student Center and Humanties. Generally needs a bit more time to get to class compared to Middle ~5 more minutes. You can get to ARC by shuttle, but it takes a while since it has to go around.\n* IIRC Mesa will sometimes give you free scantrons by the Center. Compared to Middle, there are more places to study outside of your dorm room.\n\nHonestly, there[.] only a few things that are really -THAT- different. Lots of people say things about the kinds of people for Middle and Mesa, it[.] kind of a bunch of crap. People are awesome either way.\n\nThat being said I lived in Middle when I was a freshmen, and I would not change it after having lived there."}