{"doc_id": "1493", "name": "2014_05_humanities_student_major_1860_trueaskreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueAskReddit", "title": "2014-05-humanities-student-major_1860_TrueAskReddit.txt", "pub_date": "2014-05-29T00:00:00Z", "Sentiment": "0.079", "Subjectivity": "0.405", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "626", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26qdqz", "Reddit_id": "chu5mvm", "Subreddit_id": "t5_2s91q", "Commenter": "LostontheAverage", "length": "3273", "content_scrubbed": "I feel like anger has been the go to for generations but now we are also hearing the minority getting angry and loud because they no longer have the threat of being lynched.  This is of course a good thing for many many reasons.  It is also quite aggravating for others. \n\nI think that the PC movement is starting to get a little out of hand though IMO.  It[.] not really even about equality or fair treatment.  It[.] become about hating establishment and right now (as in the past) It[.] about hating white privileged Cis-bro[.] (I am pretty sure this is a term for Males but maybe I am behind on the gender/sex thing.)\n\nI am Fairly good looking white dude in my mid-20[.].  My dad made 6 figures.\n\nif you heard just that you would think I am an awful piece of shit right?  I need to check my privilege right?  But what If I am in no way a racist and misogynist and I have never done anything to a person because of their race or sex/gender? why do people hate me for this?  Why is it suddenly cool to hate on White men, when for the most part White men are the best behaved they have been in like 1500 years (or way more)?\n\nOh and my privilege?  My dad was physically and mentally abusive and so was my mother.  The only thing my dad paid for after I turned 13 were the groceries I ate and he allowed me to live in his house.  He made me get a job at a construction site at age 9 so i could learn how to do it as a trade and with the money i made he made me pay for all my clothes, anything i wanted to do, and anything I wanted that wasn't a food item that he also wanted to eat.  I left home when I was 16 to get away from him because he pulled a gun on me when i finally fought back.  Also I have a ton of health problems so I might be white but I didnt win the genetic lottery.  I have Asthma and I am pre-diabetic even though I am not overweight.  I am allergic to everything including all the cute animals.  I have severe ADHD and Dysthymia which is long_term depression for those of you that don't know.  I am not all that mentally stable to be perfectly honest.\n\nSo why when I am hanging out at my liberal_arts college with my mixed group of friends at a protest against Monsanto (by mixed I mean ll different races, trans men and women, Bi-sexual men and women, gay men and women, artists, engineers etc. etc..)  Does a privileged white chick need to get up in my face and make some awful comment about How I am a privileged Cis-bro (while not knowing my sexual orientation whatsoever.  In fact I find some men attractive, I just don't talk about it)  and that I don't belong with these people because I am not the minority!!???!?!?!\n\nIsn't that what equality is about?!?!? The minority and the majority getting along and not acting like there is a difference?!?  \n\nWhen this happened I was stunned and didn't even know how to reply because she clearly wasn't using logic to make her argument.  Thankfully my gay black buddy jumped in and told her to take her ass elsewhere because she didn't belong because none of my friends want anything to do with hatred and bitterness.  I love that guy.\n\nTL;DR Sorry I ranted but I just feel like it[.] the MRA[.] and The SRS that are making the internet slightly uncomfortable and that people have always gotten angry over nothing"}