{"doc_id": "1313", "name": "2014_05_humanities_student_major_205_askmen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskMen", "title": "2014-05-humanities-student-major_205_AskMen.txt", "pub_date": "2014-05-04T00:00:00Z", "Sentiment": "0.024", "Subjectivity": "0.214", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "384", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24owo0", "Reddit_id": "ch9cspj", "Subreddit_id": "t5_2s30g", "Commenter": "vorpalblab", "length": "2048", "content_scrubbed": "I got a liberal_arts degree (history) and then got a job in a company that dealt in metals wholesale and cut to size. I did well there, and things were on a career track.\n\nOne day I was in an antiques store and I saw a guy in the back room running a huge piece of mahogany through a saw. I realized I wanted to do that instead of talk on telephones, do math and organize shipping and inventory replacements.\n\nSo I went to the library and borrowed a book on cabinetmaking (The Cabinet Maker[.] Notebook by James Krenov). That Saturday I bought a table saw at Canadian Tire and began by placing an ad to repair furniture.\n\nBy ten years I had an antiques repair business going, had contributed a couple of articles to Fine Woodworking, and had a decent local reputation. \n\nThen the local economy went sour, so I got a place in an IT college. (!988) and a year later was in the IT business as a teacher of applications to industrial clients (WP, Word, Lotus 123, DOS) and worked it up to owning a majority share in an ISP with a room full of modems. Managed the bankruptcy when the phone and cable companies moved in to the business and decided to kill off the competition rather than buying up the clientele.\n\nSo I went to Toronto to get into the film business making props and scenery for a few years which was cool, but too fast paced.\n\nSo it was off to France as a bilingual Canadian doing home renovations of centuries old stone village houses for British, American and Australian clients who spoke too little French to function with the locals.\n\nHeart Attack. Quintuple Bypass, and retired to writing novels and shit like that as a pauper in montreal.\n\nIts been a fun ride, and I would not change it for any other.\n\nNaturally there are plenty of other things in the middle like a teaching degree, producing a TV series, a bit of farming and recreational chemistry back in the 60[.].\n\nMy point is, you are gonna live one life, it is forward only, no pause, no reverse, then it stops.\n\nIf it isn't fun, why the fuck are you going to keep on doing it?"}