{"doc_id": "1479", "name": "2014_05_humanities_student_major_1672_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2014-05-humanities-student-major_1672_news.txt", "pub_date": "2014-05-26T00:00:00Z", "Sentiment": "0.085", "Subjectivity": "0.424", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "231", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chrymyl", "Reddit_id": "chryvsm", "Subreddit_id": "t5_2qh3l", "Commenter": "Hayek_", "length": "1483", "content_scrubbed": "you are proving the point that college has become nothing but a job training facility\n\nNo one is arguing that humanities and the liberal_arts are worthless, or that universities should become trade schools. \n\nHowever, given its financial cost, graduates should be able to find gainful employment and make good on their loans. If not, we've got a problem. \n\nThe cost-benefit ratio is completely lost in advertising, marketing, and rhetoric—with students left holding the bag entirely. Universities are stoking the coals themselves, because more students in the chairs means more money into their coffers. \n\nUniversities cannot forever blow smoke up everyone[.] asses about the \"mission\" of the university in not providing credentials, while most middle- to upper-income jobs in the economy require some form of higher education credential as a basic requirement.  \n\nit[.] supposed to be about \"I'm an astute individual who wishes to further my knowledge and wisdom about the world and to socialize with others who have a similar interest\".\n\n\nThis is a tired argument. College was never about this, even in the 1950s. There wasn't some halcyon time where universities were full of flag-waving, ACLU-loving 18-year-olds dedicated to a priestly life of philosophy and contemplation of the human condition. They were originally finishing school for the elite. \n\nStandards, on the other hand, have changed. You don't need to be particularly bright anymore to graduate with a 4-year degree. \n"}