{"doc_id": "1324", "name": "2014_05_humanities_student_major_325_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2014-05-humanities-student-major_325_AdviceAnimals.txt", "pub_date": "2014-05-05T00:00:00Z", "Sentiment": "0.13", "Subjectivity": "0.337", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "301", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24stph", "Reddit_id": "chaiuc0", "Subreddit_id": "t5_2s7tt", "Commenter": "[deleted]", "length": "1692", "content_scrubbed": "Honestly, there isn't one kind of teacher. Really, it[.] like any workplace.  You have a mix of teachers -  some who care a lot and some who couldn't care less;  some who are extremely proficient at their work, some who are a chaotic mess;  some who are experts in their subject, some who completely idiots. You rarely get a teacher who is completely perfect or complete shit.   \n  \nI think we can all remember teachers who we liked a lot but from whom we didn't learn a whole lot.  My high school had a tendency to put athletic coaches in social_sciences class rooms. Most were great guys but didn't really know a lot about history, economics or government. I had plenty of science teachers who were smart people, incredibly knowledgeable in their field and complete assholes.  I had a math teacher who was probably a certified genius and couldn't teach his way out of a paper bag.   \n  \nMy mom was an kindergarten teacher and she literally went to work every morning at 6 am and got home every evening after 7 pm. Five days a week.  Every decoration in her classroom was personally bought by her because her district didn't have funds for decorative materials.  Because it was a poor district,  she provided most of the children with with all the crayons and school supplies they used.  \n  \nOn the other hand, I went to a liberal_arts college that had a teaching program and I sat next to teaching students (people who already had a BA and were working towards their MAT) who I wouldn't want within a mile of kids in a classroom.  There were English students who didn't know  how to write critical essays and properly cite their work. I pray they were all going into the preschool program.  "}