{"doc_id": "1412", "name": "2014_05_humanities_student_major_1104_boston", "namespace": "we1sv2.0", "metapath": "", "pub": "boston", "title": "2014-05-humanities-student-major_1104_boston.txt", "pub_date": "2014-05-16T00:00:00Z", "Sentiment": "0.044", "Subjectivity": "0.231", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "474", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25o6bs", "Reddit_id": "chjvseg", "Subreddit_id": "t5_2qh3r", "Commenter": "CupcakesAreTasty", "length": "2828", "content_scrubbed": "I am slightly sympathetic to your plight, but you need a serious wake-up call. \n\nIt[.] not Boston. It[.] you.\n\n I graduated in 2012 with a liberal_arts major.\n\nThese are extremely common, especially in this particular city. It[.] essentially a meaningless degree unless you have a master[.] or a PhD to back up undergrad work.\n\nI have a bachelor[.] in history and a master[.] degree in education. Without an advanced level degree, I would never have landed a job in Boston. I am lucky and landed my dream job pretty easily (high school history teacher), but the number of people I know with English, Psych, Sociology, Communications, or History degrees who work at Target or Starbucks is scary high.\n\n Spent a year traveling\n\nUnless you were doing volunteer work, or this travel directly relates to your area of study, and you spent time abroad gathering experience towards your preferred occupation, this was a major no-no, especially in this economy. It makes you look work-shy and unreliable. You should have hit the interview circuit immediately.\n\n My resume is almost entirely customer service, but that means jack shit, aside from sales.\n\nExactly. Because you're trying to build a career in a liberal_arts field with just a bachelor[.] degree. You are under-qualified and one among thousands. You should really consider grad school if you're serious about a career in the humanities. \n\n I can't count the number of interviews I've had. The number of rejections.\n\nThis literally has nothing to do with the quality of your resume and everything to do with your interview and people skills. My principal and I just interviewed a phenomenal candidate to replace me while I go on maternity leave, and her resume is essentially empty. We were her first interview, but she was passionate about our work, outgoing, well-spoken, knowledgable about our school, and very enthusiastic. We offered her the job on the spot because if we didn't, her next interviewer would.\n\n I had an interview for an admin assist role. Literally the most entry level thing out there. \n\nYou don't have the luxury of judging potential employment right now. It might be an entry level position, but the reality is beggars can't be choosers. \n\n they wanted someone with 1-3 years experience. And I already had 6months of experience.\n\nYes, because employers have the pick of the litter. There are hundreds, if not thousands, of recent college grads competing for each job in this city. Six months of experience is nothing, even for an entry-level job. If they wanted to train a new employee, they'd be looking for interns, not inexperienced people to fill paid positions. \n\n Is it Boston? Are people just unwilling here?\n\nThis is every city, because this is the way our economy is at the moment. You're probably going to have this problem no matter where you are.\n"}