{"doc_id": "1470", "name": "2014_05_humanities_student_major_1600_futurology", "namespace": "we1sv2.0", "metapath": "", "pub": "Futurology", "title": "2014-05-humanities-student-major_1600_Futurology.txt", "pub_date": "2014-05-25T00:00:00Z", "Sentiment": "0.086", "Subjectivity": "0.464", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "292", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chqpwd8", "Reddit_id": "chqse3n", "Subreddit_id": "t5_2t7no", "Commenter": "flamingofedora", "length": "1753", "content_scrubbed": "because many can't grasp the concept or are afraid of it.\n\nNot only that but how we philosphically think of human beings in the modern world.  Those who do not work or cannot get jobs are frequently thought of as individually socially pathological.  Especially in the States, where the very idea of *any* wealth redistribution is considered repugnant or even immoral.  \n\nLook at the recent series NPR did on the poor in the criminal justice system with fines http://www. npr. org/2014/05/21/314607003/court-fees-drive-many-poor-defendants-underground\n\nThink of drug addiction as well.  I think if you asked most people they'd have a view of it as a moral failing when experts in the field now completely consider it to be a disease with biological underpinnings.  \n\nOr when Obama stated that \"you didn't build that\" in reference to how we're all products of our environment and very few of us got to where we are without some sort of help, and was met with disdain at the very thought.  \n\nOr think of the open resentment people, especially on reddit, seem to have for people who study in non-STEM fields.  Frequently retorting that liberal_arts majors have degrees in making a Frappuccino.\n\nWe as a society have a huge way to go if this were even going to be remotely feasible.  What happens when what your interest, what your \"work\" is, in society, doesn't easily submit itself to being quantified economically?  What happens when your most productive labor is aesthetic in nature?  Where wealth translates so directly to power, the idea of giving power to people in the form of what would widely be called an \"entitlement to the useless and lazy\" is never going to scan unless we stop seeing buying power as the only meaningful indicator of human worth."}