{"doc_id": "1450", "name": "2014_05_humanities_student_major_1373_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2014-05-humanities-student-major_1373_AskReddit.txt", "pub_date": "2014-05-21T00:00:00Z", "Sentiment": "0.008", "Subjectivity": "0.31", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "560", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cho3q8j", "Reddit_id": "cho4y3b", "Subreddit_id": "t5_2qh1i", "Commenter": "ooburai", "length": "3254", "content_scrubbed": "**tl;dr:** I call shenanigans!\n\nI suppose, but that would be the (vague) equivalent of Roosevelt declaring major (European) combat operations in WWII over after the Battle of the Bulge or perhaps the Lake Balaton Offensive if you prefer.  Not precisely wrong, but probably not something that most people who were in Europe would have agreed with.\n\nActually given that the experts (not the political hacks) predicted a long insurgency I would say that it[.] a bit more disingenuous to make this claim since it gave the casual observer the sense that the boys were all coming home shortly.  And I would submit that this was not any sort of accident.\n\nFrom the Wikipedia article:\n\nThe banner stating \"Mission Accomplished\" was a focal point of controversy and criticism. Navy Commander and Pentagon spokesman Conrad Chun said the banner referred specifically to the aircraft carrier[.] 10-month deployment (which was the longest deployment of a carrier since the Vietnam War) and not the war itself, saying \"It truly did signify a mission accomplished for the crew.\"\n\nThe White House claimed that the banner was requested by the crew of the ship, who did not have the facilities for producing such a banner. Afterward, the administration and naval sources stated that the banner was the Navy[.] idea, White House staff members made the banner, and it was hung by the U_S Navy personnel. White House spokesman Scott McClellan told CNN, \"We took care of the production of it. We have people to do those things. But the Navy actually put it up.\" According to John Dickerson of Time magazine, the White House later conceded that they hung the banner but still insists it had been done at the request of the crew members.\n\nWhether meant for the crew or not, the general impression created by the image of Bush under the banner has been criticized as premature, especially later as the guerrilla war began. Subsequently, the White House released a statement saying that the sign and Bush[.] visit referred to the initial invasion of Iraq. Bush[.] speech noted:\n\n\"We have difficult work to do in Iraq. We are bringing order to parts of that country that remain dangerous.\"\n\"Our mission continues... The War on Terror continues, yet it is not endless. We do not know the day of final victory, but we have seen the turning of the tide.\"\nThe speech also said that:\n\n\"In the Battle of Iraq, the U_S and our allies have prevailed.\"\n\nWhen he received an advance copy of the speech, U_S Defense Secretary Donald Rumsfeld took care to remove any use of the phrase \"Mission Accomplished\" in the speech itself. Later, when journalist Bob Woodward asked him about his changes to the speech, Rumsfeld responded: \"I was in Baghdad, and I was given a draft of that thing to look at. And I just died, and I said my God, it[.] too conclusive. And I fixed it and sent it back... *they fixed the speech, but not the sign.*\"\n\nEmphasis mine.\n\nI would submit that Rumsfeld is a pretty definitive source in this context.  He[.] saying that clearly the sign was created with the intention of accompanying a speech that would have claimed the war was over, but that when they realized that the speech was just implausible nobody told the arts and crafts department to change the sign."}