{"doc_id": "1347", "name": "2014_05_humanities_student_major_588_futurology", "namespace": "we1sv2.0", "metapath": "", "pub": "Futurology", "title": "2014-05-humanities-student-major_588_Futurology.txt", "pub_date": "2014-05-08T00:00:00Z", "Sentiment": "0.128", "Subjectivity": "0.455", "Score": "21", "Upvotes": "21", "Downvotes": "0", "Wordcount": "796", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chcut59", "Reddit_id": "chd02ew", "Subreddit_id": "t5_2t7no", "Commenter": "saintandre", "length": "5080", "content_scrubbed": "It[.] unlikely that those left unemployed by automation will find gainful employment, as the biggest indicator for success in high-skill jobs is a level of participation in education that begins in pre-school. You can't travel back in time and give people a better upbringing.\n\nOn the other hand, we can imagine a future where young people stay in school until they are productive. Currently the population with Master[.] Degrees or higher have an unemployment rate of 3%. It[.] possible, on the other hand, that every high-skill job could have a fate like law[.] current struggle - enormous numbers of newly-trained lawyers can't find work. Once the number of people with MFAs and PhDs triples or quadruples, you'd expect them to have a harder time finding work.\n\nBut when you look at high-education workers over time, they've never had a hard time finding work. Even when the economy was severely depressed, the vast majority of the unemployed were low-education workers. That may not matter in a future where 50%-65% of workers have seven or more years of higher education. \n\nThe biggest question becomes \"Are people unemployed because there are no jobs, or are they unemployed because they are unproductive?\" When the discrepancy between unemployment rates among different levels of educational attainment is examined over time, we see that the answer is yes to both questions, at different times. More education leads directly to more productivity, while overall economic activity determines a \"threshold\" for minimum-productivity-for-employment.\n\nSo it[.] possible that automation will have nearly zero impact on employment, apart from **raising the threshold for the minimum level of productivty that can make one employable**. If there is a ceiling on the extent to which education increases a person[.] productivity, it isn't apparent at this time. \n\nThere are many examples of education being directed at fields that had eschewed formal education, with extraordinary results. \n\n* The Upright Citizens Brigade Theatre, for example, has managed to go from non-existence in the 1990s to owning and operating training facilities in most major American cities that have been responsible for training a significant number of the professional comedians employed in the US entertainment business. \n\n* The fine arts master[.] degree was, until WWII, a means for training women to teach painting to children. Now, the MFA is a professional credential for full time artists all over the world. A similar transformation has occurred with graduate degrees in creative writing, music and theatre (none of which emphasized professional credentials before the 1970s). \n\n* Video game design, which didn't even exist as a field fifty years ago, now employs more people each year, many of whom graduate from graduate programs at schools all over the country. The entire idea of \"game design\" as an occupation didn't exist prior to the 20th century, and in the current environment, a formal education appears to be strongly correlated with employment in the field.\n\nThere are tertiary consequences to the increased education of the population. A more educated population reads more, on a greater variety of subjects. Over the last twenty years, the market places for poetry, philosophy, history and science writing have exploded. By educating liberal_arts undergraduates in art, theatre and music, we've created an enormous audience for the consumption of those cultural products that will get bigger with each generation. As the population grows more educated, their tastes and market demands will grow more diverse, eliminating the economics of scale that make it possible to sell the same television show or movie to everyone in the country at the same time. Better-educated people are harder to sell to, which means more resources and creative energy will have to be dedicated to cultural production and advertising. It[.] possible to imagine a future where we have a market need in the US for millions of poets, millions of filmmakers, millions of mathematicians, etc. As a result of a universally sophisticated consumer base, \"coolness\" will be such a precious commodity, and so difficult to produce, that every person in the world could conceivably be employed in its production and distribution. And because \"coolness\" relies on both novelty and authenticity, it can't reasonably be automated. A sufficiently-educated audience will be able to accurately judge the \"humanity\" of a \"cool\" thing. \"Humanity\" itself will become the final product of capitalism, as Guy Debord predicted. We'll spend all our time sharing our experience of our own humanities with each other, trying to assemble them into a system of order that gives meaning to a universe where value-as-concept is nearly extinct.\n\nTL;DR - An increasingly well-educated population will consume more media, and more diverse media, and will be automated more slowly than a poorly-educated population. This media-creation cannot be easily automated, which means the consumer culture that drives the economy can continue indefinitely."}