{"doc_id": "1457", "name": "2014_05_humanities_student_major_1465_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2014-05-humanities-student-major_1465_AskReddit.txt", "pub_date": "2014-05-23T00:00:00Z", "Sentiment": "0.014", "Subjectivity": "0.335", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "400", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chp4rpg", "Reddit_id": "chp4zxz", "Subreddit_id": "t5_2qh1i", "Commenter": "aversion25", "length": "2349", "content_scrubbed": "If you're bringing opportunity cost into play then undergrads have the stats backing that they'll make more on average in the long run. Their time horizon is going to be ~30 years of wages which can surpass the debt they took on/forgone cost of 4 years (which already assumes they don't work part_time, do any paid internships, and that they have substantial amounts of debt). \n\nSome jobs simply won't give you any consideration without a degree. You're closing the door on those places. A highschool degree is practically worthless now, but NOT having a highschool degree is pretty detrimental to your job hunt. In the future the same thing will happen with undergraduate degrees (given the over saturation of college grads). So it[.] not a bad investment to make right now. \n\nYour argument is overlooking a few critical things. Employers have more applicants than positions, and 1 of the major criteria for their automatic filters is degree vs no degree. So a liberal_arts degree is definitely better than no degree. \n\nStudying any subject from the academic perspective will not make you an expert/capable of actually doing the job without training. Theory doesn't equate to real world application. If you did an undergrad in finance you're not going to graduate knowing how to trade/run through a billion dollar merger. You don't know anything except base concepts you studied in isolation. So why does it matter what you took? You still need on the job training.\n\nWall street hires liberal_arts kids (from top tier universities) all the time. I understand that[.] the exception and not the rule, but these are kids spending 200k for art history/english degrees and coming out making tons of $$. Employers want kids who are passionate/hard_working/capable of learning + grasping new concepts quickly. What sounds more appealing - a 4. 0 english grad with 3 relevant internships, or a 3. 1 gpa \"insert hard major here\" grad with no internship exp.\n\nWhat major a student takes is just one part of the equation, and it[.] a poor away to analyze them. You need to couple it with their overall plan is to apply/capitalize on the degree. Stereotyping them by major is a poor screening process. Someone who does 4 years of english is just as worthless as someone who did 4 years of engineering if neither of them thought about the future/what to do post grad"}