{"doc_id": "1465", "name": "2014_05_humanities_student_major_1574_tumblrinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrInAction", "title": "2014-05-humanities-student-major_1574_TumblrInAction.txt", "pub_date": "2014-05-24T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.48", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "417", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chqbyro", "Reddit_id": "chqca6z", "Subreddit_id": "t5_2vizz", "Commenter": "Zigstyle", "length": "2564", "content_scrubbed": " This is actually a more accurate understanding of sexual assault in today[.] society, though. Forced kissing and forced contact is considered sexual assault, although it wouldn't be considered rape.\n\nThe term \"forced\" is suspect, though, because we all have this idea where someone is holding someone else down when we think of forced. In reality, we could be talking about someone grinding up on someone else at a club and them not being interested; this would be unwanted \"forceful\" contact, but it[.] pretty benign, supposing the person stops afterward. \n\nAgain, that[.] linked to enthusiastic consent and sexual assault. One-in-five is definitely a valid statistic for sexual assault if those are the qualifications.\n\nI'm saying that \"enthusiastic consent\" as defined here would make anyone hooking up at a party a rapist (which is, to be frank, fucking ridiculous), and would make the following exchange sexual assault/rape:\n\n*starts making out and stuff*\n\"I'm not really in the mood right now...\"\n\"Aww that sucks.\"\n*more making out*\n\"I'm just feeling kinda worn out.\"\n\"Pretty please?\" (puppy dog eyes)\n\"Oh alright. I can't resist when you pull that face.\"\n\nI mean do we really want to call this sexual assault? Seriously? \n\nI guess the point is that if 1 in 5 is the statistic we're using for sexual assault, then sexual assault suddenly becomes a lot less terrible than we normally understand it to be, insofar as a great deal of it is essentially drunk teenagers fooling around or making lewd comments. Hardly rapists.\n\nHence why this kind of policy depends per department and per subject. Again, this would be a major undertaking requiring drafting policies and proper bureaucratic solutions. I can't speak for STEM fields; only humanities.\n\nThe only humanity that[.] been mentioned is literature. I can't see this working in anthro/psych/socio/philosophy/etc. You can't just ignore huge topics in a field.\n\nThis comes back to false consciousness, which is a Marxist theory. It doesn't always matter how the issue is perceived - it de facto affects the person. But it really depends in this case.\n\nWhat? What are you taking \"internalized prejudice\" to mean? It sounds eerily similar to the \"blacks can't be racist\" rhetoric.\n\nBut it[.] at least a good start to put the warnings forward for people who can prepare. Then other solutions can be created for students who cannot.\n\nJust seems like a lot of work for questionable gain.\n\nAgain, these are complex problems requiring complex solutions. But research suggests 9% of college students have PTSD\n\nSource?\n\n\n"}