{"doc_id": "1378", "name": "2014_05_humanities_student_major_814_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2014-05-humanities-student-major_814_AskReddit.txt", "pub_date": "2014-05-12T00:00:00Z", "Sentiment": "0.13", "Subjectivity": "0.461", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "613", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25bq6f", "Reddit_id": "chfy6z7", "Subreddit_id": "t5_2qh1i", "Commenter": "Hengist", "length": "3130", "content_scrubbed": "I'm see that I'm kind of late to the party. I've told this before, and even today, I hardly believe it happened, because it seems like some kind of nonsense from a romcom, but it[.] completely true.\n\nI realized that I loved my wife long before I actually met her. I was only about 14, and I was at a gas station on the Interstate near my home. My Dad always had me pump the gas, and while I was pumping it, I noticed a cute girl about my age in a nearby car. It was a profound moment. I was struck with the strongest feeling that I had just met my future wife. The moment was impressed onto my brain---I can remember seeing her in the front passenger[.] seat of her family[.] red AMC Gremlin just as well now as if it had only happened a minute ago. I only saw her for a moment before they drove off, and as my family got under way again, I had the strongest feeling that I was in love with a girl I would never see again. But I never once forgot her.\n\nIn my first few days of college, I met a pretty young lady. I was shocked at how fast I fell for her: she was my first girlfriend, and I was in those days a total computer nerd. Despite that, we hit it off pretty much instantly as friends, and within a few months, we were dating. One day, she invited me to come to her home and meet her parents.\n\nThis is going to sound like complete BS, but it[.] completely true and to this day, it messes with my brain. When I visited her home, I found that she WAS the girl at the gas station. Her photos show that she was a perfect match for the girl I remembered. Her family owned a red AMC Gremlin, and when they would visit her family in Idaho, they would usually stop at the gas station near my home. We then, completely coincidentally, chose to attend the same college in a different part of the country. It was a small liberal_arts college, not particularly famous and the kind that are almost a dime a dozen, so there was really no reason we should have both chosen to attend that one.\n\nThere was yet another amazing coincidence in our meeting at that college. Though it was a small college, it was large enough that chance meetings were unlikely. I was back then a complete computer nerd, and I shunned any kind of social event. She was an outgoing psych major with big career plans who had no plans to meet anyone. Had we been our usual selves, we never would have met.\n\nIn the first few days of college, there was a freshman dance. I had no plans to go, but that night I had nothing but trouble debugging some Z-80 assembly, and I was feeling pissed and decided, on a whim, to check out what \"social people did,\" so I went to the dance. She also had no plans to go, but then she heard there would be free pizza, so she went. I had actually gotten the last two slices when she arrived, but I shared with her and, being a total geek who was unwittingly working very hard to maintain his virginity, asked her if she had seen the new Trek film (ST II: Wrath of Khan). As it turns out, she was just as big a Trekkist as I was, and we spent the rest of the night making delightfully nerdy conversation.\n\nWe've been inseparable ever since."}