{"doc_id": "1388", "name": "2014_05_humanities_student_major_912_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2014-05-humanities-student-major_912_changemyview.txt", "pub_date": "2014-05-13T00:00:00Z", "Sentiment": "0.153", "Subjectivity": "0.328", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "609", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25glww", "Reddit_id": "chh2umk", "Subreddit_id": "t5_2w2s8", "Commenter": "thencaapawardgoesto", "length": "3451", "content_scrubbed": "I didn't take on pretty much any student debt during my undergraduate and graduate degrees. Primarily because I'm Canadian, our schools are less expensive, and my grandparents hooked me up with an RESP when I was a toddler so I had decent enough cash going into it.\n\nI started university before the economy tanked it. When we entered university, school counsellors were eagerly selling it as *the* way to a better life. You go to university, you get a decent entry level job, you work your way up, you get yourself a car and a house and a white picket fence and raise your babies and live happily ever after.\n\nMy lovely parents both went to university/college during a great time to be a university graduate. My mother had a job teaching disabled kids about plants at a school for the disabled. My dad got a decent job in construction management and estimating. My mother[.] actually never made a resume in her life and my father wasn't aware that *coverletters* exist. They're great people but I had no idea, as an 18 year old, that their advice wouldn't be sufficient. These are two people who came from lower income families and made their way to a comfortable middle class life - they're a great example of how education and hard_work can pay off.\n\nI never considered looking at employment rates for liberal_arts grads because everyone in my life - from teachers and counsellors at school to my parents and family at home - never had anything less than full confidence that a degree - ANY DEGREE - would net employment. And it[.] fairly true. People who graduated 4-5 years ahead of me were starting to get into the work force and even with liberal_arts degrees in English and History and Politics were getting clerk jobs in the government, and low level jobs in HR departments and PR companies.\n\nThis isn't an original story. Most of my classmates had similar aspirations going into university. Then 6 months later the economy[.] in the shitter, graduates are desperately scrambling for anything, nobody[.] hiring anymore and entire middle aged workforces are out hitting the pavement looking for jobs with much more experience than any 22 year old.\n\nIn considering dropping out to save money and coming back when prospects for grads were better - or switching into something pragmatic - we got advice to stick it through. The economy would have four years to improve by the time we graduated. Plenty of time for things to come around. Stay the course, study something you like so you'll get good grades, and things will be better when they graduate.\n\nWhich ended up being youthful optimism. And following the advice you want to hear.\n\nIn any case I was grateful by the end for the money in my RESP because plenty of my classmates ended up in tens of thousands of dollars of debt with nothing but a waitressing gig at Olive Garden to pay the bills.\n\nAnd it[.] not the upper/middle class kids who suffer most. They tend to have relations or family friends who can still get them coveted entry level gigs. They have families who can support them through unpaid internships or can provide the support to go to graduate school or get college certification.\n\nIt[.] the kids of working class families. Not the impoverished - because they usually do get substantial enough aide to stave off the worst - but  the kids who come from lower income but not under the poverty level types. People who lack the connections or support to even make much of that degree."}