{"doc_id": "1395", "name": "2014_05_humanities_student_major_966_gaymers", "namespace": "we1sv2.0", "metapath": "", "pub": "gaymers", "title": "2014-05-humanities-student-major_966_gaymers.txt", "pub_date": "2014-05-14T00:00:00Z", "Sentiment": "0.196", "Subjectivity": "0.449", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "1343", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25iprn", "Reddit_id": "chhqhlg", "Subreddit_id": "t5_2s9n5", "Commenter": "ssmathias", "length": "7573", "content_scrubbed": "Well, normally I'd encourage going to /r/okcupid to ask, but apart from that, here[.] a quick review:\n\n**Photos**\n\nThese are all posed shots, by yourself, with very little context around them. They show us *sort of* what you look like, but that[.] it. One could reasonably wonder if you ever leave your room. Get some shots of you being you, out with friends, doing something. Also, avoid trying to look sexy in your photos. It never works. You'll look sexier by being genuine.\n\n**My self-summary**\n\nDon't be afraid to talk a little more here. This is a great area to share what makes you the person you are, and give people an idea of the kind of person you are. Your profile and pictures currently don't give a great sense of your personality. Inject some of it into this area. You talk about loving music and the arts, maybe share a bit about things you enjoy in that vein such as concerts or art shows you've been to recently. Let people really get a sense of who you are here, as a person, not just what you're doing.\n\n**What I'm doing with my life**\n\nNow *here[.]* where you talk about what you're doing. Don't just talk about school, though. What else are you doing with your life? Are you a part of any clubs, taking part in extra-curricular activities? What are your goals after you complete your education? How, beyond education, are you working toward them?\n\nThis section is a good place to share some big accomplishments in your life. It[.] okay to be proud, provided you're being genuine.\n\n**I'm really good at**\n\nTry to make these things that aren't particularly common, and be sure to give some more examples. It[.] not really a list area. This is another opportunity to express yourself and your personality. You say you are good at writing, what sort of stuff? You say you're good at reading (I might remove this, anyone is good at reading if they're literate), but what? Thinking (How is one good at thinking?) about what? Singing, what style or pieces? With a group or alone? Clarinet, again share some more about what you do here, also this is a good thing to have a picture of you doing... Being unique? How is one good at being unique? What makes you unique?\n\n**The first thing people notice about me**\n\nNot too bad, this can be a difficult one. Remember, in some cases this should also be the trait that you think would be sort of \"most marketable\" for you toward potential dates. Is the first thing you want them to notice about you the fact that you're polite and articulate? So is an English butler. :-P\n\n**Favorite books, movies, shows, music, and food**\n\n**Books** - This part comes off as judgmental and pretentious. Avoid negatives in your profile where possible. Instead, give us an example of a book or two you've read recently, the sort of genre you enjoy reading, and why you enjoy it.\n\n**Movies** - Don't seem to see this mentioned anywhere. Do you not enjoy movies / film / cinema? If not, maybe mention something else that you enjoy more.\n\n**Shows** - Don't see this either. See my comments about movies. Also be aware that a show could technically include a play or musical. Few people seem to realize this, and it could set you apart, particularly as a music student.\n\n**Music** - One of your better sections, as I'd expect it to be. Again, though, we're not just looking for lists. Share a couple of your favorite artists, a couple genres you like, and then (and most importantly) why you like them.\n\n**Food** - Not too bad here. This is definitely closer to a conversational tone. Of course, pizza is a pretty common example to choose. If you're going with that, maybe share a bit more about your favorite kind of pizza? You'd definitely get some attention if it[.] unique.\n\n**Six things I could do without**\n\nOK, this area is a list and you've managed that, but still try to be unique. Think of this as \"six things that are important to me, but might not be important to everyone\". In particular, this should further reflect your interests and personality. I'm honestly surprised to see nothing about music here, for someone who is a music major, sings, and plays the clarinet. Is your clarinet not that important to you? Something to think about.\n\n**I spend a lot of time thinking about**\n\nNot the most exciting section, eh? I'd definitely remove the first sentence about being a deep thinker. It[.] not doing much to add to the profile, nor is it answering the implicit question. The next part is all right, but again kind of plain. Share something fun about yourself here. Surely, as a writer, you spend a fair amount of time thinking about stuff related to that?\n\n**On a typical Friday night I am**\n\nUse this section a bit more to your advantage. Share the things you enjoy doing in your spare time, in particular things that you enjoy doing with other people. This could invite them to contact you based on those similar interests and makes it easier to figure out potential options for going out together.\n\n**The most private thing I'm willing to admit**\n\nThis section is great, minus one thing. Get rid of the \"talk to me if you want to know more\" part. It sounds kind of like \"Someone please talk to me,\" which is probably a bit more needy and clingy than you want to go with. Also, this section isn't strong on spelling or grammar, and if you say you're good at writing that'd better hold up across your profile.\n\n**I'm looking for**\n\nIf you're just looking for new friends, then OKCupid probably isn't going to get you much attention. While the feature is supported, almost everyone there is looking for dates / romantic partners primarily, and will likely skip right over you when they don't see you're looking for the same.\n\n**You should message me if**\n\nDon't be generic here. This is the place on your profile where you get to give an idea of the sort of people you're looking for, and how they might fit into your life. Be more descriptive, and really think about that.\n\n**Questions**\n\nThis may be an age or personal thing, but several of your answers suggest possessiveness, and potentially judgment, in a way that could be off-putting or unattractive. Again, this is a personal thing and if those answers are important to you, then it[.] still best to be honest.\n\nIn particular:\n\n\"Are some sex acts with consenting adults inherently wrong or immoral? Assume no unusual risk of injury.\" - Yes (This is an answer you should probably explain, because if no harm is done and there is consent, there certainly must be some reason you still think it[.] not okay.)\n\n\"Would you be okay with your significant other spending a lot of time with one of his/her exes (as a friend)?\" - No. (Again, probably should explain this one a bit, especially as it seems somewhat contradictory to you considering jealousy unhealthy in a relationship.)\n\n\"Do you believe in God?\" - Yes (combined with your Religion being set as Other, you could have some good stuff to mention in your profile)\n\n**In general**\n\nHave a bit more fun with your profile and let your personality come through a bit more. Leave some fun information there that gives people both an opportunity and a reason to contact you.\n\n**Finally**\n\nSo, that[.] the overall advice I can give. As far as my \"credentials\", well, I'm a poly 32 year old man who still manages to get dates despite being in a poly relationship in an area where that[.] very uncommon. I almost always at least get responses to the messages I send out. My profile isn't perfect, but you're welcome to [take a look](http://www. okcupid. com/profile/ssmathias/) if you want to see what I'm talking about.\n\nGood luck!"}