{"doc_id": "1495", "name": "2014_05_humanities_student_major_1893_dungeonsanddragons", "namespace": "we1sv2.0", "metapath": "", "pub": "DungeonsAndDragons", "title": "2014-05-humanities-student-major_1893_DungeonsAndDragons.txt", "pub_date": "2014-05-29T00:00:00Z", "Sentiment": "0.03", "Subjectivity": "0.374", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "266", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26t44q", "Reddit_id": "chuezgl", "Subreddit_id": "t5_2qwdo", "Commenter": "pinkemma", "length": "1536", "content_scrubbed": "I see wizard and mage schools as more than just a classroom. It[.] a place of study, for all levels of mages. It[.] a place of refuge, as wizards are (in many settings, by races, etc, frowned upon). It[.] a place of meeting for the intellects that study the arts.\n\nI see them being funded by the patrons who need wizard services, kings, warlords, nobles, and the petty man who needs a simple incantation. I see the elder wizards supporting it, financially and intellectually. \n\nI expect most of them to have local accommodation, for the elderly wizards who study (I mean, c'mon, what self respecting wizard does not spend his entire life studying, some/most may also have that as their main goal in life), and for the students who might migrate from the surrounding farmlands (which can be extensive and days of travel away).\n\nI see them as a place for all races, sexes, and ages as wizardry transcends these issues (at least, seen from the outside, INSIDE I expect quite a lot of grumbling, (filthy dwarves, that[.] not REAL wizardry. SHE? A malevolent witch!!)).\n\nI see them as a place for consultation. A place locals come to for the  ails, their potions and small incantations. A place that might be interested in trinkets, or may be able to explain the intricacies of magic items and local superstition.\n\nI see wizards travel, to meet others, to research, or visit places of magic. Meetings to attend, messages being passed, or merely personalities that... well, they have egos, don't they?\n\nI think schools are more than just schools."}