{"doc_id": "1431", "name": "2014_05_humanities_student_major_1228_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2014-05-humanities-student-major_1228_changemyview.txt", "pub_date": "2014-05-19T00:00:00Z", "Sentiment": "0.006", "Subjectivity": "0.376", "Score": "22", "Upvotes": "22", "Downvotes": "0", "Wordcount": "1004", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25xgob", "Reddit_id": "chlol5t", "Subreddit_id": "t5_2w2s8", "Commenter": "justalittlebitmore", "length": "5818", "content_scrubbed": "I have to preface this with the fact that I've never actually played through the CL side of NV, I just can't make it past the fact that they're just all *dicks*. \n\n First of all, the NCR is spread incredibly thin. ... This would never happen under Caesar[.] command.\n\n[Map. Orange is NCR, Red is CL.](http://i. imgur. com/ESDg6. png) As you can see, they have roughly equivalent empires. The NCR might be overstretched, but that[.] only because they don't forcefully indoctrinate 100% of people within their borders to work towards the war effort.\n\nAs for crime, Caesar runs his land with an iron fist, using capital punishment for the most simple of offences. When you are born and live in a society where being weak will get you killed, and you wear a slave collar from birth, you don't have much of a chance of rebellion. Crucifixion for crime and fully 50% of the population being in the army results in incredibly low crime rates, but that doesn't mean it[.] the best choice. \n\n the NCR suffers from extreme corruption, far worse than what occurs within the Legion.\n\nOf course it does, it[.] a democracy (for argument[.] sake) vs a complete dictatorship. If the dictator suddenly changes his mind on an idea, or does so because of outside influence it[.] not corruption, it[.] simply how the system works. If it occurred in a democracy however, it would be. Apples and oranges. \n\nEveryone in power in the NCR has either been voted in or earned their place in the ranks. CL uses personal choice to place people in power, arguably corruption itself. \n\n Both the Legion and the NCR use prisoners as slave labor\n\nThe NCR use prisoners for work, similar to how the US (and most countries worldwide) do now. Arguing whether this is slavery is another debate entirely, so I won't go into that now. It[.] **entirely** different from how CL operates however and doesn't even come close to how horrifically they operate. \n\nThe Legion is considerably worse about this, however, as the Legion do take women and children as prisoners.\n\nTaking over entire tribes. The women are used as breeding more soldiers and to provide support for the army, children are taken from their family and raised under Caesar[.] ideology, and the weak are killed. Men are tested to see if they are worthy. If so, they become conscripts, if not, they are killed or placed into servitude. \n\nFrom the wiki: Slaves are one step above Captures and consist of captured humans unfit for combat duty as a Legionary. They are expected to adhere to the virtues of a slave (Honestas, Industria, Prudentia - honesty, industry, and prudence) and follow their master[.] orders without questions. They are given a new name and wear rags with a light red X painted over the chest. \n\nThis sounds pretty shitty to me. \n\n\n However, the Legion does this considerably better, as most of their military are willing to die for Caesar, and ferociously loyal, whereas the NCR Troopers just want to go back to California to see their families.\n\nThe NCR troopers here are just acting as any normal citizen would in this situation. Think back to WW1/2 conscription and how the vast majority of people simply wanted to go home. They had to fight to defend their homeland however, and did so, as the NCR troopers do in NV. \n\nCL troops are a different kettle of fish. You have recently taken slaves fighting because they know if they do not, they will be killed. Nothing motivates better than death. You also have second/third generation slaves born within CL. These guys obviously have much better feelings towards the Legion as they are brought up within it and brainwashed from birth, and also know if they don't they'll be killed. \n\n Both countries are on the brink of civil war. The NCR has extremely low approval ratings and poverty, whereas if Lanius takes over, his approval ratings will also drop and plunge the country into civil war.\n\nThe NCR tries to rule fairly and democratically. Think how well it goes in the world today and the amount of people who hate their government at any one time. Now imagine we all lived in a post-apocalyptic wasteland, and just how hard that makes their job. It[.] not surprising that they have a low acceptance rating, they simply cannot please all the people all the time. \n\nCL on the other hand is a dictatorship. Remove the dictator and it[.] very hard to fill that role without causing strife. Herein lies the downfall of the Legion as it only functions because of Caesar[.] iron rule. With a slightly different ideology or a marginally different leader, the whole society falls apart as they have been built on *Caesar*, not themselves or anyone else.\n\nCaesar thinks that humanities reliance on technology is weak, as can be seen by his order for the courier to destroy the securitrons if you follow the CL questline, and the general appearance and weaponry of the legion. We've seen from previous Fallout games that this is basically suicide, things like the GECK are humanities best chance at survival. There is technology out there that can help humanity no end, but if Caesar was in power over the whole Wasteland, this would not even be an option. I think that this point alone is the deciding factor; without technological advancement, humanity is doomed to an existence of subsistence, not progress as a species. Caesar wants a Roman-style society, so he[.] more than willing to put humanity back over 2000 years.\n\n**TL;DR:** Caesar is brutal and only succeeds by being all powerful. This cannot last and neither can the legion. Even if this was not the case, Legion rule would set humanity back thousands of years and doom them to a life of subsistence. \n\nThe NCR is a better option because even though they are flawed, they haven't abandoned all morals and at least try to provide a functioning society for those within their borders."}