{"doc_id": "1341", "name": "2014_05_humanities_student_major_556_occult", "namespace": "we1sv2.0", "metapath": "", "pub": "occult", "title": "2014-05-humanities-student-major_556_occult.txt", "pub_date": "2014-05-07T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.279", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "615", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24zy2q", "Reddit_id": "chchzmw", "Subreddit_id": "t5_2qhmc", "Commenter": "justinbthemagician", "length": "3397", "content_scrubbed": "To really explain all the facets and aspects of what you are asking someone to do you would have to understand the entire system and how it works. All of the \"entities\" you describe are magical in and of themselves, maybe not consciously created magical egregores but they have ideas (spirits) firmly supporting them and their function is just like your function: survival.\nWhat is your divinely inspired idea? What replaces these things you loathe? Do you understand them and what they influence? This is not a slam on OP but railing against these concepts and asking magicians to \"fix\" them is like fussing at a storm cloud on your day off. It is a perspective that is not fully grown to understand the complexities and patterns of life, what is needed and what is greater than you are. Real magicians work with the pattern, they learn what is needed, what the Long View is and how things progress and develop.\n\nAlso, OP seems to have a freshman introduction into politics and history level of understanding of the world. Capitalism was not created by governments, or maintained by them, true capitalism is hindered by our modern government. If I make talismans and wish to sell them to make money that is capitalism at work. If I work hard and make money for myself that is capitalism at work. If I get enough people who like my work and buy my products I can become a major corporation. By doing so I will of course seek my interests and do the best I can to make more money and survive the best I can. Since I am a human and have interests outside of business I may support the arts, schools, local and national businesses that I find worthy of my support and help individuals that I deem need assistance. I assume you are more liberal and socialist leaning. Please review the history of Russia, Cuba, China and Venezuela and ask yourself what these societies did, how it affected their people, their economy and their future. Now compare that to capitalist societies and contrast the standard of living, progress, creativity, arts, music, influence. Find refugees from said countries who escaped to come to America and ask why they did so.\nThe media for the most part (besides the awful Faux News) is mostly VERY liberal leaning. You may be confused at this point on my political stance, I am a Libertarian for the most part. In other words I think you have the_right and so do I to do as you please as long as you do not harm anyone else. In my opinion all media at this stage in history is terrible, they do not report the news and facts but influence the ways people think. \nYour belief in Government is also quite skewed, what is a government? What is our government? Do we have some monarchy? Is everyone working for some secret mastermind goal? Honestly, really consider reality versus your reality tunnel. Pick up some RAW books (Hail Pope Bob) and also really check out Crowley before you try to use him as some rallying cry, he at times criticized his country but loved and honored it at the same time (and may have been a spy for the Queen as well!) and by the way, I held regular viewings of V for Vendetta, Maybe Logic and The Matrix for friends interested in magick and enlightenment usually while imbibing the sacred herb, so before you think me a conservative, corporate mole let me assure you I am not even close. \nGood magick you you OP, Do your Will.\n/End wall of text rant"}