{"doc_id": "1468", "name": "2014_05_humanities_student_major_1583_askphilosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "askphilosophy", "title": "2014-05-humanities-student-major_1583_askphilosophy.txt", "pub_date": "2014-05-24T00:00:00Z", "Sentiment": "0.161", "Subjectivity": "0.384", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "844", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26esnr", "Reddit_id": "chqis6z", "Subreddit_id": "t5_2sc5r", "Commenter": "thinkPhilosophy", "length": "4965", "content_scrubbed": "Well, most (all respected) philosophy journals are blind peer reviewed (this means you are accepted or not accepted without the reviewers seeing your name or who you are, your affiliations), so in theory there is no reason why you can't write and even get published in philosophy journals. (Publishing is the highest coin in academia, so if you can do this, you'll be golden, but it[.] not easy to carve out the time that is necessary to do the research and writing in my experince. There are also many non-fiction publishing venues these days, outside of academia.) (Anecdotal: One of my profs tells the story of how they wanted to dismiss her from her grad phil program because she hadn't fulfilled a requirement for writing an essay of \"publishable\" quality according to her profs, so she went ahead and submitted them to some journals, got accepted for publication, and now she[.] at a big wig at a top U. It happens more than one thinks... and journals are many and they need content badly.) Ditto conferences, which are also often blind reviewed. (I had an super smart undergrad student apply and be accepted to give a paper at a top neurophilosophy conference, a story he loved to tell! ) The problem might not be with engaging with philosophy itself, but the conventions and unspoken unwritten rules around being a professional academic you can only get by going through grad school. (IMHO, many of these unwritten rules are about class, and I managed to studiously ignore most of these, so maybe going to grad school doesn't totally do ti for everyone...) You also get a network of people who you know and know you, a mentoring system when you write you dissertation. In theory, there are probably ways to get all these things for a really creative and determined person who can figure out how to network their way into some of these intellectual spaces, and find some good mentors. (If there is a university or college around you, see if you can \"sit in\" on some classes (ask the instructor, many will not mind and say yes, some may have some conditions around your participation, etc; or attend any of the public talks they schedule - academia wants to think of themselves as open to the community, and access is not as closed as it would seem.) There is also teh example of independent scholars (people who usually are rich so don't need to teach/an academic position to pursue their academic interests). They are sometimes not as well received (usually there is some class resentment because they are usually very priviledged even relative to other academics), but there are places in academia for them. For example. academia is chock full of \"research groups\" and \"institutes\" that sponsor independent researchers and others conducting research outside of professorships, so there are spaces within academia for published, well connected people doing research projects wehre they need (for example) to use the academic library. Why not try to find and \"interview\" some independent scholar you see as similar in your interests, and see if it is a model you can work? (There are even some independent academic orgs you might be able to reach out to...) I'm all for freeing philosophy from academia, so I say go for it if you think it[.] worth doing even if you don't totally succeed, you could be opening a way for others down the road. (One of the consequences of the privatization of academia is that it will not exist in its present form much longer, so there is opportunity there for those looking at it at a certain angle.) But try to be clear wether you want to do philosophy or be accepted as an academic - likely the latter is a long way off. The first is possible, and people make their way into philosophy territory sideways all the time - see \"The Obstacle Is the Way\" on Stoicism by an entrepreneur, currently in the top of Amazon[.] best sellers in Philosophy. I'm babbling, best of luck, drop me a line if you have any more specific questions for someone who[.] been there. P. S. Check out the [Public Philosophy ning](http://publicphilosophynetwork. ning. com/), mostly professional academics, but they welcome independent scholars and \"activists.\" It[.] by membership and you will need to sign up and be approved, so ways to show you are already somehow engaged with philosophy would be good.... [Dr. A](http://www. thinkphilosophy. org/) P. S. Also, there are other ways to be around and engage in philosophy without becoming an academic philosopher or even independent scholar of some sort - for example, an editor at an academic press in the humanities or philoosphy dept, a librarian at an academic library, admin and support for a philosophy org like the APA (american Philosophical Association), working at a university and getting to know the philosophy people, participating in department talks and celebrations, and many many more. Often working at a college or uni comes with the ability to take free classes for credit, so there is that..."}