{"doc_id": "1333", "name": "2014_05_humanities_student_major_497_bostonu", "namespace": "we1sv2.0", "metapath": "", "pub": "BostonU", "title": "2014-05-humanities-student-major_497_BostonU.txt", "pub_date": "2014-05-06T00:00:00Z", "Sentiment": "0.095", "Subjectivity": "0.246", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "335", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24x8vt", "Reddit_id": "chbkvst", "Subreddit_id": "t5_2s4to", "Commenter": "kimolas", "length": "1852", "content_scrubbed": "Hey hey I saw this over at /r/CMU but I figured I would repeat my comment here so that people who actually know about Core can tell me why I'm so wrong about it! \n\n-------------------------\n\nHey, something that I can actually help with! I'm from BU (class of 2013, Mathematics with Honors). I'm currently a Ph. D. student at CMU (in the Department of Statistics). I don't know much about Bio/Med other than what my friends have told me. But I can tell you that Boston is significantly better than Pittsburgh.\n\nIf you go to BU you'll be within 25 minutes walk to literally everything there is to do in Boston. If you come to Pittsburgh, you'll be lucky to be within 25 minutes of campus if you ever live off-campus. Also, don't do Core! The impression I got from my friends in Core is that it was a huge waste of time and they regretted getting stuck with it. Doing your humanities courses separately (i. e. outside of Core) is the way to go in terms of flexibility. You'll probably find more interesting courses to take outside of Core but that[.] your preference.\n\nAlso, I miss Boston/BU. Boston will spoil you. Food was always a \"necessity\" thing for me, but Boston turns everyone into a foodie.\n\nEdit: If I don't respond for a day that[.] because my qualifying/comprehensive exam is all day tomorrow (yes yes, I know I shouldn't be on Reddit). PM me with your email info and I'll tell you all about food!\n\nEdit 2: I also wanted to spread the good word about research at BU. Research is obviously huge, especially in Bio. One of my friends did biomedical research for something like 3 years at BU and is starting an MD/PhD at a top top program next year. CMU undergrads (at least the ones I know) seem to worry about working with certain professors, but at BU everyone I know of was able to do undergraduate research with the professor/lab he/she wanted."}