{"doc_id": "1399", "name": "2014_05_humanities_student_major_998_apstudents", "namespace": "we1sv2.0", "metapath": "", "pub": "APStudents", "title": "2014-05-humanities-student-major_998_APStudents.txt", "pub_date": "2014-05-14T00:00:00Z", "Sentiment": "0.134", "Subjectivity": "0.278", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "482", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chi533z", "Reddit_id": "chi5o2f", "Subreddit_id": "t5_2y9jq", "Commenter": "mkbloodyen", "length": "2799", "content_scrubbed": "Make connections and generally explain why. You can link a lot of stuff together. Thats simply analysis, I did this on one of my in-class essays that was a comparison between a European Government and Non-Western Government of your choice. (mainly centered around 1450-1800).\n\nIn my essay I linked how unlike the English Monarchy, the Qing Dynasty supported the arts. First I explained the use of the civil service exam (they weren't enough ethnic Manchus to run China), and then due to the large amount of aristocrats and those taking the exam  leading to a surplus of qualified individuals. These individuals set up prep schools to help those pass the exam. Since schools leads to literacy, there is an increased amount of books being published and read (the arts). At the end, it usually good if you are doing something like that compare it with the other one such as: While the English Monarchy did not directly support the arts, it did feature the development of prominent works such as those of William Shakespeare and Adam Smith[.] \"Wealth of Nations\" (he was Scottish but, still Scotland was under the control of the crown). You could analysis this, but isn't worth it. The essay doesn't focus on the Industrial Revolution and Free Markets (it could be contrast to mercantilism if you so desire, that would be a strong idea)\n\nA pretty long example, but gives us a good example of really good analysis in my opinion. You obviously don't need to do that, something as simple as:\n\nBecause of the death of natives from new world diseases such as smallpox and the actions of Bartoleme De Las Casas proclaiming them as humane, slaves were imported from Africa to work on European Plantations in the new world.\n\nExact dates aren't important, names are more important that dates. Just know Chronology.\n\nRead the Rubrics *BEFORE* taking the exam if you haven't already, there are some easy points you can get if you don't know anything (but then again, the essay topics are so broad that you should be able to write something relevant). You get a point for writing a thesis. A Thesis. I think that more people can write a specific, directed, thesis. Easy point. Mention a wanted document for a DBQ, an easy point. You can just name a general one (woman is a good one most of the time), you don't need to always name a specific one such as The Communist Manifesto. A point for a direct comparison in the C&C. This is simple: \n\nThrough the reconquista, the Spanish government didn't support religious tolerance while the Abassiad Caliphate did have a degree of religious tolerance allowing non-Muslims to practice their religion.\n\nCollegeboard recommends 5 mins. of pre-writing time per essay. Use it. A well developed essay that you know what you are going to say is quicker to write, and better.\n\n"}