{"doc_id": "1505", "name": "2014_05_humanities_student_major_1966_politicaldiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "PoliticalDiscussion", "title": "2014-05-humanities-student-major_1966_PoliticalDiscussion.txt", "pub_date": "2014-05-31T00:00:00Z", "Sentiment": "0.119", "Subjectivity": "0.31", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "278", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chvmdan", "Reddit_id": "chvo4ix", "Subreddit_id": "t5_2sfmf", "Commenter": "homosaurusrexalot", "length": "1660", "content_scrubbed": "My college newspaper had this argument between its editorial board and the student readers. A student wrote in to complain that so many of our professors seemed to support \"liberal\" ideas. Admittedly, it was a private liberal_arts college with strong focuses on vocation, community, and global justice. It was also a Christian college, and that led to a great mix of student heritage and backgrounds. \n\nThe editorial response to the student complaining about a possible liberal bias in the faculty was this: We, as students, entrusted _________ College to guide us and build our knowledge and skills for a successful future. It does seem apparent that our faculty share common values of social equality, global justice, gender equality, etc. These lessons may not match those you were brought up with. You may not have heard these opinions and thoughts from your parents while growing up. However, that does not mean they can be as easily dismissed as labeling them \"liberal\" and, therefore, unworthy. The fact is this: our faculty are collectively the smartest people any of us has ever been surrounded by in our short lives.  If there views and opinions seem to skew toward one political opposite or the other, in your view, that[.] fine with us. We'll simply continue letter the smartest people we've ever met expose us to new ideas and perspectives. Then we'll make our own choices about how we see the world. \n\nTL;DR My college handled this issue when a small town student gripes about \"liberal\" professors. Opinion columnist was all like: \"Shut up and learn. If all the smartest professors on campus happen to be liberal, maybe there[.] something to that.\""}