{"doc_id": "1352", "name": "2014_05_humanities_student_major_629_howtonotgiveafuck", "namespace": "we1sv2.0", "metapath": "", "pub": "howtonotgiveafuck", "title": "2014-05-humanities-student-major_629_howtonotgiveafuck.txt", "pub_date": "2014-05-09T00:00:00Z", "Sentiment": "0.05", "Subjectivity": "0.426", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "430", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_253hrd", "Reddit_id": "chdjj1m", "Subreddit_id": "t5_2tna8", "Commenter": "MFTRW", "length": "2348", "content_scrubbed": "The first problem you're having is the fact that you're trying to pick a major instead of a career.\n\nStart by deciding the lifestyle that you want.  Do you like to work in an office?  Do you like to be the employee doing the work?  Are you looking for a \"40 hour a week job\" or are you okay with a screwy schedule?  Is your goal lots of money or just a typical amount?  Write down the important things for your lifestyle, don't just think about them.\n\nThen decide what overall types of things you don't hate to do.  I personally despise paperwork and busywork in general (I could tell this in college because I pretty much skipped homework) so I decided that the entire business school was pretty much out.  I don't mind doing problem-solving so engineering was a decent one.  There will be parts of every job that suck but the overall theme of your career shouldn't be absolutely miserable.\n\nDecide right now if you are going to be able to endure (financially, emotionally, and mentally) grad school.  I certainly couldn't have imagined going.  If you don't think you would want to, then make sure that there are plenty of jobs available without a graduate degree (bye bye liberal_arts degrees).  \n\nNow take this information and narrow it down to a college.  This shouldn't be too terribly hard by this point.  Now don't even consider any of the rest.  You're done and that decision is behind you.  Now is the hard part (and luckily the least important part!), deciding which actual major is for you.\n\nDo the research.  Look online and find out what the typical career path looks for each of these degrees.  Make sure that the end goal is what you want to be doing when you have kids/wife/get old/etc.  The end goal is what you need to pay attention to, not the beginning job.  You're getting a degree for a career, not a job and the job will change quickly.  I've had 3 different \"jobs\" in the last 2 years, and will probably continue to change jobs just as quickly for the next 5 years.\n\nHopefully, I've helped a little bit.  If you'd like to talk about the process with me, just shoot me a pm and I'd be happy to help you work through the process.  Good luck and remember that even if you get the completely wrong degree, it[.] not the end of the world and you'll just have to take a little bit more twisty a career path than other people would."}