{"doc_id": "1410", "name": "2014_05_humanities_student_major_1101_ukrainianconflict", "namespace": "we1sv2.0", "metapath": "", "pub": "UkrainianConflict", "title": "2014-05-humanities-student-major_1101_UkrainianConflict.txt", "pub_date": "2014-05-16T00:00:00Z", "Sentiment": "0.029", "Subjectivity": "0.353", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "1416", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25qg9h", "Reddit_id": "chjuha1", "Subreddit_id": "t5_30hhs", "Commenter": "veritanuda", "length": "9813", "content_scrubbed": "This is just flamebait. I feel so sorry for you if you are really so confused.\n____\nDr. Lawrence Britt has examined the fascist regimes of Hitler (Germany), Mussolini (Italy), Franco (Spain), Suharto (Indonesia) and several Latin American regimes. Britt found 14 defining characteristics common to each:\n \n* *Powerful and Continuing Nationalism - Fascist regimes tend to make constant use of patriotic mottos, slogans, symbols, songs, and other paraphernalia. Flags are seen everywhere, as are flag symbols on clothing and in public displays.*\n\n\nDo you see everyone dressing the same in Russia? [No.](http://girldir. com/files/images/biryukov-spring2009-02. jpg) Russia has a [very vibrant fashion industry](http://russiafashionweeklive. com/) And while the Russian flag is a matter of pride, it is no more waved and paraded than the [Union Jack](http://im. ft-static. com/content/images/973d2b02-ad90-11e1-bb8e-00144feabdc0. img) or the [Stars and Stripes](http://antiochherald. com/wp-content/uploads/2013/07/East-County-Military-Families-salute. jpg)\n \n* *Disdain for the Recognition of Human Rights - Because of fear of enemies and the need for security, the people in fascist regimes are persuaded that human rights can be ignored in certain cases because of \"need.\" The people tend to look the other way or even approve of torture, summary executions, assassinations, long incarcerations of prisoners, etc.*\n\nThe rights and liberties of the citizens of the Russian Federation are granted by Chapter 2 of the Constitution adopted in 1993. Russia does not practice ~~torture~~ rendition, drone strikes, the death penalty and bulk data collection on all it[.] citizens. Unlike [some countries](http://www. theguardian. com/world/2014/mar/27/us-human-rights-record-chastised-un-report) we could mention. \n \n* *Identification of Enemies/Scapegoats as a Unifying Cause - The people are rallied into a unifying patriotic frenzy over the need to eliminate a perceived common threat or foe: racial , ethnic or religious minorities; liberals; communists; socialists, terrorists, etc.*\n\nThis might be partially true, but a quick review of Russian history also shows it has been invaded dozens of times in the past from every direction and almost every country, including the UK, France, Gemany, Italy, China, Austria, Germany, Muslims etc etc. But it would help lots if the satellite countries around Russia stopped accepting NATO missiles and point it at them in Russia direction with the lame excuse they [are a missle shield to protect from North Korea](http://www. dailystar. com. lb/News/International/2012/Mar-26/168004-nato-to-declare-missile-shield-without-putin-rasmussen. ashx)\nYou want to see a persecution complex you need look no further than how the [UK whines everyone hates us when it comes to losing Eurovision](http://www. dailymail. co. uk/news/article-182129/Iraq-war-blamed-Eurovision-failure. html)\n \n* *Supremacy of the Military - Even when there are widespread\ndomestic problems, the military is given a disproportionate amount of government funding, and the domestic agenda is neglected. Soldiers and military service are glamorized.*\n\nOk I won't wax lyrical on this but instead point you to [this article](http://nation. time. com/2012/09/25/comparing-defense-budgets-apples-to-apples/) and if you still think Russia is a militarised society then you really need to cut back on that wacky baccy you've been smoking.\n\nOn a side note to my American cousins. You guys really need to [sort out your priorities.](http://steveharoz. com/public/NASA%20budget%202. png) It is depressing.\n \n* *Rampant Sexism - The governments of fascist nations tend to be almost exclusively male-dominated. Under fascist regimes, traditional gender roles are made more rigid. Divorce, abortion and homosexuality are suppressed and the state is represented as the ultimate guardian of the family institution.*\n\nThis is possibly the most non-sensical thing to think about Russia. As Russian women are some of the most courageous, strong-willed and respected women on the planet. I suggest you take time to look through [a list of some notable heroines](http://great. russian-women. net/) and remember that their women fought right along side men in WWII.  \n\n\n\n \n* *Controlled Mass Media - Sometimes to media is directly controlled by the government, but in other cases, the media is indirectly controlled by government regulation, or sympathetic media spokespeople and executives. Censorship, especially in war time, is very common.*\n\nThis is a such common attack on Russia and while their might be some authoritarianism to state TV that is no worse than having [90% of all media being owned by just 6 companies]( http://www. businessinsider. com/these-6-corporations-control-90-of-the-media-in-america-2012-6). They still have a full range of entertainment, documentaries and news as any other country. \nThe idea that Russians have no access to world wide media though is totally laughable. There is no great firewall of Russia and they have Facebook accounts and twitter accounts like everyone else. If anything they have access to more sources of information than you average Brit or American does, because while most Russians can at least read English we are very lazy with trying to learn to read Russian.\n \n* *Obsession with National Security - Fear is used as a motivational tool by the government over the masses.*\n\nHmmm well in a post Snowden world if you are not paranoid you are pig ignorant. That being said.. as far as I know fear, rough justice  and mass surveillance are not the tools of Russia.. but of [someone else](http://www. reddit. com/r/NSALeaks/wiki/index) \n \n* *Religion and Government are Intertwined - Governments in fascist nations tend to use the most common religion in the nation as a tool to manipulate public opinion. Religious rhetoric and terminology is common from government leaders, even when the major tenets of the religion are diametrically opposed to the government[.] policies or actions.*\n\nThis is obviously not true as the Russian Orthodox Church has no authority in government at all.  But like the CofE they do still retain a moral voice and representation on national councils. Russia does not the strange situation where the head of the church is also the head of state which is what Queen Liz is in the UK.\n \n* *Corporate Power is Protected - The industrial and business aristocracy of a fascist nation often are the ones who put the government leaders into power, creating a mutually beneficial business/government relationship and power elite.*\n\nAh hah you are thinking that means oligarchs right?! Umm no wrong.. Although there are a lot of wealthy individuals in Russia they are rich because of the state run Industries they manage.  And in fact there are not that many [compared to some countries](https://en. wikipedia. org/wiki/List_of_countries_by_the_number_of_US_dollar_billionaires). Russia has only be practicising capitalism for a few decades if you want to see the real masters of melding corporation and state then [look no further](http://www. telegraph. co. uk/news/worldnews/northamerica/usa/10769041/The-US-is-an-oligarchy-study-concludes. html)  \n\n \n* *Labor Power is Suppressed - Because the organizing power of labor is the only real threat to a fascist government, labor unions are either eliminated entirely, or are severely suppressed.*\n \nHaha.. I laugh because the idea that Russia does not respect the worker is just so ludicrous. Do you see many [of these where you live?](https://upload. wikimedia. org/wikipedia/commons/5/57/2008---Russia-Omsk-vodoprovodchik. jpg) Just because they are not communists anymore, does not mean they are not economic-socialists still. Unions [are still a big part of Russia](https://en. wikipedia. org/wiki/List_of_trade_unions_in_Russia)\n\n* *Disdain for Intellectuals and the Arts - Fascist nations tend to promote and tolerate open hostility to higher education, and academia. It is not uncommon for professors and other academics to be censored or even arrested. Free expression in the arts and letters is openly attacked.*\n\nAnyone dare throw aspersions at Russia on arts and culture? You have all heard of the Moscow Ballet, Tchaikovsky, Pushkin, Tolstoy,  Alyona Azernaya, Ural Philharmonic Orchestra etc etc etc.. Same goes for philosophers, doctors, poets and journalists. Under communism EVERYONE went to school, EVERYONE learned to read and write, and EVERYONE got a diploma. Again there are other non-Russian countries which struggle to even get that right.\n \n* *Obsession with Crime and Punishment - Under fascist regimes, the police are given almost limitless power to enforce laws. The people are often willing to overlook police abuses and even forego civil liberties in the name of patriotism. There is often a national police force with virtually unlimited power in fascist nations.*\n\nWell I should not need to spell it out to anyone who reads this sub, but Ukraine[.] police infrastructure was inherited from the USSR. How unlimited have their powers been? Same in Russia. Police are police and they can be good and bad just like anywhere else in the world. But they are certainly not all powerful.\n \n* *Rampant Cronyism and Corruption - Fascist regimes almost always are governed by groups of friends and associates who appoint each other to government positions and use governmental power and authority to protect their friends from accountability. It is not uncommon in fascist regimes for national resources and even treasures to be appropriated or even outright stolen by government leaders.*\n \nSounds more like Ukraine to me. But nepotism and cronyism happens all over the world. There are plenty of examples in the US & UK don't see why we have to single out Russia for that trait. It is certainly not rampant. \n\ncont ... "}