{"doc_id": "1467", "name": "2014_05_humanities_student_major_1579_thebluepill", "namespace": "we1sv2.0", "metapath": "", "pub": "TheBluePill", "title": "2014-05-humanities-student-major_1579_TheBluePill.txt", "pub_date": "2014-05-24T00:00:00Z", "Sentiment": "0.06", "Subjectivity": "0.343", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "508", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26ev0z", "Reddit_id": "chqfphy", "Subreddit_id": "t5_2vzvv", "Commenter": "FeminaziJournalist", "length": "2951", "content_scrubbed": "Holy shit!\n\nI know, of course, that none will object to this plan, since it does reflect what our society holds dearest. In men, charisma, honor, individuality, strength of will, and in women, beauty and youth.\n\nUm no! I'm pretty sure a ton of people will object to this plan! There is so much wrong with it.\n\nI began a careful survey into the ideals of beauty, referring to such experts as the Disney Company, Seventeen Magazine, Glamour Magazine, Mattel, Mabeline Cosmetics, Cover Girl, Vogue Magazine, Calvin Klein, and numerous others who have defined and promoted feminine beauty over the years.\n\nSurvey meaning you flipped through magazines while fapping?\n\nRound or triangular faces automatically exclude a woman from academic prospects.\n\nAnd I assume all men who are assholes will be excluded from academic prospects because charisma is valued in this system?\n\nThe most beautiful females will receive additional training in the arts of dress, game play, and most especially on bedroom skill; they will be later paired with accomplished males as mistresses or concubines.\n\nOh yeah, we need to train women on how to be good little objects to men. Notice the \"most beautiful females\" aren't even supposed to get married, just become mistresses or concubines.\n\nThis awarding of women to men, again, should be acceptable to all, as supported by my experts at Avon Publishers, Harlequin Publishers, and by Johanna Lindsey.\n\nNo, it won't be acceptable to almost anyone who isn't a misogynist fuck like you.\n\nthat the most beautiful women can assume only the roles of either Madonna or whore. We have no room for Madonnas in our society, since virtue is not valued in women.\n\nRight, because the female sex objects are so simple they can only have one of two personalities.\n\nSecond track women will receive additional training in the arts of party hosting, advanced social graces, cooking, and sex. They will be married whichever man first claims them at the age of sixteen.\n\nMarried at age 16? Trained in sex before then? No pedophilia there.\n\nThird track women will prepare themselves for a life as sexual technicians for the vocational class of men. Given that the demand for their services will be high, further training will be unnecessary, and they will enter the work force at the age of 14.\n\nBecome sex workers at the age of 14? And this person sees no problem with this?\n\nI realize that a few misguided persons, might, after reading my proposal, accuse me of being sexist or motivated by my own desires for women.\n\nI'm definitely not misguided. You are most certainly sexist.\n\nLet me refute that with the facts that I am myself a woman, having no desire for other women.\n\nIf you really are a woman (which I doubt) then you have some major self hate issues.\n\nMy time is too valuable to spend on such pursuits, given that so much of it is taken up with self-maintenance.\n\nIf you really were a woman then why did you feel the need to clarify this?"}