{"doc_id": "1486", "name": "2014_05_humanities_student_major_1821_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2014-05-humanities-student-major_1821_changemyview.txt", "pub_date": "2014-05-28T00:00:00Z", "Sentiment": "0.182", "Subjectivity": "0.382", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "423", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26rgmw", "Reddit_id": "chtt57q", "Subreddit_id": "t5_2w2s8", "Commenter": "[deleted]", "length": "2331", "content_scrubbed": "Instead, we should be emphasizing that children should know what they want from life, whether their goals be personal, financial, etc.\n\nThis is exactly what we're telling children when we tell them to follow their dreams. Their dreams are what they want from life, whether their goals be personal, financial, etc.\n\n If I just love the arts and want to go to school for theatre or sculpture or something, but I also wish to make six figures in my life, I should be made aware that I have probably picked the wrong career path.\n\nThen following your dreams would be to figure out the best way to make 6 figures in the art field. This may be your dream, but not everyone cares about making 6 figures and thus not everyone necessarily dreams of making 6 figures. Many people would be just to find something they enjoy and to be able to make enough money from it to live comfortably.\n\n I think people place too much emphasis on job satisfaction. A job is just that, A JOB. You shouldn't have to love it or even like it.\n\nBut what[.] wrong with pursuing a career that you actually enjoy? Why can't a job be both. A job is something that you devote a great deal of time to. Why would you not want to devote this time to something that you enjoy, or why wouldn't we encourage our children to do just that?\n\n Going to school for sculpting then having a serving job at 55 hours a week to make ends meet and living just above the poverty line, or learning skills that will provide a decent income and probably give you benefits and vacation time in order to pursue your sculpting passions?\n\nSome people would be just fine with the first option you mentioned.\n\n A lot of college students go into less lucrative degrees because they came straight out of high school and don't realize the truth about being an adult with day to day expenses. We shouldn't teach children to follow their dreams, we should teach them how to survive in this world.\n\nAnd who[.] to say that they would complete a \"more lucrative degree\"? For example, most lucrative degrees (Certain sciences, engineering, finance, etc.) require at least decent math skills. If a child isn't good at math and doesn't enjoy it, why should we push them towards a degree and field in which they are required to be able to do high-level math? This is essentially setting children up to fail."}