{"doc_id": "1314", "name": "2014_05_humanities_student_major_209_todayilearned", "namespace": "we1sv2.0", "metapath": "", "pub": "todayilearned", "title": "2014-05-humanities-student-major_209_todayilearned.txt", "pub_date": "2014-05-04T00:00:00Z", "Sentiment": "0.183", "Subjectivity": "0.443", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "283", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_ch9dwhm", "Reddit_id": "ch9erye", "Subreddit_id": "t5_2qqjc", "Commenter": "rmacdowe", "length": "1637", "content_scrubbed": "A very good summary. The IB programs themselves also requires you to write a large paper, take a series of exams, do community service, foreign language credits- it is a whole advanced program with high requirements (for me IB classes were harder than gen ed college but easier than higher level college -it was taken extremely seriously by our teachers). \n\n AP is a singular advanced class that people strong in a particular subject can take. You could take one AP class in something you were strong at and regular classes for other things. Far less challenging and time consuming overall- though individual AP classes could be harder than Sl (standard level IB- You needed to have 3 ish Higher Level classes and the rest sl if I remember) in some cases.\n\nIn my area at least -Nova-(it varies some school district to school district- Iowa is probably easier than New_York etc), IB was more of a humanities focused program (Though HL Math and Sciences were still probably more difficult than AP), AP required less critical thinking, analysis and writing skills and focused more on career skills like business math and sciences. \n\nAP people like to claim it was harder for them, and IB students like to claim the opposite (there are less IB students in the US -as far as I'm aware though, so there are more people singing AP[.] praises-). People are basically self important and like to claim they suffered more or are smarter etc.  But anyway, Ap and IB ultimately are just different. Several of the highest ranked Public schools in the country use AP, while others use the IB programs instead (IB is also recognized/used outside the us)."}