{"doc_id": "1449", "name": "2014_05_humanities_student_major_1362_wow", "namespace": "we1sv2.0", "metapath": "", "pub": "wow", "title": "2014-05-humanities-student-major_1362_wow.txt", "pub_date": "2014-05-21T00:00:00Z", "Sentiment": "-0.084", "Subjectivity": "0.38", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "356", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_262jq7", "Reddit_id": "chnxu3x", "Subreddit_id": "t5_2qio8", "Commenter": "DalekRy", "length": "1997", "content_scrubbed": "I had one class in college in which the professor refused to allow electronics.\n\nI have horrible handwriting that even a private handwriting coach could not help as a kid. I was so pissed, but there were no alternatives. It was either take the class or wait an additional semester to graduate.\n\nThe class was a comparative study of novels and their film adaptations. While I only ended up taking an index code-worth of notes in a given day - and the material proved easy enough to bluff - it was a huge hassle.\n\nI did not have any means of recourse, but the following things really pissed me off:\n\n+ The professor was technologically-impaired. Whenever she wanted to use the projector or other media I was tapped. I gained a reputation as the go-to guy for troubleshooting in English, Humanities and History. Other students would point me out to instructors/professors and normally this was a delight (and I believe had a little to do with my grades).\n\n+ She would *regularly* ask students to pull up IMDB on their phones. This made me very angry.\n\nIt was a small campus and the only minor (required) available for me was English. I knew the department well and there was one student that always showed up late, pulled out his laptop and had a lot of inappropriate content up at a given time.\n\nThe only times I wasn't taking notes with my laptop during class was during tests or pulling up tertiary material (such as images for Sans Culottes in History) relevant to the topics.\n\nI am a veteran and was already pushing 30 when I began college. I survived 14 months in Iraq to earn my college money and I took school very seriously. To be lumped into the same category as that guy simply because *some* people cannot control themselves was disgusting. It reminded me of Basic Training when the entire platoon did push-ups because one person screwed up.\n\nYour professor is doing it right. As long as students do not disrupt, then why should adults be treated in such a manner?\n\nRidiculous.\n\n/end rant"}