{"doc_id": "1319", "name": "2014_05_humanities_student_major_279_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2014-05-humanities-student-major_279_Economics.txt", "pub_date": "2014-05-05T00:00:00Z", "Sentiment": "0.154", "Subjectivity": "0.381", "Score": "21", "Upvotes": "21", "Downvotes": "0", "Wordcount": "331", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cha2c3q", "Reddit_id": "cha33l9", "Subreddit_id": "t5_2qh1s", "Commenter": "[deleted]", "length": "1938", "content_scrubbed": "Is it not common knowledge that being a graduate student is oftentimes pretty shitty, especially in the humanities?\n\nI'm a graduate student (admittedly Aerospace Engineering, not humanities). It is decidedly *NOT* shitty. In fact, it[.] fucking awesome. It[.] hard_work but it[.] immensely rewarding at an intellectual level. I don't earn much, but I earn *enough* to not be in poverty. I get free dental and a cheap, heavily subsidies healthcare insurance option. I have a decent life and in general am able to splurge for hobbies and entertainment now and then. I love my job. I love my life. I had the option to get a job in the industry and I don't regret for a second that I chose academia over it.\n\nAnd in my experience, among *many* peers and colleagues across dozens of schools and different disciplines, *THAT* is the expectation people have with grad school. It[.] a place you go to dedicate yourself to the study of a very specific topic you feel passionate about. You do it because you want to make a contribution towards expanding the boundaries of human knowledge. Yes, there are shitty parts of it (like funding and the occasional physical exhaustion surrounding important deadlines), but the good far outweigh the bad for anyone who isn't stuck in a sub specialization they abhor (and those don't make the cut at DQEs anyway).\n\nBeing denied meetings with your thesis advisor, forced into poverty with an inadequate stipend and generally treated as disposable labor is not part of this implicit understanding. Those are very much legitimate grievances. So I frankly have no idea what the hell you're smoking over there when you think that this is somehow the norm for graduate schools across the nation. Do you seriously think that anybody would stay for graduate degrees if it was the case, when they otherwise have the option of going straight into the industry with a BS/BA degree for multiple times the pay? Come on, man..."}