{"doc_id": "1496", "name": "2014_05_humanities_student_major_1901_ualberta", "namespace": "we1sv2.0", "metapath": "", "pub": "uAlberta", "title": "2014-05-humanities-student-major_1901_uAlberta.txt", "pub_date": "2014-05-29T00:00:00Z", "Sentiment": "0.084", "Subjectivity": "0.296", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "356", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26u9sr", "Reddit_id": "chulxpl", "Subreddit_id": "t5_2spif", "Commenter": "Adolf_Quitler", "length": "1962", "content_scrubbed": "First of all, do not go to Boyle St. If someone asks you to go to Boyle St. they are not your friend. Do not go to Boyle St.\n\nThe University Wireless service doesn't block torrents, steam, etcetera. You're going to have trouble getting it to work properly in the humanities building or Hub, because the University seems to have a strange disdain towards the social_sciences. Generally assume that arts services/buildings will be less useful/more dilapidated than the sciences.\n\nI know this is generally more useful advice for those going into the first part of their undergrad, but never pay for any sort of meal plan. It[.] not widely accepted on campus, and where it is it[.] just an excuse to charge premium prices for subpar product.\n\nThere are two pubs on campus. There[.] RATT in the student union building, and Dewey[.] (near CAB). Both are fine and relatively cheap. Dewey[.], especially in the mornings, is a good place to get some work done and feed the drinking problem you WILL have by the end of your stay at the U of A.\n\nNear Campus, the Second Cup across from the emergency hospital (address eludes me) is great. It doesn't do very good business, it[.] really comfortable, and it gets the university wireless. Nearby, Steeps is a great place to do six or seven hours of work. Other places of note: Remedy, Transcend, Sugar Bowl, Leva, La Poutine, High Level Diner.\n\nInvest in winter clothes, invest in summer clothes. In Edmonton, you'll almost always be too hot or too cold. Buy stuff you can sweat in, and by stuff you'd take with you to the North pole. For winter, go to the MEC. For summer go to LuLu Lemon.\n\nFor Night Life, you'll probably want to go to Whyte (82 ave) or Jasper (100 ave). Lots of bars/odd club down them. Both close to the University. If you go to Whyte, turn back before the train tracks (it declines heavily at a certain point).\n\nMake sure to catch an Oil Kings game here or there. Do not see the Oilers. They will make you sad."}