{"doc_id": "1472", "name": "2014_05_humanities_student_major_1614_atlfilmmakers", "namespace": "we1sv2.0", "metapath": "", "pub": "AtlFilmmakers", "title": "2014-05-humanities-student-major_1614_AtlFilmmakers.txt", "pub_date": "2014-05-25T00:00:00Z", "Sentiment": "0.172", "Subjectivity": "0.411", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "402", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26gpse", "Reddit_id": "chr0i6k", "Subreddit_id": "t5_2sw58", "Commenter": "MediocreResponse", "length": "2269", "content_scrubbed": "Hi msd85, I don't work on film sets, but I do work in the Atlanta entertainment industry, and since you asked for honesty, I thought you might be interested in the perspective of someone who has lived in Atlanta their whole life. \n\nI don't want you to come here thinking they're just handing out film jobs on every street corner - far from it. Atlanta struggles with un- & under-employment just like everywhere else. We also have thousands of college grads competing for the same low-wage, entry-level jobs you're looking for (SCAD, AIA, GSU, GA Tech, etc). Those students at least have the very real benefit of knowing the city and having local contacts. \n\nAlso, much of the \"film industry\" is not even in Atlanta proper. With some exceptions, the studios are mostly located in small satellite towns like Peachtree City, Senoia, Covington, etc (minus EUE Screen Gem in Lakewood and Tyler Perry Studios in SW Atl). There[.] also very little post production in Atlanta, but I hope that changes soon too.\n\nI don't want to discourage you from coming here, but your relatively short 1-2 month cushion worries me. Many of us who live in Atlanta have spent years trying to \"figure out\" the local film industry and our place in it. Even if you do get lucky and find a paying PA gig, you will likely have to supplement your income with a non-film job. The good news is Atlanta has a thriving bar/restaurant scene, if serving is your thing. I'm really trying hard not to sound like a cynical bastard, but its just so hard to make a \"living wage\" in the arts, especially these days.\n\nIf you do decide to come to Atlanta, here are some tips to look into:\n\n- Atlanta Film Festival: They are awesome and host PA training programs throughout the year.\n\n- Turner Broadcasting: This is where a lot of creative talent in Atlanta works, for better or worse.\n\n- Georgia Production Partners: They helped push the GA film tax credit that gave rise to the recent industry boom.\n\n- GA Dept of Film, Music & Digital Entertainment - The agency that administers the tax credit. They also occasionally post jobs, internships & local film news.\n\nAtlanta is a great town to live in, regardless of where you work, just wanted to make sure you got at least one response here. Best of luck!"}