{"doc_id": "1437", "name": "2014_05_humanities_student_major_1288_nintendo", "namespace": "we1sv2.0", "metapath": "", "pub": "nintendo", "title": "2014-05-humanities-student-major_1288_nintendo.txt", "pub_date": "2014-05-20T00:00:00Z", "Sentiment": "0.176", "Subjectivity": "0.449", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "535", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_260rd0", "Reddit_id": "chmm52g", "Subreddit_id": "t5_2qhnk", "Commenter": "MajorasAss", "length": "2976", "content_scrubbed": "Things I want:\n\n1) Keep the motion controls from SS. I personally loved them and never wanted to go back to traditional controls. While some people didn't like Skyward Sword[.] linearity, the general consensus is that the motion controls worked well and were intuitive. (Although they were shoehorned into dumb things like swimming and such) Combat was finally cerebral and challenging again. While I hope they'd be mandatory, because that way the whole game will be designed around it, I'd be fine with it being optional. However, if it was optional, I think it'd be too easy because the enemies wouldn't be designed around the mechanic\n\n2) Hard mode from the start. While I'm glad the last 3 Zelda[.] have had a hard/hero mode, I wish you would be able to select it from the start. I understand that it is the way it is to increase replay value, but it would be a nice little touch\n\n3) A totally new artstyle. One of the things I love about Zelda is that all the Zelda games look so different and have their own special charm. From the weird, surreal Majora[.] Mask to the bright and airy Wind Waker to Skyward Sword[.] soft watercolors, I'd love to see where they take the artstyle next. They've said that they aren't going to use the Wii U tech demo artstyle, which I'm glad to hear. I've heard some rumors about a sketchy, sharper ink style, which would look amazing on the Wii U. In terms of \"realistic\" graphics, the Wii U can't compete with the XBONE or PS4, but if they choose the_right artstyle, it can look just as aesthetically stunning. Look at Mario Kart 8. There[.] a reason Wind Waker still looks good and Twilight Princess does not.\n\n4) 1080p 30 fps\n\n5) Length. I want a 40 hour adventure, with lots of locales and dungeons to visit, and tons of secrets and collectibles. Ideally it should take 60 hours to 100%\n\n6) Characterization. MM and SS did a great job of giving the NPC[.] life and personality, so I actually cared about them. Hope they do it again\n\nThings I wouldn't want:\n\nSuper \"Dark\" or edgy Zelda game to appeal to the dudebros who are insecure about playing a Nintendo game. Let[.] not repeat Twilight Princess.\n\nVoice acting. Zelda games already convey tons of personality and emotion with just text, body language, and strange little noises that add quirky charm. I wouldn't mind it if it was done well, but I really doubt they can pull it off. I can't imagine what Zelda or Ganondorf speaking would sound like. No voice acting Bad voice acting\n\nGame being too short\n\nThings I don't care either way about:\n\nHow linear the game is. Skyward Sword[.] small but linear overworld was compact and full of life. TP[.] giant but empty overworld looked like the unfinished beta of a game\n\nWhether they have Ganondorf or an entirely new villain. While normally I prefer new villains, we haven't had human Ganondorf since TP. However, I wouldn't want both. Ganon was tacked on at the end of TP and ALBTW, which kind of diminished Zant and Yuga as villains for me "}