{"doc_id": "1473", "name": "2014_05_humanities_student_major_1645_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2014-05-humanities-student-major_1645_politics.txt", "pub_date": "2014-05-26T00:00:00Z", "Sentiment": "0.076", "Subjectivity": "0.412", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "312", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chrk0rq", "Reddit_id": "chrnibh", "Subreddit_id": "t5_2cneq", "Commenter": "htc710", "length": "1813", "content_scrubbed": "My senior year in college, I was part of the Student Comprehensive Fee Committee. This was a small group of juniors and seniors who examined the college[.] finances, and made recommendations on tuition. The school wasn't cheap: it was one of those famously expensive northeastern liberal_arts colleges. Examining the costs, though, it was clear that what we had been told was true: the real costs to the college per student (this included room and board, as it was a residential college in a pretty rural environment,) was close to $75,000. Tuition that year had just hit $50,000. And many more than half of our student body was on some form of financial aid. \n\n\nThe Board of Trustees stayed very close to our recommendations, and continues to offer need-blind admission. There is some waste, mostly having to do with the dining plan, but asides from that, their finances are pretty solid. \n\nObviously, not all schools are like this. But there are many, many schools out there that are not just swindling their students. The education I received was top-notch, and I made dozens of valuable connections. And while it was incredibly expensive, I was grateful for the gifts and donations that kept tuition lower than it could have been. \n\nI financed some of it through student loans, which I will be paying of for a dozen or so more years. The fact I can't refinance it what really upsets me. The problem, at least for students of this specific set of schools, is not tuition, but loan practices. \n\nLike I said, though, I know that[.] not always the case, and I'm appalled at $20,000+ online \"masters\" programs that prey on working people who need higher degrees to set themselves apart and end up with some certificate from an unknown online school. But my point is that not all expensive education is exploitative. "}