{"doc_id": "1305", "name": "2014_05_humanities_student_major_130_guitar", "namespace": "we1sv2.0", "metapath": "", "pub": "Guitar", "title": "2014-05-humanities-student-major_130_Guitar.txt", "pub_date": "2014-05-02T00:00:00Z", "Sentiment": "0.067", "Subjectivity": "0.306", "Score": "20", "Upvotes": "20", "Downvotes": "0", "Wordcount": "373", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24lcn5", "Reddit_id": "ch8afe7", "Subreddit_id": "t5_2qi79", "Commenter": "imagineyouarebusy", "length": "2179", "content_scrubbed": "My daughters (you know might want to get a drink right about now) started playing clarinet and saxophone in grade school.\n\nThey were accepted into the school of the arts in Palm Beach County.\n\nEvery quarter, they had to submit to a jury of their peer.\n\nEach day, besides their regular studies (all of the students had to maintain a \"B\" average to remain in the school), they would have lessons and play about four hours in school. \n\nThey were expected to do regular homework, *and* to practice a minimum of two hours at home.\n\nWhen they started, their instruments squealed and squaked, it was horrible. \n\nBy their senior year, they were in the top ten in the nation for Jazz bands, and both received full-ride scholarships, one to a conservatory and the other to FSU, a tier-two school.\n\nDuring the music competitions in high-school, they would be told they were blessed by god to be so talented, and that used to really piss-me-off.  That single comment completely denied the incredible effort and determination and sacrifice they'd made to achieve their success.\n\nSome parents would remark that they were born talented. \n\nFunny thing was, they were step-sisters, so their success was not so much genetic, as good-parenting and their personal drive.\n\nThey learned a valuable lesson about life, that your success is predicated upon your efforts.  You aren't guaranteed success, but you can increase the odds through hard_work.\n\nYou can buy equipment and lessons, but you can't buy skill.\n\nedit: as for myself, I'm pretty happy that after a decade where I couldn't play because of a couple strokes, I can now play again, and have just released a song for which I want to put out a humorous video.\n\nIt[.] about a party that ran out of Jack.... the horror.  It[.] a blues-rock/rap song... and yes I know I don't rap well. That[.] the point of the oddness of the video. Rather than being set in a rapper[.] mansion, it would be set in a trailer park, with pink flamingos and garden trolls figurines, gawdy women making it in the pool would not look like the videos you see put out by rap-stars.... picture the video from SRV[.] \"Cold Shot\".\n\n[Back With the Jack](http://youtu. be/eXepVTz-DZE)"}