{"doc_id": "1466", "name": "2014_05_humanities_student_major_1577_thebluepill", "namespace": "we1sv2.0", "metapath": "", "pub": "TheBluePill", "title": "2014-05-humanities-student-major_1577_TheBluePill.txt", "pub_date": "2014-05-24T00:00:00Z", "Sentiment": "0.083", "Subjectivity": "0.438", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "229", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26ev0z", "Reddit_id": "chqf0j7", "Subreddit_id": "t5_2vzvv", "Commenter": "[deleted]", "length": "1460", "content_scrubbed": "This is a troll, right?\n\n\nFemales will receive an equal education, also designed to reflect what our society holds dearest. Their pre-tracking general educational requirements will include the **arts of dance, make-up, charm, and beauty**. These subjects will prepare students to serve their country best, **beauty being the highest desirable quality in a female**. Like the males, the females will also be tracked into various vocations.\n\n\nThe most beautiful females will receive additional training in the arts of **dress, game play, and most especially on bedroom skill**; they will be later **paired with accomplished males as mistresses or concubines**\n\nSecond track women will receive additional training in the arts of party hosting, advanced social graces, cooking, and sex. They will be **married whichever man first claims them at the age of sixteen**\n\nNot pedophilia, though.\n\nThird track women will prepare themselves for a life as **sexual technicians for the vocational class of men**. Given that the demand for their services will be high, further training will be unnecessary, and they will enter the work force at the **age of 14**\n\nTotes not pedophilia, guys.\nFourth track women, being the **least beautiful, and therefore the least valuable** to society, shall be trained in all manner of suitable occupations, from **sanitary workers to maids to trash removal technicians**\n\nBut how will men live out porn fantasies of banging hot maids? :("}