{"doc_id": "1443", "name": "2014_05_humanities_student_major_1315_nostupidquestions", "namespace": "we1sv2.0", "metapath": "", "pub": "NoStupidQuestions", "title": "2014-05-humanities-student-major_1315_NoStupidQuestions.txt", "pub_date": "2014-05-20T00:00:00Z", "Sentiment": "0.022", "Subjectivity": "0.294", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "439", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_262wli", "Reddit_id": "chn57gz", "Subreddit_id": "t5_2w844", "Commenter": "lurk_in_progress", "length": "2550", "content_scrubbed": "First of all - the education systems are different within the constituent parts of the United Kingdom (England, Wales and Northern Ireland). What I am describing below applies to England only. It[.] a long time since I went to school, but I don't think that much has changed, but my information my be out of date in some parts.\n\nEducation is compulsory between ages of 5 and 16 (although home schooling is allowed).\n\nPrimary school is for ages 5 - 11 (Years 1 - 6). \n\nSecondary School is 11 - 16 (Years 7 - 11).\n\nEveryone has to take GCSEs (General Certificate of Standard Education), which start in year 10 and finish in Year 11. Some GCSEs are mandatory (I don't know which nowadays, but in my day English, Mathematics, Sciences, one humanities subject and one art subject were mandatory. At least one language is probably mandatory too.) You also get to take to choose your options in year 10 (optional subjects). Most people take about 10 GCSEs I think. I only ended up with 7, because I was lazy.\n\nA Levels (Advanced) are optional and you do these between the ages of 16 - 18. This is known as Sixth Form college, because it represents your sixth year of Secondary Education. Some sixth form colleges are attached to secondary schools (same building, same teachers etc) and some are separate institutions. You need A Levels to get into a university. People usually take 3-4 A Levels. It takes 2 years to complete A Levels. There was talk about A Levels being replaced soon but I don't know if anything is going to come of that.\n\nState schools are publicly funded schools. In my day, they were directly controlled by local authorities and had to adhere to what was known as the National Curriculum. Nowadays you get Academies, which although publicly funded are more autonomous. They are proving to be quite controversial, because of concerns about religious organizations and private companies having too much of an influence, but I'm not the person to ask about this.\n\nPublic Schools are anything but - the 'public' part is a misnomer. They are in fact privately run and funded by fees. Some public schools are very old and prestigious (e. g. Eton, Harrow) and even former students of these schools are disproportionately represent in the government. (Prime Minister David Cameron went to Eton for example)\n\nAll universities are fee-paying. Currently the maximum a university can charge is £9,000 per year (about $15000). This is funded through a student loan system.\n\nhope this helps. I'm sure if I got anything wrong, someone will correct me.\n\n"}