{"doc_id": "1504", "name": "2014_05_humanities_student_major_1941_cmu", "namespace": "we1sv2.0", "metapath": "", "pub": "cmu", "title": "2014-05-humanities-student-major_1941_cmu.txt", "pub_date": "2014-05-30T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.452", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "644", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26w5yv", "Reddit_id": "chv3dfg", "Subreddit_id": "t5_2r87b", "Commenter": "sakuranbo", "length": "3688", "content_scrubbed": "Disclaimer: I was admitted as an IS major and stayed in the program for a year so I only have limited knowledge of the program.\n\n* 1) If you haven't read this already, start here: http://www. cmu. edu/information-systems/ \n\n* 2) The program is very small. There are only 4 or 5 faculty members in the program, but that is hardly a problem since IS majors tend to take a wide range of courses from many different departments.\n\n* 3) The course requirements for the major is HIGHLY sequential (a previous class being a prereq for the next, the next being a prereq for the one after the next, etc) and some of the core IS classes are hard to find a substitute elsewhere. Also, many of the core classes are offered once a year only, so if you miss it you'll be one entire year behind. An implication of that, at least from what I experienced, is that it makes it very difficult to plan study abroad. I remember being told by the advisor that there is one core class (iirc the one taken sophomore fall) that they basically believe it is unique at cmu and not possible to find a substitute anywhere else in the world other than CMU-Qatar (this was almost 3 years ago; I have no idea how much has changed since then). Having said that though, I know someone in IS studied abroad not only once but twice in the UK; so with careful planning and working closely with the IS advisor, it certainly can be done.\n\n* 4) Aside from the sequential nature of the core requirements, the IS curriculum is very flexible and open. Take a look at the Content Area requirement stated in the catalog: http://coursecatalog. web. cmu. edu/dietrichcollegeofhumanitiesandsocialsciences/informationsystems/. Reading this page carefully should give you a thorough idea of the curriculum. I personally wouldn't consider the IS classes themselves as intense as CS classes; but again, because of the openness of the curriculum, it is up to you what classes you'd like to take so you are basically the one determining the intensity of the kind of classes you want to take.\n\n* 5) IS is not available as an additional major or minor. That is, if you want to do IS, it has to be your primary major. If you were not admitted as an IS major, there is an application process. In my batch, more people than expected ended up enrolling in the program, so there were very few slots for later internal transfers. Of course, this would vary from year to year.\n\n* 6) I'd say it is not hard to double major or minor something else if you are in IS. I do want to qualify that statement a bit though - I had a lot of AP credits coming in as a freshman, and they helped me get rid of many GenEd requirements. Also, as previously mentioned, because of the sequential nature of the curriculum, double majoring requires careful planning of your schedules (eg. if your IS core class takes place at a particular time and a class for your other major takes place at the same time, you most likely have to let go of the other if you want to be on track for IS).\n\n* 7) From what I've heard HCI and IS go great together. I know quite a few IS majors who double majored in HCI. Check out http://www. hcii. cmu. edu/undergraduate-program. There is also a new program called IDEATE. I have no idea what it is exactly but it sounds related to HCI and pretty cool: http://www. cmu. edu/information-systems/ideate/index. html.\n\n* 8) To be honest, even after I switched out of IS, I still don't have much of a clue what IS is exactly; but I don't think that[.] a problem at all as clearly it hasn't prevented people from getting good jobs at all: http://www. cmu. edu/career/salaries-and-destinations/2013-survey/pdfs-one-pagers/IS%202013%20Post%20Grad%20one%20sheet. pdf"}