{"doc_id": "1355", "name": "2014_05_humanities_student_major_678_udub", "namespace": "we1sv2.0", "metapath": "", "pub": "udub", "title": "2014-05-humanities-student-major_678_udub.txt", "pub_date": "2014-05-10T00:00:00Z", "Sentiment": "0.131", "Subjectivity": "0.292", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "299", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_256l0t", "Reddit_id": "cheazhv", "Subreddit_id": "t5_2razk", "Commenter": "Ambriesce", "length": "1702", "content_scrubbed": "Hello there! I've actually been an Arts Community RA in both McMahon and Alder, and lived in the Arts Community in McMahon my freshman year, so I have a lot of experience and insight into this community! Both Arts Communities are partnered with each other and will have events involving both buildings, though the number will vary depending on what the RAs/RDs feel like doing. We partner with the UW World Series (concerts, dances, performances, etc. at Meany Hall) and have a \"dorm concert\" with them at least once a quarter. Other programs that I have planned include floor decorating, going to plays, outings to art galleries/museums, screenprinting, open mic nights, and many more. I will not be returning as an RA next year so you wouldn't have me, but I assume that the new RAs will plan events like these.  \n  \nAs for the resident population, from my experience most of the students that sign up for the McMahon Arts Community are mostly art majors/interested in art. Because Alder is popular, many people will sign up for Alder and not care that they are in the Arts Community, so I'd say that less than half of the people that live in the Arts Community in Alder actually signed up specifically for the Arts Community. We've had great attendance in both communities this year for programs and I know that many of my residents have met their best friends on our floor. If you have any more questions about the Arts Community, or any other communities as well, please let me know! If you're an artsy person, I'd really recommend this community because there will definitely be people who are into the same type of art that you are and it[.] a great place to make friends with like-minded people."}