{"doc_id": "1459", "name": "2014_05_humanities_student_major_1477_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2014-05-humanities-student-major_1477_AskAcademia.txt", "pub_date": "2014-05-23T00:00:00Z", "Sentiment": "0.147", "Subjectivity": "0.466", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "550", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26a66k", "Reddit_id": "chp766o", "Subreddit_id": "t5_2sakj", "Commenter": "Rtalbert235", "length": "3342", "content_scrubbed": "Speaking as someone who taught in small liberal_arts colleges for 14 years: If you are focusing on liberal_arts colleges, there are two things to focus on: \n\n1. Getting as much teaching experience as humanly possible, and \n2. Focusing your research interests on topics that are amenable to undergraduate research. \n\nAnd #1 far outweighs #2 for most liberal_arts colleges. \n\nThe research culture as it exists at R-1 universities is completely absent from liberal_arts colleges with the exception of maybe the top 10. The vast majority of liberal_arts colleges, on the other hand -- i. e. the places where you will most likely get a job -- care about research only to the extent that it can be applied to undergraduates. Number of publications, name recognition of journals, NSF grants for pure research are all basically irrelevant. This is not a bad thing, just an aspect of liberal_arts colleges that too few new PhD[.] seem to grasp.\n\nTherefore the single most important thing you can do for yourself is to acquire a passion for teaching and for understanding how students learn, and do things to establish concretely that you are an instructor first and foremost. If your program doesn't place you as the instructor of record for one or more classes, then ask your department chair if there is an opportunity to teach something -- maybe a lower-level course that is staffed by an adjunct. If there are no such opportunities,  go out to the local community colleges and ask if they have adjunct positions open. (Be careful though, because sometimes graduate programs have restrictions on outside employment for grad assistants.) \n\nAlso, throw yourself into the scholarship of teaching and learning to discover the literature and state of the art about college teaching. Make it a priority to become an expert on the subject. A good couple of places to start are Linda Nilson[.] [Teaching at its Best](http://amzn. com/B003IS7676), Ken Bain[.] [What the Best College Teachers Do](http://amzn. com/B00DM1D3YO), and Susan Ambrose[.] [How Learning Works](http://amzn. com/B003IEJZXS). If your university has a Center for Teaching, go visit it and ask if there are opportunities for grad students to sit in on workshops or discussion sessions. Start following educators on Twitter and Google+ and sign up for the [Academia section on Stack Exchange](http://academia. stackexchange. com). You only have a year, so this needs to be a crash course. \n\nYou have to keep in mind that when small liberal_arts colleges hire someone, it[.] a major investment. There are not too many faculty in any one department, and the expectation is that faculty will be around for a very long time. So there[.] a great desire on the part of hiring committees not to hire someone who turns out to be a \"bust\" -- someone who just doesn't fit the mold of the college. And so search committees are looking for *known quantities*, candidates with a concrete track record in teaching and student-centered scholarship. If you have two candidates, one with a stellar publication record but little to no teaching experience -- and no evidence that they really think carefully about teaching -- and another with a so-so research record but a record of teaching experience that shows reflection and innovation and student success, then I think we know which one has the edge. \n\nGood luck! "}