{"doc_id": "1353", "name": "2014_05_humanities_student_major_647_ems", "namespace": "we1sv2.0", "metapath": "", "pub": "ems", "title": "2014-05-humanities-student-major_647_ems.txt", "pub_date": "2014-05-09T00:00:00Z", "Sentiment": "0.025", "Subjectivity": "0.258", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "285", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_254xwm", "Reddit_id": "chdryea", "Subreddit_id": "t5_2rmg0", "Commenter": "justatouchcrazy", "length": "1713", "content_scrubbed": "My input: Associates for EMT, and Bachelors for paramedic, in a manner similar to LPNs and RNs (but without the ADN).  No requirement to be an EMT first to become a paramedic, but obviously make it very possible to move up later if you desire.\n\nThe first year would be science heavy (A&P, bio, chem and a patho course) as well as a decent amount of language/writing (an english course plus something like professional writing).  Second year would be the basics of patient care, scene management and the second semester would be almost all clinical time.  That would bring the actual EMS education up to around 200 lecture hours, 100 lab hours and around 400-600 clinical hours.\n\nMedic would do a year of advanced EMS courses plus advanced patho, some leadership courses, maybe some professional/political courses and a fourth year of mostly clinicals and a research component.  Now a new paramedic would have a year and a half of science/liberal_arts education, at least 500 lecture and lab hours and around 1,500 clinical hours.  Plus at least an intro to research background.  No other levels of licensure, just EMT and paramedic, and make it a nationwide standard.\n\nWhat does this give EMS?  A true claim to being educated and capable of practice.  An ability to carry themselves as professionals, and political savvy.  That would make it very easy to push for higher reimbursement, improved practice standards, community paramedicine done by medics, transport to alternate locations, and a separation from departments that bring us down such as volunteer areas and fire departments that hold down or push aside EMS.  It would likely result in a system similar to that in Canada.\n\nWill it ever happen?  No."}