{"doc_id": "1503", "name": "2014_05_humanities_student_major_1939_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2014-05-humanities-student-major_1939_AskReddit.txt", "pub_date": "2014-05-30T00:00:00Z", "Sentiment": "-0.003", "Subjectivity": "0.307", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "356", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chv1gri", "Reddit_id": "chv1pni", "Subreddit_id": "t5_2qh1i", "Commenter": "Psyladine", "length": "2039", "content_scrubbed": "While educational reform isn't going to be solved in a reddit comment, my long standing theory is K-12, where 8-12 includes the vocationals (sort of like the pressure given on kids to do the SATs today). \n\nAt 12, you either have a certificate, or you stay on for 13-16, which is all the abstractions and college-esque crap today. So for the majority of the adult population, you're ready at g12 (18) for the world, and can drop out of highschool without social sanction. The remaining classes are AP level and function as a college degree, for skillsets with high knowledge cores (STEM stuff, essentially). Private universities can accomodate liberal_arts stuff, so the people that reallio, trullio want a degree in painting can have it, but the kid that wanted to work just took graphic design as his g8-12 trade focus. \n\nYou'll always have \"I ought to have majored in finances instead of masonry\", but those are usually because we don't have foresight for economic circumstances (kids went to lawschool to be rich, then they were glutted; kids went to be engineers to work at Pratt, then the cold war ended...), when really they  are happier doing work they are inclined to rather than abstract or difficult tasks that are unrewarding.\n\nBut they can always go and do them anyway, if they want to bang heads against the wall.\n\nBut I do not agree that watering down the BA program is the answer to a society that intuits college degree=  success, therefore we all go to college and thus everyone succeeds. No-one believes the lie and everyone goes along with it, with catastrophic economic consequences coming up fast on us.\n\nI think telling kids flat out they don't have the inner guts to make $85,000 a year like the kid on wallstreet, but they do have the sense to make a decent career out of tradework or comp skills is reasonable. To say otherwise is a fluffy deceit, really, that they'll pay for the rest of their lives because their parents couldn't handle being told that not everyone is equal in ability or temperament.\n\ntl;dr eh."}