{"doc_id": "1318", "name": "2014_05_humanities_student_major_251_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2014-05-humanities-student-major_251_Economics.txt", "pub_date": "2014-05-04T00:00:00Z", "Sentiment": "0.09", "Subjectivity": "0.315", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "495", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24quci", "Reddit_id": "ch9uk0x", "Subreddit_id": "t5_2qh1s", "Commenter": "laboringjoe", "length": "3194", "content_scrubbed": "Economics students from 19 countries have joined forces to call for an overhaul of the way their subject is taught, saying the dominance of narrow free-market theories at top universities harms the world[.] ability to confront challenges such as financial stability and climate change.\n\nEconomics students are stupid, then. Courses aren't solely focused on free markets - they discuss the way government affects markets through fiscal policies, monetary policies, and other rules and regulations. \n\nIntro courses keep it basic by having you model the microeconomic effects of taxes and subsidies. You do not have either taxes or subsidies in a free market by definition of what a free market is. Advanced courses, such as those on Money and Banking and Labor, address specific laws and regulations and their effects (expected and observed).\n\nThey want courses to include analysis of the financial crash that so many economists failed to see coming, and say the discipline has become divorced from the real world.\n\nThere isn't a proper analysis that these students would comprehend. Best just to say there was a shadow bank run that caused a credit crunch and leave it at that. And that was talked about in the economic history courses I took. \n\nHe said: \"The crisis has laid bare the latent inadequacies of economic models. These models have failed to make sense of the sorts of extreme macro-economic events, such as crises, recessions and depressions, which matter most to society.\"\n\nThe models taught in economics programs make more than enough sense of the results of recessions. Microeconomic models of markets adequately predict the results of recessions and the aggregate affects in the IS-LM graph. \n\nThe causes of recessions aren't addressed as much as their effects. But the question is, how deep should they go? Those students aren't going to understand the financial analysis of the bonds market pre-crash which is necessary to understand why the housing market[.] crash didn't cause the global crash. So why go into it?\n\nThe student manifesto calls on university economics departments to hire lecturers with a broader outlook and introduce a wider selection of texts. It also asks that lecturers endorse collaborations between social_sciences and humanities departments or \"establish special departments that could oversee interdisciplinary programs blending economics and other fields\".\n\nThere[.] a reason why economics programs separate themselves, almost entirely, from other social_sciences: those sciences aren't data oriented. Could there be social reasons for pay gaps? Sure, and that[.] talked about briefly in advanced courses like Labor Economics and Economic History/Demography (which use a bit of sociology, anthropology and biology). But sociologists have a hard time proving what they're saying because they don't have much hard evidence to back up their statements. \n\nedit: Didn't notice this before but there are economic courses that focus on environmental econ too. Specifically environmental economics but Industrial Organization discusses the marginal cost and benefit of abatement as well as those policy effects to reduce, say emissions, in the outputs market. "}