{"doc_id": "1421", "name": "2014_05_humanities_student_major_1167_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2014-05-humanities-student-major_1167_AskHistorians.txt", "pub_date": "2014-05-18T00:00:00Z", "Sentiment": "0.193", "Subjectivity": "0.305", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "475", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25ujkr", "Reddit_id": "chkwd9s", "Subreddit_id": "t5_2ssp3", "Commenter": "DatKaiser", "length": "3004", "content_scrubbed": "1. A BA at a 'top-tier university' might impress some people, but it[.] unlikely to impress the professors (who are most crucial). A BA in history is not even the first step in the hierarchical academic ladder. It[.] the ground floor.\n\n2. What matters most are those professors. Judging by your background, you're going into the classics. Enroll at a university with a top-notch Classics department. Top-notch meaning a department with a qualitative and quantitative output of papers, books, conference presentations, etc.\n\nWhy? Because writing *good* papers for your (under)graduate classes directly supervised by a renowned expert in the field can act, later on, as an indirect 'vote of confidence' when applying for student-assistantships.\n\n3. In the Netherlands, almost all universities with a history department host an independent student[.] scholarly journal. If a similar thing is around, try to become an editor. You get valuable experience in editing and critiqueing journal submissions and expand your network. You're not going to publish ground breaking work, but you can put it on your CV. In the Netherlands, these journals are acknowledged as proper scholarly journals (although they're far, far, far from A-List) by the scholarly community. Great way to expand your skillset.\n\n3. This might not be applicable to you, but in the Netherlands most Humanities departments run [.]tudent assistant' programs. These are part-time jobs as either administrative or research assistant. Try to get in those. It boosts your CV, improves your skillset and expands your network.\n\n4. Don't bother with 'original undergrad research'. Or rather: do bother with original undergraduate research for your course papers/essays, but don't bother publishing them. Unless it[.] absolutely brilliant, it[.] not going to get published. **Instead** focus on book reviews. Most journals below the top-tier are often looking for book reviews. It[.] the easiest way to get published in a journal, and has the added benefit of keeping your own knowledge of a particular area up to date.\n\n5. There are two strategies towards networking. A wide approach, or an depth approach. The former suggests getting to know as many people as possible, the latter suggests getting to know a limited number of people intimately. I'd opt for the latter. It[.] better to be a protege of an expert, than someone who[.] somewhat known by many. \n\n6. I don't know if you're into football (the European kind), but conceptualize Oxford, Cambridge, Harvard, etc. as the Real Madrids/Paris Saint-Germains/Manchester Cities of the academic world. They tend to *import* top talent, rather than directly produce it themselves. While a BA/MA at one of those universities is certainly not going to hurt, I would still advise going to a smaller university with an excellent Classics department. \n\nIf you want an academic career, you need to know the people and have the CV. \"Graduated at Oxbridge\" is maybe less important than getting the_right connections."}