{"doc_id": "1297", "name": "2014_05_humanities_student_major_42_bjj", "namespace": "we1sv2.0", "metapath": "", "pub": "bjj", "title": "2014-05-humanities-student-major_42_bjj.txt", "pub_date": "2014-05-01T00:00:00Z", "Sentiment": "0.112", "Subjectivity": "0.405", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "599", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_ch6tq6f", "Reddit_id": "ch6zdyx", "Subreddit_id": "t5_2qn02", "Commenter": "skubasteve54", "length": "3424", "content_scrubbed": "You are correct. The current rules of Judo contest state that if no forward progress is made in Newaza, then the referee may stop the match, and reset the players in standup (tachi-waza). Also, you may only enter into Newaza by applying a tachiwaza technique (off the throw/ attempt of a throw/ counter to a throw). In the states, most Judo referee[.] (at local and regional tournaments tend to have a poor understanding of Newaza), which limits further the amount of time it takes before they consider newaza to have [.]talled'.\n\nThe Scoring system in Judo is as follows:\n\nYuko (minor score)\nWaza-Ari (half point)\nIppon (full point / instant victory)\n\nThe Following scores are possible in Newaza:\n\nIppon - Jime Waza (choking techniques), Kansetsu Waza (locking techiques of which only elbow locking techniques are allowed in contest), and Oseakomi Waza (20 seconds pinning techniques)\n\nWaza-Ari - can be scored for by pinning for 15 seconds\n\nYuko can be scored by pinning for 10 seconds.\n\nGoing to your stomach in Judo is a tactic to reset standing up by stalling newaza which is why the turtle position is so common in judo:\n\nMost contest Judo players will try to [.]pin out' of a throw to land on their stomach to reduce/ avoid the score possible from a throw. Once on the bottom, to avoid osaekomi, they will stall out and wait for the stand up.\n\nAs far as why they limit Newaza time at all... It is an IJF mandate that is passed down to each country. The purpose being to make Judo more exciting to watch when televised, as it[.] current olympic standing is due mostly to television ratings, and the money received for those ratings. Outside of the olympics, Judo is televised regularly in Europe, and Asia. To Keep ratings up, they want to keep the action more exciting. This is another reason that the stand up rules have changed with regards to 'leg grabbing' but that[.] another story for another time. So basically, politics and trying to encourage athletes to give the public what they want to see by changing the ruleset is how the IJF is ruining the Art of Judo.\n\n\nAs an aside:\n\nWhen considering the differences in the arts, most people compare the difference in contest styles, or essentially the difference in contest rules. A long time ago, in Japan, there were schools of Judo that specialized in certain aspects of the art from specific throws to specific hold-downs to specific chokes and arm/ leg locks etc. These (including striking) were all parts/ aspects of Judo), There were university clubs that formed their own ruleset and called it Kosen Judo. This is the origin of sitting/ pulling guard extending newaza practice and going for submissions. Students of Kosen include Kimura, Maeda, and many other well known practitioners of the era. I'll dig up some of the old articles when I have a chance, but in essence kosen Judo remained separate to mainstream Judo, because of a mandate from Kano who wanted to make sure that Standup judo was not neglected. (and one reason today why tachiwaza must be used to enter into newaza)\n\nanyways, i'm babbling now, but I'd be happy to share any more knowledge I have on the subject. There are a few videos of Kosen Judo players from the 20[.] - 40[.] that is pretty interesting, as it resembles mainstream BJJ more than it does Judo these days.\n\n(It[.] amazing what a different ruleset and a few decades will do to an art)\n\nHope that helps with the differences,\n\n-Steve"}