{"doc_id": "1414", "name": "2014_05_humanities_student_major_1115_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2014-05-humanities-student-major_1115_AdviceAnimals.txt", "pub_date": "2014-05-16T00:00:00Z", "Sentiment": "0.123", "Subjectivity": "0.358", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "453", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chjvlg1", "Reddit_id": "chk1zeu", "Subreddit_id": "t5_2s7tt", "Commenter": "TrippelSpiral", "length": "2732", "content_scrubbed": "Let me preface this by saying I did not study marketing. I double majored in Creative Writing and Economics at a (very) liberal_arts school. I'd recommend that anyone blessed with the (utterly) amazing opportunity to attend a college/university (and you won't (and this is not meant to condescend to college students, but rather point out that it[.] impossible to understand the experience except in hindsight) realize how (utterly) amazing this opportunity is until afterwards))) pursue a liberal_arts degree. You may be saying; \"Hey, that sounds snobby and elitist as all-fuck,\" (or you might be saying wtf OP, you don't know how to use parenthesis). But let me explain.\n\nLearning marketing is not difficult. Learning business is not difficult. Succeeding in either of these two fields however, is—This difficulty is why business schools are able to exist in the first place (and why not everyone is rich). But, truth is, the art of succeeding in business cannot be taught in a school. It has more to do with learning people skills, concrete 'job specific' skills, and most essentially, ambition, than it has to do with learning 'business.' If you have a decent level of intelligence, you can master the 'intellectual' side of business pretty easily. It[.] not rocket science. Or Middle_Eastern Art. Or Psychology. Or Shakespearean Sonnets. \n\nThe point is: Take the time in college to learn about shit like Middle_Eastern Art, Psychology, Or Shakespearean Sonnets. It[.] probably the only time in your life that you'll have free reign to explore 'non-relevant' (ie non-lucrative) subjects like this. But, more importantly (and more practically) it will make you well rounded and interesting and it will teach you how to think. If you manifest these attributes, you can succeed in any job interview , and you can get your foot in the door wherever you want (the same promise offered by business schools). And what[.] even better, once you get your foot in the door, you can master the operational specifics and the political landscape of the particular business you've found yourself in, and climb upwards with life[.] ladder rooted on the firm and fertile ground of your now (certifiably) worldly brain. \n\nBut this goes for any business. To speak specific to marketing/advertising. It[.] great, mainly because of the people. Despite all my hang-ups and frustrations about working in advertising, of which there are many, I have found that a lot of talented and interesting people gravitate, reluctantly, towards this field. And if nothing else you get to commiserate with them about how what you're doing is fun, but that you wish there was more meaning to it. \n\nTL;DR-- Go into marketing as a profession. But don't go to school for it."}