{"doc_id": "1409", "name": "2014_05_humanities_student_major_1085_magicskyfairy", "namespace": "we1sv2.0", "metapath": "", "pub": "magicskyfairy", "title": "2014-05-humanities-student-major_1085_magicskyfairy.txt", "pub_date": "2014-05-16T00:00:00Z", "Sentiment": "-0.144", "Subjectivity": "0.504", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "279", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25op4b", "Reddit_id": "chjhuwz", "Subreddit_id": "t5_2t659", "Commenter": "[deleted]", "length": "1518", "content_scrubbed": "What the fuck did you just fucking say about atheism, you little bitch? I'll have you know I graduated top of my class at Yale, and I've been involved in numerous scientific breakthroughs, and I have over 300 confirmed publications. I am trained in physics and I'm the top astronomer in the entire US scientific community. You are nothing to me but just another liberal_arts major. I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my secret network of professors across the USA and your GPA is being reduced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You're fucking dead, kid. I can be anywhere, anytime, and I can debate you in over seven hundred ways, and that[.] just with my mind. Not only am I extensively trained in particle physics, but I have access to the entire arsenal of JSTOR and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what undawkin retribution your little \"clever\" comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you sagandamn idiot. I will shit fury all over you and you will drown in it. You're flunking out, theist."}