{"doc_id": "1322", "name": "2014_05_humanities_student_major_308_writingprompts", "namespace": "we1sv2.0", "metapath": "", "pub": "WritingPrompts", "title": "2014-05-humanities-student-major_308_WritingPrompts.txt", "pub_date": "2014-05-05T00:00:00Z", "Sentiment": "0.076", "Subjectivity": "0.262", "Score": "200", "Upvotes": "200", "Downvotes": "0", "Wordcount": "1632", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24stj6", "Reddit_id": "chaclbz", "Subreddit_id": "t5_2s3nb", "Commenter": "[deleted]", "length": "10226", "content_scrubbed": "The student-volunteer /u/BeerSteinBeck opened the door to /r/all, and in they walked.\n\n\"It[.] magnificent,\" said Newbia. The most highly-regarded recruit this side of the University of Phoenix, Newbia had never seen a main hall this big. She regarded the sides of the great lobby, thousands of doors to subreddits great and small. \"And so many doors!\"\n\n\"... and just as many options for a... student of your caliber,\" said BeerSteinbeck. He feigned wiping his head; really he was studying the ink he'd left on his palm, a veritable cheat[.] sheet of notes he had scrawled in blue ink that morning. \"I understand you're interested in Liberal Arts?\"\n\n\"Yes,\" said Newbia. \"I want to learn everything here. Science and history, sociology, even cats.\"\n\n\"Well, then...\" BeerSteinBeck allowed his lips to curl in a slow, expectant smile. \"Let[.] click *Random,* shall we?\"\n\nHe brought her to the first door, a simple wooden door bathed in white light. On the front said \"Random.\" Newbia felt a pang of nerves in her stomach, the anticipation of something completely new. Plainly, BeerSteinBeck had been through this door many times.\n\nHe turned the knob, and it made a heavy *click.*\n\nAwashed in white light, Newbia held her arm over her eyes, saw nothing. As the white washed away, she only heard BeerSteinBeck[.] voice.\n\n\"/r/inglin,\" he said proudly. \"Part of the International Studies department.\"\n\nThe light faded and Newbia made out a thickly-mustachioed gentleman wearing a fancy red hat and tapping at a tobacco pipe.\n\n\"Inta-nash'nal stoodies?\" he wondered aloud, his accent thick with cockney roughage. \"Bugger off. There[.] only one nation 'ere, there is, and more than a nation a' tha'. She[.] a bloody foogin' empire, so vast the sun neve' sets on 'er.\"\n\n\"I'm just showing Newbia around, Professor Cumbleton III,\" BeerSteinBeck interjected. \"We meant no offense.\"\n\n\"You sound a proper twat--I ever told you that, BeerSteinBeck? Bugger yourself in your own bleedin' arse. They[.] nothin' *International* about the studies 'ere. No bleedin' yanks, no bleedin' hosers, no bleedin' aussies. Just Her Majesty[.] own.\"\n\nBeerSteinBeck leaned in to Newbia. \"We'd better be off. They don't take kindly to hard R[.] around here. Maybe International Studies isn't your department.\"\n\nHe opened the Random Door again. Again the light came, and this time, when it washed away, Newbia found they had arrived in a dark hall, the only light glowing from distant computers. Strange creatures were clicking away at them, making strange slurping sounds. When BeerSteinBeck walked up to one, she realized they were slurping on their own saliva.\n\n\"Where are we?\" she asked.\n\nBeerSteinBeck looked around. In the faded light of the computer screens, there were women posted on the walls, but that didn't seem familiar to him. \"I'm not sure.\"\n\n\"Women[.] Studies?\" asked Newbia, pointing out the posters.\n\nThe creature at the computer *rasped.* \"Agchhghchhghh,\" he said. \"Not *women[.]* studies. Only one woman. This is /r/yvonnestrahovski, Newb. Next to the /r/christinahendricks building, and the /r/aliceeve building after that. It goes on and on like that, for miles. So go away. These halls aren't for the likes of newbs.\"\n\n\"How did you know my name?\" asked Newbia. \"Newbia?\"\n\nThe creature just shrugged and clicked through more pictures of the actress Yvonne Strahovski.\n\n\"A woman?\" rasped another creature. \"Do I hear a woman[.] voice? Could it be? Is there a woman walking these halls?\"\n\n\"Is it The One? Yvonne Strahovski?\" came a distant rasp.\n\n\"Stay back!\" yelled BeerSteinbeck. \"This woman is not the one you seek!\"\n\n\"What[.] it matter?\" Another creature reared behind the other, his back hair springing forth from pimples the size of quarters. \"We ain't had any women in these parts since the dark ages.\"\n\n\"The dark ages?\" asked Newbia.\n\n\"Dial-up,\" explained the creature.\n\n\"We have to go,\" BeerSteinBeck said, leaning over to Newbia to whisper. \"I guess Women[.] Studies isn't for you. And... please don't judge these men. They don't see much sunlight.\"\n\nAgain, they walked through the Random Door. Suddenly they found themselves in an open field on a pleasant sunny day. These were mostly men, too, but they conducted themselves carefully. Many wore large glasses, bending over books. Others walked the halls like Aristotle in Raphael[.] *Academy*.\n\n\"Now *this* is much better,\" said Newbia. \"This is how I envisioned a university.\"\n\n\"Yes,\" said BeerSteinBeck, relieved. \"The science department. Here, /r/askscience and /r/science *embrace* the light of day.\" Newbia noticed that security guards with large black hats and canes walked the lawns, carefully listening upon each conversation. \"See those men?\" BeerSteinBeck asked. \"Mods. The mods at the science subreddits are ever vigilant. You'll learn a great deal here, if you sign up for science. You'll learn where boogers come from more often than you'd like, and where poo goes once it[.] flushed, but that[.] just the 101 courses, /r/explainlikeimfive. Once you graduate you'll learn about astrophysics and quantum mechanics. Many of the users here have earned gold for their insightful comments.\"\n\nTwo students suddenly broke out in laughter. One of the Mods walked behind one of the students, and slapped him upside the head.\n\n\"What was that?\" asked Newbia.\n\n\"That student likely posted a meme,\" said BeerSteinBeck.\n\n\"This is great,\" said Newbia. \"But... I was hoping for something with cats.\"\n\n\"Ah!\" said BeerSteinBeck. \"I have just the place.\"\n\nHe found a door, and immediately there were great sounds: dogs barking, birds chirping, cats meowing. They had stepped into a completely new hall, full of cute animals. A rainbow shined through the windows.\n\n\"Animal studies,\" said BeerSteinBeck. \"/r/aww. If you like cats--\"\n\nJust then a student interrupted, shoving a cat in their faces. \"LOOK! LOOK AT CAPTAIN JEAN-LUC PICARD! DO YOU SEE? DO YOU SEE?\"\n\nBeerSteinBeck slapped her away. \"We see. Goddamnit, we see.\"\n\n\"HE'S THINKING, 'LOL, WHO ARE THESE NEW PEOPLE?'\" said the student. \"LOL, ISN'T HE PRECIOUS? HE GOT ME THROUGH SOME TOUGH TIMES. IT'S LIKE WE HAVE THIS CONNECTION, YOU KNOW, WHERE I KNOW WHAT HE'S THINKING. LOL, LOL, LOL.\" The woman left into the vast horde of domesticated animals, shoving the cat in other students' faces.\n\nNewbia leaned in to BeerSteinBeck. \"Did she just say 'L-O-L' instead of laughing?\"\n\n\"Yes,\" admitted BeerSteinBeck. \"/r/aww is a cute place--a very cute place--but cuteness is a drug. And like a drug, it is not without consequences. The people of /r/aww are... well, you see what they've become. But you said you liked cats--\"\n\n\"And I do.\" Newbia frowned.\n\nBeerSteinBeck gathered her meaning. \"You just don't like cats...*this* much.\"\n\n\"No.\"\n\n\"Another place, then.\" He entered the Random door, and Newbia knew to follow. The subreddits came more quickly after that:\n\n* The teenagers of /r/atheism mostly complained about their parents.\n* /r/keto danced in wild naked undulations around a roasting pig.\n* /r/asoiaf told her that she looked different \"in the books.\"\n* /r/reactiongifs could not stop making Chappelle[.] Show references.\n* /r/iama burned an effigy of Woody Harrelson and gathered around Martin Short, demanding \"Three Amigos\" anecdotes.\n* /r/breakingbad called Newbia a \"bitch,\" repeatedly.\n* /r/movies was on its 87th successive showing of Pulp Fiction, and wouldn't stop shushing.\n* /r/todayilearned was merely a computer lab where only Wikipedia was allowed. Ditto for /r/music, though that was limited to YouTube.\n* /r/vegan danced in wild naked undulations around a great soybean.\n* /r/murica was full of rowdy rednecks gathered in a red pickup truck. They played \"Danger Zone\" on repeat and other students cowered in fear.\n* /r/childfree wanted to know if she was a \"breeder.\"\n* /r/mildlyinteresting grabbed her attention, but only for a few moments.\n* /r/LifeProTips taught her the art of using toilet paper rolls for keeping wrapping paper rolled, but she immediately forgot the tip.\n* /r/firstworldanarchists was full of loiterers and jaywalkers. They would do nothing she asked.\n* /r/WTF questioned whether or not she truly belonged in /r/WTF. Ditto for /r/funny.\n* /r/MakeupAddiction fascinated Newbia, until her post made /r/All and she began receiving strange messages in her inbox.\n* /r/gonewild was just a strip club. Literally just a strip club with no tips. Although, when BeerSteinBeck said as much aloud, he was inundated with \"no tips?\" puns. Again, Newbia had to clear her inbox.\n* /r/trees was not the dendrological academy she expected. She thought she saw Snoop Lion.\n* In the Political Science hall, /r/politics was embroiled in a food fight that BeerSteinBeck claimed \"has lasted as long as Jupiter[.] Great Red Spot.\" \n* /r/GetMotivated was another computer lab where everyone sat frozen [like this](http://reefdigital. com. au/assets/bored-campaign-manager. jpg)\n* On the moonlit beaches of /r/twoxchromosomes, BeerSteinBeck could no longer guide her. It was the most mysterious place of all, full of pretty maidens bathing in tidepools as cupids plucked gentle chords on silver harps. The silk-haired queen offered her a gift of tampons and chocolate, and (okay fuck it I have no idea what goes on there)\n* In the sociology department, they entered a dark cave called /r/theredpill, whereupon they were attacked by a horde of pale goblins.\n* The students of /r/NoFap each sat quietly at their desks, not masturbating. Some of them spontaneously leapt away, tying their shirts into capes and yelling \"whooosh!\"\n* In BeerSteinBeck[.] home of /r/writingprompts, BeerSteinBeck kicked down the fourth wall for a better view, but there was only more A Song of Ice and Fire and Breaking Bad fan fiction.\n* /r/cringepics was fun, but ultimately uncomfortable.\n\nBy the end, Newbia was exhausted. BeerSteinBeck took her back to the lobby of /r/All and asked what she thought.\n\n\"I don't know,\" Newbia said. \"I kind of liked Mildly Interesting. What part of the university was that?\"\n\n\"Funnily enough, it[.] the Chemistry Department.\"\n\nThat was mildly interesting. As was the whole of Reddit. Newbia thanked BeerSteinBeck and went home to contemplate her options.\n\nThen she woke up from the nightmare and decided to go to an SEC school."}