{"doc_id": "1435", "name": "2014_05_humanities_student_major_1265_videos", "namespace": "we1sv2.0", "metapath": "", "pub": "videos", "title": "2014-05-humanities-student-major_1265_videos.txt", "pub_date": "2014-05-19T00:00:00Z", "Sentiment": "-0.0", "Subjectivity": "0.341", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "339", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chm67nz", "Reddit_id": "chma6qa", "Subreddit_id": "t5_2qh1e", "Commenter": "Abe_Vigoda", "length": "1992", "content_scrubbed": " I would say I fit the label because I understand how institutional oppression and privilege works.\n\nOk, so you understand the textbook definitions. Unfortunately, it[.] bullshit.\n\nFor you to understand the institutional aspects, you have to know what the institution is. The US being a capitalist country, the people that control the institutions aren't broke. They're rich as hell and they force all these labels as a method to control the public. You, me, everyone else, we're part of a system that they've created that benefits themselves while pitting us against each other to defend our labels and social ideas.\n\nMen are not the enemies of women, and women are not the enemies of men. This is a fallacy that the system promotes via ideological bullshit to make the public mad at each other.\n\nThe woman in the video, she asked for people to calm down and realize that sensationalism, driven by the media helps create these buzzword pandemics. Rape culture is the equivalent of killer bees, or pedophile scares.\n\nThe media itself is massive and has a huge effect on social attitudes, and when you give it legitimacy via academic social [.]cientists', it tends to push a lot of this crap because college humanities courses are big business nowadays, and it[.] an easy way to keep the masses split. The media gets paid, publishers get paid, shitty professors and blog spam rabble rousers get paid.\n\nWomen have valid issue, so do men. There[.] really no need to quibble over it. For true equality to work, be gender neutral and unbiased and look at situations from a moderate perspective. That[.] using logic, reason, and common sense instead of getting all emotionally bent out of shape, and it[.] fair.\n\nGeneralizations are bad, yet feminism and the whole men[.] rights types tend to make massive generalizations which is shitty, and stupid. Don't get sucked into their bullshit, and lots of those people need to be told to chill the fuck out and listen to the other side and stop being ignorant."}