{"doc_id": "1491", "name": "2014_05_humanities_student_major_1847_imgoingtohellforthis", "namespace": "we1sv2.0", "metapath": "", "pub": "ImGoingToHellForThis", "title": "2014-05-humanities-student-major_1847_ImGoingToHellForThis.txt", "pub_date": "2014-05-29T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.358", "Score": "71", "Upvotes": "71", "Downvotes": "0", "Wordcount": "245", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chu20f1", "Reddit_id": "chu2mzb", "Subreddit_id": "t5_2s7yq", "Commenter": "Ramivacation", "length": "1398", "content_scrubbed": "How did you not have the foresight to research the potential of your field?\n\nHe *just* explained why it seemed perfectly reasonable to do that, and until quite recently, it was. And, in fact, it still is. My fiance just got a good job with an anthropology degree where the only real requirement was that you had a degree.\n\nFor so many people, those degrees are just copouts... you can say you're going to college, while exhibiting zero real effort.\n\nNo, it[.] so they can get a degree. They're not taking English Lit. so they can *say* they're in college. And on top of that, those majors aren't easy, either. I mean, yeah, maybe they're easy compared to medical school or becoming an electrical engineer, but not everybody[.] cut out for that shit, or wants to get into such a field.\n\nI'm not being preachy, either...\n\nThe fuck you aren't.\n\nI realized that the potential to grow was zilch, so I started my own company\n\nGood job. The vast majority of companies that people start fail, and it often has nothing to do with the skill or intelligence of the person who started it. Starting a business has as much to do with luck as anything.\n\nIf anyone reading this thinks that liberal_arts degrees will help in finding work, please reconsider... youf be better off learning a trade\n\nThis probably is true.\n\nEdit: downvotes? \n\nYou're getting downvotes because you're being a judgmental prick about it, man."}