{"doc_id": "1481", "name": "2014_05_humanities_student_major_1731_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2014-05-humanities-student-major_1731_AskReddit.txt", "pub_date": "2014-05-27T00:00:00Z", "Sentiment": "0.079", "Subjectivity": "0.335", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "283", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chso34o", "Reddit_id": "chsoi87", "Subreddit_id": "t5_2qh1i", "Commenter": "omgdonerkebab", "length": "1753", "content_scrubbed": "In more detail, I suppose it varies from college to college, and from academic field to academic field.  \n\nIn my experience (in a STEM field), research universities hire and judge their professors almost exclusively based on their research ability.  (One way you might be able to tell if you're at a research university is to find out if there are grad students pursuing a PhD.)  Professors are expected to devote the majority of their time to research, but also some time to teaching, mentoring of grad students, department outreach, administrative stuff, etc.  Now, some departments at these universities may choose to hire extra lecturers whose primary job is teaching, especially to teach or help out with the intro-level courses, which have many more students.  But these lecturers aren't on the same track as the \"real\" professors, and probably can't ascend to that level.\n\nIn my experience (in a STEM field), smaller 4-year colleges will hire and judge professors based on their teaching.  I've often heard of an 80-20 balance between teaching and research for these professors.  Their departments are a lot smaller, and their teaching loads are a lot higher.  Research becomes the secondary job.  There are probably no grad students or postdoctoral researchers here, because there isn't much research getting done in these places.\n\nBut things may be much different in other fields - arts & humanities, social_studies, business, law, etc.  Especially with regards to the hiring of adjunct professors, which I think is a bigger thing in non-STEM fields.  Adjunct professors would be akin to the lecturers I mentioned earlier, in that they tend to be 100% teaching, except that they're more... ephemeral (or, if you ask an adjunct, disposable)."}