{"doc_id": "1452", "name": "2014_05_humanities_student_major_1392_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2014-05-humanities-student-major_1392_TwoXChromosomes.txt", "pub_date": "2014-05-22T00:00:00Z", "Sentiment": "0.116", "Subjectivity": "0.28", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "303", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_267eox", "Reddit_id": "chog9r6", "Subreddit_id": "t5_2r2jt", "Commenter": "linuxlass", "length": "1682", "content_scrubbed": "I encouraged both my son and my daughter to learn programming, by introducing them to Scratch when they were in elementary school. My son took to like like a duck to water, and quickly progressed to python/pygame and C++ and now Java (Android apps). He[.] 16 right now.\n\nMy daughter has always been more interested in \"liberal_arts\" stuff. Writing, music, language, art. She[.] still pretty good at math and enjoys science, particularly chemistry. She had fun learning to program, but it didn't really excite her. Then in middle school she was looking for science fair ideas. I suggested she do something programming-related. So she began exploring AI. Her first project was an attempt at a chat bot. He second project was a tic-tac-toe player. And this year in 8th grade, she teamed up with a friend to try and write an AI for a turn-based strategy game. She helped her friend install and learn the basics of python, and together they designed and built a simple 2D strategy game, and tried to come up with an AI. I think working together on this project was a strong motivator for her, and I saw some real enthusiasm for programming for the first time. \n\nNow, well after the science fair, she is still programming, and refining her game. She[.] talked about maybe majoring in CS in college, and pursuing writing on the side. \n\nI don't think this is a girl vs boy thing. I think it[.] more about making programming accessible to a wider range of personality types, and supporting different ways of thinking and working. When I was a kid, I would not have wanted to program in a social way. My son is a lot like me in this respect. I wish I'd had the Internet as a resource at his age! "}