{"doc_id": "1462", "name": "2014_05_humanities_student_major_1541_bipolarreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "BipolarReddit", "title": "2014-05-humanities-student-major_1541_BipolarReddit.txt", "pub_date": "2014-05-23T00:00:00Z", "Sentiment": "0.143", "Subjectivity": "0.231", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "492", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26bgf3", "Reddit_id": "chpmiod", "Subreddit_id": "t5_2qzru", "Commenter": "z1944", "length": "2730", "content_scrubbed": "A couple of things--\ndefinitely go to an immediate care center rather than an ER. It will cost less, and someone might be able to refer you to a psychiatrist sooner. If you know any doctors, asking them to call psychiatrists for you will get you an appointment--this is how I found all of my psychiatrists. Otherwise you have to wait forever. You may need to increase your Lamictal, add another drug, change your diet, exercise more, take a break from school--but talking to a psychiatrist will make you feel more confident in your treatment and how you choose to move forward.\n\nIf there are disability services at your school, that might be a good place to turn to get some leeway with absences and extensions. It will reduce your stress, and none of your professors have to know the details of your disability unless you choose to tell them.\n\nAs for med school--\nI am a graduate student in the Humanities--I think this is a lot less stressful than med school, but I also think that a lot of the things I do to lessen the stress might be applicable. I also had a very spotty history in my undergraduate--I attended 3 separate institutions in 4 years, overworked myself like crazy to get everything done in my last 2 years, and went from straight As to Cs and even Ds in my science requirements because of my mood episodes. I was rejected from every Phd program I applied to. After being rejected, I decided that the best course of action would be for me to apply for Fulbright and MA programs so that I could build up my resume and improve my GPA in order to get into a competitive Phd program in the future. I was accepted into both programs I applied to with financial assistance. So far, my grades are much better--one B and all As besides that. I am making great connections, participating in projects, have an essay that will be published soon, and have really improved my work. I am much more confident in my abilities to pursue this career than I was before.\n\nThere are a lot of ways that you can make up for so-so undergraduate marks. Try to find work in your field between college and med school--make strong connections with your professors so that you have strong recommendations and connections to programs you will apply to. You can always take community college or continuing ed courses after you graduate to improve your qualifications and raise your grades.\n\nAnother thing to consider--you can work in medicine without being an MD. My partner is working on getting his RN certification and plans to continue on to get a phd in nursing and to work as a nurse practitioner. He has never taken sciences before now. His focus is psychiatric nursing, but NPs can do a lot of the same work as doctors in many fields. \n\n"}