{"doc_id": "1403", "name": "2014_05_humanities_student_major_1046_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2014-05-humanities-student-major_1046_TwoXChromosomes.txt", "pub_date": "2014-05-15T00:00:00Z", "Sentiment": "0.026", "Subjectivity": "0.334", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "596", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25n6hm", "Reddit_id": "chj292d", "Subreddit_id": "t5_2r2jt", "Commenter": "Pretty_Alone", "length": "3218", "content_scrubbed": "Don't scream \"Fuck you\" at them. They like it.\n\nI usually respond. People always tell me to ignore it, but I'm like you, where I would feel like I was excusing their behaviour if I didn't respond.\n\nI respond **totally normally**. That[.] the key. Acting totally unaffected, calm, normal.\n\nSleazy guy: \"Hey baby\"\nMe: \"Oh hello\" and then continue walking. That[.] it, it'll be over. If it[.] not and he follows you, just keep chatting. Don't clam up, don't get flustered, don't act angry or disgusted. Pretend this is one of your old friends you've run into. Sometimes acting like someone is your friend just sort of... makes them friendly? I can't explain it well. If they follow me, I usually politely lecture them about what they did and why it was wrong.\n\nSleazy guy: \"Nice legs, what time do they open?\"\nMe: \"They're out of business, didn't you see the sign?\" It helps to have a sense of humour.\n\nSleazy guy: \"How you doin!\"\nMe: \"I'm doing very well, thank you for asking, how are you?\"\n\nI have never had anyone respond badly. Just laugh and say they're good too. One time a guy laughed and said \"You know, you're the first one not to run away from me today.\" We chatted for a bit as we were walking in the same direction and I explained frankly, without offense, why I didn't like what he had done though and why he shouldn't do it. He apologised and we went our separate ways.\n\nThis was a scary looking guy and it was quite late in a major city, for context. I have tons of these stories, if you wanna hear more. Or if you wanna give me more phrases for which I can formulate responses. I've heard it all.\n\nRespond. It breaks their weird persona. They become human all of the sudden and you become human too.\n\nIt[.] important to remember you're just people. Be people. Make yourself a person to them and them a person to you.\n\nI found myself often not seeing these catcallers as people, just inconveniences. Kind of like how some people will treat waiters or service staff as not really people ( I don't do that, just an example). They were like honking cars to me. And then I sat down and thought about it one day. They are someone[.] children, there are people in world who love them and people they love, they might have pets, they all had childhoods or one sort or another. I'm not trying to excuse them by any means. In my head, I just humanized them more.\n\nYeah, they're doing something sleazy, but I've found having empathy in all situations helps the situation. Not sympathy necessarily, just empathy.\n\nI know that[.] not the answer you're looking for, and it[.] more philosophical than you might have wanted, but that[.] my strategy.\n\nI basically just pretend I have known them all my life and act like it. Since it usually opens up a dialogue with them, I get the chance to explain my side and they usually do apologise which makes me feel better as well. Sometimes I'll see them again in the street and we do a little nod to each other. My life is weird.\n\nIt took me a long while though. When it first started happening (ugly-duckling here) I was a total mess about it. If you wanna talk about it more or need any advice, feel free to pm me. I feel like I'm an expert in the the arts of catcaller diversion haha"}