{"doc_id": "1497", "name": "2014_05_humanities_student_major_1914_trueaskreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueAskReddit", "title": "2014-05-humanities-student-major_1914_TrueAskReddit.txt", "pub_date": "2014-05-30T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.402", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "395", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26u97x", "Reddit_id": "chupfzt", "Subreddit_id": "t5_2s91q", "Commenter": "Prairie_Pete", "length": "2350", "content_scrubbed": "Seems like a bit of a poorly phrased question... so I'll just reflect a bit on corruption.\n\nI live in Cambodia. It is consistently ranked as one of the most corrupt countries in the world. Close to 100% of government revenue is lost to corruption (they don't run budgets). All of the money spent on roads and social programs comes from international donors. \n\nAt every level of society corruption is present. Teachers take bribes from their students every morning. They're paid so little and the education system is so underfunded they have little choice. Kids have to pay to get good marks. Cambodia[.] schools are teaching kids from day one how to bribe their way to the top. \n\nIn the higher grades (which only 13% make it to), kids either bribe their teachers to give them answer keys or buy photocopied exam answers from vendors camped outside the school. Those who graduate high school (about 3%) do not know anything (one teacher complained her students couldn't find Cambodia on a map) other than how to bribe, cheat and scam their way to a diploma.\n\nNone of them want to become doctors, engineers, agroscientists or the other things this country needs. They want to go into liberal_arts or management, because that[.] how to land a cushy government desk job where you can extract bribes out of your department. \n\nGovernment ministry positions which offer more opportunity for corruption are the best jobs (natural resources, infrastructure, justice). Only those close to Prime Minister Hun Sen get those. Others further out in his circle are left to run healthcare, education and agriculture ministries. They are only there until they can garner enough influence (and pay enough bribes) to get into the primo ministries. \n\nPolice don't investigate crimes without a bribe. Doctors don't cure people without a bribe. Teachers don't teach without a bribe. Businesses can't open up without a bribe. Farmers can't get their goods to market without a bribe. Protected forests get torn down with a bribe. Communities get forcibly evicted with a bribe. Anyone can rob, rape and murder with impunity with a bribe. And God forbid anybody reports or investigates it lest they shine light on a government official and pay the price for it. \n\nIt[.] sickening. And it[.] easy enough to fix. Radical transparency and paying a living income would go a long way. "}