{"doc_id": "1385", "name": "2014_05_humanities_student_major_899_tinder", "namespace": "we1sv2.0", "metapath": "", "pub": "Tinder", "title": "2014-05-humanities-student-major_899_Tinder.txt", "pub_date": "2014-05-13T00:00:00Z", "Sentiment": "0.124", "Subjectivity": "0.438", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "280", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25givw", "Reddit_id": "chgy52c", "Subreddit_id": "t5_2w7mz", "Commenter": "Askebaske", "length": "1581", "content_scrubbed": "I filled it out, though I must admit it is a REALLY hard questionnaire to answer. As a humanities student you likely know that all the \"open\" questions weakens the value of the study quantitatively, and the topic is too unspecific for the qualitative results to be very useful. In order to get more answers, I would try to add more categories so you get a more useful data set to do comparisons on.\n\nI would remove the open text field for \"age\" and just add some generic categories (Less than 18, 19-22, 22-25, 26-30, 31-40 or similar, based on your area of interest. Though typically, questionnaires will use 1-21, 22-31 etc)\n\n\"How frequently do you use it a day\" is both a strangely worded question and assumes I use it several times daily. I would likely replace it with something like \"How often do you use the app?\" with some standard categories (Several times daily, once or twice a day, several times a week, more rarely, I don't use the app any more)\n\n \"How would you describe the experience\" is too broad for any of the answers to be comparable for you in a quantitative study, and non-specific for the answers to indicate much qualitatively. I might just do it with categories and say \"Very positive/positive/neutral/negative/very negative\" and add an option to elaborate. Same with the dating questions.\n\nNet result should be some data that would be really easy to pull down into excel or something to make some quick graphs, which would probably be more useful.\n\n... Or, if you are feeling confident in this, ignore my advice and take solace in the fact I did answer ;)"}