{"doc_id": "1298", "name": "2014_05_humanities_student_major_44_ukrainianconflict", "namespace": "we1sv2.0", "metapath": "", "pub": "UkrainianConflict", "title": "2014-05-humanities-student-major_44_UkrainianConflict.txt", "pub_date": "2014-05-01T00:00:00Z", "Sentiment": "0.086", "Subjectivity": "0.428", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "608", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_ch6z9ql", "Reddit_id": "ch6zifw", "Subreddit_id": "t5_30hhs", "Commenter": "endkampf", "length": "3711", "content_scrubbed": "I guess Hannah Arendt is a brainwashed Soviet apologist for you as well:\n\nThe clearest sign that the Soviet Union can no longer be called totalitarian in the strict sense of the term is, of course, the amazingly swift and rich recovery of the arts during the last decade. To be sure, efforts to rehabilitate Stalin and to curtail the increasingly vocal demands for freedom of speech and thought among students, writers, and artists recur again and again, but none of them has been very successful or is likely to be successful without a full-fledged re-establishment of terror and police rule. No doubt, the people of the Soviet Union are denied all forms of political freedom, not only freedom of association but also freedom of thought, opinion and public expression. It looks as though nothing has changed, while in fact everything has changed. When Stalin died the drawers of writers and artists were empty; today there exists a whole literature that circulates in manuscript and all kinds of modern painting are tried out in the painters' studios and become known even though they are not exhibited. This is not to minimize the difference between tyrannical censorship and freedom of the arts, it is only to stress the fact that the difference between a clandestine literature and no literature equals the difference between one and zero.\n\nFurthermore, the very fact that members of the intellectual opposition can have a trial (though not an open one), can make themselves heard in the courtroom and count upon support outside it, do not confess to anything but plead not guilty, demonstrates that we deal here no longer with total domination. What happened to Sinyavsky and Daniel, the two writers who in February 1966 were tried for having published works abroad which could not have been published in the Soviet Union and who were sentenced to seven and five years of hard labor respectively, was certainly outrageous by all standards of justice in constitutional government; but what they had to say was heard around the world and is not likely to be forgotten. They did not disappear in the hole of oblivion which totalitarian rulers prepare for their opponents. Less well known but perhaps even more convincing is that Khrushchev[.] own and most ambitious attempt at reversing the process of detotalitarization turned into a complete failure. In 1957, he introduced a new \"law against social parasites,\" which would have enabled the regime to reintroduce mass deportations, re-establish slave labor on a large scale, and—most importantly for total domination—to let loose another flood of mass denunciations; for \"parasites\" were supposed to be selected by the people themselves in mass meetings. The \"law,\" however, met with the opposition of Soviet jurists and was dropped before it could even be tried out. 27 In other words, the people of the Soviet Union have emerged from the nightmare of totalitarian rule to the manifold hardships, dangers, and injustices of one-party dictatorship; and while it is entirely true that this modern form of tyranny offers none of the guarantees of constitutional government, that \"even accepting the presuppositions of Communist ideology, all power in the USSR is ultimately illegitimate,\"28 and that the country therefore can relapse into totalitarianism between one day and another without major upheavals, it is also true that the most horrible of all new forms of government, whose elements and historical origins I set out to analyze, came no less to an end in Russia with the death of Stalin than totalitarianism came to an end in Germany with the death of Hitler.\n\nThe quote is taken from the Introduction to 'The Origins of Totalitarianism', section III."}