{"doc_id": "1332", "name": "2014_05_humanities_student_major_467_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2014-05-humanities-student-major_467_AdviceAnimals.txt", "pub_date": "2014-05-06T00:00:00Z", "Sentiment": "-0.018", "Subjectivity": "0.389", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "489", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24vpx0", "Reddit_id": "chbavfx", "Subreddit_id": "t5_2s7tt", "Commenter": "fuckbread", "length": "2868", "content_scrubbed": "I fundamentally disagree with the definition of \"grades\" and what they tend to mean, but this response is applicable to a bunch of other comments in the thread. \n\nI guess it varies widely by country, state, and even nearby schools/universities/whatever, but it sounds like this teacher/prof gave OP a C because he/she turned in only what the instructions required. As a teacher myself, when a student turns in a writing assignment that \"did whatever the instructions said to do\" I am generally disappointed. \"Going above and beyond\" is a stupid phrase that can mean a million things, but it sounds like OP wrote an average paper, fulfilled the requirements (page length, formatting, citations, # of sources, or whatever), but the paper itself (writing quality) was average. If this is the case, I would have given the paper a C myself. \n\nThat[.] the simple response. The complicated response includes a combination of a shitload of other nuanced things to consider, like: grade level, subject matter, relationship with student, past assignment quality of student, grading system, personality of instructor... etc. If this is a humanities course, it really doesn't matter what the student thinks they should earn. If it[.] a sciences course, OP could probably argue it either way. But the point is that grading systems are inherently flawed and meaningless for a lot of the students who consistently fall in the middle. A \"C\" on a grade scale is not very telling, but the feedback on the C paper could be. An \"average\" score on a rubric works the same way, but better. Turning that average score on a rubric into a letter grade is extremely hard to do in an objective and meaningful way... and it almost defeats the purpose of using a rubric as a concrete feedback tool. \n\nI don't comment often, but the main reason why I wanted to respond was to point out that the backbone of OP[.] frustration comes from how most students don't understand grades, only work to seek high grades (extrinsic), and think that grades are either extremely fair (when you mark high) or extremely unfair (when you mark low). Obviously there are those who don't do shit and don't think their F is unfair, and those who don't work hard and think their A is unfair to those who do work hard, but here[.] my point: letter grades are bullshit. Period. And (at least the US) school system is slowly shifting pedagogy and thinking to reflect this. Many universities are shifting away from traditional methods of instruction, and with that will come non-traditional forms of assessment. My advice to OP would be to make sure they have a good relationship with the instructor, go out of his/her way to figure out what the instructor wants, and make as few assumptions about their grading scale/style/methods as possible. I should add a TL;DR on this. Oh well. Good luck!\n\nEdit: lol, I used the wrong word. "}