{"doc_id": "1402", "name": "2014_05_humanities_student_major_1026_canadapolitics", "namespace": "we1sv2.0", "metapath": "", "pub": "CanadaPolitics", "title": "2014-05-humanities-student-major_1026_CanadaPolitics.txt", "pub_date": "2014-05-15T00:00:00Z", "Sentiment": "0.075", "Subjectivity": "0.304", "Score": "22", "Upvotes": "22", "Downvotes": "0", "Wordcount": "360", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25mmg3", "Reddit_id": "chirq3x", "Subreddit_id": "t5_2s4gt", "Commenter": "flamoutan", "length": "2318", "content_scrubbed": " We want Canadians to be critical thinkers and innovators, to have a passion not just for their professions but for being good parents, community builders, global participants and for effectively choosing, challenging and engaging their governments.\n\nI think it[.] completely demeaning to say that STEM graduates somehow aren't capable of this. Furthermore, my own engineering program already *requires* me to take several \"arts\" courses as well as ethics courses. Societies like Engineers Without Borders, which has many student chapters, already go against this line of thinking.\n\nAlso, the article[.] stance on science graduates in general seems to be rather conflicted. The author lumps liberal_arts degrees and science degrees together, but then says STEM graduates should have arts knowledge. And unless I'm misunderstanding something, lumping liberal_arts and science just doesn't make any sense - Physics graduates learn as much arts as Math ones.\n\n Moreover, brains need constant development. In yesterday[.] economy, workers' lives were divided into two periods: one when they learned, one when they worked. They went to school or university, learned a competency, trade or profession, and were set for life. No more. Learning is now continuous. Careers must be constantly reinvented or they will go sour.\n\nI don't get this either. A computer programr, for example, has to constantly keep up with new coding paradigms and software in order to be successful or risk being outdated (well, maybe not if you're developing line-of-business applications). Similarly, a good doctor keeps up with medical literature. I am completely baffled that the author thinks that universities just churn out robotic graduates. Perhaps that does happen at certain places, but that problem isn't solved by making students attend some arbitrarily-chosen arts courses. \"Practical\" does not equal \"brain-dead\".\n\nEdit: I had to come back and bring up the topic of high school. English, history, arts, civics, volunteering. All of that, to some degree or other, is compulsory (at least in Ontario). Why isn't that enough? The implication being made is essentially also that high school alone is insufficient for being well-involved in the community. If so, then I think that the bigger problem is with *high school*, and not with STEM."}