{"doc_id": "1300", "name": "2014_05_humanities_student_major_61_writing", "namespace": "we1sv2.0", "metapath": "", "pub": "writing", "title": "2014-05-humanities-student-major_61_writing.txt", "pub_date": "2014-05-01T00:00:00Z", "Sentiment": "0.075", "Subjectivity": "0.314", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "950", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24h1rs", "Reddit_id": "ch74per", "Subreddit_id": "t5_2qh2n", "Commenter": "smiles134", "length": "5285", "content_scrubbed": "I think it[.] an excellent idea, though I may be biased.\n\nI'm currently finishing the second year of my English degree with a focus on creative writing. I've only taken two workshops so far (besides what I did in high school), and I've already discovered two things: I don't want to pursue poetry anymore, and writing is a lot harder than I thought it was.\n\nWell, I suppose I've learned a third thing, as well. Workshops are incredibly useful because you can get an inside look at how other writers write. You can read really rough and unpolished writing and think about ways in which it can be improved. You build relationships with other writers and have your work get completely torn apart in every facet. One pair of eyes is great but 15 is infinitely better. You get to hear from who is essentially your target audience how they read your stories. They'll tell you what sucks, what doesn't make sense, what should be cut; but they'll also tell you what is working, what you should expand on, ways in which you can improve your story.\n\nAnd even beyond that, the workshops are taught by those who have made a career out of either studying writing or writing themselves. They know what they're talking about and can really lead you in the_right direction.\n\nThat being said, creative writing is a craft. On some level it is an intrinsic skill with which a lot of people were born without. That[.] not to say anyone can't be a writer, quite the opposite. Anyone can be a writer and anyone can get their work published, especially in these modern days of self-publishing. However, not everyone can be a great writer or even a good writer. That takes time and polishing and molding and learning.\n\nYou can learn all of these things without a fancy degree. You can take workshops offered through your local community or through lit journals or writing camps. You could learn it by practicing every day and reading other writers' works that have already been published. There are a lot of avenues you can explore if you really really *really* want to pursue a career in writing.\n\nWith all of that being said, there is another thing you should consider: making a career out of writing creatively is very very hard. Like mindbogglingly hard. I recently went to an informational meeting on getting published by the editor of Tin House magazine (tinhouse. com). She said that for writers who aren't already connected with the magazine or the publishing industry in any other way (i. e., someone like Tim O'Brien would not be in this category) submit their work through their slush submissions. Slush submissions are submissions that are submitted through an online form or are otherwise unsolicited. Those submissions are read by a team of volunteer reviewers who give it either a yes or a no. The yeses continue onto a second tier of reviewers. The ones that pass that level are passed on to all the other top reviewers on their staff. If there[.] a majority yes, it will get published at some point. She told us that there are four issues published every year, with about 100ish accepted pieces. They receive about 17,000 every year. You have to round up to get a 1% acceptance rate. \n\nIt takes a lot of rejections to receive an acceptance from somewhere. But the point is to keep trying.\n\nThe other side of that is that it is very hard to publish a novel without any publications before hand. That[.] where short stories come in. It[.] also very rare to publish a collection of short stories without publishing a novel or novella first. Submitting widely and frequently is important, but also make sure that the places you are submitting to are right for your piece, just like the reviewers will make sure your piece is right for their journal.\n\nOnce you have a manuscript and a resume of short stories published, the next step would be to look for an agent who will look for a publishing house to get your novel published. (PSA: Never hire an agent who asks for money before a deal is made with a publishing house for your book. Ideally, they shouldn't be paid until you are. Their job is to get you a check so that they can get a check from you, not the other way around.) Once a deal is made, it'll most likely be for somewhere in the ballpark of $20,000ish (US, I don't know the UK equivalent), which will be paid to you in installments. After the agent takes their cut and taxes, you'll probably make about 6-7 thousand dollars, plus royalties, which will vary based on genre, publisher, and overall success of the work. The point from which the deal is made to the shipping of the books to the retailers could be anywhere from 7 months to 2 years.\n\nMy point in this whole rambling spiel is that it is very hard to make a living wage off of writing alone. I'm majoring in both English and Classical Humanities, and while neither of those are very lucrative fields, I also have a job part-time as a Systems Administrator, and am planning on going to an MFA program after I graduate. If you are considering a university degree in writing, these are all things to keep in mind about your future. I say go for it; it can only help you grow as a writer. But have several backup plans in mind.\n\nHopefully this was helpful enough :) Feel free to ask questions, but remember I am no expert myself haha"}