{"doc_id": "1321", "name": "2014_05_humanities_student_major_292_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2014-05-humanities-student-major_292_Economics.txt", "pub_date": "2014-05-05T00:00:00Z", "Sentiment": "0.062", "Subjectivity": "0.374", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "280", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_ch9zby0", "Reddit_id": "cha710s", "Subreddit_id": "t5_2qh1s", "Commenter": "djimbob", "length": "1534", "content_scrubbed": "I did grad school at different Ivy (in NY starts with a C) (physics) and there was a union drive there.  It eventually died because of lack of support.  Yes, in the humanities it sucks because the funding isn't there and it is easy to get labor.  But the problem was that they wanted to unionize everyone together and treat them equal. \n\nIn STEM fields, pay sucks compared to getting a real job, but you know that going in -- and pay is enough to survive on and you get a lot of flexibility.  \n\nSome of the union proposals said things like they would fix a grad student wage (e. g., all grads make the same stipend regardless of field) or putting limitations on hours worked (which when you are trying to do cutting edge research and want to just graduate is a barrier).  Furthermore, many STEM grads can't just stop their research to participate in a strike as a break without ruining a long going experiment or risk getting scooped by someone at another institution.\n\nMost of a grad students salary and work conditions is set by their advisor -- you  can ask around before joining a group.  There are horror stories out there from certain advisors or certain schools (e. g., school needs TAs so accepts way too many first year students to TA and then fail half of them on their quals before research), but there doesn't seem to be an easy way for a union to fix those sorts of issues -- and the current fix (you ask around on visit weekend about the school, and you talk to grad students currently with an advisor, works fairly well)."}