{"doc_id": "1382", "name": "2014_05_humanities_student_major_862_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2014-05-humanities-student-major_862_AskReddit.txt", "pub_date": "2014-05-12T00:00:00Z", "Sentiment": "0.073", "Subjectivity": "0.181", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "312", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chg52y4", "Reddit_id": "chgjb36", "Subreddit_id": "t5_2qh1i", "Commenter": "Niniane_", "length": "1709", "content_scrubbed": "Ah, yes.  I'm a first year teacher at a charter school.  While I'm not dealing with a wandering child like this, my administration has no backbone.  \n\nStudent wants to complete homework due from first quarter during third quarter to retroactively change their grade? Sure!  If they have a desire to do their work, who are we to deny them that?  \n\nWe're a \"fun\" school, so we'll have unannounced parties where all of our students get to mingle for the last hour and a half of the day.  Who cares that those last two periods are your elective periods and classes like drama (which I teach) actually need rehearsal time to put on that play that the students are performing next week?  Or that you had to provide 75% of your lesson plans before the quarter started so we could see what you're going to be doing in the classroom, but we don't bother to give you guys a heads up in advance when we're going to turn the school upside-down for a few hours.\n\nWe're a fun charter school!  You have to be flexible with your time!\n\nDirector[.] birthday?  We're going to stop instruction at 11:45 and have a huge party until the school day ends at 4:00.\n\nWe encourage the use of technology, so students can totally have their phones on them and use them to Google things while in class if they need extra help on something.  No tablet or laptop?  No biggy, just connect to the internet through your phone and do your work!  But if a teacher pulls out their phone to check the time or Google an answer, they get written up.\n\nWe're a charter school that focuses on liberal_arts and technology, but we have no real arts budget and have no technology teacher and no technology training for the other teachers.\n\n\nI could go on. "}