{"doc_id": "1464", "name": "2014_05_humanities_student_major_1568_tumblrinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrInAction", "title": "2014-05-humanities-student-major_1568_TumblrInAction.txt", "pub_date": "2014-05-24T00:00:00Z", "Sentiment": "0.119", "Subjectivity": "0.486", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "1479", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chq5gch", "Reddit_id": "chq72vz", "Subreddit_id": "t5_2vizz", "Commenter": "Zigstyle", "length": "9202", "content_scrubbed": "This isn't true, because the negative experience only further reinforces the prior conditioning. An unexpected panic attack essentially reinforces the conditioned belief that \"that panic attack is terrible and painful to go through.\"\n\nThat[.] 'cause panic attacks *are* terrible and painful to go through. But my point is that the human brain is very good at becoming desensitized to thinks through repeated exposure, even if the exposure isn't voluntary (although obviously that makes it harder). \n\n(i. e. sexual assault on campus, which is highly common and a major epidemic).\n\nI'm not sure what you mean by \"highly common\" and \"major epidemic.\" There are few-to-no reliable statistics as to the incidence of sexual assault in campuses. What[.] more, PTSD is actually quite rare. Most people who experience trauma do not develop PTSD.\n\n Exposure to traumatic material might be unexpected in certain courses - many students without triggers don't assume that an Intro Literature course will discuss rape culture, for instance. \n\nI can't imagine why an Intro Literature course would discuss rape culture, since rape culture is a sociological/deconstructionist model which has relatively little to do with introductory literary studies (which generally focus on close reading of texts). The issue in this case wouldn't be that there should be trigger warnings; it would be that the professor shouldn't be teaching stuff that has nothing to do with literature. \n\n Maybe a student walks into an environment with positive expectations; i. e. an individual transferring from a rural high school with a misogynistic culture, to an urban university which prides itself as being \"liberal,\" assumes people will be more friendly and accommodating. \n\nThis is wildly speculative and specious, I think. These kinds of expectations are frankly naive and should be treated as such.\n\n Or the assumption that a professor will work with a student who has a trigger, as is the case in many high school Health classes (for EDs, grief, violence, STDs, etc).\n\nHigh school health classes are compulsory; that[.] probably why teachers tend to be more accommodating; further, the involved parties are generally minors with teachers acting as sort of guardians during school hours. \n\nThat[.] an invitation, then, to think about how different narratives affect different individuals throughout society and culture.\n\nThis is a completely unproductive exercise, though. Everyone has a *completely* different narrative, and while it does give insight into someone[.] character to consider these narratives, it[.] entirely impossible to base policy on blanket applications of intersectional philosophy.\n\nYes, real life has no trigger warning - but individuals should be able to choose how and when they expose themselves to certain narratives outside of the classroom based on available information given regarding a narrative[.] content. \n\nWhat does this mean, and why is it even the case? People shouldn't be censored or restricted from talking about certain narratives out of consideration for the_right you seem to be advocating; that is, for people to be able to choose whether they want to encounter certain narratives. \n\n It helps individuals make informed decisions outside of the classroom, let alone which courses they choose within it.\n\nI think that it actually kinda restricts one[.] ability to make informed decisions, on the grounds that it institutionalizes a process by which information flow is artificially stifled for the sake of, well, something that isn't very well-defined.\n\nAnd we know this works well and is highly received - \"Viewer Discretion Advised\" has been used for years, now, with no plan on removing its warning before productions like Hannibal and Law & Order.\n\nThis exists solely so that parents can determine, in advance, whether a program is appropriate for their children. It[.] a relic of the 80[.]. Movie ratings have *not* be highly received either, by the way. Many people remain highly critical of them. \n\nEngaging with stress and panic attacks is important. But it[.] also important for the individual to choose this path and do it of their own agency, where they feel comfortable and safe engaging with the material.\n\nTo an extent, yes, but that[.] not what we're arguing here. Going to an institution of higher learning and taking courses that encourage discussion and challenge ideas while not shying away from contentious subjects is, in itself, stepping into the public sphere and putting oneself in the position of being challenged on *every front.* You don't get to choose which of your beliefs or conceptions are going to be challenged, because the point of a university is to create a general environment of scholarly criticism and discussion.\n\nSomeone with PTSD should have the_right between a public or private panic attack, right? Simply choosing when and where a panic attack happens is empowering in its own right.\n\nThey already do have this right, though. Not that I'd recommend it, but someone who only wants to have private panic attacks can very easily not go to university and stay home. The fact that they *are* choosing to go is what should be empowering; but the fact is that it has risks attached to it, and one of those risks is that people are going to talk about tough issues and ideas. If they're not read for that, then they're not ready to take classes which probe deep aspects of the human condition.\n\nEngaging with stress during an individual[.] undergraduate career is also a heavy choice to make, and, again, it requires resources and connections that mental health care currently fails to address. \n\nAll evidence suggests that engaging PTSD sooner rather than later results in a better prognosis. Medical health care certainly needs to improve, but, again, that[.] not really an argument for trigger warnings so much as it[.] an argument for improving medical health care and making it more accessible. My county has publicly funded healthcare and university counselors all over the place. Why not aim for something like that?\n\nNot to mention, most Grad students with mental illness are forced to drop out or take leave - the conditions are not created for anyone with anxiety, stress, or PTSD to survive for long.\n\nThat[.] because being a grad student is, in many cases, a full-time commitment. It[.] not demeaning to people with illnesses to refuse to lower the standards of a program. If someone is incapable of doing the required research or programs, then that person is not capable of getting the degree. Albert Einstein with psychosis isn't going to be much use as a professor.\n\nThere are problems with the ways in which academia and education approaches mental illness, and simply giving students more information about their course[.] narratives is an important step. \n\nI don't think it[.] an important step at all. Considering that this discussion seems to apply mostly to humanities fields, it strikes me as undesirable that we'd be creating pathways to specialization and graduation in a given field (say, literature, or philosophy) which permit someone to *entirely avoid* studying an important body of work or an important ethical issue. How can we really give someone a degree in philosophy if they refuse to take even the most elementary ethics courses dealing with issues like abortion, paternalism, and consent? \n\nEven without alternate syllabi, even without independent studies, even without stellar counseling services - students, as consumers of the University system, have the_right to know what they're reading in the first place. \n\nHow would you feel about a disclaimer at the top of every humanities department website reading: \"all courses offered by our department involve the discussion of sensitive issues.\" I mean, I guess you could write that? But what[.] the point? Is there anyone who wants to be a philosophy specialist that doesn't realize philosophy is about asking hard questions? \n\nTrigger warnings are just another way of telling students what[.] in a course - if a professor cannot be honest with their students about their course[.] content, then that[.] a highly dishonest and manipulative way of running an educational structure.\n\nI think the more interesting implication would be that almost no course would *not* have these kinds of trigger warnings. Here[.] an example: I was taking a course on Aristotle last semester. Brilliant course, brilliant professor. We were doing a detailed study of the Nicomachean Ethics. Now, at one point, the professor asked a tricky question involving a sexual assault. The way the question was asked made it very hard to actually prove that sexual assault was worse than, say, petty thievery (even though everyone feels that it is). I could see this triggering someone who had been sexually assaulted. But the discussion was entirely civil, and could not reasonably have been predicted. More importantly, I remember that discussion more than any other discussion I had in the course, because it was striking and illuminating. I think the point I'm trying to make is that university courses are *all about* trying to push the boundaries of what people are comfortable with on an intellectual level. "}