{"doc_id": "1350", "name": "2014_05_humanities_student_major_622_cscareerquestions", "namespace": "we1sv2.0", "metapath": "", "pub": "cscareerquestions", "title": "2014-05-humanities-student-major_622_cscareerquestions.txt", "pub_date": "2014-05-08T00:00:00Z", "Sentiment": "0.14", "Subjectivity": "0.282", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "267", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_250gs6", "Reddit_id": "chdesku", "Subreddit_id": "t5_2sdpm", "Commenter": "busysocks", "length": "1518", "content_scrubbed": "I would work towards a degree, but apply for junior developer roles the second you start school. Alternatively, since you're a year out of school and have been presumably financing yourself without loans, self-paced learning. \n\nIt[.] been my experience that most smaller and mid-size companies who are looking for a junior dev like a degree, but like proactive learning more. If you can actually show code that you've posted up on Github, you'd be ahead of most CS graduates I know. There are plenty of resources already for hands on, open source education, but I'd like to recommend Udacity and Coursera. Of the courses I've taken, I would point you towards Udacity[.] Intro Programming and Web Development courses (both Python).\n\nTake it with a grain of salt, but your experience was pretty close to mine a couple of years ago. Double majored in liberal_arts. Applied for a QA position while entertaining law school acceptance letters. Interviewed well and they offered me a dev spot. It was still a toss up, because I had felt so committed to law school. My starting salary ended up being more than I was hoping for after law school. FWIW, I wouldn't trade my degrees and they have made me a much better learner and critical thinker (yes, I'm aware of how cheesy that sounds).\n\nI realize this is all very anecdotal, but if you'd like some more specifics, feel free to PM me. I'd love to be of help.\n\nTL;DR Almost pulled the trigger on law school. I write software for lawyers now and always seem happier than they do."}