{"doc_id": "1400", "name": "2014_05_humanities_student_major_1003_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2014-05-humanities-student-major_1003_AdviceAnimals.txt", "pub_date": "2014-05-14T00:00:00Z", "Sentiment": "-0.065", "Subjectivity": "0.381", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "353", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chi00ua", "Reddit_id": "chic7k6", "Subreddit_id": "t5_2s7tt", "Commenter": "flyMeToCruithne", "length": "2057", "content_scrubbed": "I'm guessing you in the humanities, or maybe the social_sciences? \n\nIn upper-level hard_science classes, this is how things are done.  Homework is generally long and hard, but doable.  Tests are extremely difficult.  In my program, in both upper-level undergrad and in grad school it was normal to have tests where the average is around 50% and the high score is maybe 70%.  If you get a professor who[.] writing tests where more than a  few people are getting above 90%, they're actually doing their students a *disservice* (as I'll touch on below).  \n\nThe thing is, once you get to that level in a \"hard_science,\" everyone is extremely smart and extremely good at that subject.  You have to write an extremely difficult test to get any differentiation in the scores.  So you write a super hard test to get differentiation in the scores, but you make an A, for example, anything above a 60.  \n\nYou might say, \"well if everyone is that good, then they should all get an A.\"  Well, frankly, that[.] bullshit, at least for these types of fields.  The point of grades is differentiation.  If you didn't want to be differentiated, you should have taken the course pass fail.  But no one does that in these kinds of courses.  Why?  Because if you're bothering to take a course that[.] high-level enough to be grading like that, you probably want to go to grad school or get a research job.  And because grad schools and research jobs want to see your *grades*.  They know the overall quality level of the program you're graduating from, and they want to know how you stack up within that program.  **Providing differentiating tests (and therefore differentiating final grades) is actually doing the students a *service* by giving them something meaningful to show to a grad program or (research-y) employer**.  If you come from a program that doesn't have differentiating grades, you can bet you're not going to be taken seriously trying to get a research job or get into grad school.  \n\nIt[.] just a difference in the culture and expectations of different fields.  "}