{"doc_id": "1339", "name": "2014_05_humanities_student_major_530_mcgill", "namespace": "we1sv2.0", "metapath": "", "pub": "mcgill", "title": "2014-05-humanities-student-major_530_mcgill.txt", "pub_date": "2014-05-07T00:00:00Z", "Sentiment": "0.095", "Subjectivity": "0.342", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "548", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24y6rq", "Reddit_id": "chc8vpr", "Subreddit_id": "t5_2rhkw", "Commenter": "abstractmcgill", "length": "3097", "content_scrubbed": "Frankly, everything else you've already heard here is right - a lot of students at McGill - especially in the Faculty of Science/Arts and Science Program and especially first- and second-year students - say they're planning on medical school. Very few ever actually apply/are accepted, and even fewer immediately following undergrad. If you're going to be one of the few that actually follow-through, you need to plan your time at McGill carefully. I'm assuming you have no advanced standing (which I'm assuming for convenience based on the fact that you're a U0).\n \nIn the multi-track program, you have an 36 credit Arts major concentration + 36 credit Science major concentration (might be 38, with labs) + 3 credit integrative course (BASC 201) + 30 credit U0 Program. This brings you to about 105-108 credits, depending on labs and such. That leaves you with about 12-15 credits/around 4-5 courses to squeeze in everything you need that is beyond your major. Depending on how broadly you plan to apply and considering the new subjects included on the MCAT, it is essential that you plan your degree - what classes will you take, and when?  Check some med admissions sites and see what courses you may need to take as electives to ensure you're prepared. For Bio and Anthro, this probably means Organic 2, stats, maybe another English course if you take a language in your first year, maybe a psychology course, etc. There is no such thing as a pre-med/pre-professional advisor here, so **a lot of this legwork is stuff you're best off doing on your own**. \n\nMy advice: take at least one English course as a part of your U0 Freshman program, make a plan for the rest of your degree, and bring it to your advisor before you register for your U1 courses to ensure that A. what you plan on doing is reasonable/possible and B. what you plan on doing will actually lead to a degree. (Don't ask me what advisor you should see - ArtSci is notoriously frustrating on that front, with the notable exception IMO of the interfaculty programs advisors.) The details of whatever plan you come up with will probably have to be modified on a year-to-year basis because of scheduling conflicts, for example, but having a general framework is useful.\n\nFinally: as a recovering \"pre-med\", you should be prepared to really work but **don't get stuck on this as the only thing that you should be focusing on or your only shot for a happy future.** The second I stopped focusing on med school, I found my schoolwork more enjoyable and my GPA went up as a consequence. After years of GPA anxiety, I decided to postpone my AMCAS application last June and I was in a better mental headspace and academic place this year. I was in class to learn about cool stuff, not just to get an A or the best grade I could manage so I could move along to the next thing. It[.] good to have a goal, but especially in the Arts and Science program you'll be expected to explore interests other than medicine. \n\nTL;DR: Plan your degree. Do it by next March. Everyone is pre-med their first year, don't let that go to your head too much."}