{"doc_id": "1315", "name": "2014_05_humanities_student_major_227_relationships", "namespace": "we1sv2.0", "metapath": "", "pub": "relationships", "title": "2014-05-humanities-student-major_227_relationships.txt", "pub_date": "2014-05-04T00:00:00Z", "Sentiment": "0.1", "Subjectivity": "0.327", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "391", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24q71p", "Reddit_id": "ch9lj01", "Subreddit_id": "t5_2qjvn", "Commenter": "zizzymoo", "length": "2154", "content_scrubbed": "You know, I have to wonder how much of your ADHD (and even some of the ways in which your Asperger[.] manifests) have to do with your home environment... and how much different things might be for you if you were away from that environment.\n\nHere[.] my suggestion - \n\nI would talk to them - BRIEFLY - about the possibility of you attending a school you want to attend with the arts program you want to pursue.  Just to see how receptive they are.  You could frame it as, \"since we're not that familiar with the American educational system, this program/school might be a good way for me to get my feet wet until we know more about what it[.] like for a foreign student in the US.  I'd hate to see you spend so much money on Prestigious University, only to find that there[.] some aspect of this we didn't know about beforehand.\"\n\nBut as I said - float the idea **briefly**.  Don't hound and nag about it, just put it out there for them to consider.\n\nIf they decline, as you think they will, that[.] ok.  **Let them send you to whatever American university they want.**  Nod and smile a lot.  Be agreeable.  **And get your ass out from under their thumb as soon as possible.**\n\nOnce you're here in the US, **on their dime**, you'll have a much better opportunity to assess your options.  You'll have bought yourself some time, but more importantly, you'll have gotten far away from them.  You may find that being outside of their influence completely changes your scholastic abilities, when you're no longer being constantly subjected to stress from them.\n\nOnce you're here, start looking into financial aid options that would allow you to go to a different university under student loans and such.  Get a part-time job and sock away every penny you can.  If need be, don't tell your parents you're working and make SURE you open a bank account here in the US for your paychecks - don't put their names on the account.  \n\nYou're going to have a much easier time figuring out what sort of education - and life - you're going to lead once you're already HERE, so \"let\" them send you here... and then you figure out what to do next AFTER you're settled in here.\n\n"}