{"doc_id": "1367", "name": "2014_05_humanities_student_major_772_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2014-05-humanities-student-major_772_AskReddit.txt", "pub_date": "2014-05-11T00:00:00Z", "Sentiment": "0.026", "Subjectivity": "0.331", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "279", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chfhtte", "Reddit_id": "chfiag8", "Subreddit_id": "t5_2qh1i", "Commenter": "whyseone", "length": "1657", "content_scrubbed": "Oh, I'm a boring ol' cis-het woman, haha. I hope I did not come off as speaking for the trans/queer community, it was not intentional! Gender and sexuality are just issues I care about and enjoy talking about.\n\nThe only real authority I have on trans issues (other than being a walking liberal_arts degree social justice cliche when it comes to sexuality and gender) is reading up on this stuff, and having conversations with those in the community on occasion (quite easy because, well, liberal college campus). \n\nAs an aside, reading up is more recommended in some cases than just interrogating some poor transperson :P Sometimes this is because being asked to justify and explain one[.] existence over and over again to many people can make someone feel very illegitimate and othered. ie, asking someone \"so do you have a penis?\" or \"how do you date?\" and *expecting an answer* a) can be rude in some contexts, regardless of the other person[.] cis/transness - they're personal questions! b) suggests that somehow, you are \"owed\" an explanation because this other person is so weird. I personally ascribe to the idea that it is the responsibility of the not-trans/queer to educate themselves to some degree for that reason. There are boundless resources on the internet, and in some locations (liberal cities, I suppose) lots of IRL resources too. If you're part of the majority, why not meet the minority half-way?\n\nBeing in love with a genderqueer person also helps! I get some second-hand experience from my SO (reassuring during times of dysphoria, going on gender-neutral bathroom hunts, and ending up at a lot of trans and queer events, for example)."}