{"doc_id": "1423", "name": "2014_05_humanities_student_major_1176_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2014-05-humanities-student-major_1176_news.txt", "pub_date": "2014-05-18T00:00:00Z", "Sentiment": "0.144", "Subjectivity": "0.45", "Score": "55", "Upvotes": "55", "Downvotes": "0", "Wordcount": "522", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25v2pz", "Reddit_id": "chl1ttv", "Subreddit_id": "t5_2qh3l", "Commenter": "[deleted]", "length": "3011", "content_scrubbed": "I think the issue is that people go to college to be challenged, not protected from harm.  The very best professors I ever had, undergraduate, graduate level, either way, were the ones who weren't afraid to be controversial and challenging, and maybe even a little disturbing at times. \n\nGreat literature, great art in general, isn't about making the person exposed to it feel good... great art is great specifically because it provokes some kind of thought, or visceral response. There are two ways to read 'The Adventures of Huckleberry Finn': As a great travel and adventure story about a boy and his friend sailing downriver (how I read it in 8th grade)... or as a profound examination of a particular time and place in American history, warts and all in the forms of racism, violence, misogyny, a lack of social support for the weak, etc.,  that we should really be striving as an enlightened people not to return to (the way I read it in American Lit in college). Presumably the second way of reading this book is the one that people like Ms. Loverin fear might trigger some kind of visceral reaction in university students. She is right to fear this, because a book so powerful damned well should trigger such a reaction, and students should be glad for the opportunity to laugh, cringe, be shocked, recoil, and possibly even cry a little bit right alongside Huck and Jim. But as an avid reader and college educator (in the sciences, not the arts, but still) I would say that this kind of thing is exactly what people go to college for. To learn to think, empathize, process information, and get indignant about the constant injustices our world throws around. \n\nIdeally anyone intelligent enough to get into college should know that when they take American Lit (or any Lit course) they aren't sitting down to read a bunch of feel-good material... they are sitting down to explore the history of a country through a particular art form. And our country, like most countries, has a whole lot of history that can be disturbing. And thinking people, the kind who go to college, need to be disturbed. This is to make damned sure we are always moving forward and never back to what we were. That[.] why great literature is great, at least in my humble opinion. Because the themes are universal... people hate, people are violent, people are racist, people are ignorant, people rape, people steal, people harm each other for personal gain or for no very good reason at all. Yeah, none of that has changed, not in millennia. Nor will it, ever. A well-intentioned but misguided effort to warn the very people who need to be thinking the most about these issues (college grads, presumably a group that will make up most of the leaders of the future) away from books that might make them have an emotional experience beyond this hour[.] Facebook post is exactly what we don't need. What we do need, desperately, is informed thinkers... \n\n(/TheLemurGuy then puts away large soap box, returns to Sunday morning coffee)"}