{"doc_id": "1428", "name": "2014_05_humanities_student_major_1194_mensrights", "namespace": "we1sv2.0", "metapath": "", "pub": "MensRights", "title": "2014-05-humanities-student-major_1194_MensRights.txt", "pub_date": "2014-05-18T00:00:00Z", "Sentiment": "0.175", "Subjectivity": "0.371", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "267", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25vxz5", "Reddit_id": "chl89qn", "Subreddit_id": "t5_2qhk3", "Commenter": "thequincy", "length": "1731", "content_scrubbed": "I'm not personally outraged by the gender discrepancy itself, which I am willing to accept could have many different explanations. What I find troublesome are the stark differences in how the gender imbalance is approached for male- versus female-dominated majors at Princeton.\n\nDavid Walker, on the shortage of women in the school[.] computer science programs:\n\n \"We illustrate in our introductory courses all the range of different things that involve what I would call computational thinking — thinking algorithmically, thinking using procedures, and all the applications of that mode of thought — applications in medicine, applications in mathematics, applications in art,\" he said. He added that he expects the successes of female computer science majors to draw more women to the department. \n\nFor comparison:\n\n English had a 70. 8 percent female sophomore class, and was the second most popular humanities concentration after the history department, which had an even gender distribution. **English departmental representative Sophie Gee said she does not consider the disparity a problem and added that she likes the fact that English draws intelligent female students.** She attributed the trend in part to the strong mentorship of female faculty.\n \n \"English is a discipline where smart young women are able to feel comfortable, feel welcome,\" she said.\n\nOr on the lack of men in biology:\n\n Women may find biology inherently more interesting than the physical sciences or look to the many female faculty members as role models, he said.\n\n **Silhavy said the department does not have plans to attract more male concentrators, adding jokingly that having more women could attract more men.**\n\n(Emphasis in the above is mine)."}