{"doc_id": "1502", "name": "2014_05_humanities_student_major_1937_cfb", "namespace": "we1sv2.0", "metapath": "", "pub": "CFB", "title": "2014-05-humanities-student-major_1937_CFB.txt", "pub_date": "2014-05-30T00:00:00Z", "Sentiment": "0.12", "Subjectivity": "0.379", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "597", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chv0jbz", "Reddit_id": "chv17gr", "Subreddit_id": "t5_2qm9d", "Commenter": "smiles134", "length": "3110", "content_scrubbed": "Thanks, man! Math kicked my ass for about four years (the last two in high school, and the first two here) and finally I said, screw what my parents want me to do, I'm doing this for myself so that I can be happy, and it[.] only paid off so far.\n\nI'd also like to rant a little about my sister and mom... My sister has always been a better student than I have. She isn't as naturally smart as I am (There[.] really no way to say that without sounding egotistical...), so she really pushed herself in high school to study a lot and get good grades. She got into a UW system school, which, while it has good programs and is one of the better UW schools, she couldn't get into Wisconsin. I got into Wisconsin and my family was very proud of me, yet it[.] always been hard following in her footsteps because she[.] gotten a 4. 0 nearly every year since she was in sixth grade. \n\nWhen my sister graduated, she graduated with the highest honors. My parents told me I needed to get a tutor so that I could graduate with a CS degree. I hate math with a burning passion. Writing has always been what I've wanted to do with my life, so I felt that I needed to appease my parents by getting a CS degree at the same time that I studied English and Creative Writing. When I talked about my math exams, and courses here in general, and how the averages were always extremely low, and the classes were mind-bogglingly difficult, my parents would act like I wasn't trying hard enough, and my sister would make some comment like, \"Oh, the averages were never lower than an 85% in my classes.\" Yeah, that[.] because your school isn't nearly as competitive as mine.\n\nFinally, I said fuck it. I'm living my own life, not the one they want me to live. I'm the editor-in-chief of a school litmag as of three weeks ago. I switched into the Classical Humanities program and am taking fifth semester Latin next year. I am still getting a CS minor, because I have a job a sysadmin right now that I enjoy, and I don't need a CS degree for it, but the programming classes will help me. My grades are improving, and I'm getting degrees in the fields I love studying. It[.] not gonna land me some high paying job that my parents want me to have, but it[.] going to open doors for me to do what I really want to do with my life. Yay me.\n\nI think one of the most upsetting things my mom told me this past year is that when she interviews to hire someone for a job, she never looks at what school they graduated from. That makes no sense to me. Kids work their asses off to get into the top programs so that they can get ahead in life. I'm not saying that people should be overlooked, but if there are two candidates who interviewed the same, have similar job history and resume, I firmly believe that the one with a degree from a top school should be given preference. Those schools are fundamentally more challenging and competitive.\n\n\nAnyways, I'm not saying that I resent my family. I love my family for molding me to be who I am today, and I respect their opinions. But when it comes down to it, it[.] my life and I get to chose what I do with it."}