{"doc_id": "1432", "name": "2014_05_humanities_student_major_1230_interestingasfuck", "namespace": "we1sv2.0", "metapath": "", "pub": "interestingasfuck", "title": "2014-05-humanities-student-major_1230_interestingasfuck.txt", "pub_date": "2014-05-19T00:00:00Z", "Sentiment": "0.033", "Subjectivity": "0.39", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "286", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chlows9", "Reddit_id": "chlp0v2", "Subreddit_id": "t5_2qhsa", "Commenter": "KH10304", "length": "2216", "content_scrubbed": "That[.] one reason I doubt it[.] a black hole, after the event horizon, light[.] wavelength is stretched past the plank constant due to the effects of relativity (everyone knows how time is slower closer to massive objects, but distances are also longer) so no light can escape. [Edit: Quasars are black holes feasting on matter at the center of galaxies, and they emit beams, but much larger ones than the one depicted in the animation appears to be]  [Pulsars](http://www. smallerquestions. org/storage/pulsar_web. jpg?__SQUARESPACE_CACHEVERSION=1371241583261) have radiation beams like this, which are created by their magnetic field (kind of the same way earth[.] magnetic field draws solar wind in at the poles rather than repelling it, causing the aurora borealis, the pulsars spit out accelerated particles because they spin fast as fuck and thus have a really strong magnetic field), but I think its more likely the begining stages of a [type 1 supernovae](http://upload. wikimedia. org/wikipedia/commons/thumb/c/ce/Progenitor_IA_supernova. svg/585px-Progenitor_IA_supernova. svg. png) but I never heard about those spitting out beams.\n\nSource of all this: 1 semester of \"elementary astronomy,\" which was a science class for humanities_major basically, so I'm not really all that informed. \n\nEdit: since pulsars collapse pretty quickly from white dwarves/neutron stars, I feel like this could be a binary star system with a pulsar and a red giant. Such a system might turn into a black hole (edit probably just a supernova) eventually since the [neutron degenerate force](http://en. wikipedia. org/wiki/Degenerate_matter#Neutron_degeneracy) which is preventing the collapse of the pulsar would eventually not be enough to counteract the extra gravity precipitated by the mass being added to the pulsar by the red giant. \n\nDouble Edit: [that[.] definitely what it is and I'm extremely proud of myself for identifying it.](https://www. google. com/search?q=pulsar+and+red+giant&rlz=1C1MACD_enUS575US575&tbm=isch&tbo=u&source=univ&sa=X&ei=AvV5U_elGc_7oASHtIH4CQ&ved=0CEAQsAQ&biw=1163&bih=617)\n\nTriple Edit: which makes the pulsar an [X Ray Pulsar](http://en. wikipedia. org/wiki/X-ray_pulsar0)"}