{"doc_id": "1415", "name": "2014_05_humanities_student_major_1122_literature", "namespace": "we1sv2.0", "metapath": "", "pub": "literature", "title": "2014-05-humanities-student-major_1122_literature.txt", "pub_date": "2014-05-17T00:00:00Z", "Sentiment": "0.053", "Subjectivity": "0.347", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "371", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25ra5j", "Reddit_id": "chk6ge6", "Subreddit_id": "t5_2qhps", "Commenter": "blackbeard12", "length": "2128", "content_scrubbed": "The arts are like sedimentary rock. All the easily accessible stuff sits on the surface and everyone scoops it up thinking the rest of the earth is made of the same stuff. They find books  like Game of Thrones and Dan Brown. \n\nThen some do a little more digging and discover books like Hitchhiker[.] Guide (which I actually happen to think is quite an important book, but anyway). \n\nSome people decide they're going to go and dig where no one else is digging just so they have something different to say. These people only really dig down as far as those who found Hitchhiker[.], but instead they find Mein Kampf or The Bible (I never thought I'd mention those two in the same sentence) and they say, \"Hey look, here[.] something I found but haven't actually read, it[.] really important though but you'll never read it so I can make stuff up about it.\"\n\nThen some people are given things without needing to dig at all (literature students), like TKAM, Ulysses, The Ilyiad etc. All these are important texts, VERY important texts, obviously, because that[.] why they're being studied. But here[.] the thing: unless you study literature, it can be very difficult to actually find out about more literary texts. One of my favourite books happens to be Jealousy by Robbe-Grillet, but I would never have discovered it if I hadn't been given the pointers and suggestions about where and how to dig deeper. There are all sorts of incredible books that evade public interest simply because no one knows where they are. Perhaps this is because they are inaccessible (Jealousy isn't exactly easy-going), but my point is I don't think you can blame people for having a fairly shallow grasp of important literature, texts that changed literary forms as well as public perception, because people dig a little way down and think either that[.] all there is or there[.] just more of the same. \n\nFor anyone who cares, my most important books are these: Tristram Shandy, Madame Bovary, The Turn of the Screw, To The Lighthouse, Things Fall Apart, In Cold Blood, Foe, and My Struggle (Karl Ove Knausgaard). I read all of those as a result of my degree. "}