{"doc_id": "1448", "name": "2014_05_humanities_student_major_1354_deadbedrooms", "namespace": "we1sv2.0", "metapath": "", "pub": "DeadBedrooms", "title": "2014-05-humanities-student-major_1354_DeadBedrooms.txt", "pub_date": "2014-05-21T00:00:00Z", "Sentiment": "0.115", "Subjectivity": "0.317", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "1827", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_264u4q", "Reddit_id": "chns0mf", "Subreddit_id": "t5_2t25p", "Commenter": "zhenni86", "length": "9127", "content_scrubbed": "I have been lurking here for awhile and have yet to post. I have avoided it as my SO is a redditor as well. However, though I cannot pinpoint exactly what in this post compelled me to post, but it was likely the lines about being best friends and someone that has been a part of his life since he was 18. \n\nMy SO is my everything and we are a dying bedroom because of both of us. Both of us have become LLs and most of the time we are okay with it, but it gets to one or both of us some of the time and we fight about it on occasion.\n\nBackground:\n\nI am 27 F (and bisexual) and he is 30M and both American and both from sexually repressed and evangelical christian homes.\nWe have known each other since I was 19. We met in undergraduate school. He became the roommate of one of my then BF and I[.] mutual friends. When I met him he had recently been dumped by first GF (as a side note it turns out his ex was also my BF[.] ex before me and BF dated her before him... small world...) and I thought he was a misogynistic asshole and he was being that way as he was bitter at all women. I told him to his face he could not live with my friend as I did not want to have to see him when I was visiting my friend (LOL... I can be a Bossy Bitch). He basically said fuck you bitch... we are off to a great start.\n\nFast forward 3 months... we are becoming friends and I am beginning to look forward to visiting my friends and him. That began as he would say things he knew I would have to argue against as back then anyone who knew me for more than a few minutes could see I loved a good debate (I was even judging debate for local high schools on the weekend... how I met my BF at the time). I was then drawn into a debate with him and grew to love his quick thinking and very intelligent mind and the wit he brought to the discussions and debates. Over time we became friends not the share your secrets friends, but the have interesting discussions and laugh together friends. We did however sometimes vent to each other about how we feel like we are always trying to catch up in the popular culture world as we had less exposure and how people do not understand how we see the world so differently as atheists who were raised in fundamental christianity. Anyway, we grew on each other and I started to look forward to seeing him and he me. However, I did not see this as falling for him and I did not even think that he liked me that much as I thought he was too cool for me. Turns out he also thought that about me in regards to himself. This went on for around two years. Then the summer I turned 21 I had a huge fight with my BF and we split. I would later find out that he was going to ask me out that summer. However, I got back together with my BF. \n\nWell, that fall my current SO was going to move to take a job he got after graduation so he decided he should at least tell me how he felt about me what did he have to loose (My friend he lived with and became friends with told him he should do it as not to spend his life regretting it).  He called me and asked to meet me at a Starbucks near where I was staying off campus at the time.  I said is everything okay (we had never gone out even for coffee just us) and he said fine he just thought it would be nice to talk. I agree and get ready putting much thought into looking nice for the occasion (should have been a flag right there). I get there and we get coffee and he says I need to tell you something. I say okay and he says I understand that you are in a relationship right now and I respect that. However, if for any reason it does not work out I would like you to know that I would like to see where we would go together. I like you and would like to see if we could work out. \n\nLater that Autumn we were seeing where we would end up together. During the first two years of our relationship we were two hours apart by car. I was at school still and he at his job. He drove every weekend to see me (I did not have a car). From the moment he would arrive all I could see is him and I could not wait to kiss him touch him and hold his hand. We regularly had sex 8-12 times in a weekend (while I also worked 12 hours over the weekend and studied for at least four of them) and yes we still did things like dinners and coffee and lay in bed just talking. \n\n\nThen I graduated and spent a year in China teaching ESL and we did not see each other for nearly a year until he came to see me at the end of my contract. We spent two weeks traveling in China and even time in Tibet. \n\nHowever, when I returned we moved in together and I had to find a job while he supported me and my student loans came into repayment. He paid my bills and has been helping to support me since then. Turns out with the economy the way it is a humanities degree makes it hard to find work and due to education and research cuts professors are not taking as many graduate students so getting into graduate school is very hard. I am still trying four years later and the main reply I get from professors is funding is low so only around 3-6 students are taken per school in my field a year. Anyway, all this meant that his libido dropped to near zero we went over 6 months without sex when we had not seen each other for so long. It was hard for me and I would try, but rejection sucks. So, I stopped trying and eventually as I focused on getting into school and work my libido dropped as well. We still cuddle and that used to be hard before my libido dropped, but now it is nice and connects us. I miss sex and sometimes I crave it and when I do I just masturbate. Then physical craving gone (and I know that does not help everyone). I hope over time we may increase our sex life some, but sex is not enough to split me from him. I think we would split if the hugs and the kisses and the cuddling stopped as those are intimate acts that fuel a relationship and show love and appreciation. You can have intimacy without sex in my opinion and that is enough for me.\n\nEven with all of the trials and tribulations he is still my best friend. He is the reason that I sought help for my depression and found out that I have ADHD, he helps me understand social cues that I miss (due to the ADHD and childhood), he is supporting my return to school for a PhD (I am currently studying for the GREs and trying to get a research position), he makes me laugh and reminds me that being quirky and having what he calls a relational database brain (he is in database management and his degree is in MIS) is a thing to be happy about and proud of as they are powerful tools and flexible databases (I hope that is what he means as I do not understand computers that well), and he thinks I am great. He is the only person I am truly free around. I do not want to give that up. \n\nWe have tried everything to deal with the dying bedroom: talks, fighting, I am in therapy for depression from ADHD and for the ADHD-PH, we have tried sex toys, role playing using sexual acts as betting chips when playing our favorite games, spending more time just cuddling and being intimate such as on a date or a walk in the park. It is just that we are happy with those things and sex most of the time does not register to either of us or one of us. However, out of the two of us I am the higher of us LLs. I have been upset by it and felt many of the things posted in here by HLs in a dead bedroom, but I get frustrated by the first answer that I see being given the majority of the time being \"leave or get out\". I think it is important for the person to focus on what they do have and ask themselves if what they do have is worth giving up. If other things are at play such as the LL does not show affection or the two of you are always fighting about other things or intimacy, romance, and affection are all dead then leaving is something to consider. However, do not get caught up in the cycle of being angry about not having sex so you are (like I have been) more stand offish towards your partner. Remember the romance and help them to remember too and feel as though that is what you are after and maybe the sex will come naturally. If you try this and counseling and various other things and the relationship overall is dying then yes consider leaving. But, when it is just about sex explore options. Even explore your SO being okay with you having a lover if that is something the two of you think could help. I told him to get one while I was away. \n\nAnyway, telling people to get out without even exploring their options is not productive and negates the value of the relationship. I am sorry this is so long or if some of you feel chastised as that was not my intention. My only intention was to make all of you who your first thought and statement is \"leave\" or \"get out\"  stop and think for a moment about what that means the person is giving up and that there are other options. Thank you for reading and any replies you may give.\n\n\nOP I hope my story helps a little to give you hope and patience for your LL SO. Also, no matter what happens leave or stay this to shall pass. I wish you the best in this and in your life. "}