{"doc_id": "1498", "name": "2014_05_humanities_student_major_1926_indianapolis", "namespace": "we1sv2.0", "metapath": "", "pub": "indianapolis", "title": "2014-05-humanities-student-major_1926_indianapolis.txt", "pub_date": "2014-05-30T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.379", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "556", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26vjwp", "Reddit_id": "chuwdqb", "Subreddit_id": "t5_2rtt2", "Commenter": "MrsAnthropy", "length": "3228", "content_scrubbed": "I have a lot of family and friends here, so I relocated back from Chicago. After a year of finding no solid work, I am going back to Chicago with my kids and partner because I was offered much more there, even with cost of living difference. \n\nThere are several parts of town in Indy that are nice, depending upon what you are looking for. A lot of people like the northern suburbs of Westfield, Carmel, and Fishers, but they are not easy to navigate without transportation. Indianapolis has terrible public transport. We survived as a family of four with one vehicle for about three months before we had to drop the money to buy another. The western suburbs of Avon, Plainfield (near the airport), and Danville are relatively popular, but for the most part, all of these places seem to be populated by malls and chain restaurants.\n\nMassachusetts Avenue near downtown Indianapolis (around 10th and College Avenue at the north end; it runs southwest from there for a few blocks) has a lot of independent shops, restaurants, and bars. It[.] very gay friendly and a lot of my gay and lesbian friends live near there, but it isn't exclusive. Other neighborhoods near downtown and getting cleaned up or gentrified, which means more expensive, but walking distance to a lot. It[.] a nice starting point to begin looking near and expanding your search. Near and in downtown have a lot of pretty cute little neighborhoods.\n\nWithin the city, as /u/fraedout mentioned, Broad Ripple (around 62nd Street and College Avenue), used to be a lot more quaint, but tends to cater to the bros and Butler college students. It can get dangerous at night to be a pedestrian.\n\nSouth Broad Ripple (54th Street from College east) is cleaning up and has more affordable housing than its neighbor, Meridian Kessler (west of College from about 56th south to 38th Street), which is where I currently live. MK has a lot of really expensive, large homes with very high property taxes. I could walk to the governor[.] mansion from my house. It is mostly populated with stay-at-home moms and the trophy wives of doctors, lawyers, and politicians. \n\nI'm not very familiar with the southern part of the city. Greenwood feels like another suburb with a lot of shopping malls. Most people tend to avoid the east side, put parts of it are fine and established, such as Irvington, Emerson Heights, and Little Flower are places where friends live for very little and seem to enjoy. West of downtown are Fountain Square and Garfield Park, both affordable and apparently moving up, with independent shops and restaurants.\n\nThere isn't anything in particular that I really hate about Indy; I was just happier in Chicago. The cost of living here is good. If you already have a job, then you're set, as long as you know you'll keep it. My experience in the city this past year has been marred by my inability to locate decent work. There[.] a lot of nepotism. It[.] a very small town and a lot of people know one another. There are still lots of opportunities to experience the arts, culture, and be a part of something from the ground up. \n\nI found this \"Judgmental Map\" of the city to be funny, but a little misleading. http://judgmentalmaps. com/post/85920856135/indianapolis\n"}