{"doc_id": "1427", "name": "2014_05_humanities_student_major_1192_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2014-05-humanities-student-major_1192_RPI.txt", "pub_date": "2014-05-18T00:00:00Z", "Sentiment": "0.129", "Subjectivity": "0.366", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "348", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25vqcq", "Reddit_id": "chl705m", "Subreddit_id": "t5_2rg3u", "Commenter": "AccountAccountUser", "length": "1933", "content_scrubbed": "I feel like we need more info on your situation to actually provide you with useful advice. \n\nThe general thought is above a 3. 2 with interesting research for grad school, and above a 3. 0 for general job interviews. That said, I've landed internships with below a 3. Although courses can be a real pain at RPI grade-wise, you may want to consider approaching a professor you like to do an independent study or research for credit. In my experience, they tend to care about the grade you made in **their** class and not your overall GPA. Your professor who is overseeing your research/independent study will give you a grade. Most professors will give you an A if you are actually doing the research or fail you otherwise. So, as long as you are actually working, you can get a huge GPA boost from doing this for a semester or two. Plus, it[.] great experience. \n\nBesides that, or if you can't get an independent study, there are easy courses at RPI that are pretty much designed to give you an A if you actually do the work. (e. g. Music and Sound) For all the jokes people make about taking a course to \"pad\" their GPA, it is sometimes necessary.\n\nIf you are still early enough in your major, you could consider switching majors. While not very heavy in the humanities, RPI has a fantastic school of science with several faculty who care about their students. \n\nNext, I don't have a lot of experience with this (so take it with a grain of salt) but here is my advice about the cover letter thing: don't hide your GPA if it[.] bad, but don't emphasize it either. Just put it under the relevant section on your resume and spend your cover letter talking about relevant experience.\n\nFinally, from what I've heard from other people, GPA really only establishes your initial employer. After that, your career is more related to experience you have acquired in your job.\n\nHope this helps and that I didn't put you in a worse mood. Good luck!"}