{"doc_id": "1331", "name": "2014_05_humanities_student_major_460_askuk", "namespace": "we1sv2.0", "metapath": "", "pub": "AskUK", "title": "2014-05-humanities-student-major_460_AskUK.txt", "pub_date": "2014-05-06T00:00:00Z", "Sentiment": "0.058", "Subjectivity": "0.321", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "464", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chb7c8j", "Reddit_id": "chb81g7", "Subreddit_id": "t5_2t4s3", "Commenter": "threesquares", "length": "2556", "content_scrubbed": "It[.] *kind* of configurable, but not really? You study a huge span of things, though and you do get choice in what you study. There is one compulsory unit each year and one optional, and you get to choose your 'pathway' - I'm doing Broad Based History for example, and my aunt is doing the Heritage Pathway so there are slightly different courses. Next autumn is introducing a BA in Classical Studies too, if you like the Ancients.  \n\nSo for instance, my first year was AA100 Arts Past and Present, which is a multi discipline compulsory module for all Humanities students, not just history. We studied Cleopatra, divas (Maria Callas, Tina Turner, some medieval choral works), the Benin Bronzes, Victorian seaside holidays, Pliny[.] Roman villa, the development of modern art, poetry, Plato... all sorts. It helps give you an idea of what you enjoy studying and gives you a taster of content on other courses. \n\nSecond year has one compulsory module, A200 Exploring History: Medieval to Modern 1400-1900 and one optional module. A200 is MASSIVE and goes from the Wars of the Roses to the Reformation to the Wars of the Three Kingdoms (English Civil War etc) to slavery to the Industrial Revolution and Empire. I'm writing my last assessment for it at the moment and it[.] a hell of a slog but very good. My optional is A219 Exploring the Classical World, which is all Ancient Greece and Ancient Rome and I *love* it. I'm tempted to switch to a Classics pathway, but I've already missed my chance to do the 2nd year Latin module and I want to go into teaching, so I need to keep my options open. \n\nMy third year compulsory unit is going to be A307 War, Peace, Modernity which examines modern warfare from 1918 to the end of the Cold_War. My optional is *probably* going to be A330 Myths in the Greek and Roman worlds, which will take me back to Classics again, but there is also an option of doing a module in Scottish history in collaboration with the University of Dundee if I wanted. I *might* do that but I haven't made up my mind. From what I also understand, 3rd year is like most unis and gives you more space to do independent study in areas that specifically interest you.\n\nSorry, that turned into a bit of an essay! I hope it helps, though. It[.] not easy at all, but I'm really enjoying it, and you get LOADS of support from your tutors. A few weekends ago I went to a conference day on Ancient Greece organised by the British Museum in co operation with the OU, so there is lots going on and they have plenty of clout to compete with the brick unis."}