{"doc_id": "1422", "name": "2014_05_humanities_student_major_1169_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2014-05-humanities-student-major_1169_college.txt", "pub_date": "2014-05-18T00:00:00Z", "Sentiment": "0.017", "Subjectivity": "0.143", "Score": "22", "Upvotes": "22", "Downvotes": "0", "Wordcount": "325", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25ts8p", "Reddit_id": "chkx7zr", "Subreddit_id": "t5_2qh3z", "Commenter": "blonderengel", "length": "1944", "content_scrubbed": "Professor here. I wish all students would ask that question.\n\n1. Go to class. I don't care if it[.] the most boring, stupidly droning, and/or read from book prof conducting that class--the difference between going and not going will show up in your final grade (even if it[.] nothing more than the prof thinking, *hey ASM showed up every time; I'll round his/her grade UP!*)\n2. Get organized. One folder for each class / differently colored sub-dividers. Note: these do NOT have to be real paper/plastic; use digital technology. Check education apps for Google / android / Apple!  Take notes on laptop / tablet.\n3.  Get Google Drive for storage / collaboration, and use Google docs with add-ons like EasyBib to ace citation issues.\n4.  Get study buddies in each class.\n5.  Don't cram for two or three different tests the same night. The different topics will actually cause LESS retention of subject matters in your brain. If you MUST cram two or three topics: take a nap between each to let the info \"settle.\"\n6.  Supplement classroom instruction with on-campus support like Writing Centers and/or off-campus support like a MOOC on the topic. Tackle a topic from many different angles.\n7.  Don't view college as only/just the place that stamps your \"work permit\"--consider it also an environment where you can become a better human being/citizen/thinker with an interest in, and knowledge of, basic matters of philosophy, the arts, poetry, history--all the stuff generally considered worthy of only eye-rolls and derision.\n8.  Learn to correctly spell and pronounce your professors' names. Address them as Doctor or Professor. \n9.  Introduce yourself to your professor in each class. Believe me, it makes a difference!\n10. Finally, don't ever send an email to your professor that goes like this (real life example, from this semester): *yo prof i missed class today did we do anything? can i have  ur notes i need them too study see u tommorrow*"}