{"doc_id": "1383", "name": "2014_05_humanities_student_major_881_denmark", "namespace": "we1sv2.0", "metapath": "", "pub": "Denmark", "title": "2014-05-humanities-student-major_881_Denmark.txt", "pub_date": "2014-05-13T00:00:00Z", "Sentiment": "0.069", "Subjectivity": "0.341", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "337", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25ftnv", "Reddit_id": "chgsqwu", "Subreddit_id": "t5_2qjto", "Commenter": "dissidentresearch", "length": "1932", "content_scrubbed": "Hey OP, I went to Evergreen State College and am now studying at RUC, so perhaps I can help out. \n\nAbout the course you found at RUC ou should be aware that the teaching style at RUC is pretty different from most universities - a LOT of group work, responsibility and possibility to shape a unique education, independent research project from day 1, and for the bachelor course you have to do a \"basic course\" for the first year and a half in either natural science, social science of humanities after which you then specialize in computer science and another topic. \n\nThe international courses at RUC vary a lot in quality and are generally not well-attended compared to the Danish courses, but it[.] one of the only schools offering English-language complete degrees. The school likes to profile itself on this, but from my experience it[.] pitifully underdeveloped in practice.\n\nAnother commenter pointed out the_leftist leanings of RUC. This is true to an extent, at least historically. The school has some alternative teaching ideas and many of the professors are old marxists, but I've also found that the current student body is far from radical. Also, compared to Evergreen and other colleges I know of in the Pacific NW there[.] not a lot of student social life or organizing in general. \n\nI know a few people that had their credits transferred and could then do the basic course faster, but you'll have to talk to the school for them to evaluate your case. What you're describing sounds promising though. It[.] also not very difficult to get into RUC, so don't sweat it with your GPA and all that.\n\nAbout Denmark in general, I've moved back and forth between here and Cascadia quite a bit and I think it[.] a pretty good choice for someone to Seattle. There are of course vast cultural differences, but also many similarities between DK and the West coast. Have you visited here before so you have an idea of what it[.] like? \n\n"}