{"doc_id": "1398", "name": "2014_05_humanities_student_major_991_rwby", "namespace": "we1sv2.0", "metapath": "", "pub": "RWBY", "title": "2014-05-humanities-student-major_991_RWBY.txt", "pub_date": "2014-05-14T00:00:00Z", "Sentiment": "0.117", "Subjectivity": "0.421", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "299", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chi2b0a", "Reddit_id": "chi2ojd", "Subreddit_id": "t5_2vhg0", "Commenter": "SatsumaHermen", "length": "1704", "content_scrubbed": "Thanks for the massive reply :D Mine was mostly a copy and paste of something i wrote a short while back.\n\nWith the introduction of what seems like an APC i do actually wonder whether the military will make an appearance and what the general view of the Hunters and Huntresses are. Hopefully something like the grunts feel towards the airforce and the navy just with a bit more anger and malice. If they are involved i do hope the interaction is a bit more complex than \"wrarr Hunter, we should be doing this\" (proceeds to get ass handed to them and then concedes point).\n\nThe white fang is a terrorist organisation. Look at the terrorist organizations around our world are they famous for their amazing ability to fight? The White Fang aren't the best people to make the standard for all military organizations within Remnant. That being said i do for see something along the lines of a Special Forces/Investigations Unit being utilised by all governing bodies of the major cities. It wouldn't take long for a disgruntled member to decide that Humanities over reliance on Hunter support is the reason for its stagnation and degradation (not too far from the truth) and take actions into their own hands.\n\nThis is where political intrigue and a more complex plot can be laid down and would be a great thing to consider. Complex plot generally leads to a deeper understanding of characters as they are placed in situations which are far removed from the relative ease of putting down a couple terrorists and proving that you're actually a nice person under all that. It will result in complex actions for them to undertake and the idea of not what is right and wrong but what the character believes in.\n\n "}