{"doc_id": "1311", "name": "2014_05_humanities_student_major_198_minimalism", "namespace": "we1sv2.0", "metapath": "", "pub": "minimalism", "title": "2014-05-humanities-student-major_198_minimalism.txt", "pub_date": "2014-05-04T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.487", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "418", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_ch98o4h", "Reddit_id": "ch98yvg", "Subreddit_id": "t5_2r0z9", "Commenter": "an_imperfect_lady", "length": "2308", "content_scrubbed": "Oh, I'm sorry. Well, the architect was tasked with creating a space to house the entire humanities department right in the middle of the campus, and to create a design that brought the two sides of the campus together. The old campus on one side had much older buildings, the newer side, obviously looked more modern. He also had to keep in mind cost, the shape of the space, the weather in Illinois, and the paths people normally took across campus.\n\nHe went with the poured concrete because budget. He designed something with most of the varying features facing old campus, with the more stark side facing new campus (like a transition). It[.] long and narrow, so if you want to get out of bad weather, you can cut through on the second floor from one end to the other, taking you from the admin buildings to the student center, and if you are heading back toward the new campus where the law school was, he made several huge walkways so you can walk through the building instead of going around.\n\nThere are also quite a few outdoor spaces meant to be landscaped and turned into pretty little courtyards to soften the look, but the university didn't spend the extra money to do it, sadly. Finally, a series of concrete shields were put along the back on an angle so the setting sun wouldn't shine directly into the rooms, but you'd still have a nice view.\n\nAfter I interviewed him and realized all the thought he put into it, and recognized the features he pointed out, I really grew to love it. People would get frustrated because you can't walk from one end to the other on the first floor (because of the walkways), but other than that it[.] a very simple and logical layout. The 2nd, 3rd, and 4th floors are all the same but the doors on each level are a different color, the numbering system was very obvious if you paid attention. Students always claimed it was impossible to navigate but it really wasn't. For instance, if you were looking for room number 3224, those digits told you, respectively, the floor, which of the two corridors, how far down, and which side of the hallway the room was on.\n\nEDIT: The janitors had the system figured out, and had keys to the inner courtyards that the university had locked up and not utilized, so they had their own secret hangouts. LOL! Yeah, they liked it.\n"}