{"doc_id": "1461", "name": "2014_05_humanities_student_major_1531_debatereligion", "namespace": "we1sv2.0", "metapath": "", "pub": "DebateReligion", "title": "2014-05-humanities-student-major_1531_DebateReligion.txt", "pub_date": "2014-05-23T00:00:00Z", "Sentiment": "0.093", "Subjectivity": "0.352", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "389", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chpi630", "Reddit_id": "chpin7x", "Subreddit_id": "t5_2snuc", "Commenter": "Pinkfish_411", "length": "2383", "content_scrubbed": " who is going to do this \"huge amount of historical jesus research\" for free?\n\nFull-time faculty at research universities have research and publishing responsibilities as a core part of their job, so they're not doing it \"for free.\" People who study the historical Jesus are in no different a funding position than people who study most other subjects in the humanities.\n\n politically it doesn't make sense to make an issue out of this, since proving his non-existence (historically) wouldn't do much anyway.\n\nYou're vastly overestimating how much the academic world cares about what makes \"political sense.\" Trust me, I'm an academic myself (in theology), and the concerns you're raising just *aren't* real concerns. A tenured faculty member can question Jesus' existence all they want and face no meaningful consequences. The fact is, there are plenty of scholars out there who basically argue that the foundations of the Christian religion are bunk, and they aren't facing \"political\" consequences.\n\n no, what stops research is lack of funding and lack of desire to complete.\n\nHow do you know anything about the funding situation, or what scholars' personal desires are? \n\n it[.] only a fringe theory in the fact that it[.] less explored than a lot of theories, mainly because what effect would it have?\n\nLike I said, most academics aren't choosing their research because of the \"effect it would have\" on what common people believe. I can assure you that the vast majority of the research that I and my colleagues are doing will also have no effect. It[.] taken for granted among us that most people simply don't care about what we're doing.\n\n  as i said before, even acidamea must pick it[.] battles.\n\nWhat \"battle\"? There[.] no battle between academia and the outside world. Most research is simply ignored, unless the scholar goes out of his/her way to make it accessible to a popular audience. For every Bart Ehrman there are a hundred biblical scholars whose work will remain totally unknown the general public.\n\n only if you consider controversy good for your career.\n\nControversy can be a *very* good starting point for your career, as long as your work is promising.\n\n other than that, i sincerely doubt it\n\nWhat[.] your personal connection to academic religious studies/historical scholarship? What experience do you have that would give you insight into how those worlds work?"}