{"doc_id": "1375", "name": "2014_05_humanities_student_major_801_todayilearned", "namespace": "we1sv2.0", "metapath": "", "pub": "todayilearned", "title": "2014-05-humanities-student-major_801_todayilearned.txt", "pub_date": "2014-05-12T00:00:00Z", "Sentiment": "-0.016", "Subjectivity": "0.425", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "332", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chfg13d", "Reddit_id": "chfsy42", "Subreddit_id": "t5_2qqjc", "Commenter": "shinkouhyou", "length": "2052", "content_scrubbed": "I started out as a chemical engineering major.  There were a fairly decent number of women in my engineering classes during freshman year, but most of them (me included, although I stayed in science) switched majors either before or during sophomore year.  My female classmates and I felt like it was an awkward, sometimes hostile environment... there was definitely sexism from both male students and teachers.  When you're a minority, you feel like you have to excel *extra* hard and be a model student, and you tend to associate with other minorities because they're \"safe.\"  As a result, I really didn't interact much with my male classmates, and when some of the other girls started voicing thoughts about switching majors, I started having doubts too.  It just felt like there was an air of cutthroat competition to everything...  Engineering classes were intentionally designed to be impossible to pass without a heavy curve, which is a huge psychological blow because you constantly feel like you're struggling.  Support services aren't always there, and as a freshman, it can be hard to even know what you need!  I think men are socially conditioned from an early age to value confidence and to project confidence even when they don't really feel it, while women are socially conditioned to doubt and undervalue their own capabilities even when they're doing relatively well.  \n\nI double majored in a humanities subject, and it[.] just a different world over there.  I wouldn't say that it[.] always less rigorous - some humanities are very difficult, rivaling science for the amount of crap you have to memorize and analyze.  But the atmosphere of the classes was different, and the gender-balanced or female-heavy classrooms removed that minority pressure.  Professors seemed to give more feedback, and there was greater emphasis on team projects so it didn't feel like a couple of guys monopolized the class.  I think if engineering programs are serious about getting and *retaining* female students, they should work on changing the culture."}