{"doc_id": "1455", "name": "2014_05_humanities_student_major_1426_preppy", "namespace": "we1sv2.0", "metapath": "", "pub": "preppy", "title": "2014-05-humanities-student-major_1426_preppy.txt", "pub_date": "2014-05-22T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.506", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "461", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_cholfds", "Reddit_id": "chotuvc", "Subreddit_id": "t5_2s6vu", "Commenter": "hoboprep", "length": "2729", "content_scrubbed": " in this essay, your extended-metaphor intro and prose style obscure a beaten-to-death borderline non-point, which is that many of the people blogging about and wearing prep clothes did not actually attend prep schools. \n\nIt is obvious that you are mistaken about the substance of this topic and the reasoning behind it, and again regrettably, it is not well known nor a non-point, but rather one essential within the debate about prep, and one you, albeit erroneously, attempted to join with here. And this is the case but for one primary reason: those who are Preps need not display that fact through consciously made clothing or fashion purchases. A Prep[.] style is organic from the lives, families, work and experiences of Preps, and it is not synthetic, something which preppy style, in its modern form, aspires to be and is obvious from its very existence as a mass movement on the Internet.\n\nAlong the way, you make bad sub-points, including the idea that not having gone to an Ivy League school diminishes the credibility of Ivy fashion bloggers (falsely presuming that current Ivy students dress like that at all, or that in its heyday Ivy fashion was restricted to Ivy campuses). Or that this common observation is somehow \"Controversial for the Internet.\"\n\nWhile not the point being made, and while your description of the post above is plainly wrong, the concept of an Ivy fashion blogger is nothing but a construct, largely pushed by people who did not attend an Ivy. That of itself is not relevant to preps and preppy style, however it remains controversial irrespective of your denial by the very reason that you needed to make a point about it. Frankly, prep has nothing to do with Ivy at all, as I have identified here http://hoboprep. tumblr. com/post/71818073788/trad-vs-ivy-vs-prep, identifying that many preps begin service at an ad agency, or IB firm, or attend a Tech such as MIT or RPI immediately upon their graduation.\n\n\nAnd to top it off, you think alcohol and preps don't mix.\n I'm all for idiosyncratic prose, but it should help illuminate an interesting point, rather than render a boring point even more tedious.\n\nInteresting that you say this, as you obviously confuse the word \"drunk\" with the idea of \"having a drink\". I understand that the liberal_arts education of today has let anyone and everyone in, and worse, has let persons who wouldn't have been granted entry thirty years ago to graduate, but a basic reading of the post would have assisted you here. Perhaps to slake your boredom, another year a decent prep school will remedy your appreciation of English.\n\nIt is a fascinating topic, and I would invite you to read the reasoning again, and reconsider your reply to the substance of it."}