{"doc_id": "1351", "name": "2014_05_humanities_student_major_626_japan", "namespace": "we1sv2.0", "metapath": "", "pub": "japan", "title": "2014-05-humanities-student-major_626_japan.txt", "pub_date": "2014-05-09T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.353", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "237", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chdcvlw", "Reddit_id": "chdh5jd", "Subreddit_id": "t5_2qh2u", "Commenter": "fromthe075", "length": "1477", "content_scrubbed": " She seems to lack a basic understanding of the rules of research, why they are there, and why they need to be followed.\n\nI keep wondering how much of this story is related to structural problems with Japanese academics. During my Master[.] research here, I was really surprised by the dearth of guidance for grad students and how loose the curriculum was.\n\nIn a way, it[.] a very positive environment for motivated autodidacts. But for each impressive researcher I saw, there were always five to ten others who were simply mimicking the forms and sort of muddling their way through presentations and reports. This carried over into presentations at national conferences. Luckily, this was in the humanities, where bad research generally doesn't attract international media interest.\n\nI sometimes translate Japanese STEM papers for submission to international journals, and some of the studies I see are appalling. Of course that could be sampling bias, since I'm by definition only looking at papers written by researchers who would rather pay for a translation than do the work themselves.\n\nHow much of this do we attribute to a lack of professional ethics on Obokata[.] part? How much is rooted in an academic environment that demands certain skills of researchers (research methodology, English composition and rhetoric) without providing a system to provide or adequately assess those skills?\n\nI'd love to hear from someone with actual experience with STEM research in Japan."}