{"doc_id": "1327", "name": "2014_05_humanities_student_major_405_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2014-05-humanities-student-major_405_funny.txt", "pub_date": "2014-05-05T00:00:00Z", "Sentiment": "0.145", "Subjectivity": "0.402", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "408", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chaq7vo", "Reddit_id": "charbns", "Subreddit_id": "t5_2qh33", "Commenter": "be_a_dragon", "length": "2327", "content_scrubbed": "Where you're right:  Sure engineers need liberal_arts people to do things.  They have practice, skills, and knowledge that the engineer doesn't, but that is like anything else.  I don't go to my butcher for flowers or my mechanic for medicine.  They have their own skill sets and the experience to use them.  \n\n\nWhere you are wrong:  A graphic designer has practice at drawing, picking fonts, choosing layouts, etc..., but with practice an engineer could do the same job.  Creativity isn't something that is always directly comparable between differing jobs, fields, professions, etc.  It extends from experience and knowledge.  A painter sees paint and can put together in their head what to paint with it.  A mechanical engineer sees gears, nuts, bolts,... and sees what they can make out of it.  They may not know to use this font or that, not because they don't have \"the eye\", but because they don't have years of dealing with that kind of thing.  Engineers can be just as creative!  I've worked with a number of engineers designing things on their own.  They may not always have drawing, painting, or sketching skills that art student have, but that doesn't mean they aren't creative.  Their skill set is slanted toward another direction, but so is their creativity.  Yeah, an engineer may have trouble writing a symphony or a catchy tune for a commercial or painting their own \"Mona Lisa\" or designing a magazine ad layout, but have a mechanical engineer design a car or complicated gear system, or a chemical engineer design a chemical reactor and you will see creativity.  It isn't like they can just look up every problem and get a design to just pull out of a book and use.  They have to be creative.  It is their job to solve puzzles and problems.  That can't be done without creativity and that is creativity that you can NOT usually get from a liberal_arts person.  Look at every piece of technology you use today.  A lot of the ideas that made those items possible came directly from engineers.  For some of them, an artist came up with a very general idea and the engineers or engineers figured out how to get every little detail of it to work.  \n\nYou are right, technical know-how does not equal creativity and the opposite can be said as well.  Don't think for a hot second that the two can't go hand in hand."}