{"doc_id": "1451", "name": "2014_05_humanities_student_major_1385_anarchism", "namespace": "we1sv2.0", "metapath": "", "pub": "Anarchism", "title": "2014-05-humanities-student-major_1385_Anarchism.txt", "pub_date": "2014-05-22T00:00:00Z", "Sentiment": "0.06", "Subjectivity": "0.463", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "361", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_choa9fm", "Reddit_id": "chocsjs", "Subreddit_id": "t5_2qh5j", "Commenter": "damyankee184", "length": "2113", "content_scrubbed": "That[.] not true at all. The 'dumbest' members of society rarely make it out of high school. I know you're going for a quick/easy laugh, but teachers in general are pretty smart. Constantly they deal with less and less intelligent children, but that[.] no condemnation of the teachers before them, that[.] a condemnation of the public education system. One that was never intended to educate the masses, rather to keep them from educating themselves. To direct  their studies away from things that interested them, say Marxism, and toward things it deemed fit for them, home economics. Now, as the system has continuously expanded over the past 100-150 years, it[.] lowered the standards of the curriculum even more, trying to keep up with an ever expanding population. How do teachers fit into this? Well, usually they are the ones who went to college and 'followed their heart'/[.]tudied whatever made them happy,' then realized it was important to earn a degree they could monetize as well. Not knowing what to do with their liberal_arts -and sometimes science- degree, drowning in debt, and desperately looking for a way out they turn to teaching. It[.] rather simple to obtain a teaching certificate, and it generally pays well (in comparison to their other options), also, summers off are nice. Generally, however, the job is awful. Teachers don't have the control in the classroom anymore; state boards trying to edit out evolution or the secular beginnings of our nation from textbooks, and bitchy parents capable of saying vile things via email that they would never dare saying to the face of an individual, do. As neither of those groups are in the classroom, the vacuum of power is absorbed by students. And they act like you'd expect a 12-18 yr old to act when no one at home really values the child[.] education because they think teachers are the 'dumbest' of the dumb. So, most teachers last about 5 years, pay their loans off, then quit and look to break into other industries.\n\nOnce again, I know you were going for a cheap laugh, but humor usually works better when you know what you're talking about."}