{"doc_id": "1430", "name": "2014_05_humanities_student_major_1224_fallout", "namespace": "we1sv2.0", "metapath": "", "pub": "Fallout", "title": "2014-05-humanities-student-major_1224_Fallout.txt", "pub_date": "2014-05-18T00:00:00Z", "Sentiment": "0.07", "Subjectivity": "0.34", "Score": "24", "Upvotes": "24", "Downvotes": "0", "Wordcount": "817", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25x2vw", "Reddit_id": "chlltp2", "Subreddit_id": "t5_2qnzu", "Commenter": "theflyingcheese", "length": "4652", "content_scrubbed": "The Fallout world is not our own. It is an alternate universe in which certain key events happened differently. It starts with what is called the Divergence, or the point at which the Fallout timeline splits from our own. Until that point, the two histories are exactly the same. The Divergence occurs somewhere between 1945 and 1947, or right after the end of WW2. The key event that marks the Divergence is the invention of the transistor, or rather the lack of it. In the Fallout world, the transistor is never invented in the late 1940s, causing the micro computing revolution our world has experienced to never occur. Instead, the Fallout world undergoes a revolution in nuclear and robotics tech. This is why computers are all so clunky and large in the fallout world, while at the same time the robots are much more advanced and you can carry around nuclear reactors in your pocket. Other key events that happened after the Divergence include the space race occurring differently, with the US getting to space first, the US and China never repairing diplomatic relationships, and the Soviet Union never collapsing. \n\nThe Cold_War continues into the 21st century. By the middle of the century, resources had begun to run scarce. The European Union had waged a war with the middle east over the_rights to the last remaining drops of oil there. It ended with nukes being exchanged in the 2050s. After that the EU was reduced to it[.] individual nations constantly fighting with each other over any resources they could get there hands on. While this is happening the UN completely falls apart and officially disbands. At the same time on the other side of the globe, the US and USSR had stopped being the two super powers facing each other in the cold war. It was now the USA vs China. \n\nAround this time in the interior of the U_S a new threat emerges as well. A disease, called simply the New Plague, threatens to become a pandemic. The US does not know where it comes from, but it is bad enough that they seal their borders and attempt to contain it. Part of the efforts to contain this disease and ensure humanities survival if they cannot is called Project Safehouse. Project Safehouse was a government funded operation designed to create gigantic underground bunkers that would preserve humanity in case of some sort of world threatening event. These became the vaults. The US government contracts to a company called Vault Tech to create these vaults, and they begin construction. Little did the public know, these vaults that were designed to keep them safe were actually meant to experiment on them, as you have likely discovered in your adventures in the wasteland. \n\nAnother tactic the government funded in order to attempt to fight the New Plague was FEV, or the Forced Evolutionary Virus. It was a virus genetically designed to help the person infected with it fight the New Plague. When a person is infected by the FEV, their genetics would be mutated so that there immune system could naturally fight the virus. This research was going on at a private laboratory in California called West Tek. The project is later moved to a military instillation called Mariposa Military Base, also located in California.\n\nAs the 2050s end, tensions between the USA and China are through the roof, as China is in desperate need of oil and the US has the last major oil reserves located in Alaska. In the early 2060s, the USA begins to build up a large military presence in Alaska to defend against a Chinese invasion that they thought was coming. As it turns out, the Chinese do attack Alaska. This is the start of the Sino-American war. In order to make it easier to move troops and supplies to Alaska to support the war, the US annexes Canada, which the Canadians aren't to happy about. They don't put up a fight, but there is some resistance in the form of saboteurs who help the Chinese. As the war goes on, the US begins to deploy advanced tech such as Power Armor and energy weapons. These tools give the US an advantage the Chinese just can't compete with. With the introduction of T-51b model power armor in 2076, the US finally gets the advantage it needs to launch a full scale assault on the Chinese held areas of Alaska. In January 2077, US military operation Anchorage succeeds in finally pushing the Chinese out of Alaska all together. Over the next few months, the Americans launch an invasion of mainland China. The T-51b armor and the advanced weapons allow the Americans to cut a swath through China in what is called the Gobi Campaign. By the end summer 2077, it appears that the US has taken the upper hand in the war.\n"}