{"doc_id": "1363", "name": "2014_05_humanities_student_major_743_ucsantabarbara", "namespace": "we1sv2.0", "metapath": "", "pub": "UCSantaBarbara", "title": "2014-05-humanities-student-major_743_UCSantaBarbara.txt", "pub_date": "2014-05-11T00:00:00Z", "Sentiment": "0.0", "Subjectivity": "0.434", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "645", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_259htp", "Reddit_id": "chf3627", "Subreddit_id": "t5_2shs9", "Commenter": "UCSBECONTRANSFER", "length": "3555", "content_scrubbed": "Honestly, the way the pre-major system is set up is bullshit for transfer econ students... I transferred as an Econ/Accounting major last fall (2013). The simple fact is that the majority of transfer students will not get into the major and be forced to switch majors or drop out. The pre-major GPA is a 2. 85 minimum and this is the only class that makes up your GPA for transfers, and only 30% can get a B or above. If you get a B- you can take 100B but you are again under the pressure of getting a B to get into the major. Pretty much all other pre-majors have multiple classes to take which gives you multiple chances of getting a good GPA for the pre-major requirement. They even stopped allowing you to take the same exact class at another UC without the curve. At the end of the quarter, most of the people I knew in that 10a class were forced to switch majors or drop out. \n\nThere is also A LOT of stuff going on your first quarter. The recruiting season for the accounting corporations is early Fall quarter, this means 2 weeks into your first quarter you will be attending meet-the-firms events and writing resumes/cover letters/thank you notes at the same time you're adjusting to a new school and a new life. You can get land an internship for the following summer but then fail 10a and subsequently fail to get into the major. The problem is, there are very few majors that we can switch into and still graduate on time, namely the humanities and social_sciences. This is not a viable option for most accounting students who chose their major for a specific career... accounting.  \n\nI found the course very difficult because none of my CC classes were like it. The lecture was virtually useless and I only went to get iclicker points, you MUST study on your own to understand problem sets and master them. The course is heavily math based, it[.] closer to an applied calc class than lower division micro/macro econ classes. I also found the class to be excruciatingly boring. I transferred as an Econ and Accounting major and I never realized how theory based (ie. not practical) and boring my upper div. classes would be. However, that[.] just my experience, I was more interested in a traditional business curriculum but decided to come to UCSB anyways because it was my dream school. \n\nHaving said all this, I would suggest any potential Econ/Accounting transfers to only consider UCSB if they have a viable backup major they would be 100% happy with. Google the problem sets and get a feel for what the class is like. Look into the required courses for the Econ degree and then look up the class descriptions, to get a better idea of what you will actually be studying. If you are deadest on being an accountant or majoring in Econ, consider going to a school where you don't have to play the pre-major game. College is first and foremost about education, it doesn't make sense to attend a school to end up majoring in something you hate. Honestly, I think UCSB needs to preemptively weed out students in the application process and admit less Econ majors.\n\nAs for me, I very quickly ended up hating the class and the general idea of being an econ major and an accountant. I thought the recruiting process was discouraging and very superficial. I took a leave of absence after my first quarter and I'm back at CC taking lower division science courses to switch to a science major. I may or may not go back to SB. Sure I probably sound like a bitter hater but I'm not upset at all, I'm glad I went through this process to be where I am today. "}