{"doc_id": "1323", "name": "2014_05_humanities_student_major_321_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2014-05-humanities-student-major_321_AskAcademia.txt", "pub_date": "2014-05-05T00:00:00Z", "Sentiment": "0.037", "Subjectivity": "0.39", "Score": "16", "Upvotes": "16", "Downvotes": "0", "Wordcount": "539", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24t79r", "Reddit_id": "chagui4", "Subreddit_id": "t5_2sakj", "Commenter": "SnowblindAlbino", "length": "3196", "content_scrubbed": "Flexible hours: In my university some professors are almost never there for many reasons \n\nThis is not typical, especially for teaching-oriented schools. My colleagues tend to work 70-80 hour weeks pre-tenure, and 50-60 hour weeks post-tenure. A lot of those hours are indeed at home, but people in lab sciences are in the labs on the weekends and the humanities folks are sitting up all night grading essays. Regardless, the expectation is that everyone is on campus and accessible to students during most of the day M-F if not in class.\n\nChoosing what to work on: Are professors really free to choose what to work on?\n\nYes, but there are constraints. Faculty are hired to fill certain niches. If we hired someone to teach, say, cell bio and they later decided they wanted to shift into aquatic ecology that likely wouldn't work. Or similarly, if we hired someone to teach African history and they later decided to shift to Latin American history, that wouldn't work either. Not just for teaching-- we hire people because they work in a certain field; if they strayed *too far* from that it would be a problem and would likely doom tenure or promotion chances. That said, faculty do generally work independently so nobody is telling them specifically what to do; we're more like independent contractors in your business analogy.\n\nJob security: I've seen some crazy professors stay in my school just became they are tenure and cannot be fired.\n\nYour school sucks then. Tenure does not protect people who do not do their jobs, or at least it should not; some schools fail to actually do anything about poor faculty because they are afraid of lawsuits, but it[.] relatively simple to dismiss someone for non-performance of duties or other abuses. That said, tenure and seniority combine to make academe one of the most secure places of employment left in the US; I'm fairly confident that my university would have to go out of business for me to lose my job. But *earning* tenure is tough, and clearly getting harder each year. The number of full-time, tenure-track positions is also in decline while the number of applicants is going up, so you would be typically competing with several hundred other Ph. D. s for any entry-level position.\n\nPays well: Every single professor in my department gets over 100K/y\n\nYeah, no. I didn't see what field you're in or which school, but the median starting salary for US faculty in four year schools is around $50K. People in some fields-- law, business, engineering --and at certain schools make that sort of money, but if you take the[ data presented here](https://chronicle. com/article/2013-AAUP-Faculty-Salary/138291?cid=megamenu) you will see that most faculty earn a lot less than $100K (starting salaries at many schools are in the $40s).\n\nCanada may be a little different but not that much. Reality is that there are far, far more Ph. D. s looking than there are job openings. Only a small fraction of people who want academic careers ever get them. It[.] a good gig overall, but much harder than most people think and the pay, while OK for being on a 9 month contract, is usually much less than people with comparable education earn in the private sector.\n"}