{"doc_id": "1386", "name": "2014_05_humanities_student_major_901_bestof", "namespace": "we1sv2.0", "metapath": "", "pub": "bestof", "title": "2014-05-humanities-student-major_901_bestof.txt", "pub_date": "2014-05-13T00:00:00Z", "Sentiment": "0.015", "Subjectivity": "0.31", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "325", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chgydl8", "Reddit_id": "chgzjcv", "Subreddit_id": "t5_2qh3v", "Commenter": "Rightard", "length": "1874", "content_scrubbed": "*How come right_wingers are so dumb and evil?*\n\nI can see where this thread is going and I'm not surprised to see it on reddit. The next reply in this thread will be even more condescending towards liberals and how Obama has caused the collapse of the country. \n\nIf you look passed your blind hatred of the_left you would've seen that /u/key_lime_pie is a Christian Conservative commenting in /r/Christianity and no \"left_winger\" has any part of this. Both you and /u/buddythebear agree that there is a part of the Christian Right that opposes welfare and still the your first reaction is to go on the defensive. Straw man!! Circlejerk!! The truth is, and this is going to hurt immensely so you might want to sit down, that conservatives are the only ones who won't tolerate criticism on reddit. You have no problem speaking your mind about gays, women, liberals, vegans, environmentalists, liberal_arts, activists, blacks, asians, immigrants, etc. etc. but when a conservative dares to speak out against conservatives all hell breaks loose.\n\n*But when you listen to actual right_wingers, they have reasons that make sense to them as the best way to help everyone*\n\nThat is exactly what /u/key_lime_pie explained so you might want to settle down and actually read what he has to say. \n\nNo one at any time claimed that every right-winger is against welfare but you can't go on and on and on and on about how bleeding heart liberals want hand-outs for everyone and then get defensive when someone tries to explain why you feel that way. No one at any time claimed that right-wingers or left-wingers were right, it[.] simply an explanation why a group of right-wingers think the way they do. If conservatives on reddit who are the large majority here would be a little more open-minded towards other[.] opinions we might someday be able to have a decent debate once in a while.\n\n"}