{"doc_id": "1485", "name": "2014_05_humanities_student_major_1804_lewronggeneration", "namespace": "we1sv2.0", "metapath": "", "pub": "lewronggeneration", "title": "2014-05-humanities-student-major_1804_lewronggeneration.txt", "pub_date": "2014-05-28T00:00:00Z", "Sentiment": "0.097", "Subjectivity": "0.325", "Score": "20", "Upvotes": "20", "Downvotes": "0", "Wordcount": "1028", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26qkvk", "Reddit_id": "chtnlum", "Subreddit_id": "t5_2y7lu", "Commenter": "breawycker", "length": "6773", "content_scrubbed": "A guide to this comic:\n\nEcole normale superieure = the name for a number of French higher education bodies, comparable to universities. In France, universities have to accept all students with a baccalaureat (The French high school diploma). These do not have the obligation to accept anyone, and only a select few can attend studies at these institutions.\n\ncontinentals = people use \"continental philosophy\" (a set of 19th- and 20th-century philosophical traditions from mainland Europe. \"A polemical [of, relating to, or involving strongly critical, controversial, or disputatious writing or speech.] concept that groups up most non-analytical contemporary philosophy.\")\n\nKarl Popper = an Austrian-British philosopher and professor at the London School of Economics. He is considered one of the greatest philosophers of science of the 20th century.\n\nSaul Kripke = an American philosopher and logician. He is currently McCosh Professor of Philosophy, Emeritus, at Princeton University and teaches as a Distinguished Professor of Philosophy at the CUNY Graduate Center. Since the 1960s Kripke has been a central figure in a number of fields related to mathematical logic, philosophy of language, philosophy of mathematics, metaphysics, epistemology, and set theory.\n\nBertrand Russell = a British philosopher, logician, mathematician, historian, social critic and political activist. He is considered one of the founders of analytic philosophy along with his predecessor Gottlob Frege, colleague G. E. Moore, and his protege Ludwig Wittgenstein. He is widely held to be one of the 20th century[.] premier logicians\n\nLudwig Wittgenstein = an Austrian-British philosopher who worked primarily in logic, the philosophy of mathematics, the philosophy of mind, and the philosophy of language. The author of the 75-page Tractatus Logico-Philosophicus. Bertrand Russell described Wittgenstein as \"the most perfect example I have ever known of genius as traditionally conceived; passionate, profound, intense, and dominating\".\n\nHilary Putnam = an American philosopher, mathematician, and computer scientist who has been a central figure in analytic philosophy since the 1960s, especially in philosophy of mind, philosophy of language, philosophy of mathematics, and philosophy of science. He is known for his willingness to apply an equal degree of scrutiny to his own philosophical positions as to those of others, subjecting each position to rigorous analysis until he exposes its flaws.\n\nDerrida = (full name: Jacques Derrida) a French philosopher, born in French Algeria. Derrida is best known for developing a form of semiotic analysis known as deconstruction. He is one of the major figures associated with post-structuralism and postmodern philosophy.\n\nDeleuze = (full name: Gilles Deleuze) a French philosopher who, from the early 1960s until his death, wrote influentially on philosophy, literature, film, and fine art. His most popular works were the two volumes of Capitalism and Schizophrenia: Anti-Oedipus (1972) and A Thousand Plateaus (1980), both co-written with Felix Guattari. His metaphysical treatise Difference and Repetition (1968) is considered by many scholars to be his magnum opus.\n\nFoucault = (full name: Michel Foucault) a French philosopher, historian of ideas, social theorist, philologist and literary critic. His theories addressed the relationship between power and knowledge, and how they are used as a form of social control through societal institutions. Though often cited as a post-structuralist and postmodernist, Foucault ultimately rejected these labels, preferring to classify his thought as a critical history of modernity. His thought has been highly influential for both academic and activist groups.\n\nZizek = (full name: Slavoj Zizek) a Slovenian Marxist philosopher, psychoanalyst and cultural critic. He is a senior researcher at the Institute for Sociology and Philosophy, University of Ljubljana, Slovenia, and international director of the Birkbeck Institute for the Humanities. In July 2013, he was appointed as an Eminent Scholar at Kyung Hee University, South Korea. He writes widely on a diverse range of topics, including political theory, film theory, cultural studies, theology, psychoanalysis\n\nAdorno = (full name: Theodor W. Adorno) a German sociologist, philosopher and musicologist known for his critical theory of society. He was a leading member of the Frankfurt School of critical theory, whose work has come to be associated with thinkers such as Ernst Bloch, Walter Benjamin, Max Horkheimer and Herbert Marcuse, for whom the work of Freud, Marx and Hegel were essential to a critique of modern society. He is widely regarded as one of the 20th century[.] foremost thinkers on aesthetics and philosophy, as well as one of its preeminent essayists. As a critic of both fascism and what he called the culture industry, his writings—such as Dialectic of Enlightenment (1947), Minima Moralia (1951) and Negative Dialectics (1966)—strongly influenced the European new_left.\n\nTractatus Logico-Philosophicus = (Latin for \"Logical-Philosophical Treatise\") is the only book-length philosophical work published by the German-Austrian philosopher Ludwig Wittgenstein in his lifetime. It was an ambitious project – to identify the relationship between language and reality and to define the limits of science – and is recognized as a significant philosophical work of the twentieth century. \nThere are seven main propositions in the text. These are:\nThe world is everything that is the case.\nWhat is the case (a fact) is the existence of states of affairs.\nA logical picture of facts is a thought.\nA thought is a proposition with a sense.\nA proposition is a truth-function of elementary propositions. (An elementary proposition is a truth-function of itself.)\nThe general form of a proposition is the general form of a truth function, which is: . This is the general form of a proposition.\nWhereof one cannot speak, thereof one must be silent.\n\nAnalytical philosophy =  a philosophical movement that seeks the solution of philosophical problems in the analysis of propositions or sentences.\n\nPhilosophical inquiry = attempting to answer the most fundamental questions about a topic. (The answer to question A is more fundamental than the answer to question B if and only if the answer to B takes for granted or presupposes the answer to A.) For example, a scientist might make a statement that one type of event causes another type of event. Such statements take for granted the concept of cause.\n\nTL;DR: blah, blah, philosophy, blah, the more you know, and knowing is half the battle.\n\nEdit: Thank you /u/lordparanoid for pointing out my mistake. I just looked up the definition of continentals instead of continental philosophy."}