{"doc_id": "1487", "name": "2014_05_humanities_student_major_1825_todayilearned", "namespace": "we1sv2.0", "metapath": "", "pub": "todayilearned", "title": "2014-05-humanities-student-major_1825_todayilearned.txt", "pub_date": "2014-05-29T00:00:00Z", "Sentiment": "0.047", "Subjectivity": "0.299", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "556", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chttwr4", "Reddit_id": "chtu73i", "Subreddit_id": "t5_2qqjc", "Commenter": "Vio_", "length": "3331", "content_scrubbed": "What do you like besides computers? If you like something non-computer related and want to go the disparate route, start looking at your school subjects that interest you. Then check out a local university[.] online class schedule and see if anything piques your interest there.\n\nBut seriously, don't panic. You'll figure it out. If you're studying too much, go out to a party and have fun. If you're partying too much, stop and go study (this takes experience).\n\nAlso:\n\nDon't skip out on your fine arts or humanities classes and take them seriously. You'll learn so much more and really find things about yourself you never would have before if you hadn't.\n\nThis is also where you can really find out which disparate field you'd like to double major/minor in. Don't be afraid to go into a non-stem field. Anthropology is just gagging for computer kids. Poly sci, economics, various humanities, geology, all kinds of science fields all need computer people and math/stats people. Plus it shows that you have multiple areas of interest and can \"think outside of the computer box.\"\n\n\nDon't get in the habit of skipping classes. Even the super easy ones. Use those to train yourself how to study/practice for the harder ones.\n\nJust because the first two weeks of college is easy doesn't mean the rest of it is (I specifically told my brother this personally, and he still bone headed it).\n\n\nInvest in a Staedler Mars eraser.\n\nhttp://www. amazon. com/Staedtler-Mars-Plastic-Erasers-52650BK4/dp/B00006IFAN/ref=pd_sim_op_3?ie=UTF8&refRID=0MG058GW75M77Y1E3P6E\n\nActually get one tomorrow if you can. I've had the same one for the past 7 years, and that[.] including grad school. You'll never know just what you're missing by erasing with horrible erasers.\n\nLearn English grammar. Grind that shit home until you know the difference between perfect tense and adverbs. Subject/Predicate is complete bullshit. You want to know verb tenses, spelling, active/passive voice, conjugations, declensions, punctuation. Anything that will make you sound and write like an adult. You will be surprised how many people with PhDs can't write to save their lives. Your English writing and comprehension abilities are how you present yourself to the world.\n\n\nLearn to cook now while you have time- simple meals, but something that can feed you for several days at a time. A whole chicken with cooked carrots and potatoes can feed for 4-5 dinners for less than $10.\n\nTry to not used cans or processed food or ramen as much as you can.\n\nHomecooked meals are a fraction of the price of eating out and will be better and taste so much better for you.\n\n\nBuy a cheap sewing kit. You can sew up buttons/rips in clothes and save that much money. Every nickel and dime saved is your friend.\n\nBuy quality walking shoes- I suggest Merril or Keens. They're expensive, but they'll last for years and give you fantastic support. You will be doing a lot of walking on campus. \n\n\nFree textbook as much as you can. Hit every single library you can find in your area (don't forget other colleges), even if in another town. Interlibrary loan and search for textbooks that way. Free and legal. $20 in late fees is still saving you $180 for the textbook. If your professor goes \"I have a textbook for students to read in the library\"  GO AND READ THAT FOR FREE IN THE LIBRARY.\n"}