{"doc_id": "1292", "name": "2014_05_humanities_student_major_13_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2014-05-humanities-student-major_13_college.txt", "pub_date": "2014-04-30T00:00:00Z", "Sentiment": "0.084", "Subjectivity": "0.417", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "405", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24eyno", "Reddit_id": "ch6ive0", "Subreddit_id": "t5_2qh3z", "Commenter": "sa-yu-ri", "length": "2239", "content_scrubbed": "Dorm life isn't essential per se, but you sound as if you really crave that.\n\nOtherwise, getting involved in organizations on-campus really is the best way to meet people.\n\nI'm not going to lie, as someone heavily invested in the dorming experience my best relationships were formed in the dorms. The person I'm closest to at my school would be my RD, then my roommate for next year. I don't feel close to people in my classes, but I also haven't taken any of my upper-level major requirements yet (however, my major is so small that our classes are populated by non-majors). \n\nOr rather, I don't feel as close to people in my classes as they do to the people in their major. This past semester I sat front and center in my 50 person psych lecture, but everyone next to and around me was in the same organic chemistry class (for biochem majors). I would be having conversations with people but as soon as more than 2 other biochem majors walked in they would all start freaking out about the lab/homework due later that day. A particularly irritating girl would interrupt me while I was speaking about something else to ask my friend about strong bases or whatever. I do tend to babble, but being shoved off to the side like that every day hurt the relationships I had with those girls. tl;dr: I hate orgo bitch sessions.\n\nOn the other hand, my friends who are in those larger majors like nursing have core groups that they study and go to class with, and that really helps them. I'm not going to lie, for me that[.] been lonely - so I turned to the relationships I can maintain in the dorms with people from a wider variety of majors. Most of my friends are social science/humanities_major, since we don't have the shared pains of lab. \n\nI also don't feel very connected to students that commute, as my campus is roughly 50/50 commuters/dormers. My college has another complex between the dorms and the classrooms, so the divide between commuters and dormers is pretty noticeable. Unlike many, I feel more at home studying in my lounge than I do in the library.\n\nSo I'm pretty biased, since I love residence life. But you really sound like you want to live in a dorm, so I would reconsider Iowa and Oregon - especially if they're cheaper."}