{"doc_id": "1302", "name": "2014_05_humanities_student_major_89_nostupidquestions", "namespace": "we1sv2.0", "metapath": "", "pub": "NoStupidQuestions", "title": "2014-05-humanities-student-major_89_NoStupidQuestions.txt", "pub_date": "2014-05-02T00:00:00Z", "Sentiment": "0.146", "Subjectivity": "0.278", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "443", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24iura", "Reddit_id": "ch7lh7n", "Subreddit_id": "t5_2w844", "Commenter": "[deleted]", "length": "2392", "content_scrubbed": "Courses are worth so many credit hours. You simply add up them up. So, if you have 2 courses which are each worth 3 hours then you just do 3+3 to get 6 credit hours for that semester. If you're taking 2 4-hours courses and 2 3-hours courses then you just do 4+4+3+3 to get a total of 14 semester hours.\n\n------------------------\n\n\nCourses are worth so many \"credit hours\". The idea is that you're \"supposed\" to spend 2-3 hours per week studying for every hour you spend in the classroom. So:\n\n* 1 credit hour class: 2-3 hours per week studying for it\n* 2 credit hour class: 4-6 hours per week studying for it\n* 3 credit hour class: 6-8 hours per week studying for it\n* 4 credit hour class: 8-10 hours per week studying for it\n\nCourses generally are worth more credit hours if they're harder and/or have more frequent class periods and/or have longer class periods. Alternatively, courses tend to be worth fewer credit hours if they're easier and/or have class less often and/or have shorter class periods.\n\n\nBut each course is \"worth\" a certain number of credit hours. A 3 credit hour course is worth 3 credit hours. It doesn't matter whether the class meets 3 times a week for 50 minutes, twice a week for 90, twice a week for 80, 4 times for 40, or whatever else. A course worth 3 credit hours is worth 3 credit hours regardless of the class meeting length and/or frequency. \n\nAs a general rule universities try to keep things consistent; 3 hour courses usually meet the for the same length and frequency of other 3 hour courses, and so on. But that[.] just the general rule.\n\nYou add together your credit hours -- **not time spent in class; the credit hours that a course is worth** -- to get to the total. If you have 4 3-hour courses then you do 3+3+3+3 to get a total of 12 credit hours.\n\nEvery university that I've been to or heard about or looked at has credit hour requirements. Something like:\n\n* In order to graduate you need a minimum of 120 hours\n* To graduate with X degree you need: 3 hours in Arts; 6 hours in Math; 9 hours in Foreign Language; 12 hours in upper-level courses in your major\n\nAnd so on. The details differ wildly depending on the major but they use credit hours as a way of measuring how many courses you've passed / stuff you've learned.\n\nFinally, most courses in my experience (liberal_arts) were 3 hour courses. There were exceptions but 3 hour was the norm."}