{"doc_id": "1354", "name": "2014_05_humanities_student_major_674_asknetsec", "namespace": "we1sv2.0", "metapath": "", "pub": "AskNetsec", "title": "2014-05-humanities-student-major_674_AskNetsec.txt", "pub_date": "2014-05-09T00:00:00Z", "Sentiment": "0.125", "Subjectivity": "0.305", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "1105", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_256jdk", "Reddit_id": "che9cb9", "Subreddit_id": "t5_2t3w8", "Commenter": "firead", "length": "6329", "content_scrubbed": "I'm also still a student but a lot of the advice I'e gotten has centered around getting out there and doing things beyond \"paper\" and requirements for courses and certs.\n\nI may be going beyond basic \"entry lecel\" here, but this is all doable for a college student and I assume your goal is to get the job you want not the one you have to settle for. The one thing I've seen from guys who work at the top companies in the area I'm more familiar with (Maryland/DC/VA-based) is that they love this stuff and pretty much live, breath, eat, and sleep it.\n\nOnce you really get into it, you probably will, too. It[.] addictive as fuck - I was a web design & humanities major, joined the school security club because they needed people and I thought it would help my pass some Cisco-based Networking classes, then got totally hooked once I got into CTF and competitions. Seriously, the classes can be borning and tedious, so get involved in the fun (but legal) stuff so you can honestly say you have a passion for it.\n\n Does your school have any sort of CCDC (Collegiate Cyber Defense Competition - http://www. nationalccdc. org/) team or information security club? If so, get involved. It is great and you learn a lot and get to network with some awesme people at even the regional competitions. If not, check out other CTFs. \n\nGo to all of the security conferences you can. If money is an issues, Security B-Sides has many free & local events. You can learn a lot. As you learn more and have something to contribute, try to get into presenting (I'm super nervous about this and still a huge newb but my goal for this year is to have something worth presenting and make at least one presentaion at a con by the end of 2015).\nAnyway, go to conferences and meetups - Defcon, Schmoocon, etc if you can make it, local ones if that[.] more feasible. Also, get involved with a local 2600 group, computer group, hackerspace/makerspace or something - you will learn a lot and get a chance to do things hands-on that will really push you to use what you learn n school and to go beyond it. \n\nGet a job or internship doing something realted. I currently do web design on the side and am learning more about development, work from home as a tech support call center rep, and am doing a co-op in our school[.] computer lab over summer, then moving into actual IT support for BlackBoard in fall (I'd not reccomend trying to do 2 or 3 at once - I'm only in community college now and I am very broke and have a kid to support, so the extra jobs are because I also need money).\n\nLearn your tools. Get really comfortable with Linux. Start using it as your main OS. Start doing what you can in the command line and just learn it. It ends up being faster and easier than navigating a GUI for many things anyway. Get comfortable with PuTTy/OPENSSH/cygwin, nmap, nping, WireShark, Metasploit, Armitage, Kali (Backtrack), Nessus, Snort, aircrack, Netcat, John the Ripper, Kismet, Burp, Nikto, Ettercap, Paros, Sysinternals, and a bunch of stuff I'm probably forgetting.\n\nStart using VMs a lot - make a few up with different OS[.], servers, OS[.], etc and play with them. Get comfy with both Liunx & Windows servers, and with routers and firewalls. Play around with things like Damn Vulnerable Linux, Metasploitable, LAMPSecurity, Gruyere and OWASP Broken Web Apps. Get some old computers and set up a network just to attack (not connected the the internet, but if you wanna nab some cheap routers & switches off ebay and work on netwroking and netwroking security too, it will give you a huge edge).\n\nScripting will be more important than coding, in most situations I can thing ok but, for programming, start with C. Everyone says Python now. Fuck that, Learn C. It will teach you a shit-ton about how computers work and \"think\" and it will give you a damn solid foundation for learning other languages. After that, Python, Perl, Ruby, whatever - personally, I'd go with Ruby if you are using Metasploit, so you can understand what the injections are doing. All have their advantages. You should also have at least a basic familiarity with PHP & JavaScript and at least basic knowledge of SQL and databases. \n\nOnce you learn, and as you are learning the languages, actually do stuff outside of class. If you're not already on github, get on there. Build something, fork something ,improve something, just have something to show when it comes time for interviews. If you're not confidnet putting out \"real\" stuff, work through something like Project Euhler until you are. Get involved with open-source development if you have time - don't job straight into the Linux kernel or anything like that, but check out beginner-friend projects like LibreOffice, Mozilla/Firefox, Python, Ubuntu, Drupal, or search around for one on OpenHatch. org\n\nFor certs, you should be able to get CCNA & Security+ before or soon after graduating. If you can take the 4-class \"Cisco Academy\" stuff for the CCNA, it is great and will teach you a lot of the network stuff you will need to know. They are also pretty  affordable to get on your own - lots of certs are expensive. Most of the security certs I've looked into are around $500-1000+; once you have your foot in the door, let your employer cover that. Once you've got 5 years of expereince, go for CISSP - it is the one most job postings seem to call for and is focused, but in depth.\n\nYeah, that[.] a lot, but keep in mind security ends up being this combination where you need to know regular IT, networking, forensics, server management, systems administration, and whatever else suddenly pops up, and it[.] constantly changing.\n\n**TL;DR -  Learn as much as you can, do as much with what you learn as you can, network; find the things you can really get into and then really go deep in them and do your own research, projects, or coding on the side, and you will do well when it comes to interviewing for jobs and internships.**\n\nI apologize for any rambling and/or incoherance. I just finished finals week plus a series of interviews for co-ops and internships, while working and raising a 4-year-ol. The past 2 weeks have been one long, sleepless, hell and my brain is scrambled.\n\nAlso, these 2 links have TONS of resources:\n/r/netsec/wiki/start          \n/r/netsecstudents/wiki/index#wiki_where_to_start"}