{"doc_id": "1335", "name": "2014_05_humanities_student_major_510_queensuniversity", "namespace": "we1sv2.0", "metapath": "", "pub": "queensuniversity", "title": "2014-05-humanities-student-major_510_queensuniversity.txt", "pub_date": "2014-05-07T00:00:00Z", "Sentiment": "0.177", "Subjectivity": "0.382", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "402", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24x6ta", "Reddit_id": "chbr3oh", "Subreddit_id": "t5_2s4y9", "Commenter": "Beatlelover909", "length": "2392", "content_scrubbed": "The first year of university is quite difficult since you are transitioning from a comfortable life at home to a chaotic life at university. It is normal for people to experience a grade drop. Also, mental health issues are unfortunate and as someone with anxiety, I understand how hard it can be. \n\nSince I'm in Arts, the following advice will be from an Arts slant. As for the program you wanted to get into, if you are a grade level or two under, there is still a good chance that you can get in if you apply for the waiting list. For example, if the thresh hold is a B but you have a B-, a C+ or even a C, there[.] a good chance you will still get in after the auto-acceptances have been completed. If this possibility is not an option, you could always try to minor in the program which usually has a lower thresh hold. If you take courses from your desired program in upper year and get decent marks, then you could transfer in upper year. Alternately, you may discover that the program you currently are in is the best-suited for you. I would strongly recommend speaking with an academic adviser as they would help you discover the best options for you based on your faculty. You can ask questions over the phone and if you are in Kingston, the ArtSci faculty office is in F200 MacCorry. The office is beside the men[.] washroom across from the cafeteria. \n\nHCDS has been an amazing service in helping me with my anxiety. I recommend their counselling services, doctors and their mental health nurse. Once I was diagnosed, HCDS ensured that I was getting help regularly and referred me from one service to another. If you are in Kingston for the summer, I would recommend making an appointment with a counsellor. If you have purchased a Queen[.] health plan, the services should be free. If you are not in Kingston, options include going up to Kingston for their free services during the summer, seeing a counsellor in your hometown during the summer, and/or waiting until the school year to make an appointment. \n\nImportant Phone Numbers\n\nAcademic Advisement: 1 (613) 533-2470\n(I'm assuming you're in ArtSci)\n\nhttp://www. queensu. ca/artsci/help/advising-in-arts-and-science/types-of-academic-counselling/advising\n\nHealth and Counselling and Disability Services: 1 (613) 533-2506\n\nhttp://www. queensu. ca/hcds/contact. html\n \nI hope that helps. It[.] never too late to get help. Best of luck. "}