{"doc_id": "1477", "name": "2014_05_humanities_student_major_1662_education", "namespace": "we1sv2.0", "metapath": "", "pub": "education", "title": "2014-05-humanities-student-major_1662_education.txt", "pub_date": "2014-05-26T00:00:00Z", "Sentiment": "0.066", "Subjectivity": "0.35", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "296", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26jdd3", "Reddit_id": "chrw5r5", "Subreddit_id": "t5_2qhlm", "Commenter": "Deradius", "length": "1871", "content_scrubbed": "As someone who went through high school early enough to avoid being negatively impacted by NCLB and similar efforts, taught high school after the implementation of these types of policies, and now teach at college, I will say this:\n\n**I would prefer the federal government stop any and all funding for post-secondary education long before it tries to implement any fund-by-ratings system.**\n\nNearly any attempt that is made to quantify a ratings system will cause colleges to game the system in order to minimize the losses, and will take the priority away from academics and free, independent thinking and put it on cash flow.  \n\nwould compare schools on factors like how many of their students graduate,\n\nThere are two ways to move this metric from a college[.] perspective.\n\nOne, motivate the unmotivated and reach the unreachable.  Open hearts, change minds, and inspire students like never before.  Great for a Saturday afternoon special on Lifetime, but a shitty business plan.\n\nTwo, lower graduation standards.  Now *here* you can get quick, guaranteed results.  Lean on faculty to fail fewer students, and eliminate pesky standards that might otherwise prevent students from graduating.  We're already pumping out barely literate high school students, why not do it at the college level, too?\n\nhow much debt their students accumulate \n\nWhy not just cap the per-student amount the government is willing to loan, if this is the problem?\n\nand how much money their students earn after graduating. \n\nAnd every college now becomes a trade, career, or professional school.  Goodbye liberal_arts.  College is no longer about broadening perspectives or enlightening the masses.  It[.] vocational school 2: electric boogaloo.\n\n---\n\nPerhaps my thoughts seem a little hysterical and apocalyptic.  It can't be that bad, right?  I mean...  look at the public high school system. "}