{"doc_id": "1484", "name": "2014_05_humanities_student_major_1777_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2014-05-humanities-student-major_1777_changemyview.txt", "pub_date": "2014-05-28T00:00:00Z", "Sentiment": "0.134", "Subjectivity": "0.41", "Score": "25", "Upvotes": "25", "Downvotes": "0", "Wordcount": "851", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_26pks3", "Reddit_id": "chta0bn", "Subreddit_id": "t5_2w2s8", "Commenter": "SynysterSaint", "length": "4816", "content_scrubbed": "The reason Drive so frequently gets recommended by the artsy movie circles is because of the lighting above everything else. Whenever Gosling[.] character (unnamed, from here out called Gosling) needs to make a major decision, the lighting shifts, generally becoming brighter (and thus saturating color) or becoming darker (and thus making everything earthy). This sort of change creates a natural association in viewers of the divine: the brighter the light, the more kind and sacred we perceive it to be, whereas we perceive a room unnaturally darkening to be a sign of malice. The use of lighting to affect color palette isn't unique to Refn[.] Drive, but he uses that interplay as a tool to make key scenes emotionally visceral in a way few filmmakers before him have been able to achieve.\n\nTake the elevator scene, for instance. This scene is all about Gosling[.] love for Irene. He commits an evil act to save the woman he loves from perceived harm. And what happens as he prepares to curbstomp his affection into the would-be-killer[.] face? Everything brightens. The whole elevator car seems to glow with a heavenly approval of what[.] about to happen. The atmosphere reflects his choice *before he acts on it.* Then, almost immediately after Gosling and Irene kiss, the car darkens to reflect Irene[.] concern over the fight that hasn't even started yet; the lighting reflects her mood and her reaction, which it to be afraid of Gosling, before any fear has time to take hold or even a reason to take hold--almost as though, as with the brightening of the car moments before, something larger understands what[.] happening, knows the script so-to-speak. The beautiful light of Gosling[.] love has darkened to Irene[.] fear of not just the situation but of Gosling. Fear out of love, a common theme because it[.] a powerful theme. The image that viewers are left with after Irene leaves the elevator is the light of the elevator car protruding into the darker parking garage, Gosling[.] love unable to shake the fear sitting in Irene[.] moral-driven mind about a man who would kill for *any* reason, even if that reason is to protect her. Viewers are left with the two environments exemplifying the feelings of the two characters as the door closes to separate them.\n\nNearly every major scene in the film has dynamic lighting. Sometimes it occurs before a decision is made apparent, such as the elevator scene, and sometimes it occurs after a decision has been made apparent. It[.] entirely possible, of course, that Refn is just a shit director that can't keep his lighting consistent.\n\nBut I prefer to think of the inconsistent lighting as a kind of wink, a nod to the viewer that maybe Gosling is less in control of Drive[.] world than we imagine. Maybe he really is just along for the ride, that God or whoever is above us (if anyone is there) has set down the road and Gosling[.] job is to drive it exactly as scripted, a contemporary Sisyphean task where the top of the hill just reveals more road. Maybe Gosling[.] successful job as a stunt driver holds the key. His life is wonderful until he freelances as a getaway driver. Everything falls apart when he shows autonomy. Just like in the elevator scene, his decisions are what cause the problems. When he sits back and listens to the director, everything goes fine. Irene wouldn't have been in danger at all if Gosling hadn't knocked on her door earlier in the film, after all.\n\nWhat we're left with is a question about the meaning of the title. Are we to take \"drive\" as a command to Gosling, ordering him to drive the road life has set him on? Or do we take \"drive\" to mean that it[.] his turn to autonomously drive, not just passively ride in a car on some set rails? And if we take \"drive\" to mean that it[.] Gosling[.] turn to act autonomously (that something larger than Gosling is commanding him to be his own man), isn't that just another way for him to follow orders? Each of these possibilities leaves viewers with a notion of Gosling as a machine, no different than his car, a driver reduced to a sat nav system that could exist as easily in the dashboard as in the driver[.] seat. So in the end does Gosling even matter? Does it matter that he[.] human? And what does that say about us?\n\nThat[.] the fun in the film Drive: you never really know because there are so many instances of stuff like this happening. It isn't just the lighting, but the lighting is the easiest to explain (and thus the most common artsy thing that people point to) because the elevator scene is *really fucking good.*\n\ntl;dr Drive is considered to be great because it[.] got a lot for artsy people to talk about. The basic script (plot summary, dialogue, etc.) isn't very impressive on its own.\n\nEDIT I cleaned it up a bit and added a little paragraph about my thoughts on the title."}