{"doc_id": "1361", "name": "2014_05_humanities_student_major_731_vancouver", "namespace": "we1sv2.0", "metapath": "", "pub": "vancouver", "title": "2014-05-humanities-student-major_731_vancouver.txt", "pub_date": "2014-05-10T00:00:00Z", "Sentiment": "0.202", "Subjectivity": "0.5", "Score": "20", "Upvotes": "20", "Downvotes": "0", "Wordcount": "810", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_2596jb", "Reddit_id": "chey4c6", "Subreddit_id": "t5_2qhov", "Commenter": "gorgonautical", "length": "4747", "content_scrubbed": "I can tell you lots about UBC and more, given that I'm an alumni. \n\nPersonally--since I am the artist-type as well--I'd have to say that Emily Carr is the place where you will most likely encounter like-minded art individuals, rather than UBC. I can only say from hearsay (since I didn't study visual arts at UBC) that the visual arts program at UBC seems underfunded and taken for granted by the university--much like the UBC Film Program that I attended. \n\nHowever, I don't wanna sound like I'm ranting, or discouraging towards my alma-matter. Don't get me wrong. I had great times at UBC, and have made great friends there too--like minded, artsy-people. I loved the Art_History program as well. I used to take lots of Art_History courses that to this day inspire me, but sadly life at one point or another forces you to follow one path towards graduation; so simply put, I couldn't follow all the different course paths that interested me, or else I would still be in university and never have graduated. \n\nI cannot speak much about Emily Carr, other than the times I've visited there, seen the facilities and been amazed at how much they care for art in all its forms. Everybody there seems to be all about art--visual, theater, photography, film, fashion, etc. Seems like a great place to collaborate and learn art in general. The location in Granville Island, just seems to foster that attitude even more.  \n\nUBC is instead a giant-melting pot of characters and contradictions. Some good, some bad. You'll be bumping into funny people, depressed people, homeless people, rich kids with fast cars, etc. Arts people, Economists, Psychologists, Engineers, Med Students, Profs that are rich, Profs that are poor, Profs that should be fired, Profs that are in the midst of doing great things, and others that are plainly wasting your time and money. You'll be confronted with wanna-be Olympian athletes, loud beer-gardens disrupting your study, fraternities doing weird shit, people that live in rez vs. those who commute--and that[.] without counting those who are canadian vs. those who are foreign students and the often clash of culture that happens. Quite frankly everything at UBC is big and loud, and in your face. It is quite difficult to feel like an individual at times, and you'll find that there[.] just hundreds, and hundreds of people all sorta, kinda in a driftless boat. \n\nUBC is also a full blown bureaucracy though. It seems to be run, by an almost mythical, untouchable, group of people, that you'll never see, barely hear about it, and whom you can only really complain about. More than often it seems that all administrative things are automated by the countless websites that ubc. ca runs. Things at UBC don't really change much (except for the constant construction and expansion, queue \"Un-ending Building Construction\" joke). I personally don't think it is a University where you can come in and expect that the university will adapt to you--you kinda have to work with the system, and like most people do, just ignore it and do your own thing until the day you graduate. \n\nIn all honesty, I think UBC is about surrounding yourself with a good group of friends with like-minded attitudes and career paths. However, I'm very glad to have met many Engineers, would-be scientists, and business-students, at loud parties in rez, or down at the nudist beach in a cold winter night, at the countless libraries and study rooms. Many a time when you meet some foreign student that teaches you all about a culture you'd never even heard about before (queue \"University of a Billion Chinese\" joke). \n\nI can completely understand why UBC is treated like a city of its own, and its because it really is a world separate of Vancouver. It really is very much a giant bubble, from which you can really take almost any step or option available, and that sometimes I found issue with, because not every path at UBC is a good one... and that[.] because even though the university promises that it treats all careers equally, it really doesn't, fostering instead a lot of those who take more scientific or business endeavours, even though the Faculty of Arts is the faculty with the most students. But even then, you see that the Faculty of \"Arts\"-- should really be the Faculty of Humanities, because every major from English, to Economics, to Math, International Relations, countless Languages, and the actual FINE ARTS, are all stuck in the same \"Faculty of Arts\". \n\nThe ultimate truth is that you'll find a great disdain for the Fine Arts at UBC from most people, except for the immediate circle of friends you'll make at your major, which is both disheartening but also a great challenge for the person who seeks to change that attitude. "}