{"doc_id": "1360", "name": "2014_05_humanities_student_major_730_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2014-05-humanities-student-major_730_philosophy.txt", "pub_date": "2014-05-10T00:00:00Z", "Sentiment": "0.101", "Subjectivity": "0.336", "Score": "42", "Upvotes": "42", "Downvotes": "0", "Wordcount": "767", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chewz50", "Reddit_id": "chexgo7", "Subreddit_id": "t5_2qh5b", "Commenter": "wokeupabug", "length": "4778", "content_scrubbed": " I experienced it first hand for years both as a student and while working in the astrophysics department. \n\nNo, you experienced the same kind of story telling about group affiliation which humans engage in in any context, only because it was coming from academics, you took it more seriously than you ordinarily would.  Every field of labor has its own culture, passed on through this kind of story telling, and constructed part from the natural conditions of that kind of labor and part from received narratives.  Anyone who has worked in an IT department, an HR department, in shipping and receiving, in retail, and so forth, ought to be familiar with the kinds of narratives that labor groups naturally develop in order to pass the time and establish their identity--and anyone who was worked in multiple of such fields ought to be familiar with the differences between these narratives in the one field than in the other.\n\nPhysics or psychology or any other academic field is no different than IT or retail in this regard.  They have their own narratives which they use to pass the time and communicate their identity.  You encountered physicists talking about how their science is the foundation of any other science and looking down their nose at humanities, especially humanities which question this foundational role?  No doubt.  That[.] how physicists talk to one another in between doing physics.  If you worked in an engineering department, you'd encounter narratives about how engineers are the one[.] really advancing our knowledge by actually doing work.  If you worked in a psychology department or a sociology department, you'd encounter a combination of narratives about the quantitative rigor of the science and a minority of people complaining about these narratives.  These are reliable stereotypes for a reason.\n\nBut we've become awfully confused when we mistake the culture of story telling one encountered in one or another department with the academic work which is accomplished by one or another field.  This confusion tends not to happen in actual academic work, which is naturally occupied with the business of actually advancing our knowledge.  Likewise, it tends not to happen in the kind of popular writing which tries to popularize consensus results from the field, for the comparable reason.  This confusion most frequently occurs when popular writing about academic subject eschews its classical role of popularizing the consensus knowledge and instead employs the popular medium for the advancement of academic theories that cannot be supported by the scholarly consensus, or to engage in various political, religious, and polemic interests.\n\nThe solution to this sort of confusion is not to collude with it by joining in the complaints about these political, religious, and polemic interests, but rather to return to the academically responsible activities of furthering our knowledge and popularizing the knowledge that we've obtained.\n\n But there most definitely IS a conflict and what you've said is empirically false.\n\nWhat conflict?  Where[.] the conflict?  On Monday I'm going to go to campus and I'm going to discuss my work with people in the sciences, and so are thousands of my colleagues, and we're going to be funded to pursue interdisciplinary work, and we're going to publish journal articles and books.  Then we're going to come home to an email about what the narrator of a Fox show said in an interview on a Youtube channel dedicated to gaming, and be asked what we think about the war between philosophy and the sciences.  Sorry--when scientists and philosophers stop being able to work with one another to produce academic work, I'll say we're at war.\n\nWhen scientists and philosophers are working together to produce academic work, indeed when there[.] more and more interdisciplinary work of this sort being done, but the blogosphere is filled with drama about how there[.] a war between science and philosophy, something else is going on.\n\nDon't get me wrong, this \"something else\" is troubling.  But it[.] not troubling because *the academic work* philosophers are producing is anti-science, or vice-versa, or because philosophers and scientists can't work together--none of which is even remotely true.  Rather, it[.] troubling precisely because it[.] *disconnected* from the academic work that is going on.  There[.] this whole narrative in our popular discourse about the academy which bears no resemblance to what is going on in the academy.  And this is deeply troubling, because it[.] going to affect funding, it[.] going to affect the attitudes of the next generations of scholars, and so on.\n\nBut, again, the solution to this trouble is not to collude with it by feigning that philosophers are anti-science, or vice-versa."}