{"doc_id": "1474", "name": "2014_05_humanities_student_major_1647_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2014-05-humanities-student-major_1647_politics.txt", "pub_date": "2014-05-26T00:00:00Z", "Sentiment": "0.086", "Subjectivity": "0.481", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "480", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_chrnli3", "Reddit_id": "chro7ky", "Subreddit_id": "t5_2cneq", "Commenter": "truth-is-treason", "length": "2930", "content_scrubbed": "a very important point not reflected anywhere in this discussion about student loans: \n\nthe government guaranteed unlimited student loans to people with no job or money down through a combination of Federal Direct Loans, Federal PLUS Loans, Sallie Mae is what is giving students the buying-power to bid the cost of tuition up into the stratosphere. When credit is unlimited the price is almost irrelevant- any price becomes accessible. many of these students are not mature enough to comprehend their future years as an indentured servant as a result of the debts. Without the loans (now equaling more than $1trillion and still climbing) the vast vast majority of students in college couldn't afford to pay the tuition prices universities are charging. If the government stopped guarantees no private lender would ever be crazy and stupid enough to lend 50k a year to someone with no job. Tuition prices would crash as fast as housing did in 08'. Remove the source of the inflation, you get deflation. Probably 70% of college students would have to drop out and the classrooms would get extremely empty, universities would be forced to dramatically slash prices and extend loans themselves to get these students back- which would also incentive universities to make sure students are studying something marketable and also give more incentive to help students get jobs post-graduation so they'll be able to pay loans back. As long as students can get basically unlimited access to credit because government guarantees the debt, universities can charge whatever they want and since the gov pays them in advance if a student ends up 100k in debt for some silly degree and no prospects of ever getting a decent job the school feels no negative consequence. if the universities extended their own loans and the government allowed students loans to be reduced through bankruptcy, it would give universities all the more reason to help prevent the students from actually going bankrupt cuz if that happens they won't get paid. right now if a student takes out a 50k loan to study Human Rights in Film and Lit as part of a Liberal Arts Degree or some other nonmarketable courses the university doesn't care. there are of coarse, other factors affecting the costs of education which I don't have any more room to list here, but unlimited guaranteed loans is a primary driver in enabling rapid tuition price inflation. \n\nAs long as loans continue to be available to students like they are now, it[.] difficult to have a successful, inexpensive private schools that focus exclusively on marketable degrees and curriculum (especially with all the current government administrative mandates). there[.] no price competition, the only kind of competition among universities currently is who can build the biggest and most grandiose school with all the extra bells and whistles and all types of non-marketable electives better studied as a hobby. "}