{"doc_id": "1308", "name": "2014_05_humanities_student_major_160_yawriters", "namespace": "we1sv2.0", "metapath": "", "pub": "YAwriters", "title": "2014-05-humanities-student-major_160_YAwriters.txt", "pub_date": "2014-05-03T00:00:00Z", "Sentiment": "0.154", "Subjectivity": "0.423", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "612", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_24muw3", "Reddit_id": "ch8r3s9", "Subreddit_id": "t5_2vtil", "Commenter": "Lilah_Rose", "length": "3376", "content_scrubbed": "Ok these questions may be too far away from the fields you have repped in your panel but maybe the inorganic chem person or physicist \"engineer\" knows these people. They're more sociological questions about departments. My MC is a STEM major, a smart jock who[.] a I/ENFP has a bit of a good-looking bro/fratboy vibe but is masking more of a nerdy junior high past (Tolkien, Python, etc.) He rock climbs and plays basketball (was varsity in HS). So he[.] a 2nd year Geology major at Columbia U, undergrad. My grad alma mater, though I was in the arts dept. I feel certain this character exists because I know some guys like this but wanted to make sure it sounds plausible. \n\nAnd I want to check the logic of these things:\n\n* Is Columbia Undergrad considered a good school for earth sciences?\n* In his dept, he complains a lot of the kids are either bleeding heart environmental conservationists or money obsessed kids with no scruples that want to go work for oil companies. \n* He calls his department \"Geo\" for short. Like, \"I was talking to another kid from Geo and he said...\" want to make sure this sounds normal. Just couldn't reconcile him saying \"the geology department\" over and over again.\n* I totally fudged what I thought his class schedule would be, but assumed by second year it would have focused a little and not just be liberal_arts requirements, but he'd have labs and lectures specifically relating to his major. \n* I'm saying that he occasionally goes for class trips of several days to the nearby Adirondack mountains to do mock geological surveying. \n\n* Because of shit that happens to him the course of the novel (it[.] portal fiction after all) he decides he[.] going to switch majors to Geophysics, knowing it will be mean more math and he'll probably need to repeat a year. He considers possibly adding an organic chem and molecular bio double major to help unravel mysteries about the people he[.] encountered-- do people ever do this (yes I know it would require more than 4 years to get all this done). \n\nHis roommate (they live off campus) is also STEM and is more of the classic nerd, though cute and capable of speaking normally. These questions might be good for your CS person, and there[.] some general video game questions as well. \n\n* He[.] a CS major, but because of traumatic reasons, has developed a bad case of agoraphobia and doesn't leave the house. \n* Consquently he does his classes online. And is actually getting a semester ahead at this point.\n* He already has pretty good programming skills. It[.] mentioned a couple times that he[.] developed some clean-up scripts to cure the MC[.] slow running computer that[.] got too much malware on it from looking at porn. \n* Makes fun of MC for having a Mac. \n* Runs his own custome built PC with Unix (or Linux, can't remember)\n* I have him playing both console type FPS games during the day but he[.] also doing PC online gaming at night. \n* Have him switching between different games in the same week. He[.] into Elder Scrolls (this takes place in 2008 so it can't be Skyrim). Could he also be a DotA or WoW fan, or does it seem like too all over the shop? Think he might dabble in Gears of War, Halo or COD in the same week as well during the day? I'm not much of a gamer so I don't know how much dabbling goes on as opposed to really loyal play-throughers.  \n\n\nAny of this sound plausible? lol\n"}