{"doc_id": "1394", "name": "2014_05_humanities_student_major_961_subredditdrama", "namespace": "we1sv2.0", "metapath": "", "pub": "SubredditDrama", "title": "2014-05-humanities-student-major_961_SubredditDrama.txt", "pub_date": "2014-05-14T00:00:00Z", "Sentiment": "0.019", "Subjectivity": "0.271", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "482", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_25j6vi", "Reddit_id": "chhohd3", "Subreddit_id": "t5_2ss5b", "Commenter": "Enibas", "length": "2621", "content_scrubbed": "_Cambria: \nGrow up. Do a little research. Get an education. Come back and look at what you're saying. \n\n--\nPresBHO: \ni am grown up, probably older than you. i do have a college education, so here[.] how you're wrong.\n\n--\n_Cambria: \nNow fuck off with your \"I have a degree\" and \"I am older than you\" bullshit. You type like a fourth grader. Any self respecting degree holder would not be so lazy. It[.] muscle god damn memory to use punctuation and capitalization. You are a tool. \n\n--\nPresBHO: \ni'm a tool that[.] smarter than you, and can properly source my claims. you, otoh, can't. must suck to be out smarted by a tool...\n\n--\n_Cambria: \nI am confident in my knowledge of America[.] laws and our Constitution as well as our Declaration of Independence. I've got more knowledge in 3 years of college than you have in your (no doubt) 2 years.\n\nLiberal arts major, huh?\n\nI'd be angry if I wasted time and money on that useless degree also.\n\n--\nPresBHO: \nyou might want to switch schools or ask for some money back because i've had better debates with my dog about his stick choices...\n\n-----\n\n_Cambria:\nYou have the_right to LIFE no matter where you go. Therefor you have the_right to not feel as though your life is in danger in any place open to the general public. If I feel as though your right to life is threatened, I will remove that threat, even if you are a complete cretin.\n\nWe hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.\n\nI don't come to your place of unemployment and tell you how to mooch off your mother. Don't get on the internet and tell others they don't know theirs.\n\nPresBHO:\nkeep changing the goal posts.\n\n\"have the_right to feel safe in public\" \"the_right not to feel threatened\" \"the_right to feel safe and secure no matter where you go\".\n\nany day now...\n\n\n_Cambria:\nYou really are stupid. I've quoted the DoI. You're getting nothing else from me. I am also tagging you as \"mentally challenged\" so that I do not expect too much more from you in future posts. \n\nPresBHO:\nyou haven't sourced any of your original idiotic statements like - \"have the_right to feel safe in public\" \"the_right not to feel threatened\" \"the_right to feel safe and secure no matter where you go\".\n\nall you've done is changed what you said a billion times. fuck off already.\n\n_Cambria:\nI cited what I meant when I said what I said. You have yet to tell me where in the 2nd Amendment we are given the_right to brandish weapons in public. I'm still waiting on that. \n\n"}