{"doc_id": "35", "name": "2016_06_humanities_student_major_347_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-06-humanities-student-major_347_AskReddit.txt", "pub_date": "2016-06-04T00:00:00Z", "Sentiment": "0.166", "Subjectivity": "0.431", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "329", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3vri6y", "Reddit_id": "d3w4ue3", "Subreddit_id": "t5_2qh1i", "Commenter": "kindkitsune", "length": "1942", "content_scrubbed": "Its an interesting path to consider, and makes me wonder where we will go. The optimist in me wants to believe that we will become a society entering into a \"golden age\" of freedom and respect for the common man - a persons worth comes from the genuineness of their passion and pursuit of it, not from their station in society monetarily. If we begin bringing in generalized management AI, I could see these optimizing the resources of cities and entire nations to best serve their people in a sustainable fashion. Automation is already considerable on farms, but I bet we could take it further (and sustain a population in a healthier fashion) by finally getting to developing automated tower farms in cities (an idea thats been kicked around for ages).\n\nThe pessimist, or realist, in me believes that the profits for those controlling the major sources of labor will increase, as robotic and automated labor is ultimately far cheaper and more profitable than living sources of labor. I doubt the minimum income guaranteed for everyone will actually be livable, especially if we don't start looking for ways to produce more resources (food, potable water, etc) with less environmental impact. \n\nFrankly, I'm fascinated to see how the next several decades go. I work in the space industry as an engineer(ing intern shhh) designing various spacecraft components, and while I'm sad that I was born too early to sail the stars it is exhilarating to know that what my fellows and I do will shepherd humanities first steps into the cosmos. Our biggest work, at the company I'm at, is on robots able to fabricate structures in space, repair satellites, and eventually self replicate. All from raw material sent up at maximum density, or from raw material processed from asteroids. Here, I believe the benefits of robotics is only positive- space is hardly the best environment for humans, and construction in space is about as risky as it can get."}