{"doc_id": "1985", "name": "2016_08_humanities_student_major_1322_yale", "namespace": "we1sv2.0", "metapath": "", "pub": "yale", "title": "2016-08-humanities-student-major_1322_yale.txt", "pub_date": "2016-08-18T00:00:00Z", "Sentiment": "0.195", "Subjectivity": "0.371", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "425", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4yd3nm", "Reddit_id": "d6n2feu", "Subreddit_id": "t5_2roag", "Commenter": "jayman1466", "length": "2459", "content_scrubbed": "I've done both undergrad and grad here - though I agree, the experience is very different between the two, I would absolutely not classify one as more \"fun\" than the other.\n\nThe main difference comes with 1) how you interact with the University and the surrounding city of New Haven, and 2) how you interact with academics at an intellectual level. \n\nWhen you're an undergrad, EVERYTHING you do is Yale-centric. You live on campus, you eat on campus, all your friends are other undergrads, your free time is spent doing Yale extracurriculars, and all the parties are on campus. Besides the one or two bars I would sometimes hang out at on the weekends, it was easy to forget that there was anything but Yale in New Haven. In retrospect, the undergrad \"Yale Experience\" was pretty strongly curated; there were a lot of checks in place to make sure you were doing well, which is appropriate for kids leaving their parents' home for the first time. \n\nAs a grad student, things feel a bit more expanded. I've finally explored life in New Haven outside the university. I live in a nice house in a residential neighborhood, spend weekends on long bike rides along the Connecticut coastline, spending time on the beaches along the way, have been hitting up all the local music venues discovering a vibrant local scene, have started touring the dozens of craft breweries that are around here, have started caring about local politics, going to all the local music festivals, fun runs, and so on. If anything, I probably drink more in grad school than undergrad, it[.] just a difference of where: local whiskey bar vs frat party. Sometimes you forget that you're even at Yale, but in a good way - you're no longer trapped in an insular bubble and finally become a citizen of New Haven. \n\nIntellectually, as an undergrad at a liberal_arts institution, you're encouraged to explore widely and discover. This is great, but comes at the expense of focus and expertise. I was friendly with several of my professors but I never could consider myself their peer. Grad school is liberating in its focus. You develop yourself as a world-class expert in your field, grow close to your department, and begin to consider faculty as both mentors and peers. \n\nSo, sure, huge difference in atmosphere, but it more reflects differences in the way an 18 year old should interact with university life vs a 25 year old. But these differences definitely didn't correlate with fun for me. \n"}