{"doc_id": "188", "name": "2016_06_humanities_student_major_1781_politicaldiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "PoliticalDiscussion", "title": "2016-06-humanities-student-major_1781_PoliticalDiscussion.txt", "pub_date": "2016-06-25T00:00:00Z", "Sentiment": "0.125", "Subjectivity": "0.395", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "431", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4n95uc", "Reddit_id": "d4ndgmc", "Subreddit_id": "t5_2sfmf", "Commenter": "Put_Call_Parody", "length": "2388", "content_scrubbed": "I also firmly believe there is value in the arts and am not the biggest fan of the STEM circlejerk on Reddit.\n\nBut the fact that in the US, students are free to switch between majors pretty much at will is a huge reason I don't think free college tuition is feasible here. Germany is always called as an example of a country offering free public college, but their entire education system is different. There are limits on how many people may major in a certain subject for each school and those limits determine, partially, who is admitted in the first place. Yes there is value to the arts, but if you are getting your education publicly funded, then the public has an interest in making sure there aren't *too many* people in specific majors. In other words, the public wants some certain amount in return from you in exchange for this education. Although there is value in the arts, it isn't good for the country in the long run if there[.] a lack of engineers, to go with your example. \n\nThis attitude that students should be allowed to try out many different things in school is just fine by me, and I agree with it, but that doesn't mean the public should finance it. If the US were really willing to implement something like what Germany does in regards to limiting certain majors to only the most talented, then *maybe* we can start talking. But of course, this also doesn't take into account that not everybody in the lower schools in Germany even will try to apply to college. Starting in middle school (maybe high school), students are already filtered into three different levels of study, with only those in the top level and maybe some in the middle level even preparing to go to college. This also limits their costs of paying for college. Do you think the US would really commit to separating out who is and isn't going to end up in college from the age of 11/12? While some people may argue for a system like this, it goes pretty against the attitude that students should be allowed to try out different things (ex. what if some kid wasn't that great with grades in elementary school because he was busy with sports but still wants to go to college?).\n\nEdit: It[.] been a while so I may have some details wrong about the specifics of German education but basically: they can afford free college because it[.] limited and it[.] limited in ways that Americans wouldn't accept."}