{"doc_id": "135", "name": "2016_06_humanities_student_major_1325_srsdiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "SRSDiscussion", "title": "2016-06-humanities-student-major_1325_SRSDiscussion.txt", "pub_date": "2016-06-19T00:00:00Z", "Sentiment": "0.03", "Subjectivity": "0.388", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "396", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4fm4hv", "Reddit_id": "d4fsqy3", "Subreddit_id": "t5_2t5sa", "Commenter": "HirsuteHeretic", "length": "2497", "content_scrubbed": "Your bias is showing:\n\n That[.] really all this \"political revolution\" is. A bunch of relatively privileged, predominantly white men appropriating all the trappings of a real revolution, but refusing to put in any of the actual work that revolution requires. Another article aptly referred to them as \"cosplay revolutionaries.\" \n\nWay to be a reductionist and erase POC and women yourself, not to mention legions of progressive activists who actually did put in the work.\n\n doesn't represent a coordinated effort to propagate a certain narrative.\n\nThis is patently absurd: the HRC subreddit circlejerked day and night about this, and the BB narrative was one of the primary modes of dismissing progressive critique of HRC on and off Reddit. Your claim that this doesn't represent a coordinated attack and general narrative of anti-progressive marginalization is blatant spin.\n\n Lastly, you should be careful with your own generalizations. Pardon me if I'm making the same mistake that I just warned against, but you seem to be implying in your post that most Clinton supporters are white and wealthy, which is not true, as the electoral data demonstrates.\n\nYes, you are making a mistake. You are the one being reductive, not OP, who clearly is speaking to a specific and small, but extremely vocal and overrepresented, subset of HRC supporters in the media: White, wealthy, lib-feminist women, who essentially appropriated progressive discourses of gender critique to overgeneralize about Sanders supporters. Lest you spin what I'm saying: The BB narrative did describe an actual reality, albeit a much smaller one than representative of actual Sanders supporters. I am a university instructor teaching feminist humanities and everyone I know well at my university supported Sanders. To claim that the BB narrative and your accusations of slacktivism are representative marginalizes one of the oldest progressive traditions in the US: Leftist, esp. feminist, academics. Not to mention millions of other committed people.\n\nPOC and women who supported Sanders got basically no attention in the media, and were dismissed by HRC and the DNC when the presumptive nominee thanked Sanders[.] campaign for bringing \"new voters\" to the Dem party. I've been a supporter of the party for two decades and find such rhetoric, which you so shamelessly propagate as if it were truth, to be horribly offensive. It saddens me that your spin was so quickly upvoted on what is a generally skeptical and open-minded sub."}