{"doc_id": "195", "name": "2016_06_humanities_student_major_1882_infp", "namespace": "we1sv2.0", "metapath": "", "pub": "infp", "title": "2016-06-humanities-student-major_1882_infp.txt", "pub_date": "2016-06-26T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.469", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "361", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4p99ug", "Reddit_id": "d4pb9y0", "Subreddit_id": "t5_2qn2o", "Commenter": "rottnzonie", "length": "1949", "content_scrubbed": "To elaborate on my experience. Both of my parents were engineers with masters degrees, and both sets of grandparents were either masters or Phd level academicians. While I was growing up, I was a huge disappointment because I wasn't good at math, and I really started to hate it by the end of high school, when I had the calculus experience. I graduated early and went to college at barely 17. My parents never really considered that I would be anything other than an engineer, but the idea made me nauseous and as a compromise I went to a state u and majored in computer science. Although I secretly applied and got accepted at Berkeley for liberal_arts, because I just turned 17 it wasn't happening. The state u was 3 miles from our house and I lived at home for their peace of mind apparently. Consolation prize was a nice little sports car which was great at that age, but doesn't make up for not going to Berkeley to this day.  To my parents further dismay, I flunked out of computer science, mostly because it required calculus which I couldn't pass because of the mental block I acquired in high school. And also because I spent all my time trying to party and sneak around while living at home, instead of studying... since I still had a curfew. So I took a year off and then went back with a different major which I picked based on how fast I can graduate so I can move out. LOL. About 8-10 years after graduating, career things eventually went well and have been decent since. But for my parents the math related disappointment never really went away, and over the years some other stuff happened that they disapproved of and never got over, we're still in the same type of relationship as when I was in school. And I'm an only child to boot, so there[.] no one else to obsess over. Ironically, at the same time they love me to the moon, and I them, and I never thought they're bad or clueless people, just not open minded which they admit."}