{"doc_id": "17", "name": "2016_06_humanities_student_major_193_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2016-06-humanities-student-major_193_philosophy.txt", "pub_date": "2016-06-02T00:00:00Z", "Sentiment": "0.101", "Subjectivity": "0.354", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "445", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4m6uow", "Reddit_id": "d3th5vh", "Subreddit_id": "t5_2qh5b", "Commenter": "mindscent", "length": "2691", "content_scrubbed": "We've been here in Detroit shilling for you guys on facebook! That letter from the epidemiologist was amazing.\n\nEta letter\n\nWestern Illinois University is considering closing its philosophy program. I hope it doesn't come to that. This letter from David Ozonoff of Boston University to the chair of the board of trustees at Western Illinois is a great example of why philosophy is important:\n\nDear Trustee Clawson\n\nI am sure you will hear from many professional philosophers about the value of their discipline and asking you to reconsider any decision to discontinue it at WIU. I am not a philosopher, but a physician-epidemiologist. Epidemiology, as I am sure you know, is the study of the distribution and determinants of diseases in population, and throughout my rather long career I have concentrated on cancer epidemiology, especially the detection and analysis of cancer clusters. My current research is quite theoretical but aimed at finding efficient methods to mine large datasets for clues to the causes of cancer.\n\nThis may not sound very close to philosophy but for the last six months I have been deeply immersed in the philosophy of language and philosophical logic because they hold the keys to some of the most intractable puzzles in cancer epidemiology. In particular, untangling the interaction of the criteria for when something \"causes\" something else is at the heart of current practice (so-called causal inference). I use the work of academic philosophers on a daily basis. Indeed, I have read little else in the last 6 months but books and papers on philosophical logic, much of it quite technical. Because I am not a philosopher, I depend heavily on the expositions and research of today[.] academic philosophers for my work. This is a connection I suspect would not have occurred to you, but it is the cutting edge of today[.] epidemiological analysis. The first book has now appeared on the Philosophy of Epidemiology by Alex Broadbent (who has also written a well-regarded text on Philosophy for Graduate Students). This is an exciting career future for today[.] philosophy student.\n\nI was a Department Chair for 26 years at a School of Public Health at a major research university and am well aware of the budgetary pressures, required work-arounds and compromises needed to keep the lights on and the roof from leaking. I am hoping that in this case, one of those compromises won't result in the loss of an excellent and well-regarded Department that is at the core of a liberal_arts university and a discipline of emerging importance in the field of public health.\n\nWith best wishes and respect for the difficult job you do,\n\nDr. David Ozonoff (Boston University) "}