{"doc_id": "1892", "name": "2016_08_humanities_student_major_499_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2016-08-humanities-student-major_499_slatestarcodex.txt", "pub_date": "2016-08-08T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.34", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "809", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d699tda", "Reddit_id": "d69u3r9", "Subreddit_id": "t5_30m6u", "Commenter": "housefromtn", "length": "4608", "content_scrubbed": " I spent several years reading and trying to understand all of that postmodern bullshit and I consider the entirety of that time to have been wasted. Zizek, Baudrillard, Deleuze and Guattari, Hardt and Negri, is there any value to any of it? Does anybody have a clear example of a single valuable idea postmodernism has contributed to the world?\n\nThis is exactly where I'm at, except I haven't taken the multi-year plunge yet, and I can't decide whether I want to or not.\n\nI value my intuition highly, and my intuition says that pomo is a steaming pile of bullshit, but I'm at this impasse where I want to be able to reconcile with some of my more artsy friends, to be able to find a golden thread in postmodernism that allows me to reconcile fully with the academic underpinnings of feminist philosophy, to be able to reconcile these two warring sides of my nature, between my rationalist friends, and my artistic friends, it'd make everything in my life so much easier. \n\nThere[.] this tension where it feels like the rationalists are missing the language to talk about some subjective human experience and don't realize that they're missing it, and the artists are missing basic fucking common sense and a connection to reality, and I feel a little uneasy in either camp most of the time, and it feels like if I could just dig far enough down I could be able to ease this philosophical tension that I feel where I only half belong in either tribe.\n\nAnd postmodernism seems to be the dividing line...\n\n\nbut if I try to get more than 20 pages into any of these books it[.] like I'm reading Aleister Crowley PDF[.].\n\nI say this as someone who really values staying up late at night and reading the occasional impermeable occult text. I think there[.] something that inspires the inner muse when you read something that[.] balancing between pure gibberish and trying hard to build up a systemic view of the world through pure automatic writing style intuition. Scott once said:\n\n  \"If I get into mysticism again – and I think I should, it seems like one of the highest-utility areas for me\"\n\nas a minor endnote to one of his posts, and I remember quite a few people being puzzled and shocked by this statement, but I totally got it, or at least my own version of it. There is something about mysticism not making sense that makes it a prime substrate for generating original ideas or making new connections. [In mysticism and pattern matching](http://slatestarcodex. com/2015/08/28/mysticism-and-pattern-matching/) Scott compares mysticism and neural networks, and I'd make my own comparison where mysticism is like random noise injected into a neural network to prevent overfitting to the normal mundane everyday world we usually inhabit.\n\n\nOnly with Aleister Crowley, for the most part, nobody takes him seriously. At some level, the majority of people read him(at least the ones I know) and just take it as inspiring mental noise with which to generate patterns or ideas. Nobody is trying to use Thelema to effect social policy, decide how to study glaciers properly, or how to make effective business decisions. Nobody is using the vocabulary of Thelema to discuss important topics or citing his books or books that cite him in academic work that[.] meant to at some point touch ground with the real world.\n\n \"We place no reliance on virgin or pidgeon.\nOur method is science, our aim is religion.\"\n\n-Aleister Crowley\n\nTo me when I talk to people about pomo stuff the vibe I get is a reversal of the Crowley quote, that their aim is science, and their method is religion, and I think that[.] what weirds me out about it. There doesn't seem to be any end to the scope of what postmodern philosophy can be applied to. It[.] a totalistic belief system that seems to be willing to stick it[.] nose in anywhere with no hubris at all. I can see the value in using it in the arts, but there should be some limit to what exactly postmodernism gets to stick it[.] claws in.\n\nAnd I'm sitting here and the question I'm asking myself, is \"Is it worth it to study Enochian magic for years on end just to make 100% sure that we can't really summon demons?\" and that[.] where I'm at with postmodernism. It rings all the demon summoning bells, and if I want to tell someone I think summoning demons is bullshit they can always just say \"Yeah, but have you read Isreal Regardie or The Lesser Keys of Solomon?\"\n\nThat[.] what the parent essay read like for me. It[.] like I could make a mirror version for occultism filled with jargon and just deflect any arguments with \"yeah but have you read this 17th-century book on ceremonial magic?\""}