{"doc_id": "1981", "name": "2016_08_humanities_student_major_1292_monsterhunter", "namespace": "we1sv2.0", "metapath": "", "pub": "MonsterHunter", "title": "2016-08-humanities-student-major_1292_MonsterHunter.txt", "pub_date": "2016-08-18T00:00:00Z", "Sentiment": "0.142", "Subjectivity": "0.479", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "550", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6m21m4", "Reddit_id": "d6mm8pb", "Subreddit_id": "t5_2rron", "Commenter": "riverbankkei", "length": "3103", "content_scrubbed": "Same here! MH isn't exactly known for it[.] story, but holy crap the MH4U storyline was perfect!\n\nEvery MH game has the same basic story--you are a new Hunter for the guild, you just showed up in your assigned town, time to help people out by hunting monsters and stuff! At some point, the guild/ town starts noticing something mysterious--earthquakes, missing airships, etc.--and when they finally figure out what it is, it[.] your job to go after it, Hunter! Then afterwards, congratulations! You're awesome! Here[.] some even MORE badass stuff for you to hunt!\n\nAnd that[.] a very good formula for MH storylines, and I don't think it needs changing at all. The thing is, MH4u followed that formula with just a BIT of extra spice, and it was phenomenal. And I miss it. MHGen is even more bare bones than Tri, which was already pretty minimalist.\n\nMH4u used the frenzy virus--the new status effect--to craft its story around, with tyhe help of the new Magala monsters. And then for the G rank portion, they used Dundorma and its elder dragon problem to shape THAT storyline. The use of new mechanics and new monsters might be the easiest to make a new story around, but new settings with cool lore could be used too! (MH3 used Moga village[.] history as a major plot point.)\n\nHere[.] what they could have done for MHGen: the player is a new Hunter, one of the first to graduate from the new Hunting Styles training regimen, and in addition to their usual tasks, they're also trying to prove the viability of Hunting Styles and Arts. It[.] interesting because the antagonists for that part of the plot would be fellow Hunters, not a monster. Which could totally work without piles of cutscenes. The Hell Hunters in Kokoto would scoff at you for using Styles and Arts, while other Hunter veterans may be skeptical at first, but totally won over to your way of doing things. NPCs commenting on how the Aerial IG is even springier, how Adept LS just plain won't work with certain monsters that aren't aggressive enough. Plus there[.] the plotline you could have around the Prowlers--now instead of just providing Support for the Guild, Felynes can be Hunters in their own right.\n\nAll while still dealing with monsters  mystery  oh look the mystery is a monster, go get 'em!\n\n(Aside: I'm a nerd and this is my personal canon. Though I specifically have it as my MH4u Hunter being one of the Hunters behind Aerial style, and locking up all her cool gear and working her way up from nothing to prove the Style system is a viable choice for new Hunters. And then I mentally rewrite everything the Caravan peeps say because they totally didn't just forget about me, dammit.)\n\nThe only (maybe) downside of this is that there would probably be Key quests that would have requirements for what Styles and Arts you can and can't use, plus have some Prowler quests be Key quests. Hopefully they would, at bare minimum, not make Adept style a requirement--maybe just have it so you can't use Guild style on certain quests. Though I could see them requiring you use Striker, since it A) is a new style and B) has all the Arts."}