{"doc_id": "20", "name": "2016_06_humanities_student_major_210_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2016-06-humanities-student-major_210_politics.txt", "pub_date": "2016-06-02T00:00:00Z", "Sentiment": "0.062", "Subjectivity": "0.338", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "1267", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3snvs0", "Reddit_id": "d3tph2i", "Subreddit_id": "t5_2cneq", "Commenter": "KSDem", "length": "9913", "content_scrubbed": "I didn't jump into this before because I had looked into it once, but I see that this issue is somewhat different so I'd be happy to provide a little updated insight based on my own background and experience.  \n\nThe difference between this thread and the thread in /r/PoliticalDiscussion is that that thread had to do with allegations that the *seller* (the Roman Catholic Diocese) was wrongfully disadvantaged, whereas this article has to do with allegations that the *buyer* (Burlington College) was injured.  \n\nIt[.] probably important to keep certain things about Burlington College in mind:\n\nFirst, it[.] an incredibly *small* college.  In 2011, it was one of the five smallest colleges in the country (intriguingly, two of the others are located in Vermont as well).  [For decades, annual enrollment at Burlington College fluctuated between 100 and 250](http://vtdigger. org/2011/09/13/burlington-college-grapples-with-growing-pains/) and, according to [College Navigator](http://nces. ed. gov/collegenavigator/?q=Burlington+College&s=all&id=230825), it looks like the college has about a 45% graduation rate or approximately 100 students a year (50 a semester).  \n\nSecond, it[.] a *private* college.  That means that all the money to operate it has to come from tuition and donors, the latter of which are generally alumni and community members.\n\nThird, the college is only 44 years old.  Extrapolating the College Navigator numbers across the college[.] lifespan, it[.] only graduated 4,400 students during its entire existence -- and that[.] a high estimate.  This is important because it means the college doesn't have a large pool of alumni from which to solicit money.  \n\nSo it[.] a private school that doesn't get support from the federal or state government with a small pool of alumni donors, which means that its funding is going to come largely from the tuition of current students and community donors. And indeed, [in recent years the school[.] leaders have said that enrollment growth is key to the college[.] future and financial stability, given that tuition is the primary source of revenue](http://www. burlingtonfreepress. com/story/news/local/2014/09/02/resignation-caught-college-trustees-surprise/14981063/).\n  \nFourth, it[.] a *nontraditional* school.  The pool of students (and parents) willing and able to pay over $20,000/year to study liberal_arts at a private college that appears to have graduated no students of professional note is extraordinarily small -- it[.] not nonexistent, but the pool is small and competition for those students among colleges and universities, including those with established film schools, for example, is stiff.  \n\nPerhaps not surprisingly, then, [between 2001 and 2008 the number of students dropped by about 40 percent, from 250 to 156](http://vtdigger. org/2011/09/13/burlington-college-grapples-with-growing-pains/).  The decline in enrollment necessitated tuition increases but, [with Burlington College the 8th most expensive college in Vermont with tuition already $6,000 more per year than a student would pay to attend the University of Vermont](http://vtdigger. org/2011/09/13/burlington-college-grapples-with-growing-pains/), continued tuition increases were obviously not sustainable and the college had to come up with a plan to increase enrollment.  \n\nSometime prior to 2010, Jane Sanders (who was first hired in 2004 and remained through 2011) and the Board of Trustees apparently developed a two-pronged [plan](http://www. theatlantic. com/politics/archive/2016/05/what-happened-at-burlington-college/482973/) to increase enrollment by increasing the number of degrees offered and improving its campus:  \n\n In an interview with the Burlington Free Press at the time, she cited building enrollment and expanding the school[.] small endowment as priorities. The college adopted a plan to offer more majors and graduate-degree programs, renovate its campus and grow enrollment a couple of years later. \n\n[The college then set money aside to build a new, bigger space](http://www. wcax. com/story/12532586/burlington-college-to-buy-diocese-property).  \n\nBefore the college began to build however the Diocese property, [considered to be the most valuable piece of undeveloped lakefront property in the city](http://vtdigger. org/2014/12/21/burlington-college-fight-survival/), became available. Obviously, Burlington College would consider whether it would be possible for them to acquire it rather than build their own new building.\n\n[The transaction was done at $10 million for 33. 5 acres (or 34, depending on the source)](http://vtdigger. org/2011/09/13/burlington-college-grapples-with-growing-pains/).  And while some have questioned whether the property was worth $10 million, [the college[.] recent sale of 27. 5 acres in the parcel for $7. 65 million](http://www. burlingtonfreepress. com/story/news/local/2015/02/03/burlington-college-sold-eric-farrell-catholic-diocese/22806613/) or $278,182/acre places it right at $9. 3 million if the total property was 33. 5 acres and $9. 5 million if the total property was 34 acres; in my opinion, that[.] close enough to $10 million to establish that the property was in fact worth the price paid.\n\nBut how to pay for it?  A former trustee speaks to problems with fundraising [here](http://vtdigger. org/2014/08/06/audit-questions-financial-viability-burlington-college/) but, while a lack of satisfaction with Jane[.] fundraising may have been [one of the reasons for her departure from Burlington College](http://vtdigger. org/2011/09/22/burlington-college-board-sanders/), several things are notable that I've not seen reported elsewhere, specifically that Sanders had, quite properly and as one would expect in connection with an undertaking such as this, [engaged the services of a fundraising consultant, PFM Group of Boston](http://www. burlingtonfreepress. com/story/news/education/2014/08/15/financial-questions-dog-burlington-college/14117505/) and [hired an experienced, professional capital campaign fundraiser, Michael Luck, to serve as vice president in charge of the fundraising effort](http://vtdigger. org/2015/09/13/jane-sanders-overstated-donation-amounts-in-loan-application-for-burlington-college/) prior to purchasing the property.\n\nIn addition, I cannot help but note that fundraising did not improve after Sanders' departure.  According to [Bill Breen](http://vtdigger. org/2014/08/19/burlington-college-used-restricted-scholarship-money-operating-costs/), who served as the college[.] CFO from August 2012 to August 2013, long after Jane Sanders' departure:\n\n There was \"literally no fundraising occurring\" during the year he worked there, except by faculty, whom Plunkett asked to help raise money, Breen said.\n\nEnrollment did increase in 2011 and selling off some of the undeveloped property would have substantially reduced the college[.] debt; it appears, however, that there was a strong movement within the community to keep the property undeveloped.  This is clear from the [pushback faced by Christine Plunkett](http://www. burlingtonfreepress. com/story/news/local/2014/09/02/resignation-caught-college-trustees-surprise/14981063/), the college[.] former Vice President of Administration and Finance who succeeded Jane Sanders as the college[.] president in 2012 and who was ultimately forced out in 2014 amid student protests and a [faculty/student vote of no confidence](http://vtdigger. org/2014/08/15/burlington-college-faculty-student-groups-vote-confidence-president/) :\n\n Last year, under Plunkett, the college announced a master plan that included retaining 16 acres for the campus, and developing the other 16 acres for housing. The housing development would allow the college to pay off about half the debt, Plunkett said then.\n\n The students' statement, read by second-year student Marcia White, took issue with the development plan.\n\n \"Our college sits on the last open green space in the city, which is utilized by all members of the community,\" the statement declared. \"The current development plan will effectively destroy this open land.\"\n\nSimilar pushback existed in February 2015, when 27. 5 acres were ultimately sold:\n\n Opponents of development on the property held a meeting that attracted 200 people last month. Many in attendance called for conservation of most or all of the parcel, one of the largest tracts of undeveloped land in the city along Lake Champlain. They also called for a halt to the planned sale, to no avail.\n\nThe current controversy has to do with whether inaccurate and/or fraudulent information was given to the bank when Burlington College borrowed to purchase the property and [this](http://vtdigger. org/2015/09/13/jane-sanders-overstated-donation-amounts-in-loan-application-for-burlington-college/) is the best summary I've seen.  \n\nI'm going to reserve judgment on that but it appears Michael Luck and Christine Plunkett, who also signed the loan agreement, were also involved in confirming these donations.  In my experience a college president would rely heavily on the CFO in a transaction like this, and I cannot help but note that Christine Plunkett seems to have been involved in numerous accounting misadventures since Sanders left:  \n\n1.  [The Vermont Attorney General is looking into Burlington College[.] diversion of restricted scholarship funds that occurred in 2012](http://vtdigger. org/2014/09/29/ag-looking-burlington-colleges-diversion-scholarship-fund/); \n\n2.  [Burlington College failed to pay employee retirement in 2014, which Plunkett characterized as an \"inadvertent oversight\" unrelated to the school[.] financial struggles](http://vtdigger. org/2014/08/25/burlington-college-failed-pay-employee-retirement/); \n\n3.  [In 2014, it appears the college may have drawn down federal financial aid funds but then delayed the distribution of those funds to students](http://vtdigger. org/2014/12/21/burlington-college-fight-survival/)."}