{"doc_id": "111", "name": "2016_06_humanities_student_major_1121_askhsteacher", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHSteacher", "title": "2016-06-humanities-student-major_1121_AskHSteacher.txt", "pub_date": "2016-06-16T00:00:00Z", "Sentiment": "0.199", "Subjectivity": "0.392", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "342", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4o9l1o", "Reddit_id": "d4bel2u", "Subreddit_id": "t5_390yu", "Commenter": "hoybowdy", "length": "1971", "content_scrubbed": "I take seniors and late-year juniors through a three step process which is designed to help them figure out the college process before sending them to counselors.  \n\nFirst, I ask them to consider: What kind of learner are you?  What kind of classroom environment works best for you?   This first step is necessary, and MANY college counselors will skip it, sadly.  But the first thing you should do is look at the things which will determine what KIND of college is best for you, and what SIZE college and community would work best for you, because otherwise, you're searching randomly through tens of thousands of possibilities.  There is a HUGE difference in experience and expectations between a small liberal_arts college and a big university that specializes in, say, business and medicine, or a hands-on vocational college program vs. a generalized program with huge lecture classes.   Doing this step first allows you to figure out how to eliminate 90% of the colleges out there because the way they think of \"learning\" isn't a good match for YOU.  \n\nNext, how far are you interested in going?  What kind of geographical environment works for you?   What size community works?  This is not negligible, either.  If you plan on only going within two states of home, or prefer to be in warmer climates, this narrows your 10% down to 2. 5% or less of the schools out there.\n\nFinally, it[.] time to consider program.  What courses do you think you might want to take?  Or are you not sure - do you want a school that lets you explore for two years, instead of committing right away?  \n\nTake these things to your counselor AND to US News' ranked list of colleges.     Figure out a safety school, a \"reach\" school, and 3-5 more colleges that fit your criteria - by now, it should be relatively easy, as you're looking at a reasonable-sized pool.  Visit if you can, OR talk to people who have gone to those schools - online, in person, etc.  Enjoy the search.  Have fun.    "}