{"doc_id": "1970", "name": "2016_08_humanities_student_major_1197_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2016-08-humanities-student-major_1197_changemyview.txt", "pub_date": "2016-08-17T00:00:00Z", "Sentiment": "0.018", "Subjectivity": "0.309", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "416", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6l7cxi", "Reddit_id": "d6l8jsy", "Subreddit_id": "t5_2w2s8", "Commenter": "woxihuan", "length": "2506", "content_scrubbed": "I'm a graduate student. I am not the smartest graduate student, but I am also not the dumbest, and I certainly understand and engage in professional level discourse. My abilities aren't the issue here; the issue is systemic problems with jargon, specialization, and communication.\n\nMany academics fake an understanding of words and concepts that, if you press them, they don't actually understand, but that sound smart. This happens. People are lazy, people have egos, and people lie. Want proof? There[.] the oft mentioned Sokal paper, or if you want more consistent, modern results, check out Said, Arendt, Warner, or spend some time on the New Real Peer Review Twitter for a laugh and a chill. There are bad academics out there. Good luck trying to disprove that. There are.\n\nThe trick is to be smart enough to also admit that your discipline is certainly not beyond reproach when it comes to abusing a semblance of intellectualism. Anyone who can't admit to that is being defensive. We need to critically and reflexively examine our own roles in the academic system as a whole as well as that system, and that means being honest about the flaws and weaknesses in the higher level Humanities. \n\nI'm instantly suspicious of anyone who tries to accuse me (or other people who criticize the system) of being too stupid to understand, because that[.] playground-level mudslinging in an attempt to obfuscate the issue and shift attention away. \"Of course the writers know what they're talking about, it[.] you who doesn't get it, so it[.] your fault and your flaw.\" That[.] analogous to literally every other system of control - marginalized and shift blame onto the individual so that the systems remains free of critique. The mudslinging is a fear response; you don't want to be posited as a threat to the system because it affects your position and power in relation to the system. It[.] easier to shift the blame to detractors than to address systemic problems. \n\nThis doesn't mean there aren't good academics or that specific language isn't beautiful and clean; there is a poetics of advanced academic writing and thought. Some writers manage clarity and complexity well, other don't. The total system is and should be discursive, but that doesn't mean we don't have the ability to look critically and voice concerns - without accusing the critics of stupidity, perhaps, although those kinds of ad hominem attacks generally illustrate the weakness of the defensive position. Discuss the ideas, not the people."}