{"doc_id": "1936", "name": "2016_08_humanities_student_major_890_tefl", "namespace": "we1sv2.0", "metapath": "", "pub": "TEFL", "title": "2016-08-humanities-student-major_890_TEFL.txt", "pub_date": "2016-08-13T00:00:00Z", "Sentiment": "0.091", "Subjectivity": "0.311", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "904", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4xfcgl", "Reddit_id": "d6g9nfg", "Subreddit_id": "t5_2qq76", "Commenter": "inactivex", "length": "5051", "content_scrubbed": "I did liberal_arts and 4+ years without a TEFL cert. \n\n\nThe hagwon will groom you to their expected standards. \n\nSome of the things they will look for while evaluating you are mostly common sense but I'll lay a few things out anyway...\n\n* Voice - Do you speak too fast? Slow? Are students in the back row able to hear you loud and clear? Do you mumble? Is your voice monotonous? Anything I've missed would be picked up from a basic public speaking lesson. \n\n\n* Body language - Do you stay stationary in front of the board or do you actually go from student to student and make sure they've done their work and aren't just scribbling while you talk?\n\n\n* Notes - Do you write big enough on the board for the students in the back to see? Do you write down anything important? Is your information simplified enough?\n\n\n* Discipline - How well do you control your class? How long do you let things slide? How will you get your message across? How will you be able to explain a student[.] actions to them and prevent repeated offenses? Are you able to dish out class control AND finish your lesson before the end of class? \n\n\n* Praise - Do you give out praise? Do you give out praise equally? Your employer wants to see how and how much you will recognize a student[.] achievements. They want to see if you'll be able to send a kid home with a positive attitude so they will tell their parents how much they're enjoying your class. Don't expect these kids to \"figure it out\" or \"realize by themselves\" how you feel about them. You may need to spoon feed certain kids. \n\n\n\nA good way to flex your nerves out would be to get a friend or a family member. Tell them to talk, behave, and ask questions like a child would. Obviously they shouldn't act like a spoiled brat and not ask a billion questions (though you will have some students who do this).\n\n\nI would attach a clip on mic to your collar or shirt button during your practice sessions (hopefully you will be bringing enough teacher-appropriate clothing with you). After your session, listen to how you speak and how you answer your practice buddy[.] questions. \n\n* Do you think you answered the student[.] question well enough? If you were the student, would you understand your own explanation (assuming English is your first language etc etc) ? \n\nYou don't have to be friends with the staff at your school but establish boundaries and have constant communication with them. They will be the ones speaking with your students' parents and finding out whether or not your student understood the material well enough. If a staff member comes to you with concern or a complain from a parent regarding your lesson or teaching method, don't take it personally but don't dismiss what[.] being said and figure out how you can work with the affected student and try to cater to what your employers are asking from you.\n\n\n* No matter how educational they are, if you receive a complaint or if your employer disapproves of your use of videos or memes or whatever in the classroom, stop it. It doesn't matter if they're scientifically published journals from Harvard or if it[.] the best thing any Korean would love to hear about their country. It doesn't matter if your coworkers are getting away with it.  They specifically don't want you doing it.\n\n\nDon't be embarrassed and don't wait too long to ask a staff member about problem students or just students not understanding your lessons well. The parents usually disclose issues with their children with the staff members or if your staff members are good enough, they usually pick up on why student abc is behaving like an xyz. \n\nWorking together and having the staff know you're dealing with issues is better than not saying anything and being the grumpy foreigner who just yells at children. If the staff are aware of what[.] going on, they'll cut you slack if there[.] an issue with a problem child instead of evaluating you as someone who doesn't control the class. \n\n\n* You will have students whose parents don't care and a majority of your time in class may be disciplining them because obviously it[.] not being done at home. You may have administration that will also not care and would rather continue accepting tuition fees from the parents. There[.] nothing you can do except roll with the flow and defend yourself when needed. Avoid singling the problem child out and especially avoid using their name even when there are no students around.   \n\n\n* Also take this as a red flag because eventually other students will get fed up or the problem child and have their parents transfer them out to other schools. Beware if you start getting blamed for things outside of your control. The management at these schools are toxic and will do things like screw you over for pay or certain benefits. \n\n* If your quailty of life isn't affected too much, stick out the rest of the year if you can but you don't have to stay in a toxic school. You'll have to do your own reading about jumping ships but it[.] not uncommon if you want to change your job here mid contract. "}