{"doc_id": "1930", "name": "2016_08_humanities_student_major_816_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2016-08-humanities-student-major_816_UofT.txt", "pub_date": "2016-08-12T00:00:00Z", "Sentiment": "0.18", "Subjectivity": "0.435", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "410", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4xfv7r", "Reddit_id": "d6f660j", "Subreddit_id": "t5_2rbaq", "Commenter": "winstonl", "length": "2370", "content_scrubbed": "Well, in the real world, people need a number of different skills to making a living, not just their own \"subject\".\n\nI did graduate work in statistics, and while that[.] the major part of my job, I also do things like proposal writing, creating decks, presenting and speaking to others. All of these skills I didn't not learn from REAL ANALYSIS, VECTOR CALCULUS, or fucking QUANTUM MECHANICS. And yet, these are important skills. As a science grad, you often see that those who are better (here specifically referring to those having higher titles and making more money, not saying they are better in other ways) are often those who excel at both the quantitative stuff and the qualitative stuff. I'd assume the same for humanities grads. Those that do well tend to be good at writing and are able to think analytically.\n\nLet[.] be objective here. Yes the arts folks aren't required to take real analysis, or quantum mechanics, but they are required to take some science course. You are also not required to take the most difficult English or History or Political Science course, you are simply required to take an introductory course so you know a little something about their subjects. There are many BSc-friendly humanity courses, and the first year seminars, or some \"bird courses\" that you can choose for yourself. The advantage of being at UofT is that there are so many courses you can pick and your options are basically unlimited. If you actually want to learn something, take a course that you are interested in. I look a first year seminar called the Dialects of Dialects (something like that) and one of the most remarkable thing I learned (which I still remember today) is that linguistically, people consider two languages dialects only if they are mutually understandable. To this day, at work when I meet a Mandarin or Cantonese speaker, I'd tell them this little fact and tell them that although you believe they are dialects, they actually aren't by definition. When I tell people this, they'd always appreciated this anecdote and I also made myself sound intelligent - they think that I don't just know stats, I also know many things - and this is a great way to start a new convo with something I don't know but want to know (e. g. a new colleague, a client, etc). You see, it[.] not entirely useless their lame ass humanities courses to graduate, right?"}