{"doc_id": "108", "name": "2016_06_humanities_student_major_1114_lostgeneration", "namespace": "we1sv2.0", "metapath": "", "pub": "lostgeneration", "title": "2016-06-humanities-student-major_1114_lostgeneration.txt", "pub_date": "2016-06-15T00:00:00Z", "Sentiment": "0.205", "Subjectivity": "0.333", "Score": "18", "Upvotes": "18", "Downvotes": "0", "Wordcount": "443", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4o8i5n", "Reddit_id": "d4b7noy", "Subreddit_id": "t5_2r40j", "Commenter": "lilkuniklo", "length": "2445", "content_scrubbed": "I can understand the frustration but at what point should people take responsibility for their choices? Liberal arts and humanitarian degrees are supposed to teach you research skills, but how often do people actually research the realities of their degrees before they commit to studying it for 4+ years?\n\nBack in 2006, I was a biology major. Then I looked into it and realized that with a bachelors degree, it would be a blessing straight from heaven if I was lucky enough to to find a research assistant job that would pay a whopping $10-12/hour. (In comparison, I was making $9. 50 at my pocket money retail job.) \n\nIf I wanted to make a living at all as a bio major, I would have to pursue a PhD, most likely move and pay out of state tuition, and have to compete with a hundred other desperate applicants in the hopes of being recruited to a research team.\n\nScrew that. I changed my major to nursing the following semester and haven't looked back. I make $35/hour doing a 3 day work week and I travel for leisure about every 3-4 months. My job is hard but it[.] emotionally fulfilling. Best decision I ever made. \n\nI know the whole \"they lied to us\" position gets used a lot on this sub, and it[.] partially true, but why were people so trusting of \"they\" to begin with? I got fed the same bull but I used my research skills to actually research my prospects and went with the one that would yield a nice return on my investment. It took me like 10 minutes of googling and find out what degrees were marketable and which ones were best pursued as hobbies or armchair interests. \n\nBTW, if OP is interested in sticking with the field of psychology, they now have Psychiatric Mental Health Nurse Practitioner degrees (master[.] level) that do not require a BSN degree. (Although a BSN background would definitely be a huge asset.) Might be worth looking into. PMHNPs can work out of their own office, diagnose and write scripts for meds, and provide therapy under the oversight of an MD.\n\nThere is currently a critical shortage and jobs start out in the $90s to six figures. If you look up \"best paid NP jobs,\" it consistently makes the top 10. I know people who are getting job offers before they even graduate and sit for boards. The government is finally starting to pay attention to mental health needs of the nation plus boomers are getting older and veteran nurses are starting to retire, so it[.] a good time to get in on the ground floor. "}