{"doc_id": "2029", "name": "2016_08_humanities_student_major_1829_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2016-08-humanities-student-major_1829_changemyview.txt", "pub_date": "2016-08-24T00:00:00Z", "Sentiment": "-0.045", "Subjectivity": "0.359", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "353", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6virtq", "Reddit_id": "d6vmyyl", "Subreddit_id": "t5_2w2s8", "Commenter": "alighieri00", "length": "2046", "content_scrubbed": "Going to have to jump in here and disagree with the \"dialogue isn't necessarily what college should be about\" part...\n\nIf you're dealing with *a priori* knowledge where there is little debate, e. g., math, engineering, then ok, I can get behind the \"listen to the prof teach\" mentality. But in pretty much any humanities field (Lit, Music, Art, Dance, History, Psychology, Sociology, Philosophy, Education, etc., etc. - basically anything that is open to interpretation) dialogue is *the point* of college education. We don't have \"Socratic seminars\" in school for the hell of it; question and answer, problem and solution, dilemma and conclusion lie at the very heart of nearly all education. To put it another way:\n\nIf I tell you that you're doing something the wrong way, unless you have a *very* high opinion of my skills you will try it your way regardless. Doesn't matter if it[.] woodworking or analyzing *To Kill a Mockingbird*. Once you done fucked up you will recognize the wisdom of my words and then adhere to them from there on out. Dialogue provides that opportunity for you to realize you done fucked up in a classroom setting, allows you to see the error of your ways, and then allows you to become educated. People don't learn by being told what to do. They learn by doing. Which is what dialogue is - you spout out your shitty idea, I, as a professor, tell you why it[.] dumb, and you and everyone around you learns. Without dialogue students are simply copying notes on a piece of paper to be memorized for the test and then forgotten. Dialogue allows real learning and - I know this is astounding to some of my colleagues - occasionally the student is **right!** Sometimes, despite our years of experience and countless accolades, the student has a really good idea. And then everyone learns. Being a professor does not make you the fount of knowledge - it makes you a slightly less ignorant source of information about a topic. \n\nTL;DR: College is not there to indoctrinate, but to encourage thought.\n\nSource: Am a professor. \n\n"}