{"doc_id": "1870", "name": "2016_08_humanities_student_major_310_lesbianactually", "namespace": "we1sv2.0", "metapath": "", "pub": "LesbianActually", "title": "2016-08-humanities-student-major_310_LesbianActually.txt", "pub_date": "2016-08-05T00:00:00Z", "Sentiment": "0.19", "Subjectivity": "0.475", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "390", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4wblko", "Reddit_id": "d65sue3", "Subreddit_id": "t5_3f5dt", "Commenter": "laurenloves", "length": "2125", "content_scrubbed": "Hey there! I'm super excited to talk to you about all this! I'm profoundly deaf as well (about 70% loss). I'm not compatible with hearing aids and I know some ASL, but I grew up mainstream so I lipread and whatnot. I'm absolutely pumped to answer all these questions, so here goes!\n\nI'm worrying about is what if the other person decides I'm too much work?\n\nI'm 22 and I've been dating girls since I was 16 and it[.] NEVER been an issue. Most people are really accommodating and if you play it off casually and can laugh about it like I do, no one ever gets annoyed by it. \n\nWhen I go to College/University, how do I get out and find other gals?\n\nLet me tell you about the biggest secret for deaf people: Rochester Institute of Technology. I just graduated from that college and it[.] absolutely amazing, you have to check it out. It[.] a large school with focuses in sciences, photography and liberal_arts. Also, the National Technical Institute for the Deaf (NTID) is part of the college. What that means is that you get free hearing devices, the option for all your classes to have a notetaker, live captionist and even ASL interpreters! The best part? You can go to this amazing school as an RIT student BUT you get NTID tuition, which means that without scholarships a years worth of school is about $25,000 which is infinitely cheaper than what most people spend (and with scholarships it[.] basically nothing, I spent $5,000 per year to go). \n\nSO, you should definitely go to RIT/NTID, I'd be more than willing to give you a tour (I still live in Rochester, NY and am involved with the school and LGBT community), answer all your questions, anything. On top of that, the college and city has a MASSIVE LGBT population so finding a girl is not an issue (and since Rochester is the unofficial deaf capital of the world, most people know ASL and no one has a problem dating someone who is hard-of-hearing). \nI know I just spilled a lot of information and it[.] a lot to process, but if you want to talk more (deaf lesbian to deaf lesbian) or want to talk about college, definitely send me a PM and I'll give you my number. :)\n"}