{"doc_id": "213", "name": "2016_06_humanities_student_major_2104_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-06-humanities-student-major_2104_AskReddit.txt", "pub_date": "2016-06-29T00:00:00Z", "Sentiment": "0.032", "Subjectivity": "0.237", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "336", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4smdo8", "Reddit_id": "d4t5zqa", "Subreddit_id": "t5_2qh1i", "Commenter": "TheWordShaker", "length": "1912", "content_scrubbed": "Good rave story:       \nWe were at this alternative rock concert. You don't typically find ravers there, but, oh my god, there[.] always this one, totally-out-of-it dude in the back. Harmless enough, just doing his thing, maybe takes his shirt off and dances weird.        \nI am there with my parents - who have no clue about drugs what. so. ever.         \nThis shirtless guy gets tired of dancing in the empty space at the back of the crowd, he gets lonely. So he goes up to the last row and just starts kinda-jumping along (he was just bending his knees and standing on his toes, really).        \nThen he goes into his pocket, looking for something. Cigarettes come out, lighter, he smokes - but he doesn't quit messing around in his pockets. Probably the fabric felt super soft.        \nPoint is: I see how he sticks his hand into the pocket of the fat guy next to him. But not maliciously, he just put his hand down standing to close to the guy, shoulder-to-shoulder, and this guy is wearing baggy jogging pants for super-fat people.       \nAnd he goes to town in there for a couple of seconds - until the fat bastard goes \"YAGH! WHATTHEFUCK!!!\".      \nRaveGuy had hit dick, methinks.       \nI went in between before the guy could get pummeled and explained what I saw, that this guy doesn't really understand reality right now. To be honest, all those negative vibes from around him - the guy was crying, alright?        \nGrown-ass 30-something at a rock concert, going from having the time of his life to making one mistake that ruins it.            \nSome metal guys took him to get some water at the Red Cross tent (\"Yeah, man, you're one of us now. Look, are you thirsty? We gonna go get some ice cold water. Very refreshing. You wanna tag along, man?\").        \nThe fun bit was explaining to my parents how I could spot MDMA symptomes and knew what to do about them. I am a liberal_arts student ..... FML"}