{"doc_id": "2012", "name": "2016_08_humanities_student_major_1607_seattle", "namespace": "we1sv2.0", "metapath": "", "pub": "Seattle", "title": "2016-08-humanities-student-major_1607_Seattle.txt", "pub_date": "2016-08-22T00:00:00Z", "Sentiment": "0.035", "Subjectivity": "0.398", "Score": "32", "Upvotes": "32", "Downvotes": "0", "Wordcount": "305", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4z34wt", "Reddit_id": "d6skx1g", "Subreddit_id": "t5_2qhad", "Commenter": "Throwaway100kBFA", "length": "1727", "content_scrubbed": "Throwaway for obvious reasons.\n\nThis is going to seem harsh, but please believe me when I tell you it comes from a good place. \n\nIn my honest opinion, no it[.] not worth it.  I graduated from Cornish about 15 years ago. I ended up with over 100k in student loan debt and a completely worthless degree to show for it. \n\nThe overall education I received there was shoddy. It truly is an arts conservatory, NOT a college! The \"humanities and sciences\" classes are a joke. Aside from your chosen major, you pretty much learn as much as you force yourself to. I graduated without ever having written a proper research paper, or even an essay. \n\nWith no real-world skills or education, I walked out utterly useless for the current job market. My options were pretty much take out more loans and go to grad school, or work as a barista and start paying those student loans down. 15 years later and yep you guessed it-  still working in food service. Still paying those student loans down. Many of my classmates are living back at home and working service jobs well into their 30[.].\n\nIt[.] not *just* Cornish though- it[.] art school in general. I'm embarrassed to tell people I went to art school, people laugh at me whenever they find out. \"Wtf were you thinking??\" is the most common reaction, followed by shrieks of hysterical laughter. \n\nMy best advise: skip film school. Make your own work. Read everything you can, go to art galleries, meet other artists and find projects to collaborate on, watch all the great films and documentaries you can. Watch the bad ones too! Find your voice and develop your own interests and style. Also read True and False by David Mamet. \n\nSave yourself while you still can!!!\n\nEdit: words words words"}