{"doc_id": "107", "name": "2016_06_humanities_student_major_1107_gendercritical", "namespace": "we1sv2.0", "metapath": "", "pub": "GenderCritical", "title": "2016-06-humanities-student-major_1107_GenderCritical.txt", "pub_date": "2016-06-15T00:00:00Z", "Sentiment": "0.004", "Subjectivity": "0.261", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "357", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4o81z7", "Reddit_id": "d4b2qsf", "Subreddit_id": "t5_2yk5v", "Commenter": "othlia", "length": "2020", "content_scrubbed": "I've been out of school for a few years and am going into grad school this fall. I'm pretty worried on the amount of Kool-Aid--but I absolutely plan to be a radical feminist presence on my campus. When I was an undergrad, I was actually the president of my university[.] feminist club. \n\nWe had a Women[.] Center and an LGBTQA center. Both were run by two very well meaning but sometimes tone deaf white people. There[.] nothing quite like 2 white people running a panel about diversity to a group of students that had to be about 80% Latino. I don't really recall any moments of insanity (this was 2010-2014, btw). We held the Vagina Monologues every year, no problem. (I've always had my reservations about some of the monologues--you know which ones.) \n\nShortly after I graduated, the gay white man who was the director of the LGBTQA center left and was replaced by... another white guy--except this new director wanted to be referred by they/them pronouns and literally looked like any regular old middle-aged guy working at a university. I remember looking at his picture and just being amazed. \n\nI was deep in the mainstream feminist pool (I organized a panel on men being feminists and on BDSM) but in my last year, I was slowly shifting over. A man on campus who had repeatedly verbally harassed me had once brought up a famous woman (forgot who) who made some comments on Twitter about how cutting off your penis doesn't make you a woman (or something like that) and he so desperately wanted my approval to shit on this woman. I knew he didn't give two shits about anyone, let alone this feigned concern to trans people, I just knew he wanted a feminist to tell him it was okay to hate another woman.\n\nDespite my heavy involvement on campus activities, I was a business major, so I was pretty safe from dealing with the nightmares that might have been happening on the Humanities side of things. (Also double helpful in that I could piss off as much of the Humanities faculty I wanted--I was basically untouchable.)"}