{"doc_id": "1927", "name": "2016_08_humanities_student_major_757_outoftheloop", "namespace": "we1sv2.0", "metapath": "", "pub": "OutOfTheLoop", "title": "2016-08-humanities-student-major_757_OutOfTheLoop.txt", "pub_date": "2016-08-11T00:00:00Z", "Sentiment": "0.012", "Subjectivity": "0.256", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "308", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6e1xe8", "Reddit_id": "d6e3wzb", "Subreddit_id": "t5_2xinb", "Commenter": "yashendra2797", "length": "1908", "content_scrubbed": "**A)** This isn't /r/explainlikeimfive \n\n**B)** Saying that \nthe subcontinent has a progressively higher Muslim population the closer you get to Central Asia\n\nIs like saying the ocean gets deeper the farther you go. Its just way too general. \n\nPre 1947 (independence), there was never any such Hindu-Muslim divide as you're saying. The percentage of the population divide between Hindu-Muslim was relatively similar as the modern day. While current day Pakistan and Bangladesh had a higher level of Muslim population than the rest of India, you're negating the fact that this was just like modern India, where people of all faiths lived together. \n\n**C)** There was never *any* form of voting. Which is one of the reasons Pakistan is so hell bent on Kashmir. Indians and Pakistanis never voted for partition. The fight between Jinnah and Gandhi, and Gandhi[.] arrogance to not even lend a ear to Jinnah is what caused Jinnah to say fuck you to the Indian National Congress. The demarcation of boundaries was also totally arbitrary, and done by the EIC, as in the people we were kicking out.\n\nPeople were literally given a dozen days to vacate their lands where they'd stayed since decades and move to the country made 'for their religion'. Meanwhile this gave the bigots and racists legitimacy to go out and massacre the others. Millions upon millions were killed, and most died from rioting rather than the trip from Pakistan to India or vice versa. \n\n**D)** I did not write my own answer, because while I know enough to point out any obvious fallacies in your answer (which can be done by any 11th grade Humanities student), I am not qualified enough to give a proper answer on this issue which covers all the varied topics from all the varied corners of the problem. \n\n**E)** Here[.] what you should read: https://www. reddit. com/r/AskHistorians/comments/3ip9vm/what_is_the_kashmir_conflict_why_has_it_been/?"}