{"doc_id": "34", "name": "2016_06_humanities_student_major_315_houston", "namespace": "we1sv2.0", "metapath": "", "pub": "houston", "title": "2016-06-humanities-student-major_315_houston.txt", "pub_date": "2016-06-04T00:00:00Z", "Sentiment": "0.316", "Subjectivity": "0.472", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "273", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4mhj6o", "Reddit_id": "d3vqv52", "Subreddit_id": "t5_2qj1l", "Commenter": "Golfandbbq", "length": "1506", "content_scrubbed": "Welcome!  Hedwig is a really nice area. I don't know what your monthly budget is, but I would happy to suggest places to live in the area (or other areas, depending on your interests) so feel free to PM me.  I work in the housing industry so I have pretty detailed info.  \n\nIn general, Houston is a great place to live. People are friendly, food is really good and housing is relatively affordable. \n\nThe summers are very hot (north of 37 degrees centigrade regularly) and cool weather doesn't arrive till early October usually. That said, October-April is actually quite nice.  We keep getting flooded as a result of a bad El Nino year, but it[.] not normal for our city to flood several times per year. \n\nYou will need a car, and as others have mentioned, a toll tag. \n\nOur parks are actually really nice and we have a lot of them. \n\nThe arts scene is strong and worth exploring if that[.] your thing. \n\nIf you're feeling a bit homesick, Richmond Arms and The Red Lion Pub are both great pubs and in my opinion, very authentic to what I experienced in traveling to England.  \n\nChances are, you will fall in love with Mexican food, cheeseburgers and BBQ. We have lots of that. Your tastebuds will thank you, your waistline may not. \n\nYou're driving distance to a lot of fun places including Austin/Texas Hill Country and New  Orleans. \n\nIf you're into golf, it[.] a great town. We have tons of good courses you can play. \n\nIf you like to hunt or fish, plenty of that as well. \n\nWe hope you enjoy your stay. \n"}