{"doc_id": "2026", "name": "2016_08_humanities_student_major_1778_law", "namespace": "we1sv2.0", "metapath": "", "pub": "law", "title": "2016-08-humanities-student-major_1778_law.txt", "pub_date": "2016-08-24T00:00:00Z", "Sentiment": "0.146", "Subjectivity": "0.335", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "316", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6v0v84", "Reddit_id": "d6v1xw5", "Subreddit_id": "t5_2qh9k", "Commenter": "epoxyresin", "length": "1809", "content_scrubbed": "I'm not sure what you mean about the private school costs.  Most PhD students aren't paying any tuition (masters students do pay some).  If anything, benefits that we get are going to be paid for by undergraduate tuition.  And really, the point of this ruling is that graduate students are employees.  This ruling affects the employee aspect of being a grad student (hours, pay, benefits), not the student aspect of being a grad student (education).  NYU[.] old union got in some amount of trouble because they were trying to meddle too much in the academic decisions of the university, which it[.] been made clear are probably solely the decision of the administration.\n\nIt[.] an interesting issue.  I'm in the physical sciences, and the truth is, we get treated pretty well.  Also, when there is a big problem, it tends to be between the student and their adviser, which it[.] unclear how much a union could help with that.  Generally, in fact, the way we currently deal with it (if at all) is by getting the department involved (or just bailing).  I tend to think of a union as being most useful in dealing with the administration, but truth be told we have a very good department administration.  Now, I do recognize that this could change in the future, but we know that forming a union right now would change that dynamic.\n\nIn the cases where there are unions, (I know this is true of NYU and I believe at least some public universities as well), research assistants in the sciences are excluded from the bargaining unit (it[.] fairly different than being a TA, so our concerns are definitely different than say someone who[.] in the Humanities and only gets paid when they're a TA).  Which is fine, but means we're in or out of the union different semesters depending on how we're getting paid that semester."}