{"doc_id": "2023", "name": "2016_08_humanities_student_major_1732_kotakuinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "KotakuInAction", "title": "2016-08-humanities-student-major_1732_KotakuInAction.txt", "pub_date": "2016-08-24T00:00:00Z", "Sentiment": "-0.008", "Subjectivity": "0.264", "Score": "21", "Upvotes": "21", "Downvotes": "0", "Wordcount": "441", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4zbgk5", "Reddit_id": "d6ujoed", "Subreddit_id": "t5_33726", "Commenter": "kekkomatic", "length": "2630", "content_scrubbed": "Congratulation, Christopher C. Rogers. You just lost a viewer.\n\n \"That[.] actually a huge and unintentional benefit of our show. We didn't set out to tell that story, but actually think we can do good in the world by telling exactly what happened.\"\n\nNo, you are already misguided about GamerGate, what makes me think you didn't exaggerate historical facts to further an agenda? But what do I expect? This show has one of the most inconsistent character developments I've ever seen, worse than a Spanish soap opera. You and the other writers already [](#s \"maimed Gordon in season 2, from a competent and cautious engineer to an addicted, crippled, inconsiderate amateur. \"Hey guys! Remember the time when I was addicted to cocaine, but then I wasn't because I threw it in the garbage at the end of the episode?\" - \"Uh-oh! I just destroyed Cameron[.] business with bad code. Plz forgive me!\"\")\n\nThis is what I expect from season 3: Joe[.] new company pulls some outlandish sexist bullshit like they only hire men, or allow only male executives to give press releases, or push women to the back for a company photo. Or Gordon does some stupid shit that forces Donna to divorce him, it[.] about time to witness yet another unneeded turn of events. I'm expecting this show to be ideology-driven and not story-driven, based on history. So, not for me anymore. At this point, they could just rename it \"Men can Die in a Fire\". If I'm wrong I'll gladly acknowledge my mistake.\n\nHow about instead, you show that something, someone, outside of Silicon Valley, outside of academia, outside of scientific circles, convinced young women across the world that \"you don't need brains to succeed\". Look elsewhere, look at think tanks, lobbyists and media.\n\n Rogers noted that the levels of female enrollment in graduate programs for women in science, technology, engineering, and mathematics were higher in the '70s and '80s than they are today. He said the real reason for that is the way computers were marketed as \"toys for boys,\" and the idea that math and science should be a male-dominated field, and that women were probably better at the arts.\n\nYes, \"toys for boys\", he[.] getting there but not quite at the center. We have more women CEOs for IT companies than there were 30 years ago, and a number of them actual engineers. The explosion of independent publishing, combined with the free and open availability of programming courses means that everybody, regardless of sex, can make a career, and succeed based on the quality of their work.\n\n[Not all advertising in the 80s was aimed at boys.](https://www. youtube. com/watch?v=vLwTLpGzBB4)\n\n"}