{"doc_id": "2019", "name": "2016_08_humanities_student_major_1685_shitpoliticssays", "namespace": "we1sv2.0", "metapath": "", "pub": "ShitPoliticsSays", "title": "2016-08-humanities-student-major_1685_ShitPoliticsSays.txt", "pub_date": "2016-08-23T00:00:00Z", "Sentiment": "0.111", "Subjectivity": "0.25", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "403", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6tqgo5", "Reddit_id": "d6ttzq4", "Subreddit_id": "t5_2vcl0", "Commenter": "mousylion", "length": "2353", "content_scrubbed": " That[.] why you can't make a living doing it.\n\nI'm going to have to call bullshit.  Plenty of people make a living playing art because the arts have the potential to offer value to society.  Most people are nor will ever be robots.\n\nThe problem is that people are so inundated with art on a daily basis we've developed decent, critical tastes.  Good art[.] so ubiquitous that we don't even notice when it works--music in ads or movies, the ads themselves that sell products, etc.  There[.] an aspect that[.] marketing and entertainment, yet both are inherent to the economy based on how we've built it.  Know how many people produce the big budget movies in Hollywood?  What about AAA video games?  Sports programs?  There[.] a lot of paying jobs that come from art.\n\nThat logo on your coffee cup?  Someone designed it.  The song playing on that TV show/movie/video game?  Someone wrote it to enhance the product.  Art stands on its own, too.  We develop our own notions of individuality, communal interests, and personal feelings through many aspects of art in both the macro and micro aspect.  Look at countries where art[.] been censored or outright banished; it[.] the first loss of individuality that promotes economic freedom and success.  Soviet Russia and China were and are, respectively, major powers on the world[.] stage.  But they've also taken to censoring art.  Why?  If it was secondary or parasitic to industry in a free society, why would it exist in theirs?  Why relevance would it have?\n\nThe world always needs artists.  But we need ones who can make products that stand on their own--products worth buying.  The writer who inspires within generations values that subconsciously make them more tenacious, empathetic, or wise does something good for society.  Same with the composer whose music keeps the man who works sixty hours a week from offing himself at the end of it.  Sure, you're going to run into some deadbeat artist selling Pollack ripoff[.] is, but give him a job at a graphic design firm and maybe that eye can forge the logo on the cup of coffee that means the difference between a thousand cups sold in a day, giving jobs to people who need the money to provide for themselves and their families.  You can't tell me there[.] no value in that, nor can you say there[.] not a symbiotic, rather than parasitic, relationship there."}