{"doc_id": "216", "name": "2016_06_humanities_student_major_2133_personalfinance", "namespace": "we1sv2.0", "metapath": "", "pub": "personalfinance", "title": "2016-06-humanities-student-major_2133_personalfinance.txt", "pub_date": "2016-06-30T00:00:00Z", "Sentiment": "0.045", "Subjectivity": "0.399", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "398", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4tibw2", "Reddit_id": "d4tp445", "Subreddit_id": "t5_2qstm", "Commenter": "xlava", "length": "2203", "content_scrubbed": "No problem. I feel like I've been a lurker around here too long. \n\nPart of this failure is on the system of education that breeds such a lack of understanding. There are a few pieces of critical information / advice I would give new college students. I kinda wish there was a place I could post said advice so that more people could see it, but I'm unaware of such a place (if you know of one let me know, I think such a message would be well received since I'm a recent college graduate). It boils down to this: \n\nCollege is no longer an affordable, general liberal_arts education like it was 50 years ago. First, if you do not have a specific reason for going to a top ~100 school that is usually going to cost you $200k, don't. You're better off getting an education that is only slightly less good at a school that'll cost you 20% of that. Second, do not go to college to obtain an un-marketable degree, and make sure you understand the market opportunities / future potential of your degree. A degree is only un-marketable if *you* do not understand how to market it. The area of your degree doesn't matter if you understand your market and how to properly navigate it.\n\nI agree with you, situations like this are a tragedy. We as a society need to do a better job of educating young people about the dangers of [college] debt and why it is not always worth it. I also agree with another poster here too that $200k isn't worth any opportunity/experience in the world, and it is usually not worth a degree unless you're planning on going to a feeder school for a top graduate/law/medical program, which usually feed into ultimately incredibly high paying jobs, making the debt easily paid off. I don't think it[.] entirely OP[.] fault he[.] in this mess. It[.] also hugely on his parents and trusted adults in his life for not making his 17 year old self realize that loan companies are the manifestation of hell itself in our world, and that it would be a poor decision. Dunno, this whole thing sucks. It[.] also a fucking disgrace that a \"first world\" country like the US still puts people in this situation while many other countries overseas are providing affordable education. Absolutely despicable."}