{"doc_id": "125", "name": "2016_06_humanities_student_major_1226_askwomen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskWomen", "title": "2016-06-humanities-student-major_1226_AskWomen.txt", "pub_date": "2016-06-17T00:00:00Z", "Sentiment": "0.021", "Subjectivity": "0.461", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "304", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4dfd3b", "Reddit_id": "d4dze2t", "Subreddit_id": "t5_2rxrw", "Commenter": "grapefruit855", "length": "1728", "content_scrubbed": "I think that on a undergraduate level it is apparent that some majors are more difficult to obtain than others. That difficulty depends on the individual pursing the degree and their abilities as well as the rigor and merit of the major they pursued. On one hand it would be unrealistic to assume that all majors are equally as rigorous. My school had an American studies degree which was basically a joke. Even the people I knew who got that degree agree. Could a similarly themed degree at another school be extremely rigorous? I definitely believe it. Now it goes without saying that some skills come easier to some people than others. My sister is incredibly talented artistically. I am not as talented. Now I think that people who work very hard to excel at whatever they are passionate about deserve respect. I also believe that you should feel pride in knowing that you chose to push yourself and challenge yourself to accomplish difficult things. I don't blame those who stayed inside the library all weekend while their peers were out at parties for feeling like they worked harder than some people in college. All the math and science classes I took were quite challenging for me and all the liberal_arts classes I took tended to be easier for me so long as I was interested in them. I can see where a similar experience might lead some people coupled with seeing their peers not studying as much lead people to believe that liberal_arts degrees are easier to obtain. Yet I chose to get a science degree because I was passionate about biology. College should be about following your passion. But I think if there is any inequality it lies in the education system creating majors in their universities that are fluffy. "}