{"doc_id": "12", "name": "2016_06_humanities_student_major_121_publicfreakout", "namespace": "we1sv2.0", "metapath": "", "pub": "PublicFreakout", "title": "2016-06-humanities-student-major_121_PublicFreakout.txt", "pub_date": "2016-06-01T00:00:00Z", "Sentiment": "0.008", "Subjectivity": "0.305", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "280", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3scg3w", "Reddit_id": "d3sgnnr", "Subreddit_id": "t5_2yrq6", "Commenter": "sleepswitheyesopen", "length": "1820", "content_scrubbed": "Except we are talking about a sect of religion, not a race. I agree that if you were to use that statement for a complete race, your a dick. This is a very specific sect of Judaism, though. The statement is basically on par with saying the Sea Org group of Scientologists are generally assholes. If you're not familiar with Hasids, you should read into it. Its fascinating, yet sad. \n\nSpecific example? Sure. East Ramapo, NY\nBasically what they are doing here is that, even though the Hasidic Community send their kids to yeshiva, the parents are still on the public school board. They often vote to defund the public schools and divert the money elsewhere. This has lead to about 100 teachers getting laid off, the arts and extracurricular have basically been eliminated from the public schools. Its gotten so bad some students are not able to earn enough credits to even graduate high school in 4 years. Not enough teachers for even a basic education. Some students are given 3 lunch periods.\n[Article](http://www. nytimes. com/2015/06/03/opinion/when-a-school-board-victimizes-kids. html?_r=0)\n\nAlso, they fought the city, here in NYC, to allow moyels to suck the tips of newly circumcised penises. That[.] right. Old men are sucking the tips of baby dicks. Doesn't sound that bad, you say? Well, what about the fact that they are spreading herpes while doing so? Sad, but true. Actually, the practice was never even deemed illegal. The city just wanted the moyels to have the parents sign a consent form allowing the moyels to perform the ceremony. The Hassidic community went apeshit. Now the parents dont even have to approve the ceremony. That[.] some archaic shit, if you ask me.\n[Article](http://www. nytimes. com/2012/09/13/nyregion/regulation-of-circumcision-method-divides-some-jews-in-new-york. html?pagewanted=all)"}