{"doc_id": "45", "name": "2016_06_humanities_student_major_448_the_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "The_Donald", "title": "2016-06-humanities-student-major_448_The_Donald.txt", "pub_date": "2016-06-06T00:00:00Z", "Sentiment": "0.075", "Subjectivity": "0.349", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "635", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4msmbk", "Reddit_id": "d3xzexf", "Subreddit_id": "t5_38unr", "Commenter": "NorthJersey908", "length": "3557", "content_scrubbed": "sad, so many people are brainwashed and taken in by the false prophet and his empty promises. It should be obvious to anyone that what Bernie was offering just was simply not attainable, not in a civilized world, not in a world of rules and not in a functioning society.  \nMoney does not grow on trees and while you can always print more money, that won't solve your problem. The more money is in circulation the less overall buying power each dollar has. It[.] not as valuable because it[.] not as hard to come by. So when Bernie says \"I'm going to make college free\" you have to ask, \"where is he getting the money from to pay for all those tuitions?\" The answer, in his case is either 1) \"Punish the rich for being successful\" and steal their money in taxes to pay for it 2) print more money and not only de-value our currency but allow the colleges to further ask for whatever they want (because it'll be guaranteed by the government that at least *the college* will get its money) or 3) a combination of 1 and 2.  \nTuition is so high because of the way student loans mostly work - at least from the federal student loans. The loans are taken out by the students, but paid to the colleges, the colleges get their money no matter what, it[.] the government that gets stuck having to collect from the student. They have to deal with collections, and going after delinquents. The college gets their money and never has to worry. And if a student doesn't secure the money for another term, they drop the student from enrollment and admit another. So since the colleges get their money, they can charge whatever they want and not care. Enough students will come up with the funding to secure enrollment in the school, no matter what they charge. If they ever go too high, the school either then has to scale back or fail.  \nCouple this with the unnecessary fees students are charged for attendance - maintenance fees for dormitory buildings even if they commute, they pay in part for athletic facilities even though they never use them, and my favorite - being forced to take classes that have nothing to do with your major because they're  \"core curriculum\". The accreditation bureaus force them to make students take \"humanities\" (and they keep changing the definition of humanities based on enrollment in certain classes - if enrollment is down in History, suddenly that becomes a humanities class until enrollment goes up), physical education (come on, forced gym class in college? I know some people need exercise but this isn't grade school), and other useless classes for let[.] say, and IT or STEM major. Those classes alone could get you out in maybe 2-1/2 years for a Bachelor[.] Degree if eliminated. They claim its in the name of making you a \"more informed, more educated 'well-rounded' student\". If I'm going to a college for IT, I wan't only relevant classes, and to gtfo as soon as possible to earn money in a job, not to be racking up debt in classes I don't need or whose knowledge can't really help me in my future job.  \nThere are many ways that the college tuition thing can be fixed, it can't be fixed though by just giving it away. You might as well consider it the 13th-16th grades then. College degrees used to be the thing that set you apart from other job candidates, it was a prestigious thing. now it[.] just another baseline requirement, which is why people who probably don't have to end up investing in Master[.] Degrees or something similar just to make themselves stand out. Lots of times that ends up making you \"overqualified\"   "}