{"doc_id": "2016", "name": "2016_08_humanities_student_major_1655_latestagecapitalism", "namespace": "we1sv2.0", "metapath": "", "pub": "LateStageCapitalism", "title": "2016-08-humanities-student-major_1655_LateStageCapitalism.txt", "pub_date": "2016-08-23T00:00:00Z", "Sentiment": "0.058", "Subjectivity": "0.382", "Score": "37", "Upvotes": "37", "Downvotes": "0", "Wordcount": "319", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4z6jjx", "Reddit_id": "d6tez2k", "Subreddit_id": "t5_39qgx", "Commenter": "amblers", "length": "1935", "content_scrubbed": "Coming from a guy who[.] been there, and who continues to be there: I was a computer science student in college, mostly because the career prospects were incredible. I switched from Literature and Philosophy, because the temptation was there and I didn't know better.\n\nEnjoy college. Ignore the bullshit about employment rates, post-baccalaureate salaries, etc. etc.; those are figures to make parents happy, and to load up debt on kids who don't know any better. They also serve, intentionally or otherwise, to keep you distracted from your studies. \n\nUniversity is probably the best opportunity to explore the world outside of the lens of working for wages. Don't want to be an engineer? Don't blame you. Now change majors. You said yourself you'll have to enter the job market after graduation, so why spend time doing something you hate? You'll be miserable either way.\n\nTake classes that interest you, that inspire you. I hate to sound like 'that guy' here, but if you take responsibility for your actions (that is, taking the classes you want to take in college), then at the very least you'll have had four good years, instead of 4 mediocre years of preparation for a lifetime of miserable bullshit.\n\nAnd who knows, maybe you'll wind up publishing the paper that unshackles us from the wage.\n\nSorry for the disjointed rant. This is constantly on my mind, and I couldn't begin to describe how full of joy this world can be.\n\n\n\nUnrelated: Calculus is an incredible topic based on a near-mystical level of treatment and dedication to describing real numbers. The very fact that we can create different types of infinities based on Cantor[.] diagonal argument, the continuum hypothesis, etc., blows my mind; differential calculus is one of humanities proudest achievements, without which our fundamental understanding of the world would be, and was, radically different. Let yourself be a little more curious about the small things :)"}