{"doc_id": "42", "name": "2016_06_humanities_student_major_432_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2016-06-humanities-student-major_432_changemyview.txt", "pub_date": "2016-06-05T00:00:00Z", "Sentiment": "0.093", "Subjectivity": "0.416", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "412", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3xhllp", "Reddit_id": "d3xix8t", "Subreddit_id": "t5_2w2s8", "Commenter": "grantos", "length": "2620", "content_scrubbed": "Though this is limited to an Australian context, I'm a high school English teacher and would argue the teaching of English doesn't necessarily create or teach critical thinking. From my understanding most Western English curriculums are heavily weighted towards literature. Literature is fictional and most of how you learn how to argue is based on something purely subjective. Being able to analyse a play or any fictional text doesn't necessarily translate into being a critical thinker. Being a critical thinker has to do with understanding the nature of knowledge - as it is socially constructed - in order to address things like bias, prejudice and logical fallacies. From my experience, I'd argue media texts would actually better deal with that, if you wanted to stick solely to an English curriculum format. However, would definitely agree that philosophy is perhaps more important. To pretend like bypassing English for philosophy would equate to not learning the language well denies the reality that you are always speaking in that language - whether studying humanities, sciences or arts - so it[.] a slippery slope to presume people[.] English skills would be neglected. Ultimately a lot of what English teaches you is actually to argue something that is highly subjective and based on interpretation with little room for dealing with the idea of objectivity (whether you believe it exists or not doesn't change the significant difference in discussing topics that deal with it or subjectivity exclusively).\n\nPhilosophy helps to deal with many of these issues of being a critical thinker and it doesn't do it in some implicit way. English curriculums tend to off-handedly teach critical thinking or do it in an almost propagandistically subtle and implicit way. A skill as important as it is today (I'd argue it[.] always been important) shouldn't be implicitly taught, but openly discussed and explicitly broken down and practiced - which is what philosophy does. Though this is speaking to university, I'd actually argue it should be introduced at least in secondary/high schools - I'm pretty sure I've also seen research that has shown it[.] had a positive impact on students when pilot programs of philosophy were introduced.\n\nTLDR: English curriculums don't necessarily teach critical thinking, but how to argue your interpretation of something almost exclusively subjective. Media sources are much better for dealing with critical thinking and objectivity, and philosophy arguably would be a pretty damn helpful replacement or at least compliment.\n\nEDIT: Forgot to add point specifically about philosophy."}