{"doc_id": "1923", "name": "2016_08_humanities_student_major_726_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2016-08-humanities-student-major_726_news.txt", "pub_date": "2016-08-11T00:00:00Z", "Sentiment": "0.063", "Subjectivity": "0.323", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "281", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6dh57d", "Reddit_id": "d6dif32", "Subreddit_id": "t5_2qh3l", "Commenter": "rebelkitty", "length": "1523", "content_scrubbed": "I would definitely say you know Lahore best, since you live there.  And it[.] been years since my mum was there (though I haven't heard it[.] got any more peaceful since 2009).\n\nHowever... there was one week when my mum couldn't go to a local bookstore because the police had blocked off the road in order to allow for a book burning to be conducted safely.  The bookstore was burned to the ground.\n\nA bakery in her neighbourhood had a molotov cocktail sort of thing tossed through its window - apparently the owner hadn't paid the baker his proper wages.\n\nAnd then there was the arts festival which had explosive devices go off twice - one the day before and one the day after she visited it.\n\nThe attack on the Sri Lankan cricket players (which did make the international news) happened just down the street from her home, and she spent all day inside, listening to machine guns going off.\n\nAnd on a very small scale (as in, not news), her maid[.] young son was beaten so badly by his teacher that he had to go the hospital to get patched up, and a young girl she knew was \"contracted\" to go live and work with another family, so couldn't continue her schooling.\n\nNot to mention the banker who expected to be bribed, the students who thought they could simply purchase their degrees, and the dean who told her, \"Of course they cheat!  That[.] how you know which are the clever ones.\"\n\nSo, it may not be \"routine\" exactly, but it[.] a heck of a lot more violent and (at least overtly) corrupt than we're used to here in Canada."}