{"doc_id": "1863", "name": "2016_08_humanities_student_major_256_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2016-08-humanities-student-major_256_RPI.txt", "pub_date": "2016-08-04T00:00:00Z", "Sentiment": "0.111", "Subjectivity": "0.454", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "370", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d64dyay", "Reddit_id": "d64exik", "Subreddit_id": "t5_2rg3u", "Commenter": "RPnigh", "length": "1978", "content_scrubbed": "Thank you for taking the time to reply. A few comments: \n\nI don't think a situation has to be bad for workers to want to unionize (in many countries unions are an accepted and valued player in labor relations). \n\nBeing paid to be a grad student is awesome. I value every second of it, and I understand the implications. I've done it before (I went to a funded master[.] program), and I cherish that opportunity. I'm happy to work as a TA for RPI for my PhD, and I expect to work hard. \n\nI also think working 20 hours a day is inhumane. No one should have to do that or think it[.] expected of them. I have no problem with folks who want to do more than 8 hours of work a day (I do it often too), but I don't think people should be valued less if they're not willing to make themselves miserable for their research. I think unions help make sure the student[.] pay and benefits are as good as possible. I'm honestly surprised that some might not think that was a good thing.\n\nI do also think our work cultures might be different: my field has much more inconsistent funding, and \"success\" is a looser, more subjective term. Here, the pressure of being paid fairly is much more pressing, as there are even less professional opportunities once we finish whatever program we're in than for scientists. There is very little industry to speak of that we can fall back on if we don't find a teaching position. \n\nI think this is a really important dialogue that should be happening between arts / humanities / sciences / etc: what is your working environment like? what is expected of you, what do you expect of your colleagues? I guess if you're in the lab 14-18 hours a day you might not have time to think about that, and I won't force you to do it, but I would argue that these types of discussions offer original point of view on all our projects, and allow for better work to be done as well. The rising number of and success of interdisciplinary endeavors speaks to that, I think. \n"}