{"doc_id": "1925", "name": "2016_08_humanities_student_major_739_musicology", "namespace": "we1sv2.0", "metapath": "", "pub": "musicology", "title": "2016-08-humanities-student-major_739_musicology.txt", "pub_date": "2016-08-11T00:00:00Z", "Sentiment": "0.125", "Subjectivity": "0.36", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "686", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6dqfwp", "Reddit_id": "d6dsopu", "Subreddit_id": "t5_2sgj0", "Commenter": "shrediknight", "length": "3964", "content_scrubbed": "If you don't think boundaries are being pushed constantly, you're not looking hard enough and if you think that \"modern listeners\" are going to suddenly rally around classical music if they use electronic instruments and effects, you're the delusional one.  Classical composers used to keep up with trends because there weren't fifty different styles of music to compete with.  Music then was *only* live, there was no recording, there was no bootlegging.  Composers played or directed their own music, rarely did they perform the music of others and if they did, it was in an effort to keep it alive, to say something new with it.  It wasn't until the 19th century where the performer came to the same level as the composer in terms of desirability, before then playing another person[.] music was for amateurs.  You're trying to put the past in the same context as today and it simply won't work.  \n\nMoney absolutely comes into it, because an established orchestra playing old pops concerts will always, *always* get more funding than a new ensemble playing new music.  That doesn't mean that new music isn't there, there[.] probably actually more of it around than there is old music, it just means that it[.] harder to find, you have to look for it.  \n\nYes, the demographics of a classical audience are largely in the 40+ age range, but can you say definitively that it[.] just because of the music, and not the $100+ ticket prices, or the fact that younger people don't have as much money these days as they used to (and what money they do have, they aren't spending it on music)?\n\nI don't see where my attitude bars innovation.  I work primarily in the performance of new music, I also study the Renaissance lute, and have combined the two interests in multiple situations.  I've worked with groups and organizations who focus primarily on keeping the past alive through new and often extreme ways.  I am still under 40, I've been playing and going to see classical music concerts of all kinds since I was a teenager, I have a degree in music, I teach music of all styles to students of all ages and the clearest thing to me in 25 years of working in this business is this: most people don't care about music.  Most people don't want to spend money on it, most people don't even want to think about it.  Sure they like it, but they just want it, on demand, now, short, easily digestible.  \n\nNow we come to the issue of taste.  Those who push boundaries often like to do so without the restrictions of traditional structure.  This leads to music that is atonal, without regular metre, or without any immediately recognizable musical structure.  This music is often difficult to listen to, harder to appreciate and even harder to enjoy.  [Here[.] a link to a collective of composers that I've worked with.](https://www. youtube. com/user/toypianocomposers)  Much of it is \"boundary pushing\", I think it can be safely said, but how much of it do you think has wide appeal?  You mention heavy metal, the bands who are really pushing musical boundaries are by far not the most popular or widely heard ones.  If you turn on the radio, you're far more likely to hear Black Sabbath than Portal or Gorguts.\n\nYou're right, music performance majors have a high unemployment rate, but so does anyone in the arts, particularly those living in a country where the arts are consistently undervalued by the government.  Go somewhere where the government actually puts arts education as a priority throughout schooling, allows easier access to arts programs, and provides real support for its artists and you'll see a very different environment.\n\nI'm rambling a bit here, but it[.] just because there is so much that you clearly don't know about the way the industry works, or about what is available for you.  The music that you want is out there, there[.] lots of it, there[.] more music out there now than there ever has been.  If you want \"more\", you just have to dig a bit harder."}