{"doc_id": "1960", "name": "2016_08_humanities_student_major_1135_ask_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "Ask_Politics", "title": "2016-08-humanities-student-major_1135_Ask_Politics.txt", "pub_date": "2016-08-16T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.29", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "262", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4y19eh", "Reddit_id": "d6k5k0p", "Subreddit_id": "t5_2t160", "Commenter": "LDL707", "length": "1701", "content_scrubbed": "It[.] not left out so much as it[.] irrelevant to the discussion. \n\n\"A well-regulated militia, being necessary to the security of a free state\" lays out one of the main reasons that \"the_right of the people to keep and bear arms shall not be infringed.\" It doesn't limit or control that right in any way. \n\nJ. Neil Schulman got to the bottom of this 25 years ago. He contacted Professor Roy Copperud, a journalism professor and grammar expert. Schulman outlines Professor Copperud[.] experience as such:\n\n\"Roy Copperud was a newspaper writer on major dailies for over three decades before embarking on a a distinguished 17-year career teaching journalism at USC. Since 1952, Copperud has been writing a column dealing with the professional aspects of journalism for Editor and Publisher, a weekly magazine focusing on the journalism field.\n\nHe[.] on the usage panel of the American Heritage Dictionary, and Merriam Webster[.] Usage Dictionary frequently cites him as an expert. Copperud[.] fifth book on usage, American Usage and Style: The Consensus, has been in continuous print from Van Nostrand Reinhold since 1981, and is the winner of the Association of American Publisher[.] Humanities Award.\"\n\nSchulman posed a question to Professor Copperud. He asked if the sentence \"A well-schooled electorate, being necessary to the security of a free State, the_right of the people to keep and read Books, shall not be infringed\" was grammatically identical to the Second Amendment. Professer Copperud said that the sentence \"precisely paralleled\" the text of the Second Amendment \"in grammatical structure.\" \n\nYou can read Schulman[.] entire article [here](http://www. constitution. org/2ll/schol/2amd_grammar. htm)"}