{"doc_id": "25", "name": "2016_06_humanities_student_major_247_melbourne", "namespace": "we1sv2.0", "metapath": "", "pub": "melbourne", "title": "2016-06-humanities-student-major_247_melbourne.txt", "pub_date": "2016-06-03T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.389", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "427", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3ubu2q", "Reddit_id": "d3ucrpl", "Subreddit_id": "t5_2qkhb", "Commenter": "rdnetto", "length": "2645", "content_scrubbed": " My reasoning for likening it to religion is that the primary reason I believe religion isn't allowed in schools is that teaching it as fact is wrong as their is no empirical evidence for religion and as such belief in religion should be entirely choice - not the role of the state.\n\nThe problem I have with this line of thought is there are entire fields (the humanities, in particular) which aren't grounded in empirical evidence. e. g. you can't prove what caused a world war, or what an author intended a passage to mean - only analyse the available information.\n\nPerhaps more to the point, schools also serve to help children learn to integrate with society and socialize. This includes some basic ideas on how to treat other people.\n\n Similarly, there is no empirical evidence that there are any sexes other than male and female (although you could argue intersex)\n\nIf you include intersex* (and since that Safe Schools core intention is to be inclusive, I think that[.] a given), that implies either 3 sexes or a binary spectrum. I don't believe that part is as contentious as the following, though.\n\n* Intersex has been a valid sex descriptor for Australian passports since [2003](https://www. wikiwand. com/en/Gender#/Australian_government_policy_on_indeterminate_gender).\n\n and genderwise teaching people that genderfluid etc is a thing is similar to religion - no empirical evidence and entirely up to you whether or not you decide to subscribe to this idea.\n\nDemonstrating that gender is a social construct is easy enough, when you consider [different cultures and their approaches to gender.](https://www. wikiwand. com/en/Gender_systems)\n\nGenderfluid is arguably a special case (in that its dynamic, whereas most gender systems only have static genders), but if we consider it to be part of the LGBTQ culture, then it seems reasonable to (attempt to) make it seem less alien by explaining it. This approach is interesting to consider in light of the idea of Australia as a multicultural nation, as well as an explanation of conservative opposition to it.\n\n My problem is that the safe schools program doesn't teach that bullying is wrong as you've stipulated, and as such and otherwise arguing that teaching kids not to bully would be dumb.\n\nLet[.] be realistic: the vast majority of bullies know (rationally) that their actions are morally wrong, but they do so anyway because they get an emotional high out of it. The approach taken by Safe Schools is to (attempt to) encourage empathy by making these people seem less different. If they empathise with them, then that should negate the emotional high and thus eliminate the motivation."}