{"doc_id": "212", "name": "2016_06_humanities_student_major_2093_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-06-humanities-student-major_2093_AskReddit.txt", "pub_date": "2016-06-29T00:00:00Z", "Sentiment": "0.146", "Subjectivity": "0.363", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "731", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4ss83i", "Reddit_id": "d4sxxue", "Subreddit_id": "t5_2qh1i", "Commenter": "MistressMeowMix", "length": "3886", "content_scrubbed": "Not OP, but I am an actor who has a degree in Theatre and Performance and I am currently working as an actor in NYC. This might be long, but these are my best bits of advice:\n\n1. Go to college. Not a two year conservatory program, but a true four year degree school. There are a lot of two year conservatory programs floating around, and in all honesty they are usually scams. Go to a four year school that makes you take classes outside of your major and learn things besides acting. A good actor is someone who has knowledge of a wide range of human experience, because the point of acting is to be able to find and perform a truth or someone else[.] experience. I know too many actors who didn't go to school at all after high school or who ended up getting scammed by a program that promised them that they were going to set them up for fame and fortune, only to find that they are not able to get cast in anything. And don't just go to school to have a degree, go to school and work your ass off. The harder you work, the more you will grow. The more you grow, the more you will be recognized and rewarded by your teachers and by your fellow classmates. As far four year conservatory programs are concerned, I'm a little biased. I went to a four year liberal_arts school who[.] theatre program functioned in the same way a conservatory would, but it still required us to learn things outside of our major. I have found that unless someone attended a super high tiered performing arts school like Carnegie Mellon, they tend to leave school as dumb actors, therefore making them very hard to work with. This is just my experience, but I have found that many people agree with me. On this same vein...\n2. Research the schools theatre program. A good program is one that has professors who not only worked in the field, but are still working and are also successful enough to be recognized within the performing arts community. Generally this kind of professor will teach at schools that are in (or very close to) big performing arts cities like New_York, Chicago, or Philidelphia.\n3. Use school to build a network of likeminded performers, and jump at any chance you can to work with people you believe in and who believe in you. Almost every show I've booked has been due to the help of a friend who works for casting directors, or because a friend who knows me as a performer wants me in their production that they have been creating. Through those experiences I have been able to make the connections they had into my own, and have gotten more work as a result of it. \n4. Read any and every play you can get your hands on. And don't just read them like you would a novel (meaning in small increments), but in the way they are intended to be performed, ie in one sitting. Some plays will be shit, some will be life changing, but all will be useful in one way or another. \n5. If you can, attend an abroad program during your college years that focuses on theatre. I went to a conservatory program in London for my semester abroad; not only was it great because I was being taught by elite actors and directors, but also because they took us to a show every single week and encouraged us to see as much theatre as we could by providing us with discounts or ways to get tickets to amazing shows on a student[.] budget (London is particularly good for this, and I have also heard Berlin is as well). This leads me to my final tip:\n6. See as much theatre as you can. There are few things that can replace what you can learn from watching some truly amazing performances, and there[.] nothing quite as inspiring as seeing a good show that stays with you forever and reminds you exactly why you love theatre in the first place. \n\nSorry if this is super dense, but these are the things I've done that have helped me in more ways than I could have imagined. Good luck, and I hope I've helped! :)"}