{"doc_id": "1995", "name": "2016_08_humanities_student_major_1440_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-08-humanities-student-major_1440_AskReddit.txt", "pub_date": "2016-08-20T00:00:00Z", "Sentiment": "0.207", "Subjectivity": "0.39", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "405", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6oi5a7", "Reddit_id": "d6pcoi1", "Subreddit_id": "t5_2qh1i", "Commenter": "nuck_forte_dame", "length": "2228", "content_scrubbed": "I'd argue that college is indeed maybe not everything but it is a big step and a very good investment if you are practical about choosing your major.   \nThe problem today is many people choose a liberal_arts, zoology, and so on degree which pays shit after college and is a bad investment. You don't see engineers, nurses, computer scientists, agronomist, economists, and so on complaining about crippling student debt because they make enough money that the debt was a good investment. Its always the psychology degrees or fine art. They chose joke degrees with no practicality.   \nI'd absolutely agree we need high school programs to teach about in demand jobs. My high school experience with that was everyone took these computer job fit tests and it told you what jobs for you best. It didn't take long for us all to compare results and the whole class was given 1 of 3 results: elevator tech, bulldozer operator, and electrician. So obviously we discarded that bull shit because how could those results be right for a class of 20 to be pigeon holed into 3 different jobs that happened to be in demand at the time? What they really need to do is get honest with kids these days and tell them that sure they all have the opportunity to climb the socioeconomic ladder but most won't and for every person that moves up the ladder someone else falls. Point to the best student and say \"you'll be competing out there with other people and so and so over there will be one of them. He or she has straight As, is president of multiple club, and is already building an impressive resume. Think you have a chance to compete with them for whatever career they pick? Not just that but they are just the best student in this class, in this school in this district, in this state. There are hundreds of thousands of him or her out there to compete with. So it[.] time to get practical and give up the dreams unless you are willing to work hard for them.\"     \nThey didn't used to have a class or time in school that told people to try for in demand blue collar jobs but then again back in those days everyones parents worked those jobs and people were more realistic. Back before we pumped the kids up with unrealistic dreams and so on. \n"}