{"doc_id": "74", "name": "2016_06_humanities_student_major_814_makeyourchoice", "namespace": "we1sv2.0", "metapath": "", "pub": "makeyourchoice", "title": "2016-06-humanities-student-major_814_makeyourchoice.txt", "pub_date": "2016-06-10T00:00:00Z", "Sentiment": "0.111", "Subjectivity": "0.343", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "1390", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nbvmy", "Reddit_id": "d44loc4", "Subreddit_id": "t5_2w8em", "Commenter": "Ellyik", "length": "8323", "content_scrubbed": "So I decided to make this my first CYOA response. The world seems really cool and I can see fun opportunities for writing a story or two. I made choices as a character of common birth. We can call him Cayleb.\n\nI apologize in advance for the wordy delivery. I happened to get a bit carried away.\n\n**School:** Lunestier \n\nCayleb has an interest in nobility. Whether as a diplomat, aide, adviser, or even a bodyguard or escort. Lunestier seemed the best place to go for an appropriate education.\n\n**Companions**\n\n* 1, 2 ,3: Malyvin, Luvyna, and Valerie Bluewood.\n\n    Being childhood friends, I can see these three with Cayleb being a rag-tag, close-knit group of friends. I can imagine all of them at Lunestier for one reason or another. Malyvin pursuing a future as a tactician (probably with strong encouragement from friends and family), Valerie giving to pressure from her noble family (she would probably be a better fit for St. Flares), and Luvyna probably following Cayleb (I am assuming the crush is in fact real). We could cause a fair amount of hijinks together, but we all seem to be heading in different directions in life. We have to make our time together in school count! \n\n    The group seems pretty well rounded, too. Cayleb would probably be the face and general magic utility. Valerie would be the one who would fight most of our fights, and also probably try to get Cayleb and Malyvin to learn how to fight so she has more sparing partners than Luvyna. Seeing her and Eydal go head-to-head would be a fun event. Luvyna, with enough encouragement, seems like she could do almost anything she puts her mind to. She would be looking out for the safety of the entire group (mostly Cayleb) and will most likely be the voice of reason for them before they end up getting themselves in trouble leading to plenty \"I told you so\" moments. She would also seem useful in a combat in general, whether up close or far away.\n\n* 4: Suzette Highking\n\n    As a noble and very talented magician, her being Cayleb[.] role model makes a lot of sense. I am not entirely sure that the reverse would be true, but Cayleb[.] common upbringing would probably interest Suzette to some degree and the two would probably develop a fine rapport without seeming too forced. Her magic prowess will give him a level to aspire to and her being of royal blood will be a valuable connection for Cayleb in the future.\n\n* 5: Mecherath\n\n    When Cayleb and Mecherath first met, he really could not explain why she took an interest in him at all. He saw them as very close friends for about the first week of classes, till he realized he had basically told Mecherath his whole life story and he knew next to nothing about her. He became even more wary when her learned of her trade. When Cayleb confronted her that, she insisted she was genuinely curious about him. Cayleb could not determine if she was lying or not, but she does seem to be a bit more generous with the information she gives Cayleb. Maybe they are actually friends...\n\nClasses and Events. I randomly determined what school hosts what event year 1 and rotated from there.\n\n* #**Year** **1** **Summer/Fall** **class** - Magic Refinement\n\n    Cayleb has always had some magical capacity. Control was always an aspect of magic that he lacked though. If he is going to be a mage, he has to learn control first. Basic Refinement is the class where he first meets Suzette. She is key in helping him develop his refinement practices.\n\n    **Summer** **Event** - The Great Tournament @ Odesium\n\n    Cayleb was never one for physical competition. With the urging of Suzette, however, he joins in spectating the Battle Royal. Malyvin attends as well, making constant comments on the flawed decisions of it[.] participants.\n\n    **Fall** **Event** - The Harvest Festival @ Uzuza\n\n    Not much happens during the festival. Cayleb and his companions enjoy the festival food and drink. Cayleb catches rumors of the Basilisk Den, but thinks nothing of it.\n\n* #**Year** **1** **Winter/Spring** **class** - Diplomacy\n\n    Despite the next step after refinement being Arcane Studies, being a competent mage is not all that Cayleb wants to get out of his time at Lunestier. Somewhat surprisingly, he shares this class with Mecherath. She[.] already a smooth talker. She must be here for the easy A. She is more than willing to give Cayleb a pointer or two.\n\n    **Winter** **Event** - The Grand Summit @ Lunestier\n\n    The Grand Summit. It[.] hosted here at Lunestier. Cayleb and his friends are not renowened enough to be part of the security team and not enough studies to have a research proposal. Suzette seems to be spending time around any refinement proposals all the while Luvyna wants to see the arts festival. It[.] a tough descission. Cayleb reaches compromise with Luvyna: Cayleb attends the various proposals with Suzette and Luvyna cooks for him for the rest of the semester. Luvyna reluctantly agrees.\n\n    **Spring** **Event** - The Gathering of Life *(Party* *Planner)* @ Ej Har\n\n    Cayleb was not planning on attending The Gathering of Life. He is a commoner, it[.] at Ej Har which Cayleb has heard mostly rumors about (and not good ones), and there will be four other years to attend. That plan was smashed to pieces when Mecherath told him in the middle of class \"You are going to The Gathering of Life. I got us a spot on the Party Planning committee.\" Cayleb decided to accept. It was about half way through the fortnight when Cayleb confessed to Mecherath that he really had no interest in planning the party and noticed that Mecherath didn't either. Before he could ask her why they were even there, she made an uncharacteristically forward advance on him. After an awkward pause Cayleb declined her and left. Later that week, Cayleb noticed something off. Following a near abandoned hall, he eventually found Mecherath being acosted by a pair of menacing Ej Har students. Cayleb aproached the incident and one of the students, a blood mage, started making threats. It was after Mecherath made a little fib about Cayleb[.] abilities that the duo backed off. Mecherath confessed that she was involved in a spy-game and her assets in Ej Har were being less than helpful. Cayleb was brought along as backup. She also explained how her advances were a tactless attempt to shut up Cayleb, explaining that she knew they were being listened in on. The rest of the event went on without another incident.\n\n\nSo I am writting a bit more than I expected for this. I will post what I have now and post the next four years by Sunday (in about a day or two). Just so I don't skew my choices based on feedback, here is the plan for the rest of Cayleb[.] school career.\n\n* #**Year** **2** **Summer/Fall** **class** - Arcane Magic\n    \n    **Summer** **Event** - The Great Tournament @ St Flare\n\n    **Fall** **Event** - The Harvest Festival @ Odesium\n\n* #**Year** **2** **Winter/Spring** **class** - Diplomacy (2)\n\n    **Winter** **Event** - The Grand Summit @ Uzuza\n\n    **Spring** **Event** - The Gathering of Life @ Lunestier\n\n* #**Year** **3** **Summer/Fall** **class** - Ranged Combat\n\n    **Summer** **Event** - The Great Tournament @ Ej Har\n\n    **Fall** **Event** - The Harvest Festival *(The* *Basilisk* *Den)* @ St Flare\n\n* #**Year** **3** **Winter/Spring** **class** - Martial Combat\n\n    **Winter** **Event** - The Grand Summit @ Odesium\n\n    **Spring** **Event** - The Gathering of Life @ Uzuza\n\n* #**Year** **4** **Summer/Fall** **class** - Magic Refinement (2)\n\n    **Summer** **Event** - The Great Tournament *(Battle* *Royal)* @ Lunestier\n\n    **Fall** **Event** - The Harvest Festival @ Ej Har\n\n* #**Year** **4** **Winter/Spring** **class** - Dueling\n\n    **Winter** **Event** - The Grand Summit @ St Flare\n\n    **Spring** **Event** - The Gathering of Life *(Body* *Guard)* @ Odesium\n\n* #**Year** **5** **Summer/Fall** **class** - Arcane Magic (2)\n    \n    **Summer** **Event** - The Great Tournament *(Battle* *Royal)* @ Uzuza\n\n    **Fall** **Event** - The Harvest Festival *(Escort)* @ Lunestier\n\n    (PS: I am not sure about this one)\n\n* #**Year** **5** **Winter/Spring** **class** - Magic Refinement (3)\n    \n    **Winter** **Event** - The Grand Summit *(Research* *Proposal)* @ Ej Har\n\n    **Spring** **Event** - The Gathering of Life *(Blind* *Date:* *Kara'Tee)* @ St Flare"}