{"doc_id": "1987", "name": "2016_08_humanities_student_major_1347_videos", "namespace": "we1sv2.0", "metapath": "", "pub": "videos", "title": "2016-08-humanities-student-major_1347_videos.txt", "pub_date": "2016-08-18T00:00:00Z", "Sentiment": "0.156", "Subjectivity": "0.436", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "316", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6nj8rd", "Reddit_id": "d6nl3zk", "Subreddit_id": "t5_2qh1e", "Commenter": "Bryancreates", "length": "1726", "content_scrubbed": "Yeah.... I went to an art school near the Detroit Institute of the Arts. A fairly safe place for anyone (but you watch your back at night, but that[.] anywhere really) but when you would venture out FURTHER than the arts and culture district it got real weird. The most truthful looking part of that video was watching the car turn onto the unlit street. At least the FIRE shed light onto the surrounding area. The amount of demolished homes due to abandonment, while a good plan to fight blight, leads to large swaths of the city being unlit and very scary. We would do photo projects which many people call \"Ruin Porn\" and although interesting gets very old at a school located in an area surrounded by it and poor college students who don't travel far beyond it for subjects to photograph/ portray. However BEYOND Detroit, where I'm from, has some of the most expensive suburbs in the Midwest if not the whole country. Like, old money in the some crazy exclusive areas like grosse pointe, Birmingham and west Bloomfield where I'm from (LISA FRANK has/had a summer home next my parents house. Ok she[.] not the richest person nearby but I think it[.] the coolest) we just didn't see our neighbors as much cause of all the landscaping/ rebuilding/ privacy so she may not anymore. As wealthy as it is it[.] also isolating beyond your own social group. I love my life now in an also upscale city in the suburbs of Detroit but not quite as rich as my parents which I doubt I'll ever be able to afford. \n\nTL:DR. Went to art school in Detroit, saw scarier stuff than this but most of it is exploited for those who don't live in the city. Grew up in a wealthy suburb nearby but miss Detroit all the time, changed my entire world view. "}