{"doc_id": "32", "name": "2016_06_humanities_student_major_296_the_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "The_Donald", "title": "2016-06-humanities-student-major_296_The_Donald.txt", "pub_date": "2016-06-03T00:00:00Z", "Sentiment": "-0.054", "Subjectivity": "0.365", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "483", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3v3vrq", "Reddit_id": "d3vdljq", "Subreddit_id": "t5_38unr", "Commenter": "fieldnigga", "length": "2585", "content_scrubbed": "This situation actually makes complete sense to me. I'm no trump supporter (fuck voting, don't like any of them) but goddamned if this isn't a classic cuckening. I remember the first time I went to a boarding school full of rich lefties (ironically, the boarding school was fairly conservative/right_wing). I proceeded to traumatize the vast majority of them by just being a normal person. I kept hearing I was \"intimidating\" and \"mean\", etc. I became a full blown bully the more confused I got about what was happening. Bitches were running to the dean[.] office to snitch on me constantly, groups of em tryna cut me out of the group line like I was a fuckin tiger and they were protecting the herd. If them niggas coulda seen me just a couple of years ago getting my ass beat by my sister.... I had no idea what was going on. Back home, I was the nice guy, the butt of the jokes because they were funny and true. Could get frustrating growing up around a bunch of grown ass men, they're never gonna take you seriously while you're still just a kid. But I come to school and these fuckin pussies are literally falling over themselves in a rush to get away from my resting bitch face. That[.] part of what[.] happening in this election, I think. The existence of a more candid social class is really upsetting the soft squishy bits of our country. Just using basic communication is like slapping em in the face with your dick.\n\nThen I went to college and I got banned from the facebook group for using the word \"gyped\" which I hadn't even connected to the word gypsy, which until then I thought was the actual name of a culture. Unfortunately, the boarding school I went to had a director who said, and I quote, \"I don't care about humanities. Nobody cares about humanities.\" Which, in the context of getting banned from facebook for using gyped, I would agree. On the other hand, it would be nice to not actually be ignorant so fuck that guy and his gutting of our humanities department. Gyped and gypsy are slur words. That[.] good to know. But that doesn't mean I'm going to stop using them. Anyway, I quit college. Gonna go grab a minimum wage hard hat and probably get employed to build a wall, whether I agree with it or not. And I don't feel bad. I'm no champion of justice, I just want a little money and a few friends that don't piss their pants when I scowl because my whiskey is 100 proof. There is no good and evil. There is just shit and vices to help you get through it. Slavery by any other name isn't going anywhere and neither am I. Lets build a wall. My hours are 9 to 5."}