{"doc_id": "191", "name": "2016_06_humanities_student_major_1858_musiced", "namespace": "we1sv2.0", "metapath": "", "pub": "MusicEd", "title": "2016-06-humanities-student-major_1858_MusicEd.txt", "pub_date": "2016-06-26T00:00:00Z", "Sentiment": "0.243", "Subjectivity": "0.412", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "286", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4py5kg", "Reddit_id": "d4orfvi", "Subreddit_id": "t5_2swl6", "Commenter": "Swissarmyspoon", "length": "1638", "content_scrubbed": "What they are really asking, is are you here to teach children, or are you here to make music? This is a question for weeding out people who wanted to be pros, didn't make it, and became teachers. Within the stereotype, those teachers focus only on the driven and talented music students, and ignore the rest. This question tries to identify this teaching style.\n\nI made sure I addressed this issue whether or not it[.] asked. My mission statement was something like \"To teach children how to be responsible, successful, and happy adults, through the study of music\". In the interview I talk about how I am teaching life skills through our class, that I am using music to trick kids into leaning discipline and self-education. \n\nMy target audience is anyone who wants to be here. I want every interested child, and I will entertain them all. I will have one or two auditioned ensembles, for the kids that want to dedicate themselves to higher standards but (this is what most principals want to here) the majority of my teaching is for the average student, who just wants exposure to the arts. I am here to teach them a skill, and help them understand the discipline, while having fun doing it.\n\nBonus points if you can show evidence of great retention. 80% retention or higher is worth bragging about.\n\nEssentially, prove that you are not going to ignore or belittle the kids who won't practice. I once team-taught with a I-didn't-make-it-so-I'll-teach person, who actively tried to make less-talented students quit. I used to piss them off once a week with this one phrase: \"Remember, none of these kids took our class to be good at it.\""}