{"doc_id": "214", "name": "2016_06_humanities_student_major_2112_harvard", "namespace": "we1sv2.0", "metapath": "", "pub": "Harvard", "title": "2016-06-humanities-student-major_2112_Harvard.txt", "pub_date": "2016-06-29T00:00:00Z", "Sentiment": "0.053", "Subjectivity": "0.312", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "374", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4qiw6w", "Reddit_id": "d4tfqwx", "Subreddit_id": "t5_2qkkm", "Commenter": "gdavtor", "length": "2173", "content_scrubbed": "I will just add to /u/ruthplace[.] answer here (HES people please correct me if I'm wrong here):\n\nI do not attend the Extension School (hereafter called HES), but I have taken a class where there were one or two extension students in it. I get the sense that HES is best thought of as the adult continuing education sector of Harvard. It generally enrolls students that are older and/or have full or part_time jobs.\n\nYou are correct in sensing that HES is not equivalent to Harvard College. It[.] not meant to be. They are different. This is not to say HES is bad, it just has a different mission and student body. More practically, HES doesn't grant typical four year college degrees like the College, it doesn't offer as many classes or much of an undergraduate experience. A good comparison here might be Community College vs. Liberal Arts College (except HES is more academically rigorous than your average community college). \n\nTo answer your questions: I believe what your cousin is talking about is the standard HES track: take a few online courses, and pass with a certain GPA, then finish the degree on campus. The last part is not a transfer to Harvard College. It is just the on-campus version of Harvard Extension. \n\n One main question I have is if you can take online Harvard Classes for 2 years(which are obviously much cheaper) and then apply to the school, why doesn't everyone do this?\n\nThe term \"apply to the school\" is misleading here. What happens, as I mentioned above, is that you take HES courses online, and so long as you pass them with a certain proficiency, you can apply to do Harvard Extension on campus. So you are applying to attend HES on campus. This is completely separate from the undergraduate college. \n\nAs for your second question:\n\n When you transfer to Harvard after taking the online classes, are you transferring to the standard traditional Harvard_University or are you transferring to a separate University called Harvard Extension school, or something of that sort?\n\nI am pretty sure this means you are transferring to an on-campus version of HES, because transfers to the undergraduate college are very rare and are hard to get. "}