{"doc_id": "90", "name": "2016_06_humanities_student_major_969_askanamerican", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAnAmerican", "title": "2016-06-humanities-student-major_969_AskAnAmerican.txt", "pub_date": "2016-06-13T00:00:00Z", "Sentiment": "0.072", "Subjectivity": "0.336", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1488", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nydbx", "Reddit_id": "d482fey", "Subreddit_id": "t5_2uah7", "Commenter": "Kimye2020", "length": "9048", "content_scrubbed": "So I have a limited understanding of British education, and I'll try to make the appropriate analogies, but feel free to correct me if I'm wrong.\n\nFirst of all American terminology\n\nElementary school- everything from birth until the age of 12. Used to be called grammar school and is sometimes called primary school. \n\nMiddle School- approximately ages 12-14. Widely considered to be the worst part of everyone[.] education. \n\nHigh School- 14-18 years old\n\nCollege/University- usually 18-22, but really any age. First optional level of education. Also referred to as undergrad. When finished you earn a bachelor[.] degree. For Americans the distinction between college and university is really only size. A university will have more people and more [.]chools' for areas like nursing and business. There[.] no prestige difference. Wellesley, Williams, and Amherst are some of the top schools in the country and they're all 'colleges'.\n\n\nPublic Schools: British state schools, usually determined by where you live, though some magnet or charter schools can pull kids from surrounding areas.\n\nPrep schools: Like what Brits call public schools. These are specific to to teenagers. Our equivalents to Eton and Harrow would be places like Choate, Miss Porters, Philips, and St. Paul[.]. \n\nParochial Schools: Catholic schools, usually\n\nPrivate schools: include prep schools but also Christian schools. We don't really have hardcore Christian schools in New England, but I'm led to believe that these are the majority of private schools in the rest of the country.\n\nSAT/ACT: these are not the equivalent of A Levels or GCSE exams. They are optional tests that you take when applying to college. They are also not the most important piece of your application, like British exams are. My relatives work in admissions at several elite schools, and test scores are secondary to transcripts.\n\nAP exams: optional exams that you take after more advanced high school coursework. They are grades on a scale of 1 to 5, with 3 being a passing score and 4 being enough to earn course credit at some universities.  \n\nAll standardized tests in high school will have a writing component. It[.] a myth that American schools just teach route memorization and not critical thinking. \n\nGPA: grade point average usually on a scale of 0. 0 to 4. 0. Each of your classes is assigned a number of points based on its level of difficulty and the grade you receive in those classes will be averaged together to get your average grade.\n\nLiberal Arts: the dominant American educational philosophy. We don't have an equivalent of A levels where you pick the classes you focus on at 16 and don't learn any other material. From the beginning of school until the end of college you are supposed to be learning about every major subject area. The idea is that a person who is a productive citizen will have a broad range of knowledge. Most of our founders were polymaths and that culture continues to this day. \n\nAll right so from the beginning\n\nPre-school: this will cover about ages 3-5 in most places. Optional and in many places not public, though in my town it was. There[.] a government program called Head Start which provides pre-school type services to poor children. Usually at this age all you're going to learn is the alphabet and adding, along with social development and structured play. \n\nKindergarten: I believe Brits call this reception. This is where children first learn reading and writing and basic math. More structured play. It[.] also interesting to note that my most vivid memories of kindergarten revolve around learning about the Civil Rights Movement- even in my very white town. I hate when Europeans say that Americans don't learn real history and only hear patriotic propaganda. That[.] not true, my first memories of history in school were about our darkest days. We also learned a lot about the environment and animals at that age.\n\nFirst through Sixth Grade: in general basic math, civics, reading, and history. Most schools have programs for brighter kids, where they're pulled out of class and do enrichment activities. There[.] also usually reading and math groups, that divide kids into more and less advanced groups, but beyond that there[.] no leveling at that age.\n\nSchools tend to place a heavy emphasis on American geography, the environment, and early American history- with a special emphasis on immigrants and American Indian tribes. \n\nAt this level of education most children will be going to public schools run by their towns. It[.] important to understand the federal government has limited control over schools. Most curricula is set by the local school board, elected by that town. The schools are paid for through property taxes and state grant money, so public school quality varies widely. In my upper class suburb there[.] pretty much no issues with funding, but in other areas this is a huge problem. \n\nI'm sure a lot more people are going to go into detail about middle and high school, and  it would take me ages to go into more detail about it. That being said here[.] what my schedule looked like through the latter half of my public schooling, just to give you an idea of what it could look like\n\n**7th Grade (so 12 and 13 year olds)**\n\nPre- Algebra\n\nSocial Studies- that year we talked a lot about Ancient History and archaeology\n\nEnglish- mostly we practiced compositions and grammar\n\nReading\n\nLatin- we used the Cambridge textbooks at my school\n\nGeneral Science- a heavy emphasis on biology and Earth science\n\none semester Gym\n\none semester Music- we learned basic piano that year\n\none quarter Health, one quarter Art, one quarter wood shop, one quarter cooking\n\n**8th Grade**\n\nHonors English- this was the first time my school had leveled classes, though that probably varies. We read Anne Frank, The Outsiders, Animal Farm, Flowers for Algernon and a few other books that are escaping me.\n\nAlgebra\n\nAmerican History and Civics- this class began with the pre-Columbian era and went until 1800. My school set up our curriculum weirdly in this respect, so in high school they could skip the revolution and have more time teach everything else.\n\nGeneral Science- a heavy emphasis on basic physics and chem. \n\nLatin II\n\nSpanish- it[.] not normal to take two languages in American schools, but my parents were super pushy.\n\none semester Gym\n\none semester music \n\none quarter Health, one quarter Art, one quarter wood shop, one quarter cooking\n\n**High School**\n\nOnce in high school pretty much every school will level classes, that way smart kids aren't bored and slower kids aren't confused. There[.] also much more wiggle room in terms of classes you can take. I'll put the ones I was required to take by the state in bold and by my school in italics. \n\n**Freshman Year**\n\n*Honors English*- we read Romeo & Juliet, To Kill a Mockingbird, In the Time of the Butterflies, Night, The Catcher in the Rye, and like three other books I'm completely blanking on. We also learned how to write academic research papers and analysis at this point.\n\n*Geometry*- I was really mediocre at this class. \n\n**one semester of gym and one of health**- Health consisted of sex Ed (my school was super liberal in this area, they gave us condoms in class, among other things), drug and alcohol abuse prevention, stress management, and advice about healthy relationships.\n\n*Honors Biology*\n\n*Graphic Design*- we were allowed to pick the art class we took, but we had to take art\n\n*Honors Global Studies*-we studied geography, the major religions of the world, the current events and histories developing world (the Middle_East, parts of Africa, India, Latin America,and Southeast Asia) the major political ideologies( communism, fascism, liberalism, socialism etc.), the UN, and basic economic theory.\n\nHonors Latin III\n\nHonors Spanish II\n\n*Sophomore Year*\n\nChemistry\n\n*Honors English*- We read Much Ado about Nothing, Of Mice and Men, A Midsummer Night[.] Dream, and a bunch of other stuff\n\nAP European History- Europe from the plague until the 2007 financial crisis- heavy emphasis on Britain, France, Spain, and Russia, the Renaissance, the Reformation, the Enlightenment, the Industrial Revolution,  as well as philosophy and art history. \n\n*Algebra II*\n\nHonors Latin IV- this was first time we actually translated real Latin texts\n\nHonors Spanish III\n\n**Gym and Health again**\n\n*Junior Year*- considered by many to be the hardest year of high school\n\n*AP Language & Composition*- this was mostly a writing class, though we did learn a lot about transcendentalism, because my teacher was a hippie. \n\n*Pre-Calc*\n\n**Civics**\n\nEconomics- I took this class online, so I could use it as a technology credit and get out of taking shop class.\n\n*AP US History*\n\nAP Biology- I really should've taken physics, but I hated math. \n\n*Senior Year*\n\nAP Psychology \n\n*AP Literature*\n\nAP Environmental Science \n\nAP Stats\n\nCommunism & Fascism- this was a history elective I took, mainly because I wanted a letter of recommendation from guy who taught the class\n\nJournalism"}