{"doc_id": "1838", "name": "2016_08_humanities_student_major_17_publishing", "namespace": "we1sv2.0", "metapath": "", "pub": "publishing", "title": "2016-08-humanities-student-major_17_publishing.txt", "pub_date": "2016-07-31T00:00:00Z", "Sentiment": "0.125", "Subjectivity": "0.241", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "236", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vkv0a", "Reddit_id": "d5z8fxk", "Subreddit_id": "t5_2qly9", "Commenter": "barkingcat", "length": "1456", "content_scrubbed": "Hi there,\n\nI'm wondering what medium you are interested in (books? magazines? pamphlets? commercial b2b style materials/printing?).\n\nWhich part of Ontario are you in/are you targeting? (Ontario is extremely large and your research and likelihood of success will depend heavily on which part on Ontario you are targeting.)\n\nHave you done some Internet searches? Any one who is interested in small press publishing in Ontario would need to be familiar with at least a few of the key players, Coach House Books being one of the oldest self-sustaining ones (and my favourite).\n\nSmall press publishing in Ontario (and in Canada in general) is dominated by the grants system, accessing funding through the Canada Council for the Arts, Trillium Foundation, the Ontario Arts Council, and the OMDC - You'll find that very few successful publishers go purely through the commerical route, unless it[.] for commercially driven content - like ads (like magazines made of articles written in a style to promote an industry - some car magazines are operated this way), or promos, or trade/industry b2b paper/magazine/books, etc.\n\nI'd start with http://obpo. ca/ and try to dig some more before putting any money into courses/programs etc.\n\nNote: if you are interested in epublishing, Kobo has a main office in Toronto and there[.] a large amount of resources in the GTA region re: epub and self publishing. The resources are there and plentiful - just do some more digging."}