{"doc_id": "133", "name": "2016_06_humanities_student_major_1295_geologycareers", "namespace": "we1sv2.0", "metapath": "", "pub": "geologycareers", "title": "2016-06-humanities-student-major_1295_geologycareers.txt", "pub_date": "2016-06-19T00:00:00Z", "Sentiment": "0.002", "Subjectivity": "0.392", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "330", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4f411y", "Reddit_id": "d4f61zy", "Subreddit_id": "t5_2x755", "Commenter": "[deleted]", "length": "2015", "content_scrubbed": "That list has a bunch of assertions that are dubious in both benefit and propriety to humanities.\n\nThe\nstate-of-the-art scientific knowledge and techniques you learn in\ncollege have a limited shelf life; mastering the humanities provides\ntools for extending it.\n\nI cant believe that a science background person wrote this because this is not what the sciences teach? This seems like super condescending statements that someone who has little respect for what the sciences are. It also further states that the humanities allow for further learning? Seriously, how many people in science and technology graduate, throw up there hands and say \"whoops, im done learning about innovation in my field\". That doesn't happen.\n\nPoint 4 posulates that communication and teamwork are in the realm of humanities, despite offering no reasoning much less proof, that such is the case.\n\nPoint 5 is laughable because the number of people who become fluent, or even functionally conversational in a classroom setting is pretty low. I cant pull up the study now, but basically years of classroom work is less effective for audio-lingual skills than short term immersion.\n\nThe rest of the points are so ambiguous its impossible to refute them. Its just a fluff piece with a bone to pick.\n\nDont get me wrong. I dont extend my skepticism to the humanities in general. I know that they have real value as fields of study. Even philosophy, which is the perennial butt of humanities jokes, produces some of the most intelligent and mentally capable people I have ever met. However, for a liberal_arts education, juts getting a small intro into a larger array of subject matter, doesnt transition into quantifiable advantages. \n\nI cant even find recent scientific literature that says humanities student are better writers than others? It seems to be an unchallenged assertion, but again paywalls are the devil.\n\nI am open to discussing this in good faith, but there isnt even evidence that \"soft\" skillsets are superior for these students."}