{"doc_id": "219", "name": "2016_06_humanities_student_major_2151_tumblrinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrInAction", "title": "2016-06-humanities-student-major_2151_TumblrInAction.txt", "pub_date": "2016-06-30T00:00:00Z", "Sentiment": "0.025", "Subjectivity": "0.45", "Score": "25", "Upvotes": "25", "Downvotes": "0", "Wordcount": "489", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4qmccs", "Reddit_id": "d4u5jjl", "Subreddit_id": "t5_2vizz", "Commenter": "Gizortnik", "length": "2729", "content_scrubbed": "She has used her satirical monologues to expose the warped logic that men have when it comes to rape. ...\n\nShe forces members in the audience to not only laugh at her jokes, but to laugh at the ignorant philosophy of everyone from men in Congress to men catcalling on the streets.\n\nForcing people to laugh is not comedy. Interesting that \"everyone\" seems only to include men. Gee, I wonder where this is going.\n\n[Interviewer:] It[.] like forcing men to look at your vagina in a non-sexual way.\n\nThe show is consensual, but the interviewer doesn't seem to get the idea that actually *forcing* people to do that is a *crime*. That is not something you should be super stoked about.\n\nI was 21 years old. I was in college at Wesleyan University, a very left liberal_arts women[.] university, and my professor was trying to get us riled up and have a big debate about gender, race, and class. He brought in the statistics that 2 in 5 women are sexually assaulted in this country and he was like, \"There are 10 women in this class that means four women in this class statistically speaking have been raped.\"\n\nYou could just feel that all the women in the class felt so confronted and that could very well be true and really triggering. I felt like he thought it was this big learning moment for everybody like, deal with the reality, deal with the world, why aren't you outraged by this? He kept going how does that make you feel, and no one said anything.\n\nThen, I finally said, \"I'll tell you how it makes me feel. Really angry because I don't want to hear about who was raped. There[.] three male students in the class and you. So I want to know if four people raped, which one of you raped us? Because once someone is raped it[.] already fucking happened, but if we talk about the other thing and make the boys feel uncomfortable and say if those are the statistics, then statically speaking someone in this room raped us. Let[.] talk about that.\"\n\n[Interviewer: ] Such a good point. Men are only made to feel uncomfortable after the fact. When they have actually committed a crime.\n\nJesus fucking Christ. No, that is *not* a good point. That[.] a fallacy of generalization. Yes, the professor was being ignorant and using the fallacy to make people angry for a debate... *which is wildly incompetent for debate*. Debates are not supposed to be accusatory and filled with name calling and blame.\n\nYou, turning around and attacking the men in the room with the same ignorance is not a good point. It just tells me your an ignorant bigot who[.] happy to profit off of pissing people off. (That includes the \"journalist\").\n\nFurthermore, the interviewer is saying that men are comfortable with rape, right up until after they've committed it."}