{"doc_id": "43", "name": "2016_06_humanities_student_major_433_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-06-humanities-student-major_433_AskReddit.txt", "pub_date": "2016-06-05T00:00:00Z", "Sentiment": "0.013", "Subjectivity": "0.305", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "275", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4mqj0k", "Reddit_id": "d3xj2bq", "Subreddit_id": "t5_2qh1i", "Commenter": "SplashTheFairy", "length": "1458", "content_scrubbed": "I don't know if I could decide what fact about me[.] the saddest. Obviously not every fact about me is sad, and there[.] no point in competing to be the saddest person around. XP \n\nI'll just give the overall generalization, and then the one thing I thought of right away when I read the question: \n\nI've been raised by narcissistic parents and I'm the scapegoat child. I also have major depressive disorder and severe generalized anxiety disorder. And all the things I like to do are the artsy/theatre/entertainment things that few people think are worth chasing (yay me .'). \n\nBut the one thing I thought of right off the bat was that I don't really know how to hug. Which sounds stupid, cuz that[.] something that should come naturally to people, I guess. But hugs really haven't been a huge part of my life, and when I do get them (mostly from my parents- my friends've never been huggers) I can tell how fake they are. Like a band aid to automatically cure all the ways they try to hurt me so they don't have to own up to it and can do it again later. \n\nSo whenever I DO meet someone who likes hugging and they hug me, I kinda stand there like a statue, like, \"what do I do now,\" and I eventually manage to awkwardly kinda sorta really lightly move my arms so they're almost around the person but not really touching them. It[.] not that I don't like people. And it[.] not that I don't like hugs, I think. I just don't have any idea what to do with them. .'  "}