{"doc_id": "143", "name": "2016_06_humanities_student_major_1377_writing", "namespace": "we1sv2.0", "metapath": "", "pub": "writing", "title": "2016-06-humanities-student-major_1377_writing.txt", "pub_date": "2016-06-20T00:00:00Z", "Sentiment": "0.182", "Subjectivity": "0.293", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "412", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4ozu3d", "Reddit_id": "d4h0u4d", "Subreddit_id": "t5_2qh2n", "Commenter": "LadyGlen", "length": "2419", "content_scrubbed": "Good advice here already, I suggest taking it. \n\nAre you involved in theatre/film in your area? If not, get involved now. Does your area have a community theatre? Volunteer \"Hey, I'm interesting in being involved, I really want to learn more about the process and the artistic side of the business.\" something like that. Does your school have a film club or theatre program? Getting involved there and working on student films/plays is a good way to go. Spend the next couple years learning it and maybe you can make write your own film/play for a senior project or something (depending on your school and what country you're in). \n\nYou still need to work on writing (that[.] not a dig, everyone does) so if your school or community has a club or group, like a writing circle, dedicated to reading and reviewing each other[.] work, join that. If you know an instructor (like a film or theatre teacher) talk to them about who they know and where to look to.\n\nYou need to learn the format. If you send a script somewhere and it isn't formatted correctly they will throw it out without looking beyond the cover page. So learn the format first before anything else. \n\nWatch films, read plays, and see plays. Read scripts. \n\nAs with anything, but it[.] especially true in the arts, it[.] not what you know, but who you know. Try working on making contacts now. That[.] why I'm suggesting community theatre, your teachers, writing groups, etc. Go in the spirit of wanting to learn and they'll be happy to help. I work in theatre (I started at 11) and the contacts I made as a teenager were extremely helpful going forward. \n\nI don't know too much about the film world, but as for theatre most plays are commissioned. A company will ask a writer to write a play for them. Most of those come from children[.] theatre (that[.] where the money is) so if you want to go into this as a career, that[.] something you'll need to contend with.\n\nIf you're interested in theatre, here are some playwrights that you should read:\n\nShakespeare (no brainer), Anton Chekov (realism), Samuel Beckett (absurdism), Bertolt Brecht, Arthur Miller, Tracy Letts (\"August: Osage County), Jose Rivera (magical realism), Tom Stoppard (film and theatre, completely brilliant), Suzan Lori-Parks, Sarah Kane (not for the faint of heart, completely messed up and controversial), Ayad Akhtar, Martin Sherman, Martin McDonagh, Tennessee Williams, Theresa Rebeck.\n\n "}