{"doc_id": "95", "name": "2016_06_humanities_student_major_1033_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-06-humanities-student-major_1033_AskReddit.txt", "pub_date": "2016-06-14T00:00:00Z", "Sentiment": "0.229", "Subjectivity": "0.497", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "312", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d49fc4i", "Reddit_id": "d49kht0", "Subreddit_id": "t5_2qh1i", "Commenter": "physphilmusic", "length": "1740", "content_scrubbed": " The entire Ivy League system is designed to make even the most brilliant students work extremely hard while not necessarily learning a whole lot that will actually serve them in life.\n\nThat[.] probably true in some way but misleading. The idea of a liberal_arts education (which is what it is at most Ivy League colleges) is that there are things in life which do not necessarily help you make more money but still serve you well. I learned many things about fine arts, philosophy, literature, music, and so on that I never use in my main job today, but I cherish them and come back to them due to my education. Maybe you're different, but I would've never even *known* how to appreciate them if I had tried to study all of it myself without guidance from professors. \n\nSecondly, the point of Ivy League colleges isn't to actually learn useful, practical things. It[.] to socialize with other brilliant and/or rich people, get exposed to and inspired by famous people who teach or just visit there, get that Ivy League pedigree that signifies you are special to the entire world, and develop a strong work ethic that you will take to whatever job you do. Some people do all of these things, some just 2 or 3 of them, but they are all ultimately beneficial and they are the reason why very few people who graduate from Harvard or Yale or Stanford end up penniless, directionless and without prospects in life (barring medical or mental problems). If you can't survive the competitiveness at Princeton or Columbia, then you won't be able to survive it in Goldman Sachs, McKinsey & Company, the Fed, or the Capitol. Those are the kind of careers that Ivy League people are aiming for - not to just make a lot of money, but to run the world."}