{"doc_id": "1996", "name": "2016_08_humanities_student_major_1453_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2016-08-humanities-student-major_1453_college.txt", "pub_date": "2016-08-20T00:00:00Z", "Sentiment": "0.152", "Subjectivity": "0.304", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "281", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4yowi4", "Reddit_id": "d6pk2nn", "Subreddit_id": "t5_2qh3z", "Commenter": "SnowblindAlbino", "length": "1575", "content_scrubbed": "Will this put you into overload fees? At my school the absolute cap is five courses a semester, and you'd pay handsomely for the overload credits.\n\nThat issue aside, nobody can really answer this question for you. As a senior I took 32 credits (a double load) my final semester, all of which were upper-division courses, including an honors thesis. But I was not a typical student. By contrast, I've had many students of my own who could barely handle three courses in a semester, let alone the usual four.\n\nThe schedule you are considering isn't terribly challenging (mostly 100-level intros) so the issue will be time management. If you can fit them all into the class schedule good, but will you have time to do all the reading and assignments? German will require daily work on vocab at the very least. Accounting will require exercises regularly. Business reading presumably involves reading. Intro marketing is probably a breeze, as is entrepreuneurship... those two combined might be equivalent in work to one econ or history course. Social psych can vary a lot depending on school or professor.\n\nAs long as you're able to manage both the course time and to set aside 3-4 hours seven days a week to keep up on homework, it seems doable. Midterms and finals may be a real challenge though. If you were one of my advisees I'd be most concerned about the part-time job, which seems like a lot to pile on top of six classes. But if you think you can manage the time challenge why not give it a shot? You can always drop one if it become clear that you've taken on too much."}