{"doc_id": "152", "name": "2016_06_humanities_student_major_1433_investing", "namespace": "we1sv2.0", "metapath": "", "pub": "investing", "title": "2016-06-humanities-student-major_1433_investing.txt", "pub_date": "2016-06-21T00:00:00Z", "Sentiment": "0.158", "Subjectivity": "0.392", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "253", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4i1ubu", "Reddit_id": "d4i28io", "Subreddit_id": "t5_2qhhq", "Commenter": "redcards", "length": "1518", "content_scrubbed": "I'm a liberal_arts major with a bent towards history. I started as an economics major, but my school[.] program is largely quantitative and I was interested in more of the \"why?\" and \"how?\" behind economics. I switched out of that to my current major and have felt very fulfilled with what I learn. I'm able to bend my classes and assignments to a more \"market history\" curriculum. It[.] worked out pretty great for me. I spent one class studying the economics of the Weimar Republic, another on the effects of increased regulation under Wilson (hint: anyone who[.] studied this would have been able to predict the Feds action during the 08' crisis), and others. \n\nI've found what I do in school has lent to a more long_term view of the markets and business cycles than what my peers in the business school have. \n\nWhen I actually became interested in investing and fundamental analysis I taught myself accounting & financial modeling and didn't find it terribly difficult. I still love learning new concepts, though. In particular I have been interested in forensic accounting techniques and ways to uncover fraud/aggressive accounting in company financials. \n\nI'm very involved with our business school though. I was the portfolio manager (now TA) of our student investment fund ($1. 5mn AUM) which is a class for credits and I'm involved in our investment club. In particular with the club I lead development seminars once a week for freshmen/sophomores who want to get involved in finance (banking, PE, HFs, etc). "}