{"doc_id": "168", "name": "2016_06_humanities_student_major_1601_asianamerican", "namespace": "we1sv2.0", "metapath": "", "pub": "asianamerican", "title": "2016-06-humanities-student-major_1601_asianamerican.txt", "pub_date": "2016-06-23T00:00:00Z", "Sentiment": "0.014", "Subjectivity": "0.332", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "321", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4pgya2", "Reddit_id": "d4kussf", "Subreddit_id": "t5_2rfyw", "Commenter": "virtu333", "length": "2064", "content_scrubbed": "[The opinion](http://www. supremecourt. gov/opinions/15pdf/14-981_4g15. pdf)\n\nSeems like the achilles heel in Fisher[.] argument was not challenging the 10% plan at all:\n\nDespite the Top Ten Percent Plan[.] outsized effect on\npetitioner[.] chances of admission, she has not challenged\nit. For that reason, throughout this litigation, the Top Ten\nPercent Plan has been taken, somewhat artificially, as a\ngiven premise.\n\nA lot of pieces fall in line due to this.\n\nA relevant section for holistic admissions overall (versus trying to everything via harder metrics):\n\nEven if, as a matter of raw numbers, minority enrollment\nwould increase under such a regime, petitioner\nwould be hard-pressed to find convincing support for the\nproposition that college admissions would be improved if\nthey were a function of class rank alone. That approach\nwould sacrifice all other aspects of diversity in pursuit of\nenrolling a higher number of minority students. A system\nthat selected every student through class rank alone\nwould exclude the star athlete or musician whose grades\nsuffered because of daily practices and training. It would\nexclude a talented young biologist who struggled to maintain\nabove-average grades in humanities classes. And it\nwould exclude a student whose freshman-year grades were\npoor because of a family crisis but who got herself back on\ntrack in her last three years of school, only to find herself\njust outside of the top decile of her class\n\n.\n.\n.\nA university is in large part defined by those intangible\n\"qualities which are incapable of objective measurement\nbut which make for greatness.\" Sweatt v. Painter, 339\nU_S 629, 634 (1950). Considerable deference is owed to a\nuniversity in defining those intangible characteristics, like\nstudent body diversity, that are central to its identity and\neducational mission. But still, it remains an enduring\nchallenge to our Nation[.] education system to reconcile the\npursuit of diversity with the constitutional promise of\nequal treatment and dignity\n\nThe dissent is quite fiery given Scalia isn't involved."}