{"doc_id": "106", "name": "2016_06_humanities_student_major_1099_compsci", "namespace": "we1sv2.0", "metapath": "", "pub": "compsci", "title": "2016-06-humanities-student-major_1099_compsci.txt", "pub_date": "2016-06-15T00:00:00Z", "Sentiment": "0.062", "Subjectivity": "0.354", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "619", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4o8ioh", "Reddit_id": "d4auath", "Subreddit_id": "t5_2qhmr", "Commenter": "spinwizard69", "length": "3530", "content_scrubbed": "Well first off every single college out there is different so you really need to get specific about what you are looking at.    CS programs vary widely quality wise so you need to hook up with someone that has been through a program at a college you are looking at.   The other problem with small colleges is that you need to be concerned about what the teaching staff was at the time your references attended.   The problem is with small programs key professors can leave creating a big hole in the staff and furthermore impacting the quality of the program.   So you need good research on what is the current situation.  \n\nIn any event I think you are missing a significant possibility here.    That is a middle ground between research colleges and liberal_arts colleges.   In this regard I'm going to suggest looking into RIT.    That is the Rochester Institute of Technology.    It isn't really a research school per say and it really isn't a liberal_arts college.  However they have an excellent CS program and allied programs.  The character of this school is a bit different than you might imagine considering the schools name.  The school is also allied with a school for the death (NTID).   I'm not death so never really thought much about it but expands the schools community.   It[.] close proximity to the University of Rochester also helps to expand the schools community.     \n\nIn any event I not sure why you are looking specifically at small liberal_arts colleges.   Generally small can be an issue especially if the college is parked some distance from humanity.  With a small college you can be very limited as you navigate your way through the world of education.     Say for example,e you take on a program in CS at a small college, how do you fit in a minor.   Further what do you do if you decide CS isn't for you.?     As for the Minor you really need to think about this as you really need one to go along with a CS degree.  As for dropping CS, you will be amazed at the drop rate at most schools.  By your second year you will be lucky to see 1/5 of the students that you started the program with.  You can always go to another school but that might impact you to the point that you are restarting your education.   Frankly I've never really understood the attraction of liberal_arts colleges if you are looking for technical education.   \n\nLet[.] take this a bit further, you want a technical education but for some reason at a liberal_arts college.   Not to knock liberal_arts colleges, especially small ones, but you won't be exposed to a lot of people with a strong technology bent.  This is important because your fellow classmates are very significant when it comes to education and you will need a few fellow classmates that can help you with the technical end of things.  Contrast this with a school like RIT that has liberal_arts classes but a very large number of technically oriented students.  This variety of students can lead to the creation of your personal educational support team.   Or in otherworldly you are likely to make friends with people that might actually help with your CS classes.  \n\nI know I've rambled on here!!😊😊😊😊.  However I'm hoping it helps with your quest.   Unfortunately I don't know of any colleges, that is small liberal_arts colleges, that fits your desires.   Frankly I haven't looked as the little bit of college I've had was decades ago.    I just think it is funny that you have so limited yourself here.  There is a great deal of middle ground in colleges.  \n\n"}