{"doc_id": "163", "name": "2016_06_humanities_student_major_1536_the_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "The_Donald", "title": "2016-06-humanities-student-major_1536_The_Donald.txt", "pub_date": "2016-06-22T00:00:00Z", "Sentiment": "0.149", "Subjectivity": "0.459", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "404", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4jnxz3", "Reddit_id": "d4jwb61", "Subreddit_id": "t5_38unr", "Commenter": "[deleted]", "length": "2364", "content_scrubbed": "I had a full blown communist tell me that I don't understand economics, and that he[.] a top tier liberal_arts major.\n\nI went to one of the nations top 5 liberal_arts schools for undergrad, followed by the world[.] top ivy league program in my field for grad school, then went on to win the top award in my industry at 33. I've made enough money that I don't have to work another day in my life... and I'm 41.\n\nI believe in hard_work, but I also believe that people shouldn't have to take jobs they hate for slave wages because they have people like you who support assholes who don't understand the first thing about economics or self-improvement/empowerment making laws that prevent them from getting the educations they need to get ahead.\n\nAnd for someone who literally grew up below the poverty line, I think I'm pretty qualified to make that claim.\n\nYou've simply bought into the fear tactics that capitalists have used through the ages to get the little people to toil away for them... and to spill their blood too. I don't know if you've actually served in the navy, but that would be the greatest laugh of all, wouldn't it? And of course, it explains why many in the military, unfortunately, buy into the same crap. They can't really accept that they've spilled their blood and watched their brothers die... all to keep some rich assholes stay in power and get even richer at the expense of the masses who they exploit for their position.\n\nBecause that would be... just too much, wouldn't it?\nNope, if you're in the military, you literally aren't fighting for America, or protecting this country, you're expanding the long reach of the capitalist system to increase markets for our corporations and enrich their billionaire CEOs (especially if you're voting for someone like the Hillary Hawk or the Trumpster Fire).\n\nCapitalism is the great lie of the 20th century. Thankfully, we've entered the 21st, and as we watch capitalism crumble under its own weight (hopefully before it completely destroys our planet) we can celebrate that a higher calling for humanity is rising, one that better reflects the moral calling of all of our religions (another hilarious thing about American Capitalism is that somehow it[.] aligned itself with Jesus/Christianity while profaning his teachings at every step, I guess, because, you know, \"Commies want to take your bibles!\""}