{"doc_id": "105", "name": "2016_06_humanities_student_major_1098_askwomen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskWomen", "title": "2016-06-humanities-student-major_1098_AskWomen.txt", "pub_date": "2016-06-15T00:00:00Z", "Sentiment": "0.037", "Subjectivity": "0.305", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "280", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4o9d85", "Reddit_id": "d4au0fm", "Subreddit_id": "t5_2rxrw", "Commenter": "gilbatron", "length": "1715", "content_scrubbed": "the \"goal\" of each field in the humanities (which is where woman studies belongs) is gaining a better understanding of the subject. what[.] the role of women in society? what has been their role in history? what comes down to nature? what comes down to nurture? can things be changed? how? should they?\n\nsometimes that understanding is very general (\"the role of women in world history\" is probably the title of half of all 101 classes on the subjec), sometimes it[.] extremely focused on a single, small part of it (\"Lesbian Against the Law: Indian Lesbian Activism and Film\" which is the title of a thesis written in harvard in 2015)\n\nThe exact details of the major depend a lot on the specific university where its taught, some may focus on history, while others include a lot of biology and psychology.\n\nit[.] interdisciplinary because it touches a bunch of other subjects (history, parts of psychology, sociology and others from the humanities, and biology and others from the \"hard\" sciences)\n\nwhen it comes to job opportunities, the humanities work different from say, engineering. the skills are more important than specific knowledge. it[.] not important to know that women are statistically more likely to become a nurse. it[.] important to be able to read and interpret statistical data. \n\nvery few history majors actually work in history. they become journalists, work for a publishing company, become business consultants, work in advertising or somewhere completely different. \n\nvery few jobs for people with a degree in the humanities actually need someone with a specific one. they mostly need someone intelligent, who knows a thing or two about scientific techniques and is interested in the subject. \n\n"}