{"doc_id": "2002", "name": "2016_08_humanities_student_major_1505_carletonu", "namespace": "we1sv2.0", "metapath": "", "pub": "CarletonU", "title": "2016-08-humanities-student-major_1505_CarletonU.txt", "pub_date": "2016-08-21T00:00:00Z", "Sentiment": "0.036", "Subjectivity": "0.228", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "277", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4ys9be", "Reddit_id": "d6qk4z1", "Subreddit_id": "t5_2s47v", "Commenter": "Dreamafter", "length": "1531", "content_scrubbed": "Not to be a contrarian, but here I go:\n\nI am a student who has been employed by the Federal Government for over a year now. Has Phoenix messed with me? Yes. Are the departments themselves working to help the students? Yes. \n\nThe departments themselves are going to top up pay until Pay Centre can sort it out. And I have some serious issues with some of the cases that have come forward. If you aren't payed for eight-ish months, why does it never occur to you that you should request an emergency salary advance? I had to initially (pre-Phoenix) and I received a cheque the next business day for it. And the system is looking like it should be mostly corrected prior to students being hired next summer. \n\nEmergency pay issues: that[.] not Phoenix, that[.] your department. Department[.] give you the advances and get reimbursed by Pay Centre. I agree greatly with u/imjustafangirl that Phoenix is a fuckup, but the alternative may be no work at all. You have to remember, in Ottawa the government is the largest employer and they desperately want to be \"an employer of choice.\"\n\nBesides, as a student for so long I even get some benefits and I already contribute to the pension plan so if I ever get hired fully I have all that pensionable time. It[.] tough to be a student for the Federal Government knowing how bad the pay system is, but new hires are getting sorted it because they don't have to migrate a file from the old to the new systems. The government can be worth it, but you have to balance it (as u/imjustafangirl said)."}