{"doc_id": "14", "name": "2016_06_humanities_student_major_143_leagueoflegends", "namespace": "we1sv2.0", "metapath": "", "pub": "leagueoflegends", "title": "2016-06-humanities-student-major_143_leagueoflegends.txt", "pub_date": "2016-06-02T00:00:00Z", "Sentiment": "0.009", "Subjectivity": "0.395", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1068", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3sey79", "Reddit_id": "d3stlcv", "Subreddit_id": "t5_2rfxx", "Commenter": "Pozay", "length": "5672", "content_scrubbed": "1) No way to give you guys / get any discussion going feedback on any matters ever. We didn't get any updates on solo queue ever. We had people (at launch of dynamic + less than 2 months from now) PROMISING us that solo queue was coming back. After that, we get posts saying \"ahh dynamic has so much issues we don't know about solo queue\", only to get told solo queue isn't coming back (you guys fixed dynamic issues ? You really think it[.] a good ranked system where we can't 5v5, don't even get too choose our roles anymore and where pretty much every pro[.] has said that the system is shit). Instead of having rioters talk to us, provide any sort of meaningful data, we get your lead communication guys saying he doesn't want to get downvoted on reddit, you guys posting graphs without x / y axis (really meaningful graph, thanks by the way for that), posting disingenuous statistics (love how that bar graph they made isn't showing us win rates of 5 solos against 5 queued together, it happens in high elo), memeing around \"hahaha you guys hate us? hahaha that[.] funny\" or just downright not saying anything for months.\n\n\n2) Stupid fucking stance on shits that makes it so the game can't develop into the \"global sport\" you guys say you want it too. Sandbox is too toxic, are you fucking real ? I get dynamic queue, you want to please the casual crowds even if it[.] against the interest of your most competitive players (which i bet some won't really be willing to leave, when they spend so much time on this game), but you could not give us sandbox because of fucking TOXICITY? Now it[.] probably gonna happen exactly like dynamic, you guys are gonna say things like \"ahh we're definitely looking at the possibility\" and just gonna keep memeing us for months / years just for it to never come out. Now I don't manage a company, and frankly I don't know much about it, but this shit has been talked since season 1 / season 2 and you obviously have some sort of sandbox when testing champions / everything. You're really going to take 4-5 years to implement a feature that should have been here as SOON as you guys said you cared about \"competitive integrity\". Honestly replays, I don't care much, and I even understand the argument of the servers, and there are 3rd party alternative, it still is a HUGE let down for me that you guys can't provide it. Host the replays on my end ? I guess I'll let that one pass. Nail in the coffin is voice chat. Now more than ever you guys say you want to promote team plays. You know what would be the best (even better than fucking forcing me to play against 5 players when I'm solo and getting my shit fucked by some lcs team) ? Giving me the fucking chance to talk to my teamates. Yes, that[.] how you push the fucking teamplay you guys want to see so much, not by making it so that I have to play against an lcs team and were all my teamates have pretty much gave up after having waited up to 90 minutes. Again, what is the reason for not having voice chat ? Toxicity. This is, again, the dumbest reason. There[.] an EASY AND FAST way you can deal with people that gets on your nerves. It[.] the fucking mute button.\n\n\n3) Your stance as a company on toxicity in general. Like I said, there[.] an easy fucking way (excuse to constant swear this shit just gets to me) to deal with toxic people : THE MUTE BUTTON. I feel like Riot has spent so much fucking resources on \"toxicity\" it makes no sense. We can't get dominion, we can't get replays, we can't get sandbox, can't get lots of features that would make the game even better but you can bet your ass that riot will be the first to act whenever something touches toxicity. I'm not here to defend tyler1, I hate him because he feeds, but it is so amazing how fast you acted in his case when we still have no fucking system for afks. FFS, we CAN'T EVEN CHECK OUR PINGS OUTSIDE OF THE GAME. That is absolutely ridiculous to me that you guys seems to care way more about someone being toxic (which can mean anything, I fucking hate that word) than a feeder / scripter / griefer. That is absolutely fucking ridiculous that you can play 4v5s all fucking game long and the system does nothing to prevent it. For 6 fucking seasons.\n\n\n\nHonestly, I don't \"hate riot\". I love the gameplay, I love the esports team, i love the arts, the music. I just fucking hate whoever is in charge of the things outside of that. Basically they prefer fucking up dynamic (which you guys have admitted WAS and STILL is fucked for high elo player) than giving us basic features like sandbox, replays, voice chat, etc. This is really why I want you guys to fail, league was a big part of my life, I've played tons of league of legends, made friends, made enemies, flamed, made big plays, finally made it to high elo, laughed, got angry, etc, but now all of that means nothing. I'm a competitive player. I want to be the best. Not high elo, I want to be the fucking best. How can I accomplish that anymore ? Am I supposed to wait 50 minutes per games, don't even get to choose my roles anymore, just to play against premades that will probably makes me lose bot lane since I have to play with a support I can't talk with against pre-mades? How is that a fair representation of skills ? Does it mean anything anymore to be #1 on the ladder when even riot admits that dynamic is a huge fucking joke right now? I don't have any goals anymore, you guys took that away from me. Honestly deep down, I understand, you're appealing to the majority of the players, which is probably the best thing to do, but I still hate you for it.\n\n\nSorry long rant and english is not my first language but I still hope you read this."}