{"doc_id": "145", "name": "2016_06_humanities_student_major_1412_askmen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskMen", "title": "2016-06-humanities-student-major_1412_AskMen.txt", "pub_date": "2016-06-20T00:00:00Z", "Sentiment": "0.126", "Subjectivity": "0.371", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "451", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4p2s2t", "Reddit_id": "d4hn8s1", "Subreddit_id": "t5_2s30g", "Commenter": "TheWarriorDude", "length": "2558", "content_scrubbed": "Hmm...\n\nOK, let[.] start with the obvious: focus on your studies. I'll be completely honest here: my friends who worked hard in school to be well-rounded (STEM **and** humanities, foreign languages, being lettered overall) are all doing well. Those who just coasted on one thing generally are doing less well or poorly. It[.] not enough to get As and Bs. You have to own your studies and *learn.* Lots of people get good grades. Fewer people actually learn something.\n\nStudy a foreign language. Become fluent. My foreign language skills have gotten me farther in life than any other skill I have. Don't just sit there in class and repeat the words. Soak up the language and let it become another tool for you to use all the time. Even if it[.] \"just\" Spanish, dive all the way in. Read the newspaper, read comics, converse with people around you. You'll learn how to think differently when you speak another language. \n\nIf you're getting bored in high school (I did despite a full AP load), take classes at a community college. You'll be challenged and get a sense of what college is like.\n\nUnless you *must* work some crappy part_time job, don't. Use your free time to study more, do internships (yes, internships for high school students exist), or learn a skill. That $5000 you save up in high school isn't going to mean shit if you lose out on opportunities down the road because you spent time you could have used investing in yourself. \n\nBetween going to the expensive private university that[.] only marginally better and going to the flagship state university, always choose the latter. Unless it[.] top 25, you're okay at any top 50 school. After that, go for the best bargain. Don't just jerk off in college and play video games. Do internships, make friends, go out and meet leaders in fields. DO THINGS.\n\nFinally, relationships: don't write off meaningful relationships in your teens. Some of us (myself included) find meaningful love in high school. I married my high school sweetheart, and we've been together since I was 16. I remain very very happy with that choice. But don't be afraid to take chances, either. TBH, it[.] very unlikely you will find the_right person in your teens-- I got very lucky. But on the other hand, don't write it off.\n\nAbove all, don't fall prey to cynicism and meanness. Be a good person and be kind to those around you. Don't be a doormat, but also don't be an asshole. Be open-minded, thoughtful, and interesting. The beauty of life is everywhere, so don't go looking for the piles of shit just so you can be a cynic. "}