{"doc_id": "140", "name": "2016_06_humanities_student_major_1355_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-06-humanities-student-major_1355_AskReddit.txt", "pub_date": "2016-06-20T00:00:00Z", "Sentiment": "0.019", "Subjectivity": "0.285", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "619", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4owy1q", "Reddit_id": "d4ggqcj", "Subreddit_id": "t5_2qh1i", "Commenter": "nytheatreaddict", "length": "3174", "content_scrubbed": "TL;DR- I have a lot of issues with my mother. And I ramble about them because it[.] 5am and I can't sleep.   \nAnxiety and depression. I don't remember ever being praised for doing well in school, just criticized when I didn't. I got to 7th grade without an issue. I still vividly remember my mom yelling at me in the hallway because I got a C+ in algebra. My mom basically forced the school to put me a year ahead in math and I just wasn't as good as she thought I was. I wasn't allowed to explore what I liked. Want to audition for the school musical? For my sister- that[.] great!  For me?  You'd have thought I was the most inconsiderate human on earth. Sister got to take acting lessons, too. Weekend art classes. Me? Quash anything that[.] girly (sister got princess dresses as a kid,  I  did not; no makeup for me) or related to the arts! I must be a doctor or lawyer! Oh, but I can be in band because my mom was and I must play the same instrument.   \nBy the time I got to high school I just couldn't do it anymore. I bullshitted as much as I could senior year (my mom still is annoyed about how I didn't take an AP science. I took 5 AP tests that year. I failed AP Calc and Stats classes but passed both AP test) but I test well and managed to get into NYU. Only non-pre-professional kid in my orientation group. I still think my mom called them and told them I wanted to be a lawyer. At the time I was interested in archaeology. Got pressured into majoring in something that could get me to law school. She[.] been doing this my whole life- want to be a coroner?  Oh, good, you'll change your mind and be some kind of doctor that makes money. Go to Cornell and study pre-vet? No, do pre-med instead you'll just change your mind. You wanna know what I wanted to major in?  Dramatic lit. Do you know what I still love years later? Theater and film.   \nAnyway, my cousin killed himself after my freshman year and my grandpa got sick and died the next and I just wasn't in a good place. I ended up taking a medical leave from school because the suicidal thoughts were awful and I wasn't leaving my room to go to class or do work anymore. My mom kept saying I dropped out. That didn't help.  \nManaged to barely graduate with a BA in political science. Still pressured out of what I  wanted because my little sister went to art school and I need to be able to make money for her.  I work for my dad[.] company and make enough to cover expenses. I'm looking at taking up subbing to have some spending money. Taking a Disney trip in November (because I can be a fucking princess if I fucking want). Want to get a post-BA certificate in marketing and advertising. I hope I'll do well so at least I'll gave those grades if I decide to go to grad school. My SO is now in the Coast Guard so I'm not looking into to much of a stable career. I'm trying to work on my confidence. I gained a ton of weight when the depression was at its worst and I got on meds. I'm no longer obese- I'm a little over 20 lbs down since January. I need my confidence to not be so tied to what my parents (mostly mom) think. I need to accept the fact that she had different standards for my sister and I. "}