{"doc_id": "1860", "name": "2016_08_humanities_student_major_224_games", "namespace": "we1sv2.0", "metapath": "", "pub": "Games", "title": "2016-08-humanities-student-major_224_Games.txt", "pub_date": "2016-08-04T00:00:00Z", "Sentiment": "0.07", "Subjectivity": "0.348", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "952", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d62l8cf", "Reddit_id": "d63pmmn", "Subreddit_id": "t5_2qhwp", "Commenter": "swanswanh", "length": "5361", "content_scrubbed": "Okay, so people actually do what you're describing.  Happens all the time.  They interpret a work as meaning one thing, use it to support their arguments, and refuse to listen to alternative viewpoints.  The more someone has of their self-worth invested in that view, the less likely they are to entertain others.\n\nHowever, I used to think that[.] all there was to it.  And if someone more knowledgeable than I had simply explained it all to me instead of huffing and puffing and telling me I \"don't get it\", I might've been saved a lot of huffing and puffing myself.  So, for the benefit of anyone reading, here[.] why people do that, and why sometimes they're not wrong (they are sometimes, just not all the time):\n\n* **Inability of the artist to communicate their intention**: This happens in all walks of life, not just in art.  Ever been totally misunderstood because of something you said once?  Yeah, happens to all of us.  To give you a video game example, if a reviewer said \"I hate Super Mario 64, it[.] dumb and for little kids and I don't know why anyone would enjoy it,\" people might argue with that reviewer.  They'll say the review was unfair and needlessly harsh.  But then the reviewer comes back and says \"No, you've completely misunderstood me.  What I was saying was that I have a love/hate relationship with Super Mario 64 because it reminds me of being a little kid and what I've lost since I got older.\"  So that[.] (supposedly) the writer[.] intention - but the review *really* doesn't come across that way.  And since all we really have to judge is the review itself, it[.] still a harsh review because that[.] how most people are going to take it.  Despite the writer[.] (supposed) intentions, it[.] still a bad review.  It[.] not unfair to say that if the majority of people need a quote from the author to interpret the review 'properly', and it still doesn't really fit to how it appeared at first glance, it hasn't really communicated its intention and can be rightly criticised on that basis.\n\n* **Context**:  Let[.] continue with that Super Mario 64 example.  So everyone knows what Mario[.] about - it[.] about saving the princess, stomping goombas and platforming fun for all ages.  Let[.] say a reviewer writes a big essay on how Super Mario 64 is 'about' a transitional period between 2D and 3D, and its 'meaning' is to invoke a sense of wonder and play, and its 'intention' was to introduce a new Mario character for a new generation.  None of those things are necessarily true - but they're not necessarily *false* either.  It[.] a just a way of looking at what Super Mario 64 'means' in a *broader context*.  It[.] not what it means in terms of the work itself, but rather what it means to everyone looking back on it.\n\n* **Teaching the humanities**:  Stuff like art, music and literature have some fundamental differences to the sciences.  We all had those teachers who would mark you down for saying something different to their opinion - those are bad teachers.  The point of the humanities isn't really the work itself, but rather teaching you the skills to interpret things and see them in a different way.  Because all people really do is interpret things and construct narratives for themselves and others.  Everyone does it, because we're humans and not robots.  Studying art and literature etc. gives you an insight into how people think and feel, and allows you to see things from their point of view, even if you disagree with them.  So when people dismiss what an artist actually said, a lot of the time it[.] not about wilful ignorance, but rather because it[.] irrelevant to the teaching of skills.  Just because Super Mario 64 is a platforming game designed for fun and a little outdated by modern standards *doesn't mean it[.] not a useful teaching tool for game designers who want to make 3D platformers.*\n\n* **Unforeseen Consequences**:  This is kind of a combination of the first and second points, and it[.] one you see a lot of in discourse today.  The creator might not have *intended* something to come across a certain way, but because of their own biases and lack of understanding, it may come across that way anyway.  You remember the old horror movie cliche \"the black guy always dies first\"?  Well, sometimes people want to talk about things like that.  The creator might be hurt and claim they're not racist or whatever... so why is it always a black guy who gets killed first in all the movies they make?  It[.] obviously not random.  What can this teach us about movies at large and how actors are treated in them?  All sorts of stuff you can talk about... none of which has anything to do with what the creator said.\n\n\nThat was a very long explanation and I apologize.  And like I said, a lot of people do just latch on to one thing and extrapolate from there while rejecting all alternatives and evidence.  You're most certainly not wrong.\n\nBut there is often a bit more to it than that, and it[.] up to the individual to figure out if someone has a considered, thoughtful point to make about the 'meaning' (what a tricky word that is!) of a work, or if they're just yapping on and on about whatever[.] on their mind and using someone else[.] work to make their point for them.  I'd hate for people to think it[.] *always* the second one, because I used to, and I missed out on a lot of interesting and cool stuff."}