{"doc_id": "1844", "name": "2016_08_humanities_student_major_61_zen", "namespace": "we1sv2.0", "metapath": "", "pub": "zen", "title": "2016-08-humanities-student-major_61_zen.txt", "pub_date": "2016-08-01T00:00:00Z", "Sentiment": "0.145", "Subjectivity": "0.489", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "244", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vovtm", "Reddit_id": "d608osx", "Subreddit_id": "t5_2qhmf", "Commenter": "nahmsayin", "length": "1492", "content_scrubbed": "So you're saying it[.] illegitimate because it[.] missing just that one magic special ingredient: sweet, juicy, specially handpicked quotes from one of your personally approved Official Zen Masters, sponsored by the /r/zen Lineage Texts Wiki?\n\nThis is pure literati Zen, the kind that many Zen practitioners warned about. Not only that, it[.] armchair literati Zen. What makes you qualified to sardonically comment on and demean other people[.] scholarship when you have both admitted to and are obviously not one anyway, \"not being a scholar\". \n\nWhat you're arguing is the humanities analogue to people calling into question climate change and then labeling anyone who even loosely ascribes to it as an apologist for science at large. You hold onto your beliefs harder than a rabid pitbull .< Please wake up before you find yourself in pure conspiracy land, wherein every bit of academic scholarship which diverges or refutes your particular understanding of Zen (which is to say, the vast majority of it) is part of some grand religious conspiracy that warps and biases the minds of academics or commentators. This is none other than pure personal attack, ad hominem, character assassination masquerading as a scholastic book review. Basically just boils down to, \"I bet this author is a Jew, err I mean Soto Buddhist\". C'mon ewk, you can do better than that. It[.] not hard to launch a decent critique of a work like this without resorting to ethno or theocentrism. You're better than this. "}