{"doc_id": "70", "name": "2016_06_humanities_student_major_772_tiadiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "TiADiscussion", "title": "2016-06-humanities-student-major_772_TiADiscussion.txt", "pub_date": "2016-06-10T00:00:00Z", "Sentiment": "0.066", "Subjectivity": "0.325", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "329", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nezng", "Reddit_id": "d43hf5p", "Subreddit_id": "t5_2zsos", "Commenter": "youngrifle", "length": "1920", "content_scrubbed": "Some people with gender studies or women[.] studies degrees stay in academia or university administration, although the same could be said for many other more \"traditional\" degrees. One friend of mine with a women[.] studies degree is a social worker; another works at a rape, molestation, and sexual assault counseling place. ANOTHER works in museums, and another works in something I don't really understand but it seems to be marketing. \n\nSome of these degrees probably do have the tumblr feel to them, but at least at the university I went to, women[.] studies classes were fairly rigorous. A lot of them were interdisciplinary and brought on faculty from history, religion, etc. so you might take a class on women in Islam. Also, at my school, because of the interdisciplinary nature of the department, such courses were cross listed so a women in Islam course would be both women[.] studies and religion, which could help you do what many people in the liberal_arts do: earn a double major. (Just FYI: I only took one women[.] studies class in college and it was an intro level course to fill up an elective spot. But I worked with a lot of faculty in that department and had a lot of friends who double or dual majored in women[.] studies and something else.) \n\nFinally, as to your title, in the US (or at least the south, where I'm from), \"social_studies\" is not the term you are looking for. Social studies a term heard most often in middle school/junior high (roughly ages 12-14) and high school (roughly ages 15-18). It might denote a class that teaches history, civics, government, etc. or any one of those things. At the high school where I teach, we have the \"social_studies department,\" which has separate classes on history, economics, psychology, etc. The term you are probably looking for is something like \"ethnic studies,\" although ethnic studies is not necessarily, in my opinion, an extremist discipline."}