{"doc_id": "54", "name": "2016_06_humanities_student_major_585_askuk", "namespace": "we1sv2.0", "metapath": "", "pub": "AskUK", "title": "2016-06-humanities-student-major_585_AskUK.txt", "pub_date": "2016-06-07T00:00:00Z", "Sentiment": "0.107", "Subjectivity": "0.417", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "558", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d408ugk", "Reddit_id": "d40a58h", "Subreddit_id": "t5_2t4s3", "Commenter": "360Saturn", "length": "3141", "content_scrubbed": "Okay. Well first off it would depend what you are studying, what subject(s), because different subject areas will have *vastly* different formats.\n\nFor essay based subjects and humanities, arts, etc., you would expect to have one long_term deadline for the end of semester and an exam either at that time or at the end of the academic year. On top of that you would expect to have several more assignments spaced out through the term, as well as preparing work for each of your classes. Your course handbook should tell you if you're able to miss classes. Some courses' workloads are set up such that there is too much to do for you to attend every class; you are expected to pick the ones that interest you most and focus your work in those areas to come very prepared.\n\nIn terms of\n\n As for assignments, professors are always happy to help with planning out essays and providing feedback and answering questions.\n\nexpect this to vary wildly. Your 'professors' are likely to have other commitments on top of teaching, whether they are staff who research and publish, or, commonly, PhD students who teach or supervise some undergrad classes as a side form of income and experience. I don't know whether that[.] the case in the US as well, but in the UK, teaching is often only a small part of what the professor does as part of the university. It depends how good they are at managing their time and how busy they are.\n\n We usually have several tests and 3-4 essays over the course of the term and are also graded on participation and attendance in class.\n\nThat would be common in the UK as well, probably. Likely expect less help on drafting/re-drafting essays, unless you set up or become part of a study group - you're often marked on getting things right first time.\n\n Participation is often worth 10-15% of the grade, tests and essays around 15% each, and our final assessments usually make up the largest portion of our grade at 25-30%.\n\nAgain, it depends on what you're studying, but you would usually expect your final exams/assessments to make up at least 50% of your overall grade. Class participation would be between 5-10%, and the rest would vary based on what you were studying. Science students could expect to have tests or labs that made up part of their grade every week or two, and so have small percentages for each, arts and humanities students would be more likely to do a long, drawn-out piece of work and a smaller piece of work to make up the other 40-45%.\n\nIn terms of other things to be aware of, grade boundaries are different and also marked differently, and also, make sure you know which referencing system your course wants your written work to use. The system you are familiar with might not be the one they are looking for, British universities vary even between subject areas.\n\nOn that point, expect a smaller variety of classes to choose from. The UK, broadly, does not have the American system of college where you major in something and can do a bunch of other random credits alongside; generally, you pick one subject to study, and each class you take will be on a more focused aspect of that same area."}