{"doc_id": "157", "name": "2016_06_humanities_student_major_1483_california", "namespace": "we1sv2.0", "metapath": "", "pub": "California", "title": "2016-06-humanities-student-major_1483_California.txt", "pub_date": "2016-06-21T00:00:00Z", "Sentiment": "0.053", "Subjectivity": "0.314", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "318", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4isx32", "Reddit_id": "d4iu6dr", "Subreddit_id": "t5_2qhsz", "Commenter": "the_singular_anyone", "length": "1872", "content_scrubbed": " It[.] not just about education, it[.] about the Federal Government over-reaching their constitutional mandates to concentrate power and corruption in Washington DC.\n\nI'm not sure we see it the same way. \n\nWhile unknowable political power games undoubtedly transpire at the federal level, either optimism or blind hope has me say that the priority of the Department_of_Education is education, not the consolidation of power. \n\nI disagree. Education system now is crap compared to what it was before the Dept of Education was created. \n\nThe DoE has existed in some form or another since 1867. It coalesced into a full-fledged, independent department in 1979. \n\nSo: which \"before\" are we talking about? I'm not sure I have confidence in either the education system of 1867 or 1979 being better than our current incarnation, at any rate. \n\nDo you think the educational standards set by DC are for the best interests of students? Or do you think the standards are set by whichever lobbyist contributes the most to a political candidate? \n\nI think those questions are above my pay grade. Contemplating or bemoaning them won't do me, personally, any good. Nor, importantly, will it help the kids I teach. \n\nLook, I'm not saying the federal government is spotless. Far from it. But it does no small amount of good in making sure our education system doesn't *utterly* devolve into backwoods madness. \n\nOr, y'know. Moreso than it already is. \n\nAgreed, but they don't all have to be exactly the same and there is plenty of room to account for the desires of the local community.\n\nYeah, it[.] not a hard-and-fast, and there[.] plenty of elbow room. \n\nAll I really want is for every school to have a place for the arts, no school to throw away hard_science or recolor history, and no (public) school to preach a One True Faith to their students. Beyond that, I'm game for near anything. "}