{"doc_id": "134", "name": "2016_06_humanities_student_major_1315_thebluepill", "namespace": "we1sv2.0", "metapath": "", "pub": "TheBluePill", "title": "2016-06-humanities-student-major_1315_TheBluePill.txt", "pub_date": "2016-06-19T00:00:00Z", "Sentiment": "0.061", "Subjectivity": "0.365", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1298", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4et7zj", "Reddit_id": "d4flwc6", "Subreddit_id": "t5_2vzvv", "Commenter": "[deleted]", "length": "7525", "content_scrubbed": " A lot of men struggle for years (decades, sometimes) trying to \"do the_right thing\".\n\nThat[.] called being alive. We all do this. If we didn't struggle with it, it would be because we wouldn't be recognizing the nuance and complexity of issues of morality. \n\n In our modern society, they're not rewarded for it.\n\nWhy should they be? 'Not being an asshole' is the default position. It[.] adopting a state of not detracting from society and from other people. You start from 'not being an asshole', and work up from there. No one owes the 'not an asshole' sex because he wasn't an asshole. \n\n They're frustrated when their natural urges to be nice and charitable and providing for women are not met with gratitude, but scorn.\n\nAgain, why should women have gratitude that you're not an asshole? \n\nAnd as for the second part, I keep hearing this, but I honestly have no idea what you're talking about. And neither do guys I've known, and had discussions with outside the manosphere. I've always been nice to women. And never once have I been rejected based on that. Have I dealt with some female assholes? Absolutely. Have I been rejected? Sure. We all have. But me being nice had nothing to do with it. Which brings me to something else about this.\n\nI suspect when you say 'nice' you're referring to doing this token gestures with the express purpose of getting sex. And let me tell ya, women tend to see through that shit rather often. They might be flattered, but as soon as it becomes apparent that he[.] just doing it because he expects  'reward', it[.] going to turn her off. Not because he[.] a 'beta', but because he[.] not being organic.\n\nThis: \n\n**He does x 'nice' thing. She goes 'Oh what a gentleman. How sweet. Let me reward him with a nice blowjob'. He looks at the camera with a cheesy grin and a thumbs up. Success!**\n\nIs not real life.\n\n In the absence of a traditional family unit, in a world where women \"don't need a man\", what[.] the point in acting like a traditional men?\n\nGood question. Welcome to feminism 101.\n\nIt[.] not that being a 'traditional man' is bad if it works for you and yours. It[.] a matter of it not being a strictly culturally expected paradigm. Same with 'traditional' women.\n\nIf you want to be a traditional man, no one is stopping you. And there are plenty of women out there (provided you're currently single) who are a perfect match for it.\n\n Men get fed up with trying and cast themselves into new roles instead.\n\nWhich men? The only men I hear saying this are guys in the manosphere, and those who are aligned with their beliefs. Who, as a result, I highly doubt have ever given the notion serious thought. Instead it[.] always, 'these sjw/feminists have an irrational hatred of men, or else place blame on men because they lack accountability and thus want to change us. Fuck them' instead of actual consideration of what[.] actually being said.\n\n Shockingly, women who don't need a man are very upset at men who don't need a woman.\n\nWhat women? I keep hearing about these legendary women stewing about those men who stay single, and who get upset and insecure at the notion. But still only time I see reference to them is in the manosphere. Speaking of which, the general response I see from men and women to MGTOW is 'You want to go your own way? Fine go. Go do your thang. No one[.] stopping you.'\n\n I'd challenge you to name the significant ones, but I've had that discussion and it[.] boring.\n\nWhy, because the discussion is about women? You've gotta love the qualifier you're sneaking in here, rendering the whole thing pointless. No matter what is cited, you can say 'doesn't count because it[.] not *significant*'.\n\n The contributions of women to the sciences have been extraordinarily small.\n\nYou seem to have missed my point. Historically societies have been structured away from the idea of women doing things like this. Thus, mostly men have. But _despite this_ many women still managed great accomplishments in the sciences.\n\nhttps://en. wikipedia. org/wiki/List_of_female_scientists_before_the_20th_century\n\n They're more suited to the arts. It[.] a biology thing. Female brains are wired to be more emotional than logical - this produces better results in art than in science.\n\nHow shocking that you come around to the gender essentialist handwave of everything that doesn't align with your beliefs.\n\nPlease explain the science behind this, and how scientists have used the data to show that it[.] the reason behind historical trends, with cultural biases apparently having little to no impact whatsoever. \n\n Female brains are wired to be more emotional than logical\n\nPlease define 'emotional'. We humans are driven almost entirely by our emotions. Logic takes a back seat for all of us, of all genders. Hell, emotion is how and why we justify and give meaning to our very existence. Logically speaking, human beings have no purpose whatsoever. We exist because we procreate. Like all other life. Yet we romanticize everything we do and ascribe meaning to that which is utterly devoid of such properties, objectively speaking. \n\nYou were driven by emotion to respond to my post. I'm driven by emotion to respond to yours. The men you say are 'fed up' with this and that are operating on emotion. You felt emotion when you've been bored by discussions of female scientists.\n\n I skimmed your post history and apparently you're a man? I can't tell, there are too many people wanting to be too many genders these days.\n\nMWAHAHAHAHA!\n\n Anyway, you're never going to get anywhere in life if you continue to play make believe and pretend that women have all these accomplishments that you can't actually name.\n\nActually, I'm getting along in life just fine. Somehow I'm making it work without you. Imagine that. \n\nAnd again, you seem to have missed (or dodged) the point actually made. I said historically *despite* trends, still many women managed to do some pretty cool shit in male-dominated fields. I don't know why that[.] not clear to you.\n\n You need to realize that men conquered the world and women just helped out a bit.\n\nYup. Occasionally the women stopped eating their ancient bon-bons and picked a few berries. Let[.] pat them on the head condescendingly. \n\nBloody 'ell.\n\nSo, let me see if I have this right? By cultural design, men had most of the glory and leadership and broke the most technological ground, due to historical structure of societies demanding that men take this role and women stay behind the scenes and support the men. So now that that[.] changed, we're going to reference that fact, go 'na nana na na' and use it as evidence women are intellectually inferior. Then proceed to ignore every exception to this cultural norm, and complain that society is not currently like these historical societies were, where men at long last don't have a large majority hold on power and glory.\n\nIn other words, we should feel sorry for men because for the first time in history they don't always run the fucking world.\n\nSorry, I just can't muster much in the sympathy department for that one.\n\nSnark aside, why do you give a shit what other people think about what kind of man you are? There are a lot of loud douchebags out there who like to demean and degrade because they're insecure douchebags. \n\nIgnore them. Just be a human, and follow your principles, think critically about life. That[.] something we all have to do. Has nothing to do with gender. \n\nAnd let me know how it goes, I'm still on that journey myself. And a long road stretches ahead of me.\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}