{"doc_id": "2010", "name": "2016_08_humanities_student_major_1603_math", "namespace": "we1sv2.0", "metapath": "", "pub": "math", "title": "2016-08-humanities-student-major_1603_math.txt", "pub_date": "2016-08-22T00:00:00Z", "Sentiment": "0.093", "Subjectivity": "0.367", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "352", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6rm9nu", "Reddit_id": "d6sh66t", "Subreddit_id": "t5_2qh0n", "Commenter": "Homomorphism", "length": "2161", "content_scrubbed": "Having taught multivariable calculus (and studied differential geometry), my experience is that the vast majority of students won't understand \"the secrets from differential geometry\" without already knowing multivariable calculus.\n\nI think it[.] possible to *hint* at modern differential geometry in Calc III. For example, you can justify \"total differentials\" by treating them as covector fields. Of course, you don't want to call them that, but you can explain the idea that way.\n\nA minority of students would be able to take some kind of hybrid course, teaching the important parts of Calc III while also talking about manifolds. But that would only work for very strong students, maybe who have already seen the material.\n\nFinally, a major part of the course is learning how to write down multiple integrals over non-rectangular domains. These integrals aren't differential geometry, they're more analysis, but being able to write them down is a very important practical skill for calculating stuff.\n\nOn the other hand, if by \"differential geometry\" you mean \"differential forms\", then I agree with you to some degree. The algebra of wedge product isn't any scarier than cross products, and I think it[.] a bit easier. There[.] a pretty cool text^1 that teaches both multivariable calc and linear algebra using differential forms.\n\nThere are two difficulties to this. The first is that you need more linear algebra knowledge than is usually assumed for Calc III. I *think* you can teach what you need without it, but it may be better to teach Calc III and linear algebra in a combined, yearlong course. This is the approach of Hubbard[.] book.\n\nThe second difficulty is that many of your students are engineers and physicists, who need to know how to work with classical vector calculus. You can teach them to translate, but that[.] time lost you could have been teaching. You could also hope the physics faculty decides to change how to teach E&M, but that[.] probably hoping for too much. Maybe at a small liberal_arts college...\n\n\n1. It[.] called *Vector Calculus, Linear Algebra, and Differential Forms*, by Hubbard. Someone else has already mentioned it."}