{"doc_id": "36", "name": "2016_06_humanities_student_major_363_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2016-06-humanities-student-major_363_RPI.txt", "pub_date": "2016-06-04T00:00:00Z", "Sentiment": "0.056", "Subjectivity": "0.303", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "410", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3wct9v", "Reddit_id": "d3wdmwz", "Subreddit_id": "t5_2rg3u", "Commenter": "atnorman", "length": "2260", "content_scrubbed": "What is your opinion on dual majoring as opposed to double majoring?\n\nDual is a year less, so in general I just don't see the point in a double degree. There might be some situations where it[.] better, not grad school to my knowledge.\n\nI'm Physics/Math and I quite like it. I have some Physics/CS friends who like it as well. My only comment toward Physics/Math is that how you'll end up feeling will likely depend on your concentrations. I'm taking the pure physics and pure math concentrations, away from applied stuff by and large, but people from physics kept pushing me towards applied math. So I tried that out and hated it. So I think if I went physics/applied math I'd have been miserable, but I really, really enjoyed the more pure math courses, even if they're not what the physics dept recommends (as a note, when pressed they'll admit all of the pure math classes offered are actually useful in theoretical physics). So you have to think about if you're just taking math to bulk up your physics capabilities, or if you genuinely love math as well.\n\nAs a few notes aside from this: Get to know your advisor in both departments. Even if you think you know what you're going to do, check in and talk every once in a while. We have two great libraries for math, both the main library and on the third floor of the math building. Use them both - especially the one in the math building, some of the books are incredibly interesting, they have multiple copies of PM, so even just from a historical standpoint it[.] a great resource. Take some humanities courses that you think sound fun, get a minor if need be. I'm of the train of thought, advanced by Lee Smolin and some others, that much of the problems currently plaguing physics come from the fact that physics has walled itself off from other ways of thinking, and so while we might be mathematically very adept, we've lost the insight that made the brilliant minds at the beginning of the twentieth century able to do so much. That said, avoid the STS department. There are larger issues for that that I can expound upon at length, but it[.] due to actual interactions I've had with them. Avoid taking logic with Bringsjord, take it with the other professor. And if you can take a Puka class, do so."}