{"doc_id": "2036", "name": "2016_08_humanities_student_major_1878_foodforthought", "namespace": "we1sv2.0", "metapath": "", "pub": "Foodforthought", "title": "2016-08-humanities-student-major_1878_Foodforthought.txt", "pub_date": "2016-08-25T00:00:00Z", "Sentiment": "-0.02", "Subjectivity": "0.24", "Score": "26", "Upvotes": "26", "Downvotes": "0", "Wordcount": "568", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6wabvn", "Reddit_id": "d6wd2no", "Subreddit_id": "t5_2rete", "Commenter": "GGKind", "length": "3328", "content_scrubbed": " The administration tends to handle cases of sexual assault and harassment poorly or with little or no disciplinary action\n\nWait, so your proof of this is an article about a list someone on Tumblr made with a bunch of names of students who are rapists based on little to no evidence? \n\nHow could the university act on this? They aren't police. They can't punish people without evidence. They aren't detectives. Why hasn't any of this actually been taken to the police? \n\n as well as taking no action against explicit cases of racism in greek life.\n\nGreek frats are not a part of the official student body. What is the university supposed to do, expel a student because they said something racist in an email? Get the cops to arrest them?\n\nThey might be racist assholes, but they were being racist via private leaked emails. And if you can be kicked out of school because of things you do or say in your personal time that aren't illegal and affect no one, well thats pretty damn Orwellian and terrifying. \n\n This culminated at the end of the last quarter with our student-body president almost getting expelled for letting protestors into the administration (which was locked because they were worried about protestors entering the building).\n\nDid you ever think that breaking into a locked administration building (aka private property) is against the law and that is why he almost got expelled? Your school sounds freaking insane.\n\n Related to this, one of the only proven ways to get the administration to listen to your concerns is through protest\n\nOr maybe you guys are a bunch of whining children and you get pissed for an administration not waiting on your hand and foot or talking about issues they are not wiling to change. Private businesses don't owe you anything. If you bring up an issue to your boss and he says \"Ok. I hear you. But we aren't changing\" you don't go and start protesting to get your way. You will get fired.\n\nColleges are a business and you are paying to use their services. Go into McDonalds and start making demands from them and see how far that gets you. Schools are not your parents and they are not a daycare.\n\n There has been considerable downsizing and austerity measures taken in the previous few months, which have been severely disruptive to some departments (firing invaluable administrators in the department) and have disproportionately affected the Humanities while largely leaving the Sciences untouched.\n\nWhy do you think that is? Do you think it[.] because the administration are Disney villains that hate liberal_arts majors because you're too free spirited? \n\n The administration, more and more, feels out of touch with the student body, and seems more concerned with monthly returns on investment than fostering an intellectual haven. \n\nAn intellectual haven is a place of learning. It is not a place where you get everything your way at the expense of the other students. It is not a place where the students decide how things are run instead of the administration. It is not a place where kids are expelled because of conversations they between friends in private and it is not a place where vigilante justice is imposed based on witch hunts. \n\nMy recommendation to you is this: Stop giving a damn about the school politics and actually use the school for what is intended. \n\n"}