{"doc_id": "1858", "name": "2016_08_humanities_student_major_204_theredpill", "namespace": "we1sv2.0", "metapath": "", "pub": "TheRedPill", "title": "2016-08-humanities-student-major_204_TheRedPill.txt", "pub_date": "2016-08-03T00:00:00Z", "Sentiment": "0.03", "Subjectivity": "0.376", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "630", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4w0ow3", "Reddit_id": "d638psq", "Subreddit_id": "t5_2ve1u", "Commenter": "ShallITinder", "length": "3437", "content_scrubbed": "I am going to offer some reasons for this, some of which involve feminism.\n\n1 - Lower quality of women in general now compared to a while back.\n\nBlame it on feminism, fat acceptance, or whatever you may want; men have to be the ones looking good while women are immediately above a 7 these days if they aren't facially deformed or obese. In the 90s you would walk around the mall and see so many hotties compared to now where you see so many fat girls, skillrex haircut women, and other women who have horribly deformed their own appearance. All of this leads to a large amount of good looking guys who are in great shape (since the pressure is now on the guys to look good, you can easily insult a man for his appearance) fighting for a much smaller pool of good looking girls. \n\nI have found that some parts of the USA are exempt for this but most I would say are not.\n\n2 - Fear, single parent homes, and the rise of the helicopter parent.\n\nBlame the tiger moms for creating a bunch of spineless young guys who lack confidence and are too scared to approach women. I don't know what led to it but helicopter parents are one of the biggest setbacks a guy can have in life if his aspirations are to be a player. You have to leave kids alone in their teenage years to experiment or else you are going to have stunted growth in your kids.\n\n3 - Economic situation.\n\nNow more than ever, more and more younger people are living at home with their parents after college. A college degree today is equivalent to a high school diploma a couple decades ago. Now add to that the fact that the college degrees which do lead to employment (engineering mainly) tend to require a lot more time and dedication. The college kids you see partying and living it up on spring break are usually liberal_arts and advertising majors who will be screwed in the job market after graduation unless they are very well connected by their families. From my experience, it is very hard to date around and get laid when living at home with parents compared to living on your own.\n\n4 - We just don't care anymore as a society, empathy is dead.\n\nWe don't care for each other like we used to, everyone is out for themselves now. These days, there is less of a sense of community and people are starting to just give less of a crap about each other. A lot of this had led to lonely frustrated men lashing out (Eliot Rodger was an example of this). Many decades ago, whenever a stranger moved into town or someone was suffering, people would reach out and try to actually help them. I also blame a lot of this on issues such as a rise in immigrants who won't assimilate into American society and American people growing more weary rather than being as trusting of each other as they once were. A rise in divorce rates and the war on men has also led to this horrible situation.\n\n5 - White population is lower now, more immigrants in the western world.\n\nLets admit it, whites are generally the most promiscuous race. The whole hookup culture and \"college experience\" thing, it all revolves around whites, the whites invented it. With the rise in cut throat academically inclined immigrants from the third world and those who are more religious, promiscuity and the same open minded hookup culture are slowly dying out. \n\nOther than that, feminism has led to women having unrealistic expectations about men. An overweight whale now feels entitled to a John Stamos, not good."}