{"doc_id": "174", "name": "2016_06_humanities_student_major_1665_uwaterloo", "namespace": "we1sv2.0", "metapath": "", "pub": "uwaterloo", "title": "2016-06-humanities-student-major_1665_uwaterloo.txt", "pub_date": "2016-06-23T00:00:00Z", "Sentiment": "0.092", "Subjectivity": "0.36", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "356", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4pk0em", "Reddit_id": "d4lljat", "Subreddit_id": "t5_2rb5s", "Commenter": "atomala", "length": "2033", "content_scrubbed": "Note that this information is for Natural Sciences (includes Math) and Engineering research, not medical or humanities research.\n\n How did you approach a professor to talk about possibly supervising a research topic? \n\nIf you don't have a topic, try finding profs with research interests similar to yours and try talking to them about their research. Then inquire if they have a position open.\n\nIf you do have an idea, try finding profs with a research interest in that topic. Also talk to them about their research and then suggest your idea. If they like it, then ask them if they can help you with it.\n\n Is it a good idea to have a specific research topic in mind before you contact the professor?\n\nI would say yes since it shows the professor that you are already knowledgeable about the field. This shouldn't discourage you from talking to a professor if you don't have a topic; sometimes they may have a few ideas that they didn't pursue on their own yet.\n\n And what is the process of using a research position as a co-op work term?\n\nAt UWaterloo, you should apply for an NSERC USRA, which basically is government funding (+ some UWaterloo funding) for you to do undergrad research. I believe that coop students need to apply for this ~4 months ahead of time but I can't remember for sure. Anyway, before applying, you need to have a professor that will take you in and decent marks (~78% or higher). If you don't qualify for a NSERC USRA, I believe you can do an unpaid research coop, but that may not be desirable.\n\nFor other universities in Canada, you would probably also go with a NSERC USRA application. \n\nFor US universities, the prof will typically fund you themselves since the NSF usually funds the prof and expects them to fund their students. It may be a bit harder since different US universities have different policies regarding international students visiting for research. One nice thing is that decent marks are not mandatory like Canada for getting funding.\n\nIf you have any questions, feel free to ask them."}