{"doc_id": "150", "name": "2016_06_humanities_student_major_1428_personalfinance", "namespace": "we1sv2.0", "metapath": "", "pub": "personalfinance", "title": "2016-06-humanities-student-major_1428_personalfinance.txt", "pub_date": "2016-06-21T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.355", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "294", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4p3eey", "Reddit_id": "d4hya4u", "Subreddit_id": "t5_2qstm", "Commenter": "electricgrapes", "length": "1609", "content_scrubbed": "Bottom line is, I highly recommend you go somewhere cheaper. Where do you live? Look at state schools outside the northeast. It was cheaper for me to go out of state to NC than stay in state in NJ. By a lot. Then I established residency two years in for a giant tuition cut. And that[.] just NC; there are tons of states with even cheaper. \n\nHowever if you're absolutely set on staying nearby (which you shouldn't be), the most important question is: *what is your major and what is the career outlook of that major?* what is the expected starting salary? \n\n\nAre you going for art, humanities, basket weaving? You shouldn't get the degree unless it[.] free. Don't pay for a useless degree. Full scholarship, sure. Go for it.\n\nAre you going for something with lots of jobs but not great pay? I'm thinking like teaching, social work, social science? Go to a very cheap state school in a state with a good economy. \n\nOr are you going for something in high demand with high paying jobs? Personally I still wouldn't spend much, but you have some flexibility. Take it from someone you graduated with an in demand degree (CS). College was almost worthless to me. I learned everything I need for my career in internships. I got my awesome job because of my experience. Not my college. No regrets on not choosing a more expensive school. I would have been lucky to end up in the same job. That being said, I make plenty of money and my loan payments are $106 a month. I could definitely afford more. If it[.] worth shelling more out monthly for the next 20+ years of your life to get a fancy college experience, go forth."}