{"doc_id": "27", "name": "2016_06_humanities_student_major_259_daystrominstitute", "namespace": "we1sv2.0", "metapath": "", "pub": "DaystromInstitute", "title": "2016-06-humanities-student-major_259_DaystromInstitute.txt", "pub_date": "2016-06-03T00:00:00Z", "Sentiment": "0.116", "Subjectivity": "0.376", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "904", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4mceyw", "Reddit_id": "d3un7ks", "Subreddit_id": "t5_2whek", "Commenter": "[deleted]", "length": "5731", "content_scrubbed": "Most of these points are just differentces between Starfleet[.] organizational structure and the modern U_S armed forces' organizational structure. Which makes sense, since it[.] 250 years in the future and an entirely different organization. The contemporary U_S Navy is structured a fair bit differently from the Royal Navy that was operating in North_America before the Revolutionary war, too. Aside from Miles' pips being in a state of flux and a flubbed line over his Academy training, none of these problematic or inconsistent within the context of the show.\n\nPositional authority trumps rank, and COs have broad authority to assign personnel in positions, regardless of their rank. Chief O'Brien[.] not an officer, but he[.] chief of operations, so every enginner and maintenance worker in Starfleet and the Bajoran Militia posted to the station is under him in the chain of command. Captain Maxwell flexed the same authority when he made O'Brien his tactical officer. The chain of command is clear, formal, and unambiguous, but it[.] not strictly based on rank, and COs are largely unrestricted in what stations they can assign their staff to.\n\nStarfleet Academy is a comprehensive school. It[.] aimed at preparing people for careers in Starfleet, and graduation is a prerequisite to being granted a commission as an officer, but it doesn't just provide officer training. It has training programs for enlisted personnel, courses in science, engineering, social science, humanities... Starfleet wants Miles to teach engineering because he[.] one of the best engineers there is. They probably won't have him running people through bridge officer training tests, because he[.] not qualified for that.\n\nThe Captain[.] Chair: Admirals in Starfleet are assigned to starbases and command centers and have broad authority in a certain area (either operational, like Starfleet security, or geographic, like fleet operations and strategic and policy decisions with a particular sector). They have desk jobs; they're not permitted to directly command a ships or fleets except in the short term to respond to emergencies. Small starship groups operate under the command of the commanding officer who[.] operating the tactically superior vessel, rather than a higher-level flag officer position. The kind of battlegroup and flotilla command positions you're describing don't exist.\n\nAn officer[.] duty: Most of Starfleet[.] personnel are officers. This change happened because the social and economic barriers to higher education opportunity barriers (ie, advanced officer training at the Academy) have been eliminated, a large portion of blue collar work has been automated, and the idea that white collar work is automatically better and more valuable than blue collar work has largely disappeared. Enlisted personnel training programs are taken as specialized fast-track programs by people who want to get into space ASAP; most of them eventually go back to the Academy for full officer training. Since officers comprise most of a starship[.] staff, they do most of the work—sometimes including scrubbing manifolds—and only senior officers are regularly in leadership roles.\n\nCletus the slack-jawed yokel: Dear lord, that[.] an ugly and offenseive stereotype of the American rural poor, but that aside, Trip isn't stupid. He[.] a mechanical prodigy. He stuggled with math, but figured it out—plenty of smart people have failed a first year calculus class or two before getting it down. He attended college, and so far as we know, probably did very well and got very far in it, but got impatient and wanted to get right to Starfleet training. Point is, he[.] smart, was qualified except for a couple of credits and a convocation ceremony, and had immense natural aptitude as well as enthusiasm, focus, and interpersonal skills. 22nd century Starfleet is a little less procedural and a little more holistic about screening officer candidates than the modern U_S armed forces.\n\nThere may be some interesting conversations to be had about *why* Stafleet[.] structured the way it is and what that advantages and disadvantages are. Certainly, a lot of it was for out-of-universe storytelling reasons; some was because writers weren't familiar with naval operations and didn't have comprehensive guidelines to work with, and some was because Gene had decreed that enlisted ranks would be abolished in the 24th century, so they had to work around that by expanding the operational duties of officers. In universe, it has to do with what appears to be an ongoing debate and tension around the role of Starfleet (which acts as a military when it needs to, but is expressly not supposed to be one). But I don't think this is the_right track for finding those interesting discussions... these things aren't wrong, they're just different.\n\nAs an aside, parallels to the post-revolution Red Army are very, very thin, aside from being in some manner inspired by an ideal of greater equality. However, it[.] worth noting that during the time that the U_S S. R. used purely positional ranks, the Red Army won the Russian Civil War, several armed conflicts with China, had limited success in a campaign against Finland and nearly completed a successful invasion of half of Poland. In other words, the Red Army was not crippled by the reorganization. And it didn't become any more effective when personal ranks were re-introduced. By most accounts, it wasn't until Stalin[.] mass purges of the army[.] leadership that its morale and effectiveness plummeted, and it only recovered as a new generation of officers (some of which had never had non-positional ranks) had gained enough experience to be more effective in their command positions."}