{"doc_id": "217", "name": "2016_06_humanities_student_major_2136_writing", "namespace": "we1sv2.0", "metapath": "", "pub": "writing", "title": "2016-06-humanities-student-major_2136_writing.txt", "pub_date": "2016-06-30T00:00:00Z", "Sentiment": "0.055", "Subjectivity": "0.346", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1164", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4tr616", "Reddit_id": "d4trojf", "Subreddit_id": "t5_2qh2n", "Commenter": "crowqueen", "length": "6788", "content_scrubbed": "It[.] OK. Student life in the UK is pretty diverse these days, particularly at a large place like Oxford or Cambridge, but it[.] so long since I was there as an undergrad (postgraduate studies - what we call grad school - are very different in terms of atmosphere) that I don't know how people would talk today, but chances are it would be not much different to any student body in the UK. \n\nAll of the rest of this is directed at OP:\n\nIt[.] highly likely there[.] a lot of international students and faculty members, as well as the push to get students from less advantaged social backgrounds into the top flight universities (despite the ever-increasing tuition fees). Anything casting these places as Hogwarts is likely to be unrealistic.\n\nNow, if OP was to set their work at a school like Eton, that might be very different. There'd still be colloquial texture to speech, but to most of us that would still be a fairly rarified environment. Again, unlikely to be completely undiverse, and likely to have a range of international students, but not of the same mixture as the average Oxbridge college. \n\nSpeaking of which: colleges. Not the same thing as a university in the UK. Generally speaking, in the UK you don't go to college, you go to university, shortened to 'uni'. However, Oxford, Cambridge and a few other UK universities have 'colleges', which in our case means a sub-division of a university, not quite just a dorm, but not a single full institution. My cousin went to Oxford University, but was part of Merton College. For intance, for my undergraduate degree, I went to the London School of Economics, part of the broader University of London, but an autonomous unit with its own admission policies, and focusing directly on the social_sciences. If you want to do natural sciences at the UoL, you can go to a general 'college' such as King[.] College or University College London (UCL), but there[.] also a dedicated institution for nat-sci called Imperial College. Birkbeck College is an institution \n\nMost other universities - like where I did my Master[.] degree, at the University of Reading - are just called universities, usually 'University of X' or 'X University'. They range from the top-flight institutions such as Durham, York, Warwick, Exeter, Manchester, UMIST (a technical university located in Manchester but not to be confused with the UoM) etc through middle-range such as De Montfort (Leicester) to former polytechnics (technical colleges, not quite the equivalent of community college, but more focused on vocational studies than on academic subjects) such as University of Greenwich, University of Salford, etc.\n\nAlso don't forget British students specialise from 16. We do broad GCSEs (14-16 yo), then for academic purposes narrow down to four subjects (AS level) in the first year post-16 and then three (A level) in the final year. Scottish students do a broader curriculum, but English, Northern Irish and Welsh students do A levels.\n\nThen we apply to do a specific subject at university. Many will do 'traditional' academic subjects (I did Government; my sister did Geography and Natural Science (basically Geography and Geology, but including some climate study and so on); my cousins did English, Engineering and Computer Science) for undergraduate degrees; there is no such thing as the broad liberal_arts degree, and you CAN do Law and Medicine as undergraduate degrees (no such thing as pre-Med or pre-Law). So many of us who are writers won't actually have taken any creative writing or even EngLit classes at uni. We will largely have self-taught :D. Different universities teach in different ways - the LSE courses I took were modular and I had options to pursue what I wanted within the remit of my Government degree, but many degree programs teach the same thing to everyone. (I rejected one university when making a choice because they just gave me a handout with the course plan on it and I reckoned I could go away, read the books they recommended, and teach myself. I was more interested in a range of options such as political thought, history of politics in X region, democratic theory, etc. and could choose to tailor my degree to what I wanted to study.)\n\nFor instance, these are the student experiences of some of my family: \n\n- My degree is technically from the UoL, but I studied exclusively at the LSE and to all intents and purposes I quote the LSE as the university I went to. I have a Master[.] in Law Research (MRes) from the University of Reading. Master[.] are one year long in the UK.\n\n- My sister went to Durham University and was lodged at (I think) Hatfield College, but her classes were taken amongst students from other colleges.\n\n- My older cousin went to St Andrew[.] University in Scotland. Simple, straightforward, stayed there for his PhD and ended up lecturing and researching there as well, with stints at the University of Kent IIRC.\n\n- My mum went to Queen[.] University in Belfast, but came to England in the 1970s to do her teacher training at De Montfort University in Leicester, which has a good reputation for teacher training, the 'PGCE'. \n\n(Incidentally, if OP wants a character to be sporty, in terms of having an academic sports *degree*, they probably either went to De Montfort[.] Bedford campus or Loughborough; if they pursue sports as a hobby, then they probably have an Oxbridge 'blue' in their particular sport.)\n\n- My youngest cousin went to Herriott-Watt University in Edinburgh but dropped out - he was more practical than academic and returned home to Northern Ireland to go to a further education (FE) college in Belfast. Shame, because he wanted to be an officer in the army and you need a degree to get into 'Sandhurst', where the British army officer corps is trained. He is, however, in the Paras, an elite regiment; he'll be on deployment in the Falklands :( for my wedding.\n\n- My dad went to a polytechnic to study civil engineering, and initially did not study for a degree (he did something called a Higher National Diploma, a HND, which is part of a large range of non-degree qualifications that you can do instead of degrees in further education; university education is sometimes called 'higher education') but was clever enough to upgrade his qualification to a degree.\n\n- My soon-to-be-husband looked at a couple of places (we NEVER refer to universities as [.]chools'; school is ONLY pre-18 education) but his dad got ill and couldn't work, so because he didn't have any particular interest in academic studies - some people just go to uni because they want to have the student experience, but not everyone can afford to, just like in the US, even though Jeremy would have got a grant and free tuition at the time he was eligible to go - he just went out and got a job locally."}