{"doc_id": "1913", "name": "2016_08_humanities_student_major_647_writing", "namespace": "we1sv2.0", "metapath": "", "pub": "writing", "title": "2016-08-humanities-student-major_647_writing.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.146", "Subjectivity": "0.34", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "830", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4x3k9m", "Reddit_id": "d6ce778", "Subreddit_id": "t5_2qh2n", "Commenter": "alexatd", "length": "4763", "content_scrubbed": "As others have said: deep breaths! You're going to be fine.\n\nYou don't have to major in STEM to do well outside of college. There are many many many industries and jobs where a humanities degree is PREFERRED. Many jobs require someone who can be analytical and write well (SO MANY PEOPLE CANNOT WRITE). Or, they may require a depth of knowledge in the subject in which you majored. Great, you majored in finance, but what do you know about international politics? Or social policy? Or literature? It may be relevant. There are also hybrid degrees: humanities-esque majors that focus on practical skills--journalism, marketing, PR, communications, etc. Companies like these because they mean you can write, reason, sell... let me tell you EVERY INDUSTRY REQUIRES MARKETING. There are always marketing jobs. Marketing is a skill--and the cornerstone is writing.\n\nCollege should be fun--it is your chance to explore a bunch of stuff, and take weird classes (I took one on natural disasters! It has come in SUPER HANDY in my fiction writing career), grow up and mature. Don't worry too much about after college right now. The best thing you can do for yourself is enjoy college, learn some stuff, do some internships and LEARN PRACTICAL SKILLS IN THOSE JOBS. Srsly. You will be so valuable and \"hireable\" if you can properly use Office (especially Excel--learn all the formulas, and pivot tables/v look-ups if you're baller), are not above copying/ordering office supplies/scheduling etc., CAN WRITE (srsly. I have to do alllll the writing for my department b/c none of the other hires can properly string together coherent sentences), are detail oriented (pleasepleaseplease) and KNOW HOW TO GOOGLE/research things. You'd be shocked how many people seriously cannot do these things, or consider themselves above these things. Most entry level jobs don't involve rocket science (ie: high level stuff you learned with your degree), but pretty basic stuff, and most jobs don't want to have to train you to do these things.\n\nI'll give you my anecdata story, as it may soothe. I majored in journalism and minored in German. I graduated into the recession AND a dying industry (RIP Journalism). My first job, the only one I could get, was as an office assistant for my university[.] London program. I was able to live abroad, save money (b/c of the strength of pound to dollar at the time), and utilize my baller office skills (learned as a work/study--srsly, decent office skills make you hireable). After that, I moved to Boston and temped. My 2nd temp assignment, they hired me after a week... to process invoices and review expense reports. EXCITING. (not) But at least it was at a publisher? Point is: I was quick to learn invoicing/SAP and did it. My next job, I found homes for exchange students--basically volunteer management for a non-profit. Throughout all this, I was writing fanfiction, for funsies. I also worked on a Harry Potter fan conference, for funsies.\n\nThrough networking, I got a great opportunity and made the jump to work in international television marketing and move to los_angeles. Turns out, I love marketing! It pays well (not amazingly, but comfortably), it[.] dynamic, and stable. I write YA novels on the side--I have an agent and am going on sub soon. I organize my own HP/lit cons, and also work on DragonCon, for funsies, but I have a conference skill set I may leverage into Paying Actual Money at some point. And via volunteering I started doing in LA related to college admissions, now I'm a paid college essay consultant. I'm doing all these things--all of my jobs involve writing/communications, etc.--I'm being paid for some of them, with the aim to have them ALL be things I'm paid for eventually (writing books is a longgggg haullllll). I'm happy. And I could have done none of this if I'd majored in something like finance or econ. At the end of the day: I LOVED being a journalism major. It was the_right major, not a lucrative one. I use those skills ever day, even if I'm not a journalist.\n\nHere[.] the thing: college very often kills your creative impulses. It happens. I turned to fanfic b/c it was 100% pressure free. You'll find your way back later. Just write down all those ideas--keep an idea file--and come back to it later. And don't worry: you'll find your way, no matter what, as long as you don't have your head in the clouds (graduate and insist only on cushy \"dream jobs\") and allow yourself to wander a bit. My career path is not what I would have wanted it to be when I was in college, but it lead me to the_right place. If you really want to be a writer, you can find jobs where you can do some writing... and then like most of us, do a day job and write on the side. If you keep at your craft, you'll do fine."}