{"doc_id": "178", "name": "2016_06_humanities_student_major_1683_katawashoujo", "namespace": "we1sv2.0", "metapath": "", "pub": "katawashoujo", "title": "2016-06-humanities-student-major_1683_katawashoujo.txt", "pub_date": "2016-06-23T00:00:00Z", "Sentiment": "0.108", "Subjectivity": "0.408", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "861", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4pj9mv", "Reddit_id": "d4lscn5", "Subreddit_id": "t5_2tb50", "Commenter": "Xilirite", "length": "4733", "content_scrubbed": "Hey, big wall of text ahead -- I tend to get carried away when I talk about Rin[.] route :P\n\nIt[.] been a *loooong* time since I read KS, so excuse me if I remember a few things incorrectly. Once upon a time, I did exactly what you mentioned -- I '[thoroughly interpreted](https://www. reddit. com/r/katawashoujo/comments/2cbwq0/why_do_you_like_your_favourite_route/cjdwlxj)' the entirety of Rin[.] route, going through it with a fine tooth comb in an attempt to really figure out exactly what it was that resonated with me so deeply. As weird as it sounds, the route totally changed my life -- most of my best friends today remember not liking me much before I played through KS, but the person I became after figuring out what the game meant to me is a person I'm much happier to be.\n\nI feel like Rin[.] route is one of the few that really establishes Hisao as his own entity rather than just a vessel for the player to experience the story through. The entire second act is devoted to Hisao[.] development as a person, and the meat of the story (Rin[.] time in the atelier) only takes place *after* the first visit to the dandelion field, with the majority of Rin[.] involvement in the second act being related to helping Hisao[.] growth as a character or setting up the events of the rest of her route.\n\nIt[.] worth pointing out that a lot of why Hisao acts so differently in this route than the others is because of the conditions necessary to enter Rin[.] route. To access her route, you basically have to fail to enter all of the others -- you spend time with her at the festival because you don't have anybody else to spend time with. In my opinion, this is a Hisao who, because he failed to enter the other routes at earlier stages of the first act, is a more flawed version of himself -- because, of course, the Hisao in each route is different. (He didn't have choices to make, you made the choices that were his first reaction, and thus a reflection of his character, if that makes any sense.) A lot of people were upset because Hisao acted in ways that they felt they would never act, but it[.] much easier to imagine Hisao[.] actions when you consider the context -- he[.] recovering from the realization that his time on Earth is very short, and he only recently came out of a sort of 'depression' from the second act. Rin becomes his only real friend -- Emi, too, technically, but only in that friend-of-a-friend way where Hisao'd probably never hang out with her if Rin weren't there. When Rin pushes him away the way he does, he acts out. He[.] emotionally volatile and confused, and so is Rin. This is part of why the route feels so offputting and depressive. Both of the main characters are in a very dark time in their lives, pulling each other up out of the rut at times, but at others dragging each other down to even darker depths.\n\nI think the reason you enjoyed it despite how much of a dirge it was is likely the same reason I did. It stands out among the other routes, with the prose being very unique in comparison to the other routes and the focus being on different things. The route is quiet, reflective, and introspective, in stark contrast to routes like Emi[.] and Shizune[.], and the scope of the route is smaller, with Lilly[.] route being a bit crowded in terms of characters and Hanako[.] route feeling kind of rushed. And, for me at least (I, of course, can't speak for you), I heavily connected with the major themes of the route. I've always loved the arts, with acting and writing being huge passions of mine, but I've also had trouble communicating with others due to my Asperger[.]. Rin[.] route, being about art and having difficulty communicating with others, immediately spoke to me.\n\nIf you haven't yet, I strongly recommend you play the route a second time. There are some lines that seem really throwaway on the first playthrough, but on a second really illuminate the depth behind the characters. One example, of many, is the difference in philosophy between Rin and Nomiya. Nomiya has a big speech about how an artist creates art because they must -- it[.] what drives them in life. Rin, however, only creates art because she can. She has the talent and the ability, and she believes it[.] a way she can express herself in a way she cannot with words. However, she doesn't truly need to pursue art in the way Nomiya believes an artist does. It helps provide a bit of insight into their later conflict, and it was a really neat detail -- one of many. I'm sure there[.] tons I didn't even pick up on!\n\nI could talk your ear off about this route all day (and probably already have :P) so I'll stop here. I don't know if it[.] what you were asking for, but I sure hope you take something away from all that ^.^"}