{"doc_id": "1937", "name": "2016_08_humanities_student_major_894_rowing", "namespace": "we1sv2.0", "metapath": "", "pub": "Rowing", "title": "2016-08-humanities-student-major_894_Rowing.txt", "pub_date": "2016-08-13T00:00:00Z", "Sentiment": "0.21", "Subjectivity": "0.374", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "340", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6g7hfa", "Reddit_id": "d6gace0", "Subreddit_id": "t5_2qljq", "Commenter": "chaoslaw", "length": "1912", "content_scrubbed": "This is a very good list.  I'd also mention the following: \n\nNortheastern - in the past 10-20 years they have really stepped up their selectivity, but they don't have cutoffs or an academic index like the Ivies, so you might want to reach out to the coach and ask if they could support you as a recruit.  FYI, they expect incoming freshmen to be at a 6:18 2k, but you're within range of that.  \n\nThey will also want you to take the ACT again, to see if you can get a point or two higher, but you're probably going to hear that from everyone.  \n\nGeorge Washington U - They are definitely on the lookout for good rowers, as they compete against the big boys at the Eastern Sprints.  \n\nHoly Cross - a good liberal_arts college with a longstanding commitment to rowing.  They also compete in the Sprints.  \n\nWould you consider Annapolis?  they have pretty high academic standards, but I'm told they have flexibility for recruits.  And you don't need to worry about a scholarship, since the tuition is free.  Just a thought.  \n\nFinal thought - you will probably say you know what I'm about to say, but reading your reference to your stats as \"lower end\" bothers me.  So much of the discussion here focuses on the stats of a very small fraction of top rowers who also manage to score 90+ percentile on standardized tests, etc., that one[.] perspective can easily get skewed.  \n\nLooking at your numbers, by any objective standard, you're a bright student and a talented athlete.  A few years from now, when you are out of college and in the \"real world\", you'll see that qualities of character and willingness to work hard are much, much more important, for almost any endeavor you choose to pursue, that a few points on standardized tests or on your GPA.  So if you can combine the discipline and focus required by serious rowing with a solid academic program at <any of these schools, you'll be fine.  Good luck!   "}