{"doc_id": "147", "name": "2016_06_humanities_student_major_1420_asktrumpsupporters", "namespace": "we1sv2.0", "metapath": "", "pub": "AskTrumpSupporters", "title": "2016-06-humanities-student-major_1420_AskTrumpSupporters.txt", "pub_date": "2016-06-20T00:00:00Z", "Sentiment": "0.022", "Subjectivity": "0.529", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "268", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4hfc5k", "Reddit_id": "d4hpqng", "Subreddit_id": "t5_3cr3o", "Commenter": "U2_is_gay", "length": "1538", "content_scrubbed": "College classmates of mine from Africa (mostly west Africa) were some of the most brilliant and well spoken people I'd ever engaged with. I don't just mean well spoken for a foreigner or a person that came from poverty. I mean well spoken for the world. These kids clawed their way out of dollar a day type poverty just to sit next pieces of shit like me. That[.] the most American shit ever. And they definitely made me feel dumb sometimes. \n\nFor the first time I really understood how important diversity was in terms of ideas. And backgrounds play a part in your ideas. And it was fantastic that we could speak openly about it. I went to a very liberal school and one of my majors was a bachelor[.] of liberal_arts. You'd expect the worst but even 10 years ago everything was pretty open. \n\nI had a professor or two that were pretty openly \"fuck Bush\". Nobody really liked them, but it[.] mostly because they were angry. I remember one openly conservative professor I had, Dr. Vedder. Very outspoken. But even in that bastion of liberalism all the students loved him. He was hilarious, engaging, and backed his shit up. His political commentary was always presented as a joke rather than fact. He actually specialized in the politics of education. He called all this shit. Told us we were all being brain washed, wasting our money. Unfortunately that wasn't a joke.\n\n I thought that[.] what college was and I'm sad to see that[.] not the case anymore.\n\n[Dr. Vedder](https://youtu. be/Z4VxlMeLkvU) is a national treasure to higher education. "}