{"doc_id": "1931", "name": "2016_08_humanities_student_major_840_olympia", "namespace": "we1sv2.0", "metapath": "", "pub": "olympia", "title": "2016-08-humanities-student-major_840_olympia.txt", "pub_date": "2016-08-12T00:00:00Z", "Sentiment": "0.009", "Subjectivity": "0.266", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "276", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6f9yik", "Reddit_id": "d6flrbi", "Subreddit_id": "t5_2r63n", "Commenter": "Serruptitious1", "length": "1538", "content_scrubbed": "While some elements of downtown may certainly be less appealing to the eye than some others, I find the way the common people don't go out of their way to berate the homeless and downtrodden to be heart warming. They're people. People with no money. When you really look at it. A guy told me that you can't go hungry there, implying that there is always food for them. Honestly, I believe you can tell a lot about people by what they will do for those who can do nothing in return for them. However you treat the poor and the sick, that is who you are.\n\nThe poor will always be with us. Exploring the well, even walking among them, outnumbered 20:1 I feel no fear. Nobody stares. Nobody follows you with their eyes. There was one guy in an alley that was a bit sketchy, but he didn't approach me. The whole place just has this vibe... I've felt more uncomfortable inside of busy fast food restaurants than walking alone on the streets of downtown Olympia at sunset.\n\nDaytime is a completely different vibe. The biggest concern becomes finding a place to park your car and keeping valuables out of view.\n\nIt[.] truly a magical thing when you have middle-class liberal_arts students living in studio apartments above such chaos, when I can simultaneously be observing a man speaking to himself, while someone busily is writing code on his Imac above a chinese restaurant blasting music from one hell of a sound system... it truly is a place where 'anything goes'...\n\nAnd yes, perhaps even some 'hate'... but that[.] what you get with freedom."}