{"doc_id": "1915", "name": "2016_08_humanities_student_major_655_utaustin", "namespace": "we1sv2.0", "metapath": "", "pub": "UTAustin", "title": "2016-08-humanities-student-major_655_UTAustin.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.313", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "955", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4x46ep", "Reddit_id": "d6cic1n", "Subreddit_id": "t5_2qy08", "Commenter": "pabloe168", "length": "5360", "content_scrubbed": "You are asking lots of questions that are not very simple so lets break them down.\n\n1) Academics.\n\nNo BSA or BS doesn't matter. For a Masters or PHd Application it would but not for industry. \n\nGraduating in 2 years is extremely hard.  Looks okayish on paper, but in practice its a nightmare. First reason is that it will be really hard to get all your upper division courses when you need them. You might have to settle for classes you are not that interested in, or have shitty teachers if you want to graduate asap. Also you can only register for 2 upper divisions before you have to wait for the last add drop. Which is when everything is full.  Only then you can register for more upper division courses with authorization of your adviser.  2 years means 4 semesters and 2 summers. You want an internship that is one less Summer. That will leave you with very little room for mistakes.\n\nThe second reason why 2 years is pretty hard is it would be a crazy  work load. CS classes where you actually learn have labs that are time consuming. And you will most likely spend more time doing labs rather than studying for tests. 4 classes with 4 labs would be quite a challenge. Maybe its ok if you are fine with getting low Bs and Cs. A CNS adviser told me that statistically some people manage to graduate in 2 years, but the vast majority end up taking an average of 2 semesters more, specially for the BS.\n\n2) People.\n\nI am a dude, so I can't advice on how to handle relationships in a \"male dominated major/field\" but I have heard that many women get in better internships just because some companies like Facebook and google want to level the gender gap in CS and be more politically correct.  Certainly I have never ever ever heard of or seen discrimination against women in CS.\n\n\n\n3) Internships\n\n\nNo, just \"limited python\" is not enough for an internship. If that is all you say you know, I doubt you would ever get a call back. So you have two options, learn more skills or lie in your resume. I clearly don't recommend the latter, if you lie using university resources about your GPA or your resume when getting hired you might get banned from using them. \n\nUnfortunately just knowing some python means you are very inexperienced. Python is usually complemented with a contrasting language like c++. And a seasoned programr will not need much training to learn it. Python offers easy ways to finish simple jobs and prototypes, the other one offers control and performance.  Most people have a high level programming language (python - ruby etc), a lower programming language under their belts C (eew), C++ (yay), or even java which is not that low level. These are nicely complemented with a scripting language of their choice like Javascript. And knowledge of the tools in subjects they like. If I liked web dev I'd know stuff like CSS, HTML, stuff with data bases, hosting, server management, virtual machines etc.\n\nSince python is usually paired with C++, you could learn that and start applying. Otherwise learn Java and JavaScript to add to your python experience. You will get experience in C at UT but not C++ unless you take the OOP, Generic programming or cs 105. This is just an example of one of the many things you could do. But get started yesterday. Where you stand right now, your best bet for an internship is having good contacts that will hook you up.\n\n4) What you should do right now (yes before fall starts)\n\nPersonal projects are a staple of UT CS majors. Personally I have made a motion detection program that works with webcams using an API, I've made games and simulations. And I've done work with image processing. \n\nI suggest you learn Java, you are going to need it for data structures, and its just good to know. Its far easier than C++ too. Do some projects in java, before class start so you can jump start a portfolio. Or you could start learning C++. You need experience with the meaty programming languages asap.\n\nOpen a free Git student account for private repositories and learn git. Use it 100 times a day for your projects until its permanently marked in your brain.\n\nOnce you have this knowledge and hang out with only the smartest of your classes, you will know where to head from here as far as your portfolio. They will tell you about industry rumors, trends, facts and blah blah. I've personally have made great friends and they have taught me so much that I will always use for the rest of my life, like how to use linux and vim effectively. No, UT will not offer you a class on that kind of thing. You are expected to know it, or easily pick it up. I think they do mini lectures of linux on the labs. GO.\n\n\n5) extra notes: \n\n1. Your major challenge is going to be balancing your schedule. Kids who get as freshmen start from their first semester working on the CS requirements. And their schedule is by far better than yours. It might look like a humanities class, an elective, a cs course and a science course. Leaving them with plenty of time for personal projects. They have time to do their school work properly while they grow in their personal interests. You don't have that advantage you are in for express ride. So stock up in caffeine.\n\n\n2.  do everything in your power to not take novak, and take scott.  \n((((((((((((((unless)you)Are)Ok)with)Using)Lisp)and)don't)care)about)real)world)Java)\n\n\n\n"}