{"doc_id": "15", "name": "2016_06_humanities_student_major_164_earlymoderneurope", "namespace": "we1sv2.0", "metapath": "", "pub": "EarlyModernEurope", "title": "2016-06-humanities-student-major_164_EarlyModernEurope.txt", "pub_date": "2016-06-02T00:00:00Z", "Sentiment": "0.119", "Subjectivity": "0.361", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "1506", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4lw66g", "Reddit_id": "d3t7hw9", "Subreddit_id": "t5_3edej", "Commenter": "DonaldFDraper", "length": "8522", "content_scrubbed": "I'll be doing a live updating about my watching of Barry Lyndon. I avoided watching it again because it[.] a three hour movie but I love/hate it. I love everything about it, I just hate the length.\n\n\nAll time will be designated by the minute of the movie.\n\n16:52 I have come to realize that the introduction of the company of British regulars had them marching toward the crowd then marching parallel, which means we missed the long and complicated movement of company from line to column of movement.\n\nCaptain Quinn is a man worth FIFTEEN hundred pounds a year (\"a man of fifteen hundred a year\"). Of course he pales compared to the jovial Mr. Bingly and the venerable Mr. Fitzwilliam Darcy who made five thousand and ten thousand pounds a year. \n\n21:24 Now, I can't say much about dueling sadly, but this is Kubrick being Kubrick by pulling the audience away and letting things happen. The great skill of Kubrick is the sterility of his direction, he doesn't tell or make you feel a certain way but lets the audience discover things for themselves. Of course there[.] the needless amount of one point perspective shots that makes me feel good.\n\n28:00: DO YOU SEE ALL OF THIS SCENERY PORN!? BECAUSE THIS IS KUBRICK AT HIS BEST!\n\n33:41: Highwaymen, the real problem in early modern Europe. Now, highwaymen were real, often they were former soldiers, runaway soldiers, petty crooks that looked to take advantage of people alone or less protected. Often these would be cleared up by the local militia or regiment of the Crown. \n\n34:13: Recruitment, this is a standard form of \"normal\" recruitment. Most recruitment would be like this, enticing the rural populations with money and excitement. \n\n38:49: Stopping to eat lunch, will continue from this point at a later time today.\n\nEdit: Continuing the film, let[.] do this.\n\n44:12 - Now we're reaching the best part of the film, and OH GLORY YES TIME TO SEE SOME LINEAR WARFARE!\n\n44:22 - Here the line is presented in a semi-column of advance where the men are preparing not to fire but for the bayonet charge. Captains and other officers in front to lead the men forward with the first line holding muskets ready for the charge. Men in the rear of course don't need ot do this as it[.] foolish and deadly to hvae their muskets at the ready since it would kill their own men.\n\n46:09 - Now the line battle has commenced and proved to be inconclusive for the British that effectively walked into the enemy fire. Most important, notice how no one freaks out and runs nor there is any moment of hesitation when the Captain gets shot, the men simply walk around him and keep on moving. This is possibly the most important aspect of linear warfare, machine line precision of fighting and movement.\n\nThe French seem to be firing in a semi-fire by rank method where the front line is kneeling (kneel fire is also another form of what this is) while the others are standing up. This would maximize the amount of fire power going out while also ensuring a constant amount of fire goes out to bother the British.\n\n46:35 - Also note how most of the men shot are on the ground and writhing. A shot isn't as likely to kill due to the low power of black powder.\n\n47:19 - \"Kiss me my boy for we shall never meet again\", nothing homoerotic about this, as kissing is a sign of friendly affection among men at this time. \n\n51:48 - BOO PRUSSIANS REMOVE PRUSSIA \n\n54:43 - Another thing to love about Kubrick is his attention to detail. For some mad reason, he insisted that every shot in the film be naturally lit. Every candle is real and every source of light makes sense, which is amazing and perfect.\n\n59:28 - The recruitment of Prussian soldiers. This is probably one of the more infamous things about Frederick as he recruited the lowest pieces of society or would resort to letting recruiters (also known has headhunters at the time) for his armies. It would be a major early event in Voltaire[.] *Candide*.\n\n1:04:50 - Yes, everything is basically right about the Prussian Army. Leading with the stick rather than leading by example. This would be a major theme in Revolutionary propaganda. \n\n1:05:55 - Yes, the Prussian army was mainly non-Prussian by the end of the Seven Years War... I believe it was at least 50% were non-Prussian.\n\n1:11:51 - Can we just wait a moment here and just love the Rococo design of the room? Big but ornate?\n\n1:14:18 - THIS CHATEAU THIS BEAUTIFUL MAGNIFICENT BUILDING THIS SHOT\n\n1:20:53 - This Prince is so... ugly and princely that it hurts.\n\n1:31:21 - I'm afraid I'm watching the movie now...\n\n1:37:00 - We're getting that Schubert piece. Of all the music this is the most anachronistic of all.\n\n1:42:00 - Intermission, what is this? The 50s?\n\n1:47:22 - Carriages are known during this time period to be wayward and troublesome, bouncing here and there due to a lack of a proper suspension system. They were so bad that pregnant women would miscarry as a result of the troublesome trips across unpaved roads, causing many women to stay put once pregnant or force trips in hopes of a miscarriage. (Napoleon[.] own Josephine often used this complaint as a pretext for not visiting Napoleon during his first Italian campaign, which we know now was because she was often busy in the arms of a Hussar). \n\n1:48:44 - Accomplishments in women were seen at the time as marks of quality. Just as now there are societal expectations of women being able to do certain things or have certain stylings about them, it was the same in the 18th century. Rather than focusing on healthiness or intelligence, skills were focused on presentation; Jane Austen is a great source for societal expectations of women during the time and her own characters were skilled at drawing, embroidery, playing varieties of music, or even gardening. All things that were to be done at home and effectively being an ornamentation to the women.\n\n1:52:02 - Reading in French. As French was the main language of communication in Europe, it was also the language of the arts. With the exception of music, most arts were based in the French language by the late 18th century. As such, the maid reading to Lady Lyndon in French would be both common (as both would be expected to know French) and common for the literature itself. \n\n1:58:25 Ornamental Sheep are the best sheep.\n\n2:07:49 Now I cannot speak much about the method that Redmond was trying to obtain rank. British aristocracy is outside of my skill set but it is very interesting that it is happening. By this time in France, the nobility were advocating and pushing for any attempt to block commoners from obtaining rank so as to ensure that offices and military rank were held only for the nobility.\n\n2:12:00 - This is a Bach Keyboard Concerto, which one I cannot say. The likelihood of Bach being played is low as Bach was essentially forgotten after his death and not until Felix Mendelssohn brings back Bach in the 1830s.\n\n2:23:10 - This scene shows best the natural light that Kubrick obsessed over during this film. With a single source of light from the window, it bathes and darkens the entire room in a natural way that you will never see in other films.\n\n2:30:52 - Remember kids, don't ride horses that aren't broken. \n\n2:31:02 - MORE ORNAMENTAL SHEEP\n\n2:52:35 - As the duel between Redmond and the spoild Bullington took a while, I will continue to say there is little I can say about duels, however the shot was a deadly shot. A shot to the leg is deadly because the bone could easily shatter and pour marrow into the blood or worse hit an artery that would cause constant bleeding (which is what happened to Redmond). As such an amputation would be necessary and a common medical procedure for surgeons of the time. \n\n2:58:50 - This exact frame is... beautiful. Presented almost as a painting of the era, this shot is the reason why Barry Lyndon is Kubrick[.] Masterpiece. Well formed, well shot, and with the best realistic lighting that you could ever see. \n\nAdditionally, Barry is given an annuity of five hundred pounds a year. This is the same income that would have been expected of Mr. Collins, one of Elizabeth Bennet[.] suitors in *Pride & Prejudice* by Jane Austen.\n\n2:59:40 - Look at the year, it[.] December of 1789, the Revolution is occurring!\n\nAnd thus it is over. I think the live response actually is very different than many other[.]. I have worked on watching the film to discuss the era as it is my focus. I love this movie so much, it[.]... special. Also Barry was insane because Lady Lyndon was a great woman."}