{"doc_id": "50", "name": "2016_06_humanities_student_major_481_bostoncollege", "namespace": "we1sv2.0", "metapath": "", "pub": "bostoncollege", "title": "2016-06-humanities-student-major_481_bostoncollege.txt", "pub_date": "2016-06-06T00:00:00Z", "Sentiment": "0.184", "Subjectivity": "0.427", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "511", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4muebm", "Reddit_id": "d3yofsi", "Subreddit_id": "t5_2s4l4", "Commenter": "DonJu4n", "length": "2760", "content_scrubbed": "I am a rising junior at BC and I think I can give you a little bit of insight into how you feel.\n\nI LITERALLY didn't know ANYTHING about BC when I applied and got in. I knew of ND and my college advisor had suggested I apply to BC because they were similar (Catholic/Jesuit, liberal_arts with a strong business school, etc).\n\nI think that /u/saratogacv60 hit the nail in the head with the student profile. Most people did well in HS, but not well enough the get into an Ivy (ex. I graduated top 9% out of 808). The students are for the most part white and very Northeastern. You'll hear of the outlier who \"summers in the Cape\" but it[.] not as if EVERYONE you meet has 3 houses in the Hamptons. People LOVE to party, but it[.] not on the level of a frat-riddled state university by any means (it[.] pretty far from it actually)\n\nAcademically, I think that one of the most interesting things that BC has to offer is its liberal_arts curriculum. You are required to take certain classes regardless of your major (ex. 2 semesters of philosophy/theology, 2 semesters of science, etc) which lets you experience some other parts of the curriculum that you would not necessarily have at other universities. For example, one of my roommates is Pre-Med but he took Logic last semester as one of his philosophy requirements and he loved it so much that he[.] taking Logic II with the same professor.\n\nWhile I can't speak from experience as to how strong the science curriculum is, a huge part of the people you meet early on will be science majors. I know for a fact that General Chemistry is hard, and all the low level science courses like Bio and Chem are considered \"weeder\" courses meant to show how rigorous medicine can be. I know that from last year[.] graduating class only ~80 people finished pre-med and were going to Med School in the fall.\n\nI've most definitely enjoyed my time there! It doesn't help that football and basketball were extremely disappointing this year but there[.] always something to do, whether it[.] a comedy show on campus, a Spring hockey game against BU, or even going out to explore parts of Boston with friends. I think that people for the most part are all incredibly friendly, and you can find a group to click with based on your interests.\n\nI was shaky on BC at the beginning just because I didn't know about it, and I was also mad/disappointed with myself that I was unable to get into any of my top choices. However, once I got past the \"I didn't want to be here\" phase I made some incredible friends and experienced the university with a new set of eyes. I legitimately think that BC has a lot to offer, and it[.] a great school overall. Feel free to PM me if you want to chat, or if I can help you with anything else.\n\nBest of luck!"}