{"doc_id": "69", "name": "2016_06_humanities_student_major_748_kotakuinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "KotakuInAction", "title": "2016-06-humanities-student-major_748_KotakuInAction.txt", "pub_date": "2016-06-09T00:00:00Z", "Sentiment": "0.008", "Subjectivity": "0.329", "Score": "16", "Upvotes": "16", "Downvotes": "0", "Wordcount": "342", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nbb8f", "Reddit_id": "d42wikp", "Subreddit_id": "t5_33726", "Commenter": "CanofKimochi", "length": "2112", "content_scrubbed": "When students are made to feel so alienated that they get up and leave the room, or get up and leave the major, something is wrong. The English department loses out when talented students engaged in literary and cultural analysis are driven away from the major. \n\nIf you have to leave a room because \" Geoffrey Chaucer, Edmund Spenser, William Shakespeare, John Milton, William Wordsworth, and T. S. Eliot\" are being taught, you're not a \"talented student,\" and I have serious doubts that you are even \"engaged with literary and cultural analysis.\" It[.] more like you are only interested in literature as an elaborate argument, a rhetoric, for a specific part of contemporary culture, instead of, you know, fucking England from its early history until the World Wars, which is where English and English literature come from, and which happens to be white for most of its history. And nevermind that multiple women poets and novelists are well regarded, and both George Eliot and Jane Austen, in the novelist department, are serious contenders for best regarded English novelist. \n\nStudents who continue on after taking the introductory sequence are ill-prepared to take higher-level courses relating to race, gender, sexuality, ethnicity, nationality, ability, or even to engage with critical theory or secondary scholarship. \n\nUhhhhhhh, if you can grasp Chaucer in the original and write papers about T. S Eliot[.] thinking I'm pretty sure you're going to be able to \"engage\" with pretty much anything in the humanities. \n\nIt is unacceptable that a Yale student considering studying English literature might read only white male authors. \n\nMight. You might also take a totally difference course of study and not read much of anyone at all. Sorry you chose *English.* Maybe you should have gone to Oberlin and majored in Semiotics. \n\nA year spent around a seminar table where the literary contributions of women, people of color, and queer folk are absent\n\nAlso small factual error here: Shakespeare is probably a bit funny. I guess you didn't pay attention in Major English Poets when the sonnets were being read? "}