{"doc_id": "1905", "name": "2016_08_humanities_student_major_616_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2016-08-humanities-student-major_616_GradSchool.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.117", "Subjectivity": "0.327", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "332", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4x1clg", "Reddit_id": "d6bxfod", "Subreddit_id": "t5_2r4r8", "Commenter": "rimeroyal", "length": "1770", "content_scrubbed": "I'm an American about to start a humanities MA in the UK, and I did a lot of vetting with some of my professors before making the decision, but there are definite pros and cons to consider depending on your future plans.\n\nIn general, UK schools are highly regarded, and it looks good in and of itself that you'd be able to get accepted, funded, and go through the program successfully--especially if you're like me and come from a state school but want to go on to a PhD. I think that[.] partly because UK postgrad programs are a lot more independent/research-oriented than US ones. At least, that[.] been my impression from what other professors and students have told me. You meet with your advisors for your thesis, but in general, you have a lot more personal responsibility to produce independent work, at least in humanities. You also won't be teaching classes, from what I've seen. In the US, you can expect to be given a TAship or a gen ed course to teach on your own, like an adjunct. That doesn't seem to be a thing in the UK. On principle, I like that, because I think it[.] kind of awful on the university[.] part to divert money like that (because that[.] what it comes down to), but if you want a PhD back in the States, lacking the teaching experience could bite you, depending on what else you do. It[.] not so much of a problem if you aren't coming back, but then you have to deal with the fact that foreigners aren't allowed to get certain pots of funding money you'd get in the US.\n\nThat said, if you're just looking to come back to your home country get a job afterward, pretty much all sources have said an MA in the UK is a respectable thing to do. But again, everything I have to say comes from a humanities perspective, so take it with a grain of salt."}