{"doc_id": "1866", "name": "2016_08_humanities_student_major_285_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2016-08-humanities-student-major_285_AskHistorians.txt", "pub_date": "2016-08-05T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.341", "Score": "26", "Upvotes": "26", "Downvotes": "0", "Wordcount": "1636", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4w6p6o", "Reddit_id": "d65990t", "Subreddit_id": "t5_2ssp3", "Commenter": "restricteddata", "length": "9725", "content_scrubbed": "History as a discipline doesn't _generally_ coalesce around \"unsolved problems\" in the same way that science and medicine often does. There are interesting reasons for this — it has been argued that part of the definition of a \"science\" is that many practitioners all acknowledge they are trying to solve very similar problems, which relies on a huge body of shared interest and accepted ways of viewing the world. Historians are a funny bunch in that they are empirical (they rely on facts and evidence) but they sit somewhere between the social_sciences (with their generally more rigid methodologies) and the more creative humanities (with their aesthetics and general rejection of methodology). \n\nWhat historians tend to coalesce around are broad _themes_ and _lenses_ of doing history, not unanswered questions. You could rephrase these as \"questions,\" I suppose, but they are unlikely to have \"answers\" in the sense you probably mean. \n\nSo a big theme for awhile has been _transnationalism_, which has been moving through various different sub-disciplines of history for a few decades now. To understand transnationalism you have to understand what it is pitting itself against: nationalist histories (focused on a single nation), internationalist histories (the same framework as nationalist histories but applied to a few more nations), and globalization (which is more about the process of nations thinking more globally, and arguably implies a sort of teleology or sense of \"progress\"). The transnational approach was to focus on the idea of nations and even the idea of \"the international\" as something in flux, developed out of the course of said history, rather than the preconditions for it.\n\nAnother one, from the discipline of science and technology studies (which includes history of science, my discipline) is the idea of _coproduction_. Again, to understand it, you have to understand what it is pitched against. For a long time (as in, is goes back to 19th century thinkers) there were questions asked about whether science and technology determined changes in society, or whether society was responsible for changes in science and technology. That is, who affects who? And of course you can find examples of each case, and, of course, various people have tried various forms of a synthetic argument to take into account both actions (e. g. Thomas Hughes argued for \"technological momentum,\" which basically means that society starts out \"in control\" but eventually the accretion of time leads to a logic imposed by the technology). Coproduction is a different sort of solution to this kind of question: instead of asking which entity affects which entity, it says that both of these entities are in flux (that is, there is no solid thing called \"society\" or \"science\"), and that they coproduce, co-create, one another simultaneously. To put it another way, statements about nature are statements about society and vice versa. Instead of asking, did Darwin come up with the theory of evolution because of his social influences, or did Victorian England modify itself based on the theory of evolution, you say, well, these things are actually pretty well bound up with one another, and the theory of evolution  became a way to talk about what kinds of entities science was and what kinds of entities society was. That is, in the discussions people had about it (including Darwin[.]), they are defining, either explicitly or implicitly, what counts as \"nature\" and what counts as \"society,\" and these things are not \"givens\" to be analyzed about who impacts who.\n\nOK, you're saying, jeez louise, this is _not_ what I was asking! What I was asking was, are there any cool mysteries out there that scholars are trying to solve, not \"what are the latest jargony fads in academic history\"! And hey, I'm with you on that. I find the above stuff sometimes useful as a way to think about what I'm studying (I am on a panel about transnationalism in Cold_War technology this fall, and I do find coproduction an interesting idea), but you have to be pretty well signed on to the academic lifestyle to think these are fun mysteries.\n\nIndividual historians often are trying to solve unanswered questions in their specific research areas. I know I am! One paper I've been trying to get out the door is a very micro-historical attempt to understand what evidence we have for how Harry Truman felt about the atomic bombs _prior_ to the surrender of Japan. (That is, between him learning about them after FDR[.] death, but most importantly the period in which he knew they were going to be used, was initially elated by the first one[.] success, and then becomes much more morose about the whole thing once casualty figures come in.) There are loads of interesting questions in this little slice of history. Did Truman know what kind of target Hiroshima was? (That is, a city with a base in it, not just a base.) Did he know a second bomb would be used so soon? Who wrote his speeches in which he characterized Hiroshima as a base and not a city? When, exactly, did he learn that thousands of women and children were killed in the attacks? Can we trace the evolution of his thoughts reliably through direct statements, diary entries of his contemporaries, and maybe even a little linguistic analysis? (Truman, like many people, tends to have \"stock phrases,\" so you can see where certain things repeat.) Why exactly did Truman order no further atomic bombings on August 10th — was it because he felt they would hamper negotiations, or because he was put off by the slaughter of civilians, or because he felt like the bombings were being done out of his direct control? What do the atomic bombings and Truman and Stimson[.] response to them tell us about the evolution of the idea that the use of atomic bomb was a \"civilian\" responsibility as opposed to a \"military\" one? When exactly did Truman[.] public justification of what happened turn into the \"saving lives\" one? \n\nAnd so on and so on. You can see from the above that once you corner any individual historian (or, at least, me) and start quizzing them on what questions are on their mind, you'll get a million of them. Those are the questions that interest _me_ at the moment. They probably interest a few other historians though very few are working on those particular questions right now. In fact many historians _deliberately_ choose topics where other people aren't working on the same questions because they don't like to feel like they are in \"competition\" with one another. It is considered a bad thing to work on exactly the same book or article topic, for example. Junior historians are deathly afraid of being scooped — because how many historians do you _need_ puzzling over whether Truman knew there were two bombs?\n\nAll of which is a very unsatisfying answer, I am sure, but you can see why I prefaced it with a discussion of why historians aren't scientists. (And thank goodness, from my perspective! If I wanted to be hidebound to a methodology I'd have become a sociologist or something. Smiley face and wink to my dear sociologist friends.) These aren't questions on the level of \"what is dark energy?\" or \"can you make general relativity compatible with quantum mechanics?\" Arguably _those_ aren't the questions that most practicing physicists are working on, either — though their day-to-day- micro-questions (e. g., \"why does star X rotate at the speed it does?\") might be more deliberately tied into those \"big\" questions of their discipline than a historian[.] questions might be tied into theirs. \n\nOne major, final difference to contemplate is whether historians are ever satisfied with the _answers_ to their questions. This, too, is a major disciplinary difference and arguably a definition for what a \"science\" is. You can always, _always_ have doubts about an answer to a question, even in a \"hard\" science like physics or chemistry. But it is characteristic of scientific communities that they tend to jettison those doubts after a reasonably short amount of time. If they get a pretty good answer, they say, great — on to the next questions. This is why sciences appear to make \"progress,\" moving through new questions at a quick pace. (Historians of science have whole reams of dead forests dedicated to the tricky notion of \"progress\" in science but let[.] put that aside for now.) History doesn't really work that way. You do get programs or answers or lenses that hold sway for awhile. But a generation or two later, the later historians do their best to explain that the reigning approach is probably wrong, and put forward a new one. And there are lots of possible reasons for this (ranging from the cynical to the idealistic — are they just finding a way to say new things about old topics, or is it a reflection of genuinely better understanding over time?), but it remains a characteristic of the discipline, that it repeatedly \"kills its fathers.\" To many in the discipline I think this represents a form of \"progress,\" though I think the historians of science (who are picky about these kinds of things) might throw some cold water on that issue. \n\nI hope the above is interesting even if it is not exactly what you asked for (but hey, it[.] how a tricky historian of science would approach the answer). If you're interested in notions of collective progress in the development of knowledge, Thomas Kuhn[.] _The Structure of Scientific Revolutions_ (1962) is the classic text in the history of science, though of course most historians of science (myself included) don't consider it to be entirely correct (Kuhn is a father who we've long since killed but still keep around because he makes for a good introduction to these topics). "}