{"doc_id": "1956", "name": "2016_08_humanities_student_major_1113_worldnews", "namespace": "we1sv2.0", "metapath": "", "pub": "worldnews", "title": "2016-08-humanities-student-major_1113_worldnews.txt", "pub_date": "2016-08-16T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.464", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "371", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6jrbiu", "Reddit_id": "d6jvqkn", "Subreddit_id": "t5_2qh13", "Commenter": "[deleted]", "length": "2151", "content_scrubbed": "1) The perception that the lion[.] share of why women are not in x field is discrimination is rampant, but it ultimately doesn't bear up under any reasonable scrutiny. There[.] no bogeyman standing over women[.] shoulders when they apply for university at 18 telling them that their rightful place is in the Arts, Humanities, Fine Art or Languages, but that[.] where they largely end up, regardless.\n\n2) We both agree that women can be taught to take more risks, but that[.] the solution then, isn't it? The solution has to start with changing how women think about themselves and their work, not with the institutions. The mantra is \"institutional sexism\" isn't it, not \"we train women to be less aggressive\", right?\n\n3) I don't think you get that parties bend over backwards to even get their female MP representation in caucus to 25% or close to it.  They have to consciously turn down men on that front end to get there. The issue is HUGE. I think we both agree that biasing FOR women is the wrong route, so I guess I'm wondering why you don't seem to want to defend your stance and call out people like Trudeau for slapping that lipstick on that pig?\n\n Both had to come together for something new to occur.\n\nThat[.] how you perceive that story, but studies into how tenure is awarded in STEM show that women are preferred for tenure 2 to 1 over men, so it[.] almost impossible that the barriers were institutional.  It[.] pretty tough to argue that an industry keeps women shut out at the outset when once they are in there[.] measurable statistics showing they are preferred or even privileged once they walk through the door.  Hell, the vast majority of our scholarships are restricted to minorities and women, so there[.] a whole industry working to promote them on that front end, which is further evidence that the \"institution\" isn't biased against women.\n\nWhat was the solution? More applications.  That[.] not \"two sides coming together\", that[.] an already largely neutral organization bending over backwards to show lack of bias, up to and including preferential treatment, and still not getting people to the door.  Nichols did the work, not NASA."}