{"doc_id": "39", "name": "2016_06_humanities_student_major_373_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2016-06-humanities-student-major_373_politics.txt", "pub_date": "2016-06-04T00:00:00Z", "Sentiment": "0.134", "Subjectivity": "0.364", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "748", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3w4l7b", "Reddit_id": "d3wjwzs", "Subreddit_id": "t5_2cneq", "Commenter": "Plazmatic", "length": "4950", "content_scrubbed": "The US can't afford free education, but not in the classical way, even ignoring the degrees people are getting, too many people are attempting to get degrees, we don't have enough jobs for the amount of people graduating, and we certainly don't have enough jobs for those entering college.  I'm just going to quote another comment I made somewhere else on a similar issue.\n\nOn the first part, PBS Newshour ran a piece about Oregon Schools trying to prepare students for the work force, but not in the traditional preparation for college.   According to the Newshour team, 14% of jobs are low skill, 32% are high skill (bachelor degree required or recommended) and 54% of jobs are middle skill (as in you don't need a bachelors though you may need specialized training or associates).   According to the same piece, there was a 20% gap between the number of positions needed to fill these jobs and the number of people available to fill these **middle skill** jobs. \n\nAccording to this article  http://www. nytimes. com/2014/04/26/business/fewer-us-high-school-graduates-opt-for-college. html 65. 9 percent of kids enroll in college after highschool.  As you can see the numbers don't add up with the 32% of high skill jobs available.   It is simply not feasible that all these kids make it through college in the first place, and we can see that with drop out rates in collages. \n\nhttps://nces. ed. gov/fastfacts/display. asp?id=40\n\nThe 2013 6-year graduation rate for first-time, full-time undergraduate students who began their pursuit of a bachelor[.] degree at a 4-year degree-granting institution in fall 2007 was 59 percent. That is, 59 percent of first-time, full-time students who began seeking a bachelor[.] degree at a 4-year institution in fall 2007 completed the degree at that institution by 2013.\n\nFor different universities this rate is different (60 % drop out in for profit, 30% in private, and 40% average in public) \n\nBut if we assume that only 59% of kids make it out we end up getting 38. 881% kids entering the work force for high skill jobs.  This in itself is bad because it over saturates the market with employees, but its even worse when you consider what degree these people are getting\n\nhttps://nces. ed. gov/fastfacts/display. asp?id=37\n\nOf the 1,791,000 bachelor[.] degrees conferred in 2011–12, the greatest numbers of degrees were conferred in the fields of business (367,000), social_sciences and history (179,000), health professions and related programs (163,000), psychology (109,000), and education (106,000). At the master[.] degree level, the greatest numbers of degrees were conferred in the fields of business (192,000) and education (178,000). At the doctor[.] degree level, the greatest numbers of degrees were conferred in the fields of health professions and related programs (62,100), legal professions and studies (46,800), education (10,000), engineering (8,700), biological and biomedical sciences (7,900), psychology (5,900), and physical sciences and science technologies (5,400).\n\nThis is likely to have changed in the 5 to 4 years since, but it shows a disturbingly high number of degrees in what could be over saturated fields by now due to the 32% number I listed. \n\nWhile I have no direct evidence to show that wages have been depressed already, basic laws of capitalism would suggest over-saturating the market with high skill workers would presumably depress wages in those areas, or that they are now lower than they would be otherwise. \n\nAdditionally, there is some evidence that a higher density of the highly educated leads to greater knowledge spillover between firms and industries, boosting productivity (and hopefully wages).\n\nAdditionally I want to note that \n\nhttp://www. epi. org/publication/understanding-the-historic-divergence-between-productivity-and-a-typical-workers-pay-why-it-matters-and-why-its-real/\n\nshow that productivity and wage growth has been largely decoupled in the US for most Americans.  Though this may not apply to highskill jobs it appears an overall trend in the united states. \n\nThis was originally in response to this post https://www. reddit. com/r/NeutralPolitics/comments/4j29jk/free_or_reduced_cost_of_college_has_been_a_major/\n\nYou may complain about other countries are able to get free college (or very reduced cost). This is due to the selection process in European schools that weed out students very early on into certain fields, which means you don't get the 66% of High school kids enrolling in university in the first place. I also mention how schools don't scale student intake with capacity as well in the same thread.\n\nI know reddit is very weird with anti-circle-jerky with the whole \"liberal_arts are dumb!\" sentiment, but there really are too many people getting liberal_arts degrees (along with legal fields).  We need more people to switch to middle skill careers instead of high skill careers out of high-school, that[.] where the jobs are right now.  \n"}