{"doc_id": "82", "name": "2016_06_humanities_student_major_874_professors", "namespace": "we1sv2.0", "metapath": "", "pub": "Professors", "title": "2016-06-humanities-student-major_874_Professors.txt", "pub_date": "2016-06-12T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.248", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "441", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nmc3s", "Reddit_id": "d45t5bp", "Subreddit_id": "t5_2svhp", "Commenter": "remnbibi", "length": "2368", "content_scrubbed": "Wow! The bitterness is so strong that it ought to turn you off of academia entirely. which is the point. Academia is really difficult. Don't listen to that because you don't have to decide right now. You're 17. Go to college and double major, if you want. Get a major in something useful, and something that is important to you. You won't know what that is for a couple of years , so just worry about your gen ed stuff. If you have a passion for something use your electives to knock out courses in both majors. Take classes in things that will help you with future jobs, like coding. But take philosophy and ethics too. Law will need this. Worry about your Bachelors first, but take classes that you can double dip into in the future. Poli sci and law can double dip. But a poli sci major is going to give you very narrow range of possibilities as far as teaching. Small liberal_arts college poli sci professors aren't really a thing. It[.] way too narrow and hundreds of people would be applying for one job. But lawyers are a dime a dozen as well. You can go into other fields with a law degree. I suggest you find a niche like technology and law. That is something that will be a future need. Professors need a bachelors and a masters and a PhD, unless you want to teach at a community college. And there is not much demand for pol sci in a CC. \n\nAudit what you want to do right now, and realize that this will change in the next few years. Take as many classes as you can that will be generally useful to a specific range of your degree. Be flexible and wise in your course choices. Think about what the job market will need in 5, 10, 20 years and get ahead of the curve.\n\nI think what people are trying to tell you is don't get a degree in poli sci with the goal of being a professor, because it[.] right up there with underwater basket weaving. And don't think of academia as this ivory tower where people just read the classics. Right now, the academic climate is hostile towards conservatives, and the classics, because the classics are often seen as patriarchal cisgender colonial hegemony.... and other such bullshit. I am a female professor in the Humanities, with a Libertarian leaning, and I still teach the classics, but i also add female philosophers. But, by the time you have your bachelors something else will come up. You need to be ahead of the wave."}