{"doc_id": "126", "name": "2016_06_humanities_student_major_1228_harrypotter", "namespace": "we1sv2.0", "metapath": "", "pub": "harrypotter", "title": "2016-06-humanities-student-major_1228_harrypotter.txt", "pub_date": "2016-06-17T00:00:00Z", "Sentiment": "0.069", "Subjectivity": "0.232", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "412", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4dcvcc", "Reddit_id": "d4e0mj8", "Subreddit_id": "t5_2qiqi", "Commenter": "alexi_lupin", "length": "2373", "content_scrubbed": "I'm Australian, so there are a lot of cultural similarities with the UK but also a lot of influence from the US so we're probably halfway between you guys somehow.\n\nAt the end of school we don't have a graduation ceremony with gowns and hats. In fact we don't even really call if graduation. People don't really refer to themselves as \"high school graduates\". They'd probably say they finished school or they got their VCE/HSC/IB/whatever the actual qualification was for their state (IB is international of course). That whole graduate thing with the gowns and hats is for university. And actually at the university I'm at you don't even get a mortarboard for an undergraduate/Bachelor level degree, you have to wait for postgraduate. Other universities do mortarboards for Bachelor level degrees though.\n\nAnyway, at my school when we finished we had a few traditional events. Muck Up day is a day for the year 12s to play pranks on the rest of the school. Carnival Day is just a fun day to celebrate. We'd either hire carnival rides to have at school or else go on an excursion to a theme park. Valedictory Dinner is kind of like a formal (what you'd call a prom in the US). It[.] a sit down dinner with everyone dressed up, except unlike a formal, everyone[.] parents are also there and it[.] when you get a certificate from the school saying you completed school, and like, any awards are presented such as academic achievement or contributions in sport or the arts.\n\nHowever, if you wanted to go to university then what you're really waiting for is the certificate from the assessment authority in your state telling you that you have completed your VCE/HSC etc. In my state they take your assessment tasks from school and your exams and do a whole detailed process that I won't explain and you are ranked against everyone else in your state and given a number rank. This ranges from presumably 0 (they don't tell you if it[.] below 30) to 99. 95. So there[.] this period of waiting when you've finished school probably in November but the results don't come out until December. And then you have a chance to change your university preferences (we do not apply directly to universities, we apply online and rank the courses we want in order of preference) and then more waiting until the universities make their first round offers, which happens for everyone simultaneously."}