{"doc_id": "160", "name": "2016_06_humanities_student_major_1504_nyu", "namespace": "we1sv2.0", "metapath": "", "pub": "nyu", "title": "2016-06-humanities-student-major_1504_nyu.txt", "pub_date": "2016-06-22T00:00:00Z", "Sentiment": "0.044", "Subjectivity": "0.374", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "505", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4p8fq7", "Reddit_id": "d4j8043", "Subreddit_id": "t5_2rbpf", "Commenter": "Siantlark", "length": "2826", "content_scrubbed": "So I went there. The Shanghai campus is new and there are kinks that need to be worked out but overall it[.] really cool. \n\nBad things first. Complaints about financial aid were common as well as required classes on the curriculum; the foreign kids need to take Chinese up to the Intermediate level but the Chinese kids only need to take 1 English class and everyone needs to take GPS classes. Those are basically humanities classes. People complain about those at pretty much every college campus so not really a big surprise. \n\nOverall though the teachers are good. The Chinese teachers care about their students and try to help each one improve and practice. The other faculty seem motivated and passionate about their subjects. However the amount of majors offered is small because of the age and size of the university. The Interactive Media Arts (?) Or IMA major is really popular and diverse; there[.] a ton of things there and all of the IMA kids were super into their projects.\n\nThe campus is also a very big English bubble. Even though it[.] pretty much 50/50 foreign and Chinese students it[.] pretty easy to get away with using only English and never really relying on the Mandarin that you've learned so that might be an issue for you as well. There[.] not really a lot of school spirit but that[.] just a regular NYU staple. The student body does manage to do large scale things when it wants to though. They had a really successful protest of the cafeteria because of horrible food and oversight. So they're connected and they care, just not really about NYU. \n\nThe dorms are also super far away from campus so you're basically required to take public transportation from there to school and back. They also have regular shuttles to and from the dorms which are free, they leave about every hour or so. You can also take the metro and it[.] not too bad. The dorm rooms themselves are okay. They're on the smaller side though. There[.] a mall on the other side of the street and a bunch of other shops behind the dorms so it[.] convinient. \n\nHowever the dorms are in Pudong so it[.] a pretty far ride if you want to get to most of the sightseeing spots or to any bars/clubs. Those are mostly in Puxi which is on the other side of the river. \n\nThe ResLife office was pretty good with activities and stuff; there[.] always cool things to do on a weekend and trips are common to surrounding cities, or restaurants, or attractions in Shanghai. \n\nI'd say to try for it if you're really interested. And if you like Chinese culture, try to go outside that English bubble and travel around Shanghai and China in general. It[.] pretty easy to get trapped in a cycle of School, Family Mart, Mall, School, where you don't really see much. \n\nI'm really shit at these large overview things. Just like ask questions if I missed anything. "}