{"doc_id": "114", "name": "2016_06_humanities_student_major_1132_anime", "namespace": "we1sv2.0", "metapath": "", "pub": "anime", "title": "2016-06-humanities-student-major_1132_anime.txt", "pub_date": "2016-06-16T00:00:00Z", "Sentiment": "0.152", "Subjectivity": "0.361", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "564", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4bb7hg", "Reddit_id": "d4bp103", "Subreddit_id": "t5_2qh22", "Commenter": "Kuramhan", "length": "3267", "content_scrubbed": "Yes and no. I (and most who watch ConRev) believe it[.] grossly underrated, but there are reasons the majority of the anime community shunned the show.\n\nFirst, it has a [very different art style](http://imgur. com/a/64RPr) than the average anime. It looks very cartoony, especially in the early episodes. It intentionally goes for this look to appear more like the traditional Saturday morning superhero show. ConRev is a deconstruction of the superhero genre (much like Watchmen), so it wants to establish this parallel. This art style is also used to contrast the light hearted early days with the more gritty events that happen later in the timeline. Again, I think the artstyle is used brilliantly, but like PingPong, some people just won't watch the show because of it.\n\nSecond is timeskips. ConRev is an alternate timeline retelling of Japan[.] 60s and 70s (though it goes outside of those time frames occasionally). It tells the story from the perspective of the same character at two different points in time. Essentially you see what he is doing in the 60s and see what he is doing in the 70s, in the same episode. Of course what it[.] talking about in both time periods will always be related. Usually it shows you an event that happens in the 60s and then shows you the aftermath in the 70s. The point being though, a lot of people find this kind of nonlinear storytelling hard to follow. It doesn't help that they occasionally show backstory from the 40s and 50s, on top of the already established time periods. I'm making it sound a lot worse than it is. They always show the date when they jump in time. The MC[.] character model also looks noticeably different in each time period. There[.] also a bunch of timelines online and in the MAL discussion threads to help make sense of the time jumps. But again, this deterred a great many people from watching the show. I think the results of this kind of presentation are brilliant, but for a lot of people it makes watching the show too much work.\n\nFinally, ConRev values thematic exploration above all else. This isn't  to say ConRev is lacking in story, because it has a great story and a great MC. But, there are episodes and characters that exist more to explore a certain theme than adding to the narrative progression. The thematic exploration is ConRev[.] biggest selling point. The fantastic worldbuilding, realistic story, quirky characters, great soundtrack, and fantastic sakuga are all icing on that cake. If you're not engaged in ConRev[.] themes, you're left with just a bunch of icing. This leaves anyone who was expecting a more surface level experience very underwhelmed.\n\nAs a bit of an extre, ConRev is filmed to the brim with references. Virtually every episode is based on some real event from Japanese history during that time period. It also frequently references a range of fiction. Examples include: Superman, X-Men, V for Vendetta, Astro Boy, Akira, NGE, and I could go on. Getting these reference certainly aren't necessary to enjoy the series, but they added to my enjoyment.\n\nI think that more or less sums up why MAL (and the anime community at large) had such a cold reaction to the series. If none of the things I listed seem like problems, then you'll love the shit out of ConRev."}