{"doc_id": "1911", "name": "2016_08_humanities_student_major_643_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2016-08-humanities-student-major_643_politics.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "-0.045", "Subjectivity": "0.43", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "290", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6cb5cx", "Reddit_id": "d6cc8on", "Subreddit_id": "t5_2cneq", "Commenter": "watchout5", "length": "1622", "content_scrubbed": "That[.] because it[.] complicated. Different Americans will be benefited in different ways if this bill is passed. For example, if someone is spending the majority of their money on foreign products TTP is like a godsend, you're going to save ungodly amounts of money you want this thing passed ASAP. If you work in labor, specifically the kind of labor they're exporting, this bill is the worst thing ever, you will probably lose your job, and there[.] no way you can afford the things that are being made cheaper because there[.] little opportunity left in the country, and what opportunity there is are service jobs that can't be exported.\n\nThe core issue to me, and I understand not many share my passion for copyright issues, is that there[.] no reason for a copyrighted song in America to extend those protections to a country like Vietnam for the next 200 ish years. It[.] fucking stupid. The idea that this should be a thing is an insult the idea that we have culture. We're making more music than is possible to physically listen to and we're taking a concept from the time where music recordings were first possible and acting like nothing has changed. The power of the internet overcomes this problem. Look I'd be okay with a compromise, I get that people really really really wanna copyright and own ideas but the terms need to be limited to a single lifetime. Like, 1/4th of a single life time maximum kind of shit. You don't get to scribble a song on a paper and have it copyrighted for 200 years in a just society that cared about promoting the arts. No one deserves that kind of exclusivity backed up by the law."}