{"doc_id": "119", "name": "2016_06_humanities_student_major_1199_askwomen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskWomen", "title": "2016-06-humanities-student-major_1199_AskWomen.txt", "pub_date": "2016-06-17T00:00:00Z", "Sentiment": "0.191", "Subjectivity": "0.485", "Score": "59", "Upvotes": "59", "Downvotes": "0", "Wordcount": "559", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4okhkn", "Reddit_id": "d4dk5fk", "Subreddit_id": "t5_2rxrw", "Commenter": "Beave1", "length": "3246", "content_scrubbed": "I have a STEM degree and career, and I post a fair amount in subreddits dedicated to engineering and jobs. I think you're missing the fact that almost every survey done on job growth and salaries have shown for the last decade that STEM careers will widely outpace other college majors for both job opportunities in the future and income potential. (That includes careers in healthcare like nursing by the way.) There[.] a fair amount of tongue-in-cheek \"my major is the best\" banter among college-aged kids, but I don't see a lot of \"I'm a ____(STEM major) so I'm smarter than you\" here on Reddit. Certainly not meant seriously. \n\nWhat I do see is a lot of *conventional wisdom* being passed along that if you're picking a college major or looking for a career path, if you have an aptitude for STEM that[.] what you should focus on. I feel that[.] good advice. Especially when people are considering majors without a defined job path after college like arts. Much better to minor in music or art if that[.] your passion and major in something you know will pay the bills when you graduate.\n\nOne more thought... I'm in my 30[.], but I spend enough time online and dealing with younger people that I think it[.] fair to say Millennials are a rather disillusioned generation when it comes to economic participation and the value of our education system. They've been told by their parents, grandparents, and teachers since they were young that the key to a good future was to go to college and get a degree. This was usually coming from people for whom that was indeed good advice when they were 18. For Baby Boomers and early GenX'ers college attainment was low and among other things served as a sorting mechanism to identify high-achieving/high-potential individuals. Good jobs were there for graduates. Taking that advice as truth Millennials went to college despite the fact that the costs have been increasing 8-10% a year, more and more of their peers are going to college, and globalization has been chipping away at the wage expectations of any career that can be outsourced or off-shored.  They've taken on massive amounts of debt only to graduate and find they've in many cases been sold a false bill of goods. A liberal_arts degree from a non-elite college no longer guarantees the holder a good job upon graduation. The jobs and student subreddits on this site regularly have distraught posts from people who have 80K in college debt, a BA, and they can't find a job. Often the \"lucky\" ones are making $30K/yr out of college with say, a degree in communications, and they're stuck living with their parents at 26yrs old and questioning whether it was worth it or not. That[.] why I see the pro-STEM bias. As a group engineers, nurses, programrs, biological research scientists, IT functions, and accountants are doing pretty well. These are the 20-somethings who are getting jobs and making decent money. This is feeding back into the conventional wisdom that STEM is the way to go. \n\nAll that said, STEM obviously isn't for everyone and there are definitely paths to success other than STEM. My kids though, I'm going to nudge them towards STEM careers, and that[.] my impression of the general pro-STEM sentiment on reddit and elsewhere. "}