{"doc_id": "2004", "name": "2016_08_humanities_student_major_1510_singapore", "namespace": "we1sv2.0", "metapath": "", "pub": "singapore", "title": "2016-08-humanities-student-major_1510_singapore.txt", "pub_date": "2016-08-21T00:00:00Z", "Sentiment": "0.126", "Subjectivity": "0.433", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "625", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6qiu51", "Reddit_id": "d6qm1cd", "Subreddit_id": "t5_2qh8c", "Commenter": "pregrace", "length": "3502", "content_scrubbed": "You said in one of your comments below that you haven't read your books yet...? yoooo wtf dude what have you been doing in your lit lessons lol.\n\nStart reading your books. And this is the most important part – understand it. Mindlessly reading through paragraphs after paragraphs isn't going to do you any favours, even if you \"read\" the book ten thousand times.\n\nAs you're reading it you should try to empathise with the protagonist as much as you can. Understand his views of the world, why he reacts in a certain way to certain significant events that happen in the book, why he is the way he is.\n\nThen you do the same thing with the supporting characters.\n\nFrom that point on, the themes/symbols present in the book should be fairly obvious. You should be able to understand *why* significant events are significant. If you truly understand the book, you'll be able to pick up on it. This is a book set for the O levels – it[.] honestly not that difficult lol. Even though you're doing pure lit.\n\nI wouldn't worry that much about memorising quotes word for word. Your literature teacher right now may be stressing the importance of it in class, but they're only doing it because they know the average Singaporean student[.] response to studying for the Humanities subjects is memorising the information and regurgitating it out. That[.] really not the way Literature is meant to be taught or studied. (Question: Is your class considered one of the \"weaker\" ones in the cohort? Not asking to shame you btw, cause mine was, and I had very similar subject combinations as you.)\n\nTrust me – you don't need to memorise quotes. As long as you're reading the essay questions during the exams and you can pinpoint two to three characters/scenes/symbols/whatever that relates back to your essay, you should be able to give a brief description of whatever that is and then immediately explain why it[.] relevant. (BUT, if in the text you're studying, there are specific phrases that are narratively important to the story, then yeah, you should remember those.)\n\nAnd as an aside, you may find that when you aren't stressing yourself over trying to memorise specific wordings in the text, it'll come naturally to you and you'll be able to remember it anyway.\n\n-----\n\nAs for unseen prose/poem, a tip I can think of right now is don't panic when you're reading it. Since the first time you're going to be reading that specific text is during the exam itself, there[.] always a feeling of panic and \"wtf is this shit am I even reading English?\" Just take a deep breath and read it again, and of course, **understand** it. Like, that shit is critical.\n\nUltimately Literature in O levels is just having an understanding of the text and being able to justify yourself.\n\n-----\n\nI was from an average neighbourhood school and I was in 4E6 (aka worst class wtf) and I got A1 for pure lit throughout school and in my O[.].\n\nAlso read in another comment of yours that you're already planning to sacrifice your subjects. While I don't think pure lit is *as* important as English or Maths in the case of O levels (since you'd need at least a pass in those to go pretty much anywhere), I will say that I really believe that pure lit can help you in your R4/R5. I think a lot of your problem so far in pure lit has been not reading the books and thus not understanding it fully. That[.] something you can change in two months imo. I'm also probably biased, but Literature can be really fun and even rewarding to study.\n\nGood luck! "}