{"doc_id": "64", "name": "2016_06_humanities_student_major_712_nottheonion", "namespace": "we1sv2.0", "metapath": "", "pub": "nottheonion", "title": "2016-06-humanities-student-major_712_nottheonion.txt", "pub_date": "2016-06-09T00:00:00Z", "Sentiment": "0.053", "Subjectivity": "0.218", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "369", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d42bq5b", "Reddit_id": "d42eby4", "Subreddit_id": "t5_2qnts", "Commenter": "Samuel_I", "length": "2384", "content_scrubbed": "Why not the [Yale News](http://yaledailynews. com/blog/2016/05/26/student-petition-urges-english-department-to-diversify-curriculum/)? It[.] a far more balanced and nuanced discussion than... what is it? *Law Newz*? Whatever. \n\nThe arguments made in the Yale News are not as unreasonable as this article makes it out to be. Plus, it seems like most of the people involved want a real discussion, not \"Lol just Ban Shakespeare,\" like Law Newz seems to be suggesting.\n\nAlso, here is (apparently) a link to the text of [the petition](https://docs. google. com/forms/d/1p__DaGbJK-eYc5NPzB9DDy6Et19fqzAK_xGyc_OEPRg/viewform?c=0&w=1).\n\nIf you're looking for a more balanced perspective:\n\n\"I love the idea of decolonizing our early period courses: as the authors of the petition rightly suggest, there is no reason why classes in pre-1800 literature shouldn't be spaces for thinking and learning about the histories of race, gender, sexuality, religion, ethnicity, and ability–indeed, there[.] something especially illuminating about studying such issues in the context of a period whose frames of reference are often radically different from our own,\" Nicholson said.\n\nand\n\nWhile Waldman praised the petition[.] commitment to inclusivity and diversity, she suggested that the tradition canon, comprised of mostly white male poets, is an essential area of study. \"If you want to become well-versed in English literature, you're going to have to hold your nose and read a lot of white male poets. Like, a lot,\" Waldman wrote. \"I want to gently push back, too, against the idea that the major English poets have nothing to say to students who aren't straight, male, and white.\"\n\nand\n\n\"The question of English 125/126, and its privileged place in the major, is an important one, and I don't have easy answers — though I am personally eager to participate in a more open conversation about it,\" Nicholson said.\n\nI'd argue it[.] a bit more complicated than \"... stop demonizing pillars of their culture...\"\n\nThreads like this are inevitably a bunch of people who have little to no connection to the actual issue itself. In fact, most often, the people who get most up in arms about things like this are the ones who are the first to decry the liberal_arts as completely useless and waste of time. So, the outrage often strikes me as being bullshit from the beginning.\n\nEdit: a letter and some italics"}