{"doc_id": "93", "name": "2016_06_humanities_student_major_1008_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2016-06-humanities-student-major_1008_politics.txt", "pub_date": "2016-06-14T00:00:00Z", "Sentiment": "0.114", "Subjectivity": "0.403", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "491", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d48vi7y", "Reddit_id": "d48wzff", "Subreddit_id": "t5_2cneq", "Commenter": "slimy_birdseed", "length": "3143", "content_scrubbed": "I'm in my mid-30[.], I'm in the top 75% by income and I wholeheartedly disagree with you.\n\nIncomes are not stagnant, if you get a full time job after college you will get yearly raises. Since the market crash wages have grown over 2% annually.\n\n[Wrong.](http://www. pewresearch. org/fact-tank/2014/10/09/for-most-workers-real-wages-have-barely-budged-for-decades/)  Wages in total have grown over 2% anually with the vast majority [\\(90%\\)](http://www. epi. org/publication/charting-wage-stagnation/) of that growth going to the top 1% of earners.  Everyone else got a double-whammy of stagnant wages and working twice as hard.\n\n Food is cheaper than ever, one of the benefits of globalization,\n\nCPI indexes have outstripped wage growth over the past two decades, which means food is more expensive than ever before.   Globalization has few benefits unless you have a large stake in a multinational corporation or are in some way well-positioned to take advantage of the cost of labor gradient.   That advantage has gone almost one-sidedly to Capitalists at the expense of workers, with the perceived benefits on the part of the majority being powered entirely by a cheap credit bubble.  Furthermore, it[.] resulted paradoxically in damage to already fragile industries in economically depressed areas as the result of one-sided trade agreements which force them to compete against well-subsidized Western interests.  It[.] only possible to repeat that globalization is a positive force up until the point where you get shafted by it - which is happening, right now.\n\nunless you want the highest quality organic food. \n\nWrong, nobody is asking to eat Kobe steaks every day, and this is a half-baked effort to label anyone disagreeing with you as some kind of fussy hipster.  I[t[.] getting increasingly harder to buy good, cheap food.  \n](https://www. colorlines. com/articles/why-more-americans-cant-access-healthy-food)\n\n\nWhen I was younger and in college I ate cheap food because it was cheap, now I can afford better quality food. \n\nWhen you were younger, food also cost 10-15% less, and you had to pay less in college loans as well as housing.\n\nIf you have a degree, your job is not yet being outsourced.  I don't know many people who went to college and got a degree in factory manufacturing.\n\nThere are many people who got a degree and didn't manage to get a job at all through no fault of their own.   No, they weren't all liberal_arts majors either.\n\nThe claim jobs aren't at risk from outsourcing or automation really needs a citation.  Of course[ don't take my word for it.](http://www. oxfordmartin. ox. ac. uk/downloads/academic/The_Future_of_Employment. pdf)\n\nIt seems to me that a lot of people have problems that are not much different than older generations, but for some reason are giving up on putting in the effort to improve their situation and looking for some magic policy to fix everything for them.\n\nIt seems to me to see similar levels of wealth and income inequality you have to go back to the 1920[.].   Just take a look how global stability went from there instead of hand-waving away every problem past the end of your own nose.\n"}