{"doc_id": "1921", "name": "2016_08_humanities_student_major_706_kravmaga", "namespace": "we1sv2.0", "metapath": "", "pub": "kravmaga", "title": "2016-08-humanities-student-major_706_kravmaga.txt", "pub_date": "2016-08-11T00:00:00Z", "Sentiment": "0.115", "Subjectivity": "0.314", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "560", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4x527n", "Reddit_id": "d6daegx", "Subreddit_id": "t5_2rpbv", "Commenter": "krvmga", "length": "3406", "content_scrubbed": "Intro/disclaimer: I have been studying and practicing martial art for 52 years (as of this writing), Krav Maga for 34 years, taijiquan and baguazhang for 45 years.\n\nYou ask a really interesting question, more interesting than you may know.\n\nI think most modern Krav Maga practitioners don't realize it but quite a few internal martial art practices were introduced and adapted into the Krav Maga system from baguazhang back in the 1980s at Imi[.] insistence. (Imi was an amazing man.) Multiple man fighting drills, \"zombie\" games, intensity drills -- these all arose out of baguazhang methods taught in multiple national seminars to all ranking Krav Maga instructors in Israel at the time. (I know because I was there.) \n\nThese were also further adapted from the Conflict Management Institute (CMI) intensive course in Israel. (Imi and I were both charter members of the CMI board.) This was a course designed to improve on civilian/military training and take someone, essentially, from zero to sixty in two and a half days of high intensity work. (After I left Israel and Imi died, the CMI faded and although a couple of instructors tried to continue the course their skill wasn't high enough to make it successful. The intensity drills just went into Krav Maga proper.)\n\nIn the 90s, Imi encouraged structural changes in some of Krav Maga[.] fundamental techniques (punching, for example) based on whole body power drills from taijiquan. This was still going on in 1996 when Imi and I went to Wingate and Bahad 8. (Based on my observation, it seems these changes have only been adopted in a spotty manner worldwide and, perhaps, never learned by some in the new generations.)\n\nThere are other high ranking Israeli Krav Maga masters who continue, to this day, to practice taijiquan, baguazhang, and/or xinyiquan and who teach clean Krav Maga.\n\nKrav Maga is a self-defense system without peer (although there are plenty of \"wannabe\" systems). Krav Maga is a \"miktsoa\" -- a profession -- not \"omanut lechima\" -- martial art. Take Krav Maga for all your self-defense needs. Just be sure you're learning from a legitimate source.\n\nTaijiquan, baguazhang and other internal arts are martial arts. They have goals going beyond mere self defense -- too many to enumerate here -- which include development of a strong, global \"state of being\". Just be sure you're learning from someone with a decent lineage and who has good body structure.\n\nAs always, a lot depends on who you're learning from, their skill, understanding, and experience.\n\nChoose to practice each system for the value you can get from it and take each one on its own terms. This may, from time to time, cause you a little cognitive dissonance where performance standards are different between the arts. For example, if your typical taiji or bagua teacher shows you \"self-defense\" techniques, odds are they're going to fall short of Krav Maga[.] standards. (Feel free, inside your head, to observe what[.] suboptimal but leave those teachers to themselves. It[.] not your job to \"fix\" them.)\n\nThe major caveat is don't try to combine systems. \"taijimaga\", \"kravmagua\", these are recipes for Turd Soup. Practice the physical aspects of each system separately.\n\nTL;DR Krav Maga may help clarify understanding of technical application in internal arts; internal arts may facilitate higher \"state of being\" practice for someone who also practices Krav Maga."}