{"doc_id": "136", "name": "2016_06_humanities_student_major_1327_books", "namespace": "we1sv2.0", "metapath": "", "pub": "books", "title": "2016-06-humanities-student-major_1327_books.txt", "pub_date": "2016-06-19T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.53", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "254", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4fsz35", "Reddit_id": "d4ftgt2", "Subreddit_id": "t5_2qh4i", "Commenter": "ribosometronome", "length": "1613", "content_scrubbed": "In English we had courses like Foundations of Literary Analysis and Act of Interpretation\n\nI was taking a look at Yale[.] website and it sounds like Yale is using this course as a bit of a [double whammy](http://english. yale. edu/undergraduate/what-english-125-126) in that regard. \n\nUnlike most introductory surveys, 125 and 126 teach the arts of critical analysis and interpretation in small seminars.  Through conversation, writing, and rewriting, students practice the pleasurable and absorbing work of making meaning out of words, lines, stanzas, and poems.  Each class is likely to develop its own unique narrative threads – the tastes, interests, and expertise of the participants will shape the conversation over the course of the semester.  At the end, however, the common result of these distinct experiences should be a heightened sensitivity to and curiosity about the way language works, a confidence in engaging with historically and formally diverse literary texts, and an appreciation both of the continuities that sustain English verse across the centuries and of the profound formal and philosophical shifts that divide one era from another.\n\nGiven all that, it[.] not sounding like the complaints are necessarily all that invalid. To a layman like myself, some of these texts seem relatively foundational in terms of English lit, but if the course is required and the goal is largely to get students in that sense of analysis, it isn't really unreasonable to think that focusing only on those authors is a bit arbitrary and that they might be better served by course with a slightly broader scope."}