{"doc_id": "141", "name": "2016_06_humanities_student_major_1356_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-06-humanities-student-major_1356_AskReddit.txt", "pub_date": "2016-06-20T00:00:00Z", "Sentiment": "0.143", "Subjectivity": "0.362", "Score": "26", "Upvotes": "26", "Downvotes": "0", "Wordcount": "277", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4ggu74", "Reddit_id": "d4ghwzn", "Subreddit_id": "t5_2qh1i", "Commenter": "TheRobotRabbit", "length": "1502", "content_scrubbed": "Mind if I ask your age?\n\nI'm 30, and my experience very much mirrors the above posters. All through my education, we were told over and over just how challenging school was, and how special and smart we all were for doing so well. I was always put into honors or AP classes, because I was coming into a public high school after a mainly private early education. The result was spending four years not having to try at all, while being told I was an amazing student.\n\nI got bored of the academics, because I was never challenged or strained, and moved into art, where I could basically do whatever I wanted because the school had labeled me as 'gifted' even though all that really meant was that my parents paid more for my elementary school than my classmates'.\n\nThree years into college, I gave up on art because I sucked at it, and left with a meaningless liberal_arts degree, which was enough to land me a simple corporate job where I continue to be highly rewarded for doing simple work anybody could do. \n\nI've found that people slightly older tend to value my \"work\" more, because they actually had to bust ass to be successful, and people younger tend to value themselves more than me because they were in the generation told that a C- was an accomplishment worth celebrating. It all just goes back to your experience growing up.\n\nI try to motivate myself, but it[.] hard when the world rewards my D- effort as much as hey reward my A+ effort - why stress myself out when no one notices or cares?"}