{"doc_id": "1890", "name": "2016_08_humanities_student_major_485_aprogressiveparty", "namespace": "we1sv2.0", "metapath": "", "pub": "AprogressiveParty", "title": "2016-08-humanities-student-major_485_AprogressiveParty.txt", "pub_date": "2016-08-08T00:00:00Z", "Sentiment": "0.105", "Subjectivity": "0.37", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "914", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4wqk5c", "Reddit_id": "d69k18c", "Subreddit_id": "t5_3fozl", "Commenter": "TheKingOfCrumpets", "length": "5632", "content_scrubbed": "This is an excellent list, and thanks for posting it. I've replied  to each of your points, and added a couple of my own at the end. Would like to know what you all think.\n\nAbolish all standardized tests including the SAT and ACT used for colleges and universities.\n\nI strongly disagree with this point. There is a huge variety in quality of education in this country, and standardized tests give us a way to quantify that. I think we should continue to have standardized tests, but scores should not be proportional to funding. Identify key policies from top-tier schools to implement in lower performing schools to improve overall quality, and provide training and additional human resources to under-performing schools. Additionally, I think the government should pay for each high school student to take the ACT/SAT at least once. The cost can be restrictive for poor families.\n\nRemove current curriculum and replace it with straightforward and easy to understand concepts created by teachers with suggestions from parents. (e. g. Replacing Common_Core[.] version of math with the simple math that our parents were taught.)\n\nIf we remove common core, then we'll need a viable alternative. I honestly don't know enough about common core to form my own opinion, so I'd be super interested in seeing some detailed plans for alternatives and the advantages/disadvantages of those over common core.\n\nIncrease funding for field trips to museums, zoos, and institutions of learning\n\nSome funding should be provided for field trips, but special emphasis should be put on trips to colleges and universities. In my opinion, regular field trips to colleges and universities would have a much larger impact compared to trips to museums, zoos, etc. \n\nAll High Schools should provide classes in useful trades and offer certification for those who choose not to attend college (i. e. carpentry, plumbing, electrical, auto mechanics, etc.)\n\nThis will be out of reach for many, MANY public high schools in the US, especially in rural areas. I think we should tackle this problem by subsidizing or paying for students to go through trade programs at community colleges and universities, and subsidize schools that can provide these classes and certifications.\n\nMassive emphasis on S. T. E. M.\n\nAgreed, but we can't forget about music and the arts. I'd actually go so far as to say that music and arts programs should receive special/extra funding as an incentive.\n\nMandatory sex ed for all students starting in 8th grade\n\nOMG yes. There will definitely be challenges in the more conservative regions like the South though. I think if this were to be implemented, we would have to develop a nationwide curriculum rather than letting each school develop their own. \n\nAllow teachers to audit administrators and allow those audits to be used by school boards to decide if the administrator[.] contract should be renewed for the next year\n\nThis seems like a super specific policy position. What problem does this fix? What[.] the point here?\n\nInstitute a code of ethics for all school boards. Any board member found to be acting in their own interest instead of the students or parents should be immediately removed and forbidden from participating in future discussions regarding district business.\n\nIsn't this the point of voting for school board members? Does this actually fix existing problems? Is school board corruption a common thing? I'm not sure I see the point of this one either.\n\nProvide more moneys for after-school programs to inner city schools in high crime or high poverty areas to keep low income students out of trouble\n\nInstitute a 3 strike rule for problem students. High school students who habitually disrupt learning due to bad behavior should be expelled from public school and given the ability to attain their GED. (Stop treating teachers as baby sitters)\n\nI get what you're trying to say here, but I don't agree with this at all. We have to think about why students habitually reoffend and act up. I think we should spend more money on guidance counselors and one-on-one mentoring for students, and allow for individual states/schools to deal with problem cases the way they see fit, withing certain limitations.\n\nAll supplies bought by teachers for classroom use should be considered a tax exemption and should be fully reimbursed to them when they file income tax returns.\n\nGreat point. I definitely agree, but there should be a limit ($1000-2500) to discourage fraud.\n\nTuition at all public colleges and universities should be free\n\nI agree with this, but we'll have to implement cost-limiting measure to make it viable. The cost of education is incredibly inflated right now, and it would be incredibly expensive to just pay whatever the colleges and universities are asking. I think we should also allocate funds to expand and improve student housing to make things even more affordable.\n\n\nIn addition to what I've already written, I have a few more points.\n\n* Schools should receive subsidies or incentives for implementing physical education classes, which should focus on nutrition and weight management in addition to fitness.\n* Online AP courses should be made available nationwide. Making these courses would even the playing field for students from rural or poor communities to compete for more prestigious scholarships and acceptance to more prestigious schools.\n* Frankly, I think the current state of school lunches is unacceptable. We should provide additional funding and guidelines for school lunches, such as what constitutes a vegetable (i. e. not pizza) and money to hire kitchen staff who will actually cook. "}