{"doc_id": "78", "name": "2016_06_humanities_student_major_852_fortlauderdale", "namespace": "we1sv2.0", "metapath": "", "pub": "fortlauderdale", "title": "2016-06-humanities-student-major_852_fortlauderdale.txt", "pub_date": "2016-06-11T00:00:00Z", "Sentiment": "0.083", "Subjectivity": "0.35", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "916", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nmreo", "Reddit_id": "d45ccdu", "Subreddit_id": "t5_2s494", "Commenter": "PixelTreason", "length": "5232", "content_scrubbed": "\nIn upstate NY, we have Wegmans for all of our grocery needs. Are there any decent or comparable grocers in FTL?\n\nPublix is king. Big, clean, fresh - good meats, good deli and bakery. *Great* subs. :) You'll love it. We're pretty proud of it. Never been to Wegmans so not sure how it stacks up but it[.] very good. Also just a good company in general - IIRC the employees own the company pretty much? They all get stock and Publix treat them very well. We do have a few Trader Joe[.]/Fresh Markets/Whole Foods too.\n\n\nMy wife and I prefer credit unions over major banks. Are there any well-respected CUs around?\n\nYes. Not sure what all of them are but I used IBM[.] for a while and there[.] another called Priority One that I hear is fine. \n\nWhat[.] the arts/entertainment culture like? Rochester is known for the Eastman School of Music and the performances they give, and the amount of art/general culture around the city. Is there anything comparable?\n\n[Broward Center for the Performing Arts](https://www. browardcenter. org) and the surrounding area has some good stuff going on usually. \n\n\nI hate to sound completely ignorant here, but how invasive/problematic is the local wildlife (read: alligators). In the Rochester area, all have to deal with is the occasional deer being hit by a car, or that darn pesky squirrel eating out of your trash bin and making a mess. We're no strangers to animals or wildlife (I grew up in the country on the non-farm equivalent of a farm, and my wife did barn-work when she was younger), but we're moving to a different climate, which means different animals, and different ways to manage them.\nHow problematic are the insects and are there any particular ones we should be aware of/stay away from? The most I've had to deal with up here are mosquitoes, ticks, fleas, and the occasional non-venomous spider.\n\nAlligators aren't normally a real issue. Don't go swimming in the canals and just keep an eye out on the banks of any canals/lakes. You'll be fine. Don't go mucking about in the swamp alone. \nAlso you might see some iguanas, hear some parrots and get a glimpse of one of our breeding pairs of egyptian geese. All invasive - but awesome - species. :)\n\n**edit** Oh yes - ducks! Our Muscovy ducks. Most people hate them. They poop everywhere, are idiots when crossing roads and people think they are ugly. I like them and think they're kinda sweet. Just don't feed them bread it[.] not good for them (try oatmeal, they love it!). And don't feed them near your house or they will just congregate and poop all over. \n\nMosquitos, palmetto bugs (giant roaches), fleas/ticks all love the warm weather. \n\nI know there are other threads/postings on this, but could anyone recommend a current reliable and uncapped Internet connection (that hopefully isn't Comcast)? We do a LOT of video streaming (Netflix), and I do a LOT of video game downloads/streaming and would blow through any caps within a week. I'm not against paying for a business account for unlimited data, but I was hoping for something cheaper. I currently pay $45/month for 30 down, 5 up, unlimited through Time Warner with my own modem/router.\n\nComcast is kinda it in most places. We pay $80 something for 80 down 10 up I think. We don't have cable, only internet. \n\n \nWhile we most likely be working with a realtor through my wife[.] new job to find a place to rent, would anyone be able to recommend a reliable and trustworthy realtor for looking into a house or more permanent rental later on?\n\nSorry, nope!\n\n \nOn a separate, yet very related note, we've lived in upstate NY for our entire lives, so we're completely clueless about hurricanes...\nBoth of us have cars, but are worried about hurricanes damaging them. What do people normally do with their cars during one? Garage? Covered Parking Lot (do they exist down there?) Just throw a cover on it?\n\nNothing, usually. Hope that it doesn't get destroyed. Deal with the dents when it does. Lost my old truck to flooding but you'll have to deal with hurricanes less often then you would think.\n\n \nWhat is the flooding situation like during a hurricane, or does it depend on the area?\n\nDepends, you got it. Some places are old and the streets weren't built well or with flooding in mind. \n\n\nHow often does power cut out due to storms or something else? (We'll melt without A/C. True fact.)\n\nDepends again on the area. I've never lived anywhere else but Florida so I don't know, maybe I'm just used to it. Thunderstorms all summer and the power gets knocked out every other storm or so! But it comes back on before I need to worry about getting too hot or clearing out the fridge. \n\n\nAnd last, but not least:\nIs there anything else that us northerners should know about hurricanes or living in Fort Lauderdale that might be common knowledge down there?\n\nThe humidity may surprise you. It[.] muggy, muggy gross pretty often. It[.] VERY VERY HOT. Make sure to hydrate a lot! \nPeople drive like maniacs. Keep your wits about you. Old people like to complain in the grocery store line and use many coupons. \nYou'll be pretty near the beach wherever you are and it[.] lovely. It[.] always green here, all year round. We take it for granted. \n\n\nEdits: Fooking commas. I use them too liberally. "}