{"doc_id": "1997", "name": "2016_08_humanities_student_major_1454_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2016-08-humanities-student-major_1454_college.txt", "pub_date": "2016-08-20T00:00:00Z", "Sentiment": "0.127", "Subjectivity": "0.374", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "294", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6pk9pu", "Reddit_id": "d6pkzbi", "Subreddit_id": "t5_2qh3z", "Commenter": "SnowblindAlbino", "length": "1744", "content_scrubbed": " It[.] not that students are at fault for not being interested it[.] that school should be reserved for those who actually need to be there for there future jobs.\n\nYour comments go to a particular problem with American higher education: the broad assumption that you should go to school largely to prepare for a job. There are many other reasons to be educated-- our country *needs* an educated populace to function in fact. The challenge is that we've done a terrible job explaining the value of education beyond a simple credential for employment, so people go through the steps primarily to qualify for a job (which as you suggest isn't even necessary in many cases) while ignoring the purpose/need/uttility of actually becomming educated in a meaningful way.\n\nAmerican high school education is, on the whole, terrible; graduates often can't do basic math, can't read a complex magazine article, can't analyze problems, and can't write worth a damn. The number of jobs *not* requiring those skills is going down rapidly. Since high school can't/won't provide them, colleges must. That[.] the basic bargain our educational system has made, and why college now feels a lot like high school for many students. The authors of this article (and the book upon which it is based) are suggesting strategies for making college more than just grades 13-16. \n\nHigher education doesn't *have* to be a waste of time, and until we fix the system as a whole students who want to do more than check boxes need to be invested in their own futures well beyond the level seen by students like your roommate and his ice skating/wall climbing course load-- after all, he *could* have taken diffential calculus and advanced econometics courses if he wanted to do so."}