{"doc_id": "1896", "name": "2016_08_humanities_student_major_534_books", "namespace": "we1sv2.0", "metapath": "", "pub": "books", "title": "2016-08-humanities-student-major_534_books.txt", "pub_date": "2016-08-09T00:00:00Z", "Sentiment": "0.105", "Subjectivity": "0.409", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "341", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6aedwr", "Reddit_id": "d6ajp3v", "Subreddit_id": "t5_2qh4i", "Commenter": "attacklibrarian", "length": "1983", "content_scrubbed": "I have been an academic librarian for ~5 years at a liberal_arts college in the Southeastern U_S, and going back to school to get my masters in library and information science was perhaps one of the best decisions of my life. Granted, I was teaching high school English before going back to school (for a little over 5 years), so for me personally, many professions would have been much better.\n\nAnyway, I love being a librarian because I can still teach and interact with students, but I don't have the constraints of doing it in a public high school setting.\n\nAs far as online classes go, I think a lot of it has to do with personal preferences and what you're willing to put into the class. I myself did a blended approach (some classes online, some in person) and liked it a lot. Sure, some professors were better at facilitating courses online than others, but I think I gained the most by putting in the time and effort to make the online environment more like an face-to-face class--heavily participated in discussion boards, met synchronously when possible, went to the univ. library for assignments as much as possible, etc.   \n\nI have now taught a few online classes, and some people just don't like it. Sometimes it[.] due to defincines in technological knowledge, and sometimes they just prefer to have a professor in front of them professing, rather than having to rely on watching a recorded lecture.\n\nI'd suggest contacting a library in which you're interested in working (academic, public, specialized, etc.) and seeing if you can shadow someone. I know this may be difficult with whatever else you have going on in life, but it definitely wouldn't hurt if you can! \n\nAlso, if you do pursue librarianship, make sure you do some sort of internship (I'm sure most programs would require it anyway). That[.] how I found my passion in academic libraries as a research and instruction librarian, while coordinating interlibrary loan.\n\nPM me if you have any other questions!"}