{"doc_id": "47", "name": "2016_06_humanities_student_major_462_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2016-06-humanities-student-major_462_politics.txt", "pub_date": "2016-06-06T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.359", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "331", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3ybeui", "Reddit_id": "d3yc0uh", "Subreddit_id": "t5_2cneq", "Commenter": "nameless912", "length": "1971", "content_scrubbed": " they want to take my money away so they don't have to get real jobs \n\nSo, I'm a liberal bordering on a socialist, and I have a full time job as an engineer. Has your brain exploded yet?\n\nReducing a 4 year degree program to 3 years by removing non-major classes is sawing off a leg to fix a toothache. The whole point of non-major classes is to make people well-rounded, compassionate, and generally intelligent human beings (lessons you could certainly use...). And blaming arts degrees for all your problems is idiotic; many, many people are legitimately extremely talented in those fields and go to college for them to get better. Are you saying art doesn't matter? Or that we should just completely stop supporting it as a society? Because the only people in history who have ever gone down that route are eastern communists, and we can all see how well that went.\n\nA good university system is a place of learning, not a glorified job training program/state funded day care. I agree, universities aren't properly serving students, but the solution isn't cutting costs and reducing core requirements. The solution is to let *institutions of learning* be just that: focused on learning and pushing the boundaries of human knowledge, not training a bunch of mindless drones for dead end office jobs.\n\nHonestly, people who blame universities for \"liberal-ifying America\" completely lose credibility in my eyes. It[.] absolutely insane that you would throw away the advancement of human knowledge because they're forcing your kid to see the world in a viewpoint *you* don't agree with. Who made *you* the goddamn education czar? Why is it that a liberal_arts education (which, by the way, does not mean liberal brainwashing-it means liberal_arts in the classical sense, which includes both arts and sciences education to create a well-rounded individual; it contrasts with a fine arts education or a natural arts education, and sits in between the two) is such a bad thing?"}