{"doc_id": "91", "name": "2016_06_humanities_student_major_970_realestate", "namespace": "we1sv2.0", "metapath": "", "pub": "RealEstate", "title": "2016-06-humanities-student-major_970_RealEstate.txt", "pub_date": "2016-06-13T00:00:00Z", "Sentiment": "0.075", "Subjectivity": "0.333", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "490", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4809ds", "Reddit_id": "d482v4x", "Subreddit_id": "t5_2qipl", "Commenter": "TEEss", "length": "2654", "content_scrubbed": "Going to disagree here. Certainly some degrees will not have a great return on investment, but it gives OP a leg up or a fall back plan. To make a blanket statement that degrees are worthless is just bad advise.\n\nI have a pretty common degree, but I have spent the last 8 years since I left college working hard in my field and I now make phenomenal money. Without the degree, I wouldn't have even gotten an interview. I am surrounded by individuals with bachelor or master[.] degrees who are highly successful. And that degree was the stepping stone that was required. I'm not even talking about fields where a specialized education is required. I'm talking business and communication degrees. I work for a huge data and marketing company as a Project Manager. You won't get in the door for a talk about a job without a significant amount of experience or at least a 4 year degree for any entry level job. And there[.] nothing elite about my company.\n\nCollege can be obtained on a reasonable budget. My local community college can get you through a 2 year degree for less than $12,000 and that[.] before a single drop of financial aid. Move onto a 4 year college to complete a Bachelor[.] and that can be done in a lot of cases for $20,000 or less before financial aid as well. Add in financial aid and there[.] a chance it'll cost you somewhere between $15,000-$20,000 total for the 4 years between two schools. Those are fully accredited, known schools. OP could burn a summer and join the military reserve for any branch and gain access to additional benefits and a legit paycheck on top of that to help pay his/her way through too. Plenty of friends who did that, left college with minimal or no debt, and went into quality jobs. Not to mention nice benefits like VA Loans and such.\n\nNow, with all of that said, it[.] not the worst idea in the world as you said to see how OP likes working in a RE office after high school. I went out and worked minimum wage, hourly jobs for 2 years before I started college. Then I decided this was not for me. It took me 3 years while working full time to complete my Associate[.] before I went full time for my last 2 years to get my B. S. B. A.. And I'm glad I took that time off because I wasn't ready to succeed in college.\n\nSide note to OP: At least pick a major, if you go to school, that you enjoy on some level and could enhance your real estate ability or makes you more marketable to a RE office. Don't go Liberal Arts or Fine Arts or something. Maybe pick Finance, Business (anything really IMO), Communications, etc. Something that you could reasonably draw a correlation on the skills you got from that degree."}