{"doc_id": "18", "name": "2016_06_humanities_student_major_200_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2016-06-humanities-student-major_200_ApplyingToCollege.txt", "pub_date": "2016-06-02T00:00:00Z", "Sentiment": "-0.059", "Subjectivity": "0.239", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "327", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3t913x", "Reddit_id": "d3tl0wl", "Subreddit_id": "t5_2y2r8", "Commenter": "4profitaway", "length": "1932", "content_scrubbed": "Low-Quality education, with short class schedules, low passing grade requirements, grade inflation, and low quality Professors.\n\nThe last one is typically not because of the professors themselves but is a result of the first factors. I did my PhD at a very high-ranking university but due to personal circumstances, had to take the for-profit job when it was offered. Many of the professors I met there were in similar situations: personal and/or economic hardship led them to accepting jobs there. Then once they were hired (this even happened to me), they were given mandatory curricula to follow with no room for negotiation and were ordered to pass failing students. I was personally brought into the college president[.] office and told I couldn't fail certain students multiple times. The mandatory curriculum I was told to follow was so basic it was a joke. I was reprimanded when I tried to implement changes. My point is, teachers at these things often have their hands tied when it comes to the quality of the teaching materials. Everybody where I worked was secretly trying to get other jobs so they could leave. Everybody, unless they'd given up, had one foot out the door as soon as they realized how awful the school actually was.\n\n\nOr, in other cases, they may genuinely not be qualified in the subject area they teach. The school where I worked would assign teachers classes in random subjects so long as those subjects were under the same department. For instance, a teacher with a background in psychology could be assigned (always at the last minute) a class in English-as-a-second-language simply because both subjects were lumped into the Arts & Sciences department. Someone with a background solely in math could be assigned an economics class. And so on. One semester a professor from another subject area was assigned to teach in my subject area and I had to train him in the subject. It was a total mess."}