{"doc_id": "181", "name": "2016_06_humanities_student_major_1718_asklosangeles", "namespace": "we1sv2.0", "metapath": "", "pub": "AskLosAngeles", "title": "2016-06-humanities-student-major_1718_AskLosAngeles.txt", "pub_date": "2016-06-24T00:00:00Z", "Sentiment": "0.13", "Subjectivity": "0.294", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "336", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4pk4pu", "Reddit_id": "d4mhhte", "Subreddit_id": "t5_2zay0", "Commenter": "demodulator", "length": "1832", "content_scrubbed": "Yeah, I have noticed the same thing too. \n\nHaving lived in Austin/LA. \nYou have a bunch of kids who are at UT/ACC who are hanging out, living the Austin dream. 10 years ago, Austin was much cheaper than it is now and was easier to be highly educated, wait tables and just get by. I knew plenty of people who willingly took pay cuts, just to enjoy quality of life in ATX. \n\nWhen I have looked at comparable rents/cost of living lately, looks like prices in Austin have also blown up.\n\nI have alot more friends making 6 figures in LA than I did in Austin working around silicon beach/DTLA. More industry, more demand for specialized talent, higher wages. Also consider how how much of central Austin is tied to UT, current/former students. Some of those dudes making 6 figures were pretty punk rock 10 years ago too, but LA has so much to offer in terms of things to see/do/eat and just to spend money on... its what makes living in LA tolerable  for me. \nI saw someone post an article recently about how the \"LA lifestyle\" is basically what people need to compensate for the low quality of living in other ways. \nThe same thing goes for Austin 10 years ago. The scenery, culture, food, people, stuff compensates for the lower wages. \n\nI miss Austin from 10 years ago too, I actually just moved out of a place in the Arts District.. the cool restaurants/shit to do over there helps compensate for living skid row adjacent. Everything is a give and take. I just moved to Mar Vista. The give and take was giving up the hipster kingdom for trees and a shorter commute with fewer homeless people shitting on my street.  \n\nTL;DR\nPeople can get paid more here. In ATX quality of life 10 years ago was super high. In LA, I need to spend money and enjoy the amazing quality and variety of things to do in order to make living in LA tolerable. \n"}