{"doc_id": "60", "name": "2016_06_humanities_student_major_678_femradebates", "namespace": "we1sv2.0", "metapath": "", "pub": "FeMRADebates", "title": "2016-06-humanities-student-major_678_FeMRADebates.txt", "pub_date": "2016-06-08T00:00:00Z", "Sentiment": "0.013", "Subjectivity": "0.316", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "367", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d41u5x1", "Reddit_id": "d41vee6", "Subreddit_id": "t5_2y44v", "Commenter": "Ding_batman", "length": "2162", "content_scrubbed": "Teacher led learning v student led learning is a different concept to literacy centerd learning v active learning.\n\nI am not sure where to start, but I guess I will need to start somewhere. \n\n1. There is no such educational concept such as literacy learning, at least not in the context you are using it.\n\n2. The opposite of Active learning is Passive learning, not 'literacy learning'.\n\n3. Active learning actually comes under the umbrella of student centered learning, and passive learning comes under the umbrella of teacher centered learning, so no, they are not different concepts\n\nWhen did they stop measuring numeracy in NAPLAN?\n\nI never said they did. I was focusing on your use of the word literacy, though it is now obvious, after reading your last comment, that you were not using it in the correct context. This seems to another attempt at deflecting.\n\nThe fact that maths and hard_sciences are weighted heavily for a student[.] year 12 score (IB; VCE; HSC) and humanities and English are weighted down flies in the face of claims that boys are discriminated again.\n\nThe fact you are conflating HSC with ATAR scores does lead me to believe you have a firm grasp of what we are discussing here. With the HSC there is scaling within subjects depending on the level being studied. With the ATAR, there is scaling across subjects, but it isn't as heavy as you are stating. But this is yet again an example of you trying to deflect, this is not what our current conversation is about.\n\nI am a Humanities teacher with 12 years of experience who has taught in 2 states and 2 countries. Removed*.\n\nSo I will ask again, \n\nWhy do you think the question relevant, do you have some special understanding from the perspective of someone who presumably sets their feet within classrooms regarding giving normal boys ADHD medications?\n\nHow many discussions have you had with parents outlining behavioural strategies you will be implementing in order to help counteract ADHD behaviours? How many discussions have you had with counselors and parents on the side effects you have noticed if the student is on medication?\n\nEdit: Removed possibly identifying information."}