{"doc_id": "7", "name": "2016_06_humanities_student_major_71_dotamasterrace", "namespace": "we1sv2.0", "metapath": "", "pub": "dotamasterrace", "title": "2016-06-humanities-student-major_71_dotamasterrace.txt", "pub_date": "2016-06-01T00:00:00Z", "Sentiment": "0.017", "Subjectivity": "0.315", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "656", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3rw074", "Reddit_id": "d3rx8tj", "Subreddit_id": "t5_2z18c", "Commenter": "Anna_the_potato", "length": "3829", "content_scrubbed": " The term Multiplayer Online Battle Arena was coined by Riot games to create a distinct genre for League of Legends without mentioning it[.] connections to Dota.\n\n However, it[.] exceptionally vague terminology is poor at describing the core attributes of a Dota-like game. It may certainly describe Dota and League of Legends in some way, but so too does it describe nearly every competitive multiplayer game in existence. Call of Duty is multiplayer, online, battle focused and restricted to an arena. So too is the latest Super Smash Brothers. Even a browser-based Chess game is multiplayer, online, a simulation of a battle and restricted to an arena...\n\n The term Action Real-Time Strategy, in contrast, does a much better job of describing the genre Dota belongs to. Having arisen from an RTS, it shares a lot of gameplay and mechanics typical to that genre. The differentiator is the action focus in the choice to limit the player to a single complex unit, similar to a character in a fighting game. Hence the acronym ARTS.\n\n Of course, if you find ARTS to be too ambiguous, you can go back to the Starcraft mod that inspired DotA: Allstars and created the genre; call it ASSFAGGOTS, or \"Aeon of Strife Styled Fortress Assault Game Going On Two Sides.\".\n\n -written by /u/ConstantCaprice\n\nSheesh, you must be a peasant, using that term on here. It[.] like you don't even read the sidebar or anything! Besides the existence of specific heroes and abilities, what does Overwatch actually have in common with Dota?\n\nAre there levels and XP mechanics in Overwatch? Well, no. There aren't. Considering that *virtually every game in the Dota-like genre has this* including even dumbed down versions like PotS, I'd say that[.] one strike against Overwatch being a \"MOBA\" (ugh, peasant terms).\n\nAre there allied creeps constantly moving to take an objective? No, there never are. I wouldn't say it[.] strictly a requirement, but considering the fact that *every Dota-like game* has this from SMITE to Heroes to League to HoN, I would say the lack of them is also a major strike against Overwatch being in the same genre.\n\nLikewise, is there a jungle with neutral creeps that can be killed for extra XP/resources? Well, no. There aren't, although you will find them, again, in virtually any other ARTS game from SMITE to League to Pots to HoN.\n\nAre there buildings or bases that must be destroyed to win the game? Well, no. Despite the fact that virtually every game in the genre features some version of towers and ancients ranging from SMITE to Hon to League to PotS, there is a glaring lack of these features in Overwatch.\n\nIs there a gold system with which you can buy items that generally give you an advantage of some sort? Well, no, not in Overwatch, unlike HoN or League or SMITE. PotS lacks gold, although it *does* have a talent system that should theoretically substitute for items. CS:GO does, though. Is CS:GO a \"MOBA\" too now?\n\nIs there some sort of Mana system for most heroes that limits the number of times I can cast spells? Well, no, unlike *every other game in the ARTS genre.*\n\nYou might be saying now \"well wat abut ultimate abilities?!?!? what abot abilities huh?!?\" Well, great. Yeah, you sure got me there. Overwatch does have abilities and some ultimate abilities! Surely that makes it an ARTS. Since any game with abilities and ultimate abilities of some sort is now considered an ARTS, let[.] remember to consider Super Smash Bros Brawl (you know, with Smash Ball based ultimates?), TF2 (what else is an uber charge huh?), and *RuneScape* (hey, you have abilities on cooldown and \"ultimate\" abilities) to all be ARTS games now.\n\nYou can say Overwatch is a \"MOBA\" (damn peasant...) all you'd like, just like you could say Pride and Prejudice is a sci-fi novel all you'd like. Doesn't mean you're at *all* right."}