{"doc_id": "2031", "name": "2016_08_humanities_student_major_1838_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2016-08-humanities-student-major_1838_college.txt", "pub_date": "2016-08-24T00:00:00Z", "Sentiment": "0.085", "Subjectivity": "0.332", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "605", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4zgzk9", "Reddit_id": "d6vri0y", "Subreddit_id": "t5_2qh3z", "Commenter": "chevybow", "length": "3475", "content_scrubbed": "Ask yourself the following questions: \n\n\n\n1.) What classes do you enjoy in highschool thus far? \n\n\n\nDo you enjoy math, science, english, history, or maybe your foreign language courses the most? If you had to rank them, how would you do so? Do you like your music electives the most or maybe your art electives? Figure it out. Make a list! \n\n\n\n\n2.) What courses do you get good grades in highschool thus far? \n\n\n\nPerhaps you're just a genius and have straight A[.] in everything. But perhaps there[.] a couple areas you struggle in. What areas are they? Figure out maybe the top 3 academic areas you struggle in the most. Write them down!\n\n\n\n\n3.) What do you enjoy doing in your spare time? \n\n\nYour hobby doesn't have to become your career- but listing out your hobbies might help indicate areas of interest that you could further pursue in an academic setting. \n\n\n\n4.) What kind of person are you in general? \n\n\n\nAre you more outgoing or do you kind of prefer alone time. There are careers suited for both types of people and while certain majors won't be full of just one or the other- certain majors attract certain kinds of people moreso than others. \n\n\n\n5.) What could you see yourself doing in the future? \n\n\n\nAny careers you have in mind? What type of job could you see yourself doing in the future? Could you manage working in an office cubicle or are you the type of person that requires working outdoors? Just give a general gist of what you would ideally want your career outlook to look like. \n\n\n\n\n\n\nIf you answer these 5 questions I could personally recommend some majors that I think might be a good fit. But I hope that through considering the questions you also go through some form of self exploration that might assist you in narrowing down the choice of college majors you might want to pick when you enter college. \n\n\n\n\nFor what its worth, I highly enjoyed math in highschool, was really good in both math and english in highschool, sucked at science and anything artsy or musicy, and was a pretty standard \"nerd\" into video games at the time. Freshman year of highschool I had a math teacher introduce a few students including myself to computer science (our school had no AP courses or anything special like that- so no AP CS). And though I was pretty awful at programming back then, and still probably am, I got really interested and fascinated with computers and technology. \n\n\nI really wanted a career in math but knew I wasn't cut out for engineering- I even failed miserably at a pre-engineering program- so I was glad to pretty early on realize that I wanted to major in computer science. Ended up using my skill in humanities to help pursue a philosophy minor since I still like being analytical through writing and philosophy helps me do just that. \n\n\n\n\nEven if my questions don't help or if any other responses don't help- don't feel discouraged about not knowing what to study in college. It[.] not always easy to realize what you would want to do in the future. Take it slow and worst case scenario I would recommend freshman year, if not during highschool, take some college level intro courses in a variety of areas that would also fulfill gen ed requirements. For example, take some sociology, philosophy, geology, anthropology, Classics, etc. Not only will you knock out gen eds and earn credits but maybe you will find your major through exploring courses that aren't necessarily regularly offered in the highschool setting. \n\n\n\nGood luck! "}