{"doc_id": "1909", "name": "2016_08_humanities_student_major_629_houston", "namespace": "we1sv2.0", "metapath": "", "pub": "houston", "title": "2016-08-humanities-student-major_629_houston.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.323", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "525", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6aw5sv", "Reddit_id": "d6c54dm", "Subreddit_id": "t5_2qj1l", "Commenter": "DementedBenny", "length": "2944", "content_scrubbed": "Well, you don't like Houston, and that[.] fine, but you're absolutely wrong on some points...\n\n Have you seen this \"city\"?! It[.] just a highway and giant shopping centers!! That[.] it! The parks are laughable. There is ZERO culture. It[.] a big fake place. Of course housing is cheap, there[.] jack shit to do here besides go to Walmart Chipotle and Starbucks ever 5 steps. And if there is, it[.] 25 miles away in any given direction! Now, of course I'm being a bit hyperbolic there.\n\nYes, you are being hyperbolic. Our highways are the lifeblood of the region, and make it incredibly easy to travel vast distances relatively easily. Have you ever driven around during non-rush hour traffic times? Please, tell me a major city that is easier to get around in off-peak times than Houston. I can be in Galveston in the morning, Katy in the afternoon, and The Heights for a nightcap, and I didn't have to change trains multiple times or deal with leery drunks. Houston is not bad at all for driving, as transplants from the northeast like to tell me all the time. Do some traveling, and stop being dramatic. Could Houston be better when it comes to transportation? Sure, but it sure as hell is now where near as bad as people like to make it out to be.\n\nAlso, for being flat as can be, Houston is actually very pleasant. There are trees and parks and trails and wildlife literally everywhere. Our parks absolutely swamp anything NYC has. Have you been all the way through Buffalo Bayou Park? Memorial Park? George Bush Park? Bear Creek Park? Did you know you can kayak down our bayous? Go on a horse ride through the city? See coyotes and deer within the city limits? Have you driven through Rice Village? Memorial?\n\nIn the U_S, Houston is second only to NYC when it comes to the arts. How can you not know that? Have you never seen our symphony orchestra? Opera house? Multiple theatre companies? We're also literally the most diverse city in the country, and many would argue Houston has the best all-around food scene in the country. Our live music scene is also going through a revival, there are numerous outdoor cultural and music festivals throughout the year... \n\nOh, and to show some love to our maligned suburbs... From them, you have the opportunity to live in homes at prices the rest of the major \"cultural\" cities could only dream of. You have easy access to locations to hunt and fish, ample area for outdoor sports, multiple lakes, places for extreme sports and mudding, etc. Oh, and while locals bitch about Galveston, NYC and Chicago would kill for halfway decent beaches that they could visit basically year long.  \n\nI don't know, it seems to me you don't know jack shit about this city. But, hey, if you don't like it that much, move. Oh, but that[.] right, the rest of the country[.] economy is shit, and their home prices are out of whack... and it[.] not like having a home and a decent job is all that important... right?"}