{"doc_id": "115", "name": "2016_06_humanities_student_major_1145_the_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "The_Donald", "title": "2016-06-humanities-student-major_1145_The_Donald.txt", "pub_date": "2016-06-16T00:00:00Z", "Sentiment": "-0.009", "Subjectivity": "0.172", "Score": "69", "Upvotes": "69", "Downvotes": "0", "Wordcount": "333", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4bzs3a", "Reddit_id": "d4c10u0", "Subreddit_id": "t5_38unr", "Commenter": "321LTD123", "length": "2215", "content_scrubbed": "Yeah. During the Bolshevik Revolution in Russia the useful idiots were killed off for \"not being revolutionary enough\"\n\n\nDuring Mao[.] [Cultural Revolution](https://en. wikipedia. org/wiki/Cultural_Revolution#Early_Stage:_Mass_Movement) the academics who helped Mao rile up the youths into the Red Guard and attack moderates and conservatives (sound familiar? cough* BLM) wound up being beaten in public, jailed and even killed by the same red guard. The police and elected people went on record saying \"If a bad person is beat up, that[.] ok. If a good person gets beat up, then that[.] how you get to know them and find out they aren't bad.\"  [Nie Yuanzi](https://en. wikipedia. org/wiki/Nie_Yuanzi) is the best example of useful idiots being eaten by their creations. **Obama is a Maoist, study Mao[.] thoughts and tactics and you will see similarities.**\n\n\nEven ISIS uses the same ideology, when they control an area, they start attacking each other for \"not being Islamic enough\".\n\n\nMarxism follows a set pattern through history, from the [1918 attempted communist takeover of Germany](https://en. wikipedia. org/wiki/German_Revolution_of_1918%E2%80%9319) to the soft versions used in modern times. \n\n\n1) Step 1- Demoralize. Take over academia and media/the arts. Aim to subvert the existing majority culture. This is supposed to take the longest, a generation or two.\n\n\n2) Step 2- Destabilization. Marxist agents attack and prevent the future functioning of key essential services in the society. The society[.] economics, foreign ties/relations, and it[.] ability to defend itself are subverted. **Obama has done all of this in his last term**\n\n\n-----WE ARE HERE NOW-------\n\n\n3) Step 3- Create Crisis. Stage a coup, create economic or political chaos. Martial Law, food shortage, etc. To set the stage for step 4.\n\n\n4) Step 4 - \"Normalization\" A takeover using false illusions and overwhelming political or economic force, combined with physical occupation of territory. At this point, history is rewritten and dissidents are sent to reeducation, along with the useful idiots from stage 1 and 2 who now realize they've gotten a bad deal. \n\n\nRinse and repeat. They always follow variations of this pattern unless stopped."}