{"doc_id": "1941", "name": "2016_08_humanities_student_major_937_europe", "namespace": "we1sv2.0", "metapath": "", "pub": "europe", "title": "2016-08-humanities-student-major_937_europe.txt", "pub_date": "2016-08-14T00:00:00Z", "Sentiment": "-0.011", "Subjectivity": "0.27", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "735", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6gs6u6", "Reddit_id": "d6h1llg", "Subreddit_id": "t5_2qh4j", "Commenter": "Fahund", "length": "4824", "content_scrubbed": "I just did a google search as I knew i had read a checklist somewhere before. Make of it what you will. \nfrom: \nhttp://www. rense. com/general37/char. htm\n\n(Apparantly Rense. com the site linked is an extremelt antisemitic and right_wing conspiracy website, although its not apparent on the linked page with the list. It was originally published in the\n [Free inquiry Magazine](https://en. wikipedia. org/wiki/Free_Inquiry) and Lawrence Britt does not have a Phd and his research has a problems. I will leave this here because at least i Learned to be sceptical of the list and not to link to that website.)\n\n\nDr. Lawrence Britt has examined the fascist regimes of Hitler (Germany), Mussolini (Italy), Franco (Spain), Suharto (Indonesia) and several Latin American regimes. Britt found 14 defining characteristics common to each:\n \n1. Powerful and Continuing Nationalism - Fascist regimes tend to make constant use of patriotic mottos, slogans, symbols, songs, and other paraphernalia. Flags are seen everywhere, as are flag symbols on clothing and in public displays.\n \n2. Disdain for the Recognition of Human Rights - Because of fear of enemies and the need for security, the people in fascist regimes are persuaded that human rights can be ignored in certain cases because of \"need.\" The people tend to look the other way or even approve of torture, summary executions, assassinations, long incarcerations of prisoners, etc.\n \n3. Identification of Enemies/Scapegoats as a Unifying Cause - The people are rallied into a unifying patriotic frenzy over the need to eliminate a perceived common threat or foe: racial , ethnic or religious minorities; liberals; communists; socialists, terrorists, etc.\n \n4. Supremacy of the Military - Even when there are widespread\ndomestic problems, the military is given a disproportionate amount of government funding, and the domestic agenda is neglected. Soldiers and military service are glamorized.\n \n5. Rampant Sexism - The governments of fascist nations tend to be almost exclusively male-dominated. Under fascist regimes, traditional gender roles are made more rigid. Divorce, abortion and homosexuality are suppressed and the state is represented as the ultimate guardian of the family institution.\n \n6. Controlled Mass Media - Sometimes to media is directly controlled by the government, but in other cases, the media is indirectly controlled by government regulation, or sympathetic media spokespeople and executives. Censorship, especially in war time, is very common.\n \n7. Obsession with National Security - Fear is used as a motivational tool by the government over the masses.\n \n8. Religion and Government are Intertwined - Governments in fascist nations tend to use the most common religion in the nation as a tool to manipulate public opinion. Religious rhetoric and terminology is common from government leaders, even when the major tenets of the religion are diametrically opposed to the government[.] policies or actions.\n \n9. Corporate Power is Protected - The industrial and business aristocracy of a fascist nation often are the ones who put the government leaders into power, creating a mutually beneficial business/government relationship and power elite.\n \n10. Labor Power is Suppressed - Because the organizing power of labor is the only real threat to a fascist government, labor unions are either eliminated entirely, or are severely suppressed.\n \n11. Disdain for Intellectuals and the Arts - Fascist nations tend to promote and tolerate open hostility to higher education, and academia. It is not uncommon for professors and other academics to be censored or even arrested. Free expression in the arts and letters is openly attacked.\n \n12. Obsession with Crime and Punishment - Under fascist regimes, the police are given almost limitless power to enforce laws. The people are often willing to overlook police abuses and even forego civil liberties in the name of patriotism. There is often a national police force with virtually unlimited power in fascist nations.\n \n13. Rampant Cronyism and Corruption - Fascist regimes almost always are governed by groups of friends and associates who appoint each other to government positions and use governmental power and authority to protect their friends from accountability. It is not uncommon in fascist regimes for national resources and even treasures to be appropriated or even outright stolen by government leaders.\n \n14. Fraudulent Elections - Sometimes elections in fascist nations are a complete sham. Other times elections are manipulated by smear campaigns against or even assassination of opposition candidates, use of legislation to control voting numbers or political district boundaries, and manipulation of the media. Fascist nations also typically use their judiciaries to manipulate or control elections."}