{"doc_id": "30", "name": "2016_06_humanities_student_major_270_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2016-06-humanities-student-major_270_politics.txt", "pub_date": "2016-06-03T00:00:00Z", "Sentiment": "-0.017", "Subjectivity": "0.38", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "313", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3ujsfh", "Reddit_id": "d3uwo0x", "Subreddit_id": "t5_2cneq", "Commenter": "MosDaf", "length": "1928", "content_scrubbed": "Look, that is a very important comment.  \nAmerican liberals are used to fighting only conservatives. Unlike many European liberals, American liberals are not used to having a threat from the illiberal left. In the late '80s-early '90s, the first political correctness movement became a problem. Liberals at first thought it was a liberal movement, and protected it, despite its craziness. And when conservatives started criticizing it... well, of course, that[.] the best way to get liberals to defend something...   \n\nSlowly, as PC got crazier and crazier, liberals finally started to wake up--but not before *lots* of damage was done. The craziness we see at the Department_of_Education[.] OCR and its lunatic misuse of Title IX seems to have its roots in paleo-PC. Back in the day, one of the things that really turned people against PC was the loony \"Antioch Rules\" from Antioch College, a small liberal_arts school. These rules mandated that (male, of course) students must *always* ask permission at every point during sex--\"may I kiss you?\", \"may I touch your breast?\", etc.  Now... that was recognized as crazy back then, when one small, minor Liberal Arts school mandated it...  But today, 25 years later, *it is the fucking Department of Justice that is mandating basically those same rules for all universities that get public funds.*   \n\nUnless centrist liberals wake up faster and do more this time, we might not only suffer from PC madness now... but we might face an even crazier version 20 years from now.   \n\n[And, to finish the original thought: this will only happen if American liberals fucking wake up and recognize that the crazy left is every bit as anti-liberal--more, in fact--than the crazy right. At least the crazy right generally recognizes the freedom of speech and freedom to assemble, and recognizes the authority of reason. The crazy left is just bat. shit. fucking. crazy. about almost *everything.*"}