{"doc_id": "122", "name": "2016_06_humanities_student_major_1219_latestagecapitalism", "namespace": "we1sv2.0", "metapath": "", "pub": "LateStageCapitalism", "title": "2016-06-humanities-student-major_1219_LateStageCapitalism.txt", "pub_date": "2016-06-17T00:00:00Z", "Sentiment": "0.12", "Subjectivity": "0.253", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "393", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4okll3", "Reddit_id": "d4dsx38", "Subreddit_id": "t5_39qgx", "Commenter": "fatoldncranky1982", "length": "2151", "content_scrubbed": "I was a PolySci major, and I think you know that I have met many a law school aspirant. \n\nI do blame much of this on law schools that have lowered admission standards. Many of the schools need to be closed. Another issue is the Bar Association[.] monopoly on accreditation, this jacks the price up to obscene levels. A law degree should not cost hundreds of thousands of dollars, nor should it be a graduate degree. There is no reason why it cannot return to undergraduate schools. A five-year program would suit the profession just fine.  Federal government loan guarantees are also problematic. There are no price controls and no demand to prove the worth of the degree. These low-tier schools are little more than U of Phoenix with a larger price tag. \n\nThis stuff extends to graduate programs around the country. This country graduates thousands more PhDs than there are jobs for them. Hot Tip: If you've got to pay for grad school, you should not be there. Much of this is due to a terrible job market, but I'm not sure grad school is a good place to hide out these days. MBA[.] are oversaturated as well. These loans will eventually have to be forgiven. There is nothing else for it. \n\nBut, and this is where I might get reamed, some of this is on students. There is no shortage of horror stories you can find via a simple google search. The data on the legal market is out there. Many of the people I went to school with (at a low-rank liberal_arts college) had delusions they were going to hit the legal lottery. You couldn't tell them otherwise, and believe me, I tried. Most of them are going to low-rank schools, some of them have kids. I know personal responsibility isn't a popular term around these parts, but you've got to weigh the odds. I feel bad for those who weren't told beforehand, and I know there are many in that boat. I don't blame them at all. \n\nThe best indication of future success in the legal world is your current socioeconomic status. The legal sector is an elitist world. Is that just? Absolutely not, but it is reality. The same goes for academia as well. If you don't get into a top 15 school, don't waste your time. "}