{"doc_id": "1928", "name": "2016_08_humanities_student_major_798_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2016-08-humanities-student-major_798_college.txt", "pub_date": "2016-08-12T00:00:00Z", "Sentiment": "0.106", "Subjectivity": "0.416", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1083", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4xdibs", "Reddit_id": "d6etqby", "Subreddit_id": "t5_2qh3z", "Commenter": "nix831", "length": "5991", "content_scrubbed": "I think I have to be the mean one. :( Maybe my experience was different.. please keep this in mind.\n\nAlmost everyone I got to know at university who came from a sheltered life (in any single way, be it religion, home-schooled and/or politics) went berserk freshman year typically shortly after the second or third weekend after syllabus week. They lived life too fast and were not aware of the consequences. They got messier than the most twisted partier, and not in the fun way. Most dropped out. Some later joined a local community college to get something out of that period of life once they gained some sense of normality but when I meet them I cant help but notice that they still have a little crazy in their eyes. I'm sure their friends/parents/family would not have recognized them in university when comparing them to the person they knew pre/post-university. Granted, we all change. But in their case, it was two entirely different people. 1 was who they spoke to their parents as over Skype, the other was who you saw out of control at a party.* The others got married and have kids, usually not conceiving after officially dropping out. Most returned to church. I wonder what they think of university. Likely a learning experience finding out who they can feel most comfortably as an individual, but I sure hope they dont judge the rest of us who kept on with it. Those who stayed and had a horrible first year would, after picking themselves up after hitting college hard, have a bone to pick with people. They were never calm. They were never \"cool\" you know? There was one girl who got drunk one night and spent the night with a guy at a frat house. She later was always on edge as I would expect many in her (or his) situation to be. No one wants to be taken advantage of, certainly not in the most personal way. She joined this megachurch in the area and you'd only ever see her occasionally. Initially I thought it was great that she was able to overcome a traumatic experience. However the more I saw her (rarely) I realized she wasn't cool and this became very clear when a street preacher came to our university and started yapping on about how awful all our hedonistic lives were, and she started standing next to him and supporting him. An isolated incident i'm sure, but that may be the extreme to use as a gauge. Don't be that person. She was the extreme, but she had mannerisms that were found in others with similar experiences. Others who had similar experiences like her who did not use religion as a way to deal with things would come out a lot more.... calm? Confident?\n\n\\* I just want to point out that I am in no way judging here. I think people should and can do whatever they want in life. I did. Many do. This is more to contrast the \"college\" image of those people who grew up sheltered vs those they still attempted to portray themselves as, who they used to be. At some point I never knew which was the real version and which was the act.\n\nMost of those who did not go crazy became angry. They do not like people who live differently. They were not accepting. They were suspicious of atheists (seriously, I killed the warmth of a room just mentioning that once), of the LGBT community, of immigrants, of minorities, of anyone with different views in any single way. If they didnt drop out or move universities, this got worse as university passed. They are all so mad at the idea that people take different courses, that people have different opinions, that someone can have a different understanding of values, life, etc. They'd go on and on about how the humanities were bullshit and how universities are eroding America[.] values. It[.] easy to poke fun at SJWs and in some cases it[.] \"fair\" (i dont like this word, but i cant think of what else to use) but many of these people would blow a fuse if you made a simple conversational point against religion, institutionalized faith, the united states, the army, etc. (i'm not saying i was being a dick and went out of my way to do this, but this was just in conversation over dinner or whatever)\n\nThe rest? Well, they're good. They kept it together. It was really cool to see. Be this person, OP. Be humble. Be understanding. You should always have values but realise that in the same way we as humans can change, so can our morals and values. They can evolve too. Despite your professed \"sheltered upbringing\" theres no reason you cannot live life to it[.] fullest in a healthy and holistic way. There was one church group who was super cool here. They seemed to understand 21st century life and blend it with Christian upbringings. I liked them. (There was another that would follow you if you didnt take their flyers and would yell at you if you outright dismissed it) Just be good. Be good to you, be good to others (even if they live lives different to what you deem is acceptable/appropriate), and dont let your upbringing put the rest of your life in stone. That said, don't jeopardize who you are either just to fit in. That will hurt you later more than the uncomfortable instance you'll have in the moment. Just be cool, man. Judging by your post I think you'll be okay. Most of the people I mentioned above never met a gay person until college and were very ignorant of the bad things that happen in our world in real depth.\n\nI finished university with no friends who were religious** or sheltered growing up not because of me but they all simply faded away on their own and I can't help but wonder if it was a clash of lives/judgement on their part, though i'm maybe i'm overthinking that and there were other reasons. Regardless, this makes me sad as university should be a place where you meet different people with different life experiences that can enrich your own. (**Edit: actually, I want to specify no Christian friends. Those of Jewish and Muslim faith were solid throughout my four years.) The interesting thing is that post-university I found more who were and we get along great."}