{"doc_id": "2017", "name": "2016_08_humanities_student_major_1662_astrology", "namespace": "we1sv2.0", "metapath": "", "pub": "astrology", "title": "2016-08-humanities-student-major_1662_astrology.txt", "pub_date": "2016-08-23T00:00:00Z", "Sentiment": "0.105", "Subjectivity": "0.339", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "400", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6thil7", "Reddit_id": "d6tij4t", "Subreddit_id": "t5_2qi4c", "Commenter": "Mesoph", "length": "2351", "content_scrubbed": "The attributes of the planets do not differ much between Vedic and Western astrology. How they interact is usually pretty similar as well. Western astrology doesn't have the idea of friendships (as far as I have seen), so that is a definite difference. \n\nWhat are some of the major attributes you would contribute to Venus? It is true that Saturn and Venus' energies are not the same, but friendship doesn't require sameness. It[.] all in how they work together and how often they work together, which is why I gave common examples of their interactions. \n\nIf you contemplate how Saturn and Jupiter work together you'll find quite a big difference between that and how Venus and Saturn work together. As a culture we believe hard_work (Saturn) leads to success (Jupiter), but this has, historically, not been the case. For most of human history the hardest workers have been the least [.]uccessful'. \n\nSuccess requires opportunity (which is what Jupiter brings). Some of the most successful people in our day and age admit this. If it weren't for moments where things seemed to fall together or the fact that one is born into the_right network many successful people wouldn't be where they are today. This is not the same as sadness and love or attraction and pain holding hands. \n\nContinuing the example, Saturn likes to build walls and Jupiter likes to tear them down. Wherever Saturn is working Jupiter is reduced. Whenever Jupiter is working it[.] tearing down the walls of Saturn. They cannot work together and are therefore enemies. Sometimes hard_work does lead to success, but this is suggestive of Saturn being over-ruled and made subservient to Jupiter. \n\nVenus and Saturn work together often and can blend their energies together to create new things. Venus isn't just the pleasurable and freeing love you feel for you mother (this is one of her higher expressions) but is our attraction to anything and how we experience beauty. Are there not many dark things in this world that are beautiful? Isn't a large portion of our arts surrounding dark nights of the soul? Remember, Venus rules the arts. \n\nLook at a sunset, it invokes both beauty and sadness. It mixes it together in such a lovely way. There are so many other examples, should you contemplate it, that these two energies attract each other and play together as friends and lovers. \n"}