{"doc_id": "144", "name": "2016_06_humanities_student_major_1396_askwomen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskWomen", "title": "2016-06-humanities-student-major_1396_AskWomen.txt", "pub_date": "2016-06-20T00:00:00Z", "Sentiment": "0.055", "Subjectivity": "0.312", "Score": "27", "Upvotes": "27", "Downvotes": "0", "Wordcount": "391", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4h6rev", "Reddit_id": "d4h86u2", "Subreddit_id": "t5_2rxrw", "Commenter": "localgyro", "length": "2123", "content_scrubbed": "Not any one thing -- a slow disintegration.  \n\nI think his experiences over two decades, as a military scientist, led him to believe more and more that there was a \"right way\" to do everything -- that one needed merely to do the research and figure out what that right way was, and then it would be the_right way for everyone.  He applied this to nutrition, exercise, sexuality, taste in movies, etc.  At the same time, my experiences as a grad student in the humanities/social_sciences led me to believe more and more that there were many potential choices to make, and that one must figure out what works for them, negotiate with those around them, and custom design the best possible life.  \n\nThese two attitudes toward life don't co-exist very well in the same home.  He became a paleo and crossfit zealot, and was very frustrated that I didn't jump on the same bandwagons.  He had done the research about what sexual moves should lead most successfully toward female orgasm, and would ask me why I didn't perform as expected, why I wasn't \"a normal girl\".  He was offended if I asked to have music playing during sex, saying that I shouldn't need anything but him to set the mood.  He ridiculed my taste in fiction, told me that my academic work was crap, and when I told him that the constant criticism was not helpful, he just told me that I was too sensitive and needed to get over my hurt.  \n\nIt felt like my choices were either to simply become a doormat that agreed with whatever he said, to turn our home into a constant battleground, or to leave.  Leaving felt like the most mature option, so that[.] what I did.  \n\nI loved him once.  I maybe still do.  I hate that we divorced, but I am *so glad* to be outside his blast radius, away from that constant criticism.  It[.] taken me almost 5 years, but I'm slowly rebuilding my self-image.\n\nETA:  He[.] already remarried, to someone who was a mutual friend of ours.  No, I don't think they were getting it on while we were married.  But I do think that I left him with a FAR better impression of married life than he left me with, if he wanted a wife again so soon."}