{"doc_id": "98", "name": "2016_06_humanities_student_major_1047_sargonofakkad", "namespace": "we1sv2.0", "metapath": "", "pub": "SargonofAkkad", "title": "2016-06-humanities-student-major_1047_SargonofAkkad.txt", "pub_date": "2016-06-15T00:00:00Z", "Sentiment": "0.043", "Subjectivity": "0.435", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "244", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4o3b75", "Reddit_id": "d4a06pk", "Subreddit_id": "t5_38l30", "Commenter": "gkm64", "length": "1467", "content_scrubbed": "Wayne State is not even a no-name community college that nobody cares about. \n\nWhile it[.] no MIT or Stanford, it does active research and its output is noticeable in the scholarly literature. \n\nHowever, dropping the math requirement and the introduction of the diversity course may not be directly related. \n\nI would suspect that they're probably dropping the math requirement for a combination of two reasons:\n\n* Many students enter the university at such an abysmal level that no remedial is possible.\n\n* It costs a lot of money to pay people to teach and grade those courses. It[.] more difficult to get away with exploiting adjuncts for below minimum wage in the sciences than it is in the humanities. People who know how to do calculus and differential equations tend to be able to find well-paid alternative employment a lot easier than those with comparative literature degrees\n\nMeanwhile the diversity course is just activism gone wild.\n\nThere is, of course, an indirect connection -- teaching math properly in schools (especially K12) involves a certain amount of inevitable psychological violence and brutality. You have to put in the effort, you have to be punished for not doing that, and you have to eventually slog it through to get to a good level (as it is the case with all difficult things). \n\nWhich is a reality that clashes head on with the decades-long push towards preserving people[.] fragile feelings and making everyone think they're a winner. "}