{"doc_id": "1885", "name": "2016_08_humanities_student_major_432_economics", "namespace": "we1sv2.0", "metapath": "", "pub": "Economics", "title": "2016-08-humanities-student-major_432_Economics.txt", "pub_date": "2016-08-07T00:00:00Z", "Sentiment": "0.12", "Subjectivity": "0.377", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "760", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d67tz84", "Reddit_id": "d688wl8", "Subreddit_id": "t5_2qh1s", "Commenter": "3030dd0", "length": "4928", "content_scrubbed": " It seems to me the focus in high school is far more on getting kids into university than it is on having them do well there.\n\nWell, yeah. They're handing off the kids to the next level. Whether they succeed after...\n\nAP classes/exams are generally more challenging than typical College \"101\" english lit/comp.  But the caveat here is you really need to score at least a 4, usually a 5 (the top score, last i checked) to get those waived at most colleges.\n\nI actually think community colleges are part of the answer. They're affordable, accessible and act as a bellweather to continue or not.\n\nI went to community college after going to a \"fancy\" prep school. I was a rebellious, fucked up kid, though considered quite intelligent and community college set me back on track (I was going waaaaay down the wrong track!). Ended up going to a good school to finish undergrad.\n\nI think the problem is what most of us know- a cultural expectation for everyone to get a college degree remains deeply entrenched in our psyche.  \n\nOver the past 60 years, everyone increasingly goes to college. For instance, my grandparents- Ivy league undergrad. Their kids/my parents: Ivy league undergrad AND grad school. My generation didn't make the cut as it just got so much more competitive for millenials  and legacy family status stop meaning shit after the 1980[.], really, unless you donate a fair bit of money.  \n\nIt just speaks to the huge surge top-down. And while the top schools fill the ranks with competent and generally ambitious students the schools down from that increasingly accommodate demand by attracting millennials with the means to pay (or borrow) by increasingly comfy accommodations, facilities and campus enrichment programs to woo students and their parents (you should see what we do here for first year students AND parents during summer orientation- it[.] basically wine-and-dine!). All the while, there[.] expected grade inflation (most schools, including a lot of top schools) and cultural pressures, including political correctness culture, which may actually be starting to have an effect on academic standards and expectations as accommodating individuals and groups precedes academic standards and rigor. This even goes so far as to how faculty are hired (which is incredibly significant, given the nature of tenure).\n\nThe culture of accommodating all students at the university trickles into every crack. The overwhelming demand for college degrees has created a situation, I believe, where academics are secondary to having (1) the college experience, and (2) getting a college degree. This applies to the moderately competitive schools and below. I've had several (prescient) undergrads express their dissatisfaction with this. They want to learn, and they feel shortchanged.\n\nIn my assesment, there are two basic categories: universities and colleges. First, the latter: top liberal_arts colleges attract, generally, high-quality students and are well-endowed with resources. Mostly east coast but elsewhere too (e. g. Williams, Amherst, Bowdoin, Carlton, Reeds, Wesleyan, etc). They produce great students. Any private, small liberal_arts school that[.] not in the top 30-40 is probably not worth the money.\n\nThen there are the universities. There are top ~40-50 research universities , which have generally high academic standards, public or private. These get and produce competent students in aggregate. Anything below that needs careful consideration- as standards erode quickly.  \n\nBelow this level, university the education varies by department, but only the most fastidious applicants discern what[.] good- and even then it[.] not guaranteed. By my experience in academia, looking at the level of research and the graduate programs' qualities is huge- for undergrads. The apocryphal perception that research-focused programs sideline undergraduates pains me. Instead, I believe, high-performing research programs generally attract high-quality people, and this pervades the department, and extends to the school/college and even university. A-quality people don't do C-quality work, overall. Some do, but a culture of A-quality people generally benefits everyone.\n\nUniversities that have weak research and graduate programs, generally, represent systemic weakness in the system. For paying undergraduates, we call this a waste of money in my opinion. Here, the administrators are more interested in keeping the status quo, and building a marketable school for high-paying undergrads without regard for their education, just their status as diploma-holders 4 years out. And so they build a new Rec Center and several on-campus sushi bars... Unfortunately, these schools are increasingly accommodating the masses in higher education.\n\nedit: as always, any student anywhere can get a great education. But if we're talking value and a typical student, this is my assessment. Caveat emptor!\n\nSorry for the rant!"}