{"doc_id": "1865", "name": "2016_08_humanities_student_major_270_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2016-08-humanities-student-major_270_RPI.txt", "pub_date": "2016-08-04T00:00:00Z", "Sentiment": "-0.018", "Subjectivity": "0.556", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "360", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d64exik", "Reddit_id": "d64vmwf", "Subreddit_id": "t5_2rg3u", "Commenter": "rpiguy9907", "length": "2087", "content_scrubbed": "If someone chooses to work 20 hour days and it is for their own enrichment/to get the most out of their program and not a requirement then it is no way inhumane. It is gratifying.\n\nThere are quite a few reasons why I think there are slim chances for grad student[.] unionizing at RPI:\n\n*Current administration does not recognize any other power structures and treats them as threats\n\n*Introverts are probably over-represented among Engineers/scientists\n\n*Alpha-nerdery (if you don't know what this is, you will experience soon) Let[.] just say alpha-nerds don't play well with others either\n\n*Engineers/Scientists/MBAs are heading into industries that are largely not unionized, or at least the parts they will be hired into\n\n*Nerds like to focus on their nerdery - forming a union isn't so important or as interesting as that next test you are going to run in the lab\n\n*Similarly, if you are spending 20 hours voluntarily in the lab you don't have time for a union\n\n*Grad students are treated pretty well at RPI - like it or not the impetus for starting a union in the US is often mistreatment\n\nI think you hit the nail on the head with your statement: \n*(in many countries unions are an accepted and valued player in labor relations)*\n\nThe U_S is not one of those countries. Only 11. 3% of the workforce is unionized. Unions are often looked on as corrupt, impeding innovation and competition, and generally only for laborers. That is a broad generalization and certainly not everyone feels that way, but you are attending a university where a large percentage of the  student body probably feels they were smarter than their \"stupid unionized high school teachers.\"\n\nYou may get some traction with STS/Humanities students, I think it will be much more difficult to get others excited about it enough to spend their energy on trying to unionize.\n\n**EDIT** re-read this and realized it comes across as very negative. Not my intent and I wish you luck if it is important to you. I spent 6 years at RPI (graduated in 99 and again in 07) and am sharing my impressions of my fellow students. "}