{"doc_id": "187", "name": "2016_06_humanities_student_major_1775_conspiracy", "namespace": "we1sv2.0", "metapath": "", "pub": "conspiracy", "title": "2016-06-humanities-student-major_1775_conspiracy.txt", "pub_date": "2016-06-24T00:00:00Z", "Sentiment": "0.054", "Subjectivity": "0.351", "Score": "32", "Upvotes": "32", "Downvotes": "0", "Wordcount": "1038", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4pqeh7", "Reddit_id": "d4n9m68", "Subreddit_id": "t5_2qh4r", "Commenter": "TheTruthQuest123", "length": "6161", "content_scrubbed": "Good. This is just the begnining of what needs to happen. Not only do the rich cunts need to lose money, but they need to be prosecuted for all the fraud, and chinese slave explitation, as well as crashing our economy they have done so far.\n\nThen we need to close all the off shore bank accounts, and tax them progressively up to 90% depending on how greedy they are\n\nHere is how you make America great again.. and not with trump, but bernie\n\n\nHow to fix America overnight\n\n\n1.         Tariffs \non all imported third world country shit. %40 or more\n2. Usury laws \nprotect the working class in America from being exploited by the rich.\n3. Repeal Citizens United\nGet money out of politics, and then pass an amendment preventing this from being able to happen ever again.\n4. Tax the rich \nGo back to the tax code of Roosevelt. Progressive taxes on income, no capital gains. Tax on the the top 1% from %40 -%90\n5. Tax Wallstreet transactions\n1% on all transactions, if they bitch about it, raise them to %10. Use the money along with other money we will get from a revised tax code to provide free college education for those with good grades, free vocational school for those with C&D[.]\n6.  Sherman anti trust laws\nPrevent these big pharma and others, from creating monopolies, and jacking the prices of Aids medicine (like that Albanian turd did recently), Polio shots, etc.. however the fuck they want . Regulate the prices.\n7. Get rid of any and all loopholes that allow the rich to make their money in China, and then keep it in the Cayman islands, in order to avoid paying taxes, only to later store it in Swiss bank accounts. This is money laundering and should be punishable by prison or worse.\n8. Secure the borders.\nYes, yes, I know, all the pc crowd will be butthurt about this, and all the Trump tards will praise me, but look reality is reality.\nUntil the day when there is not a single homeless veteran on our streets, or any other homeless guy, the borders should be closed to immigration. And then and only then, open them up, and only let in people who are at least semi educated, non extremist religitards, and should know how to speak English before they get here. Other prerequisites would exist as well. You dont just let in any random goat fucker.\n9. Balance and redirect the budget \nAs in the beginning we have to not only re balance, but redirect the budget. We have to break the hold of these big zionist banksters on wall street (yes, I said zionist you fucking asshole, cause thats what they are) crowd of Pnac (Project for the new american century, which is a plan for global zionist control, by getting rid of Iran,Syria,venezuela, and then Russia and China, Google it assholes) We have to get rid of these zionist military industrial complex and big banks. Redirect the money to the public commons, education, healthcare and infrastructure, and once we turn this country around, IMO, increase the budget of Nasa. There is no reason why we shouldn't have a  base on the Moon by now.\n10. Healthcare for all/Single payer. \n\nHow do we pay for this? Pretty fucking easily actually, you fucking morons. Once you redirect the budget from policing the fucking world, and bombing the shit our of weaker countries around the world, in order to steal their resources for the sake of the big wall street corps. as well as getting rid of any \"regime\" that may even remotely pose a threat the the great state of Israel, our father, they you will have PLENTY of money to cover healthcare for ALL our citizens, esp. coupled with the wall street transaction tax.\n\n\nThere are a few others but those alone would do just fine, until we at least get back on the_right road.\n\nI can tell you, with ALL the confidence in the world, that if we DO NOT do any  of those things, you can expect nothing more that a continuation of this country sliding down the toilet. Shit is about to get a lot worse before it gets better. And you cannot arbitrarily keep raising wages, etc.. when you have illegal immigrants being allowed to come in and devaluating our labor, as well as the big corps. still being allowed to make shit in China. The big comp. will only put more work on the individual worker, and stop hiring new ones. The solution to this is to go back to protectionism, not arbitrarily raising the wage. Once we go back to where we were, the wages will go up automatically.\nWe have turned into a service based economy, which never works. A job at Starbucks is considered good nowadays, when in fact college students shoud be making $35/hr in a non entry level job. This is all the fault, of what the Queen of England[.] and her rich Rothschild bankster zionist jew friends East India Company free market musketeer puppets known as Ronald the fucking Anti Christ Reagan[.] has given us with his Free market economics, trickle down bullshit on your face, economy.\n\nThis, my friends is a fact. Dont do this, and you have no right to bitch about everything thats happening to you now, and will happen to you in the future.\n\nAlso in order to enlarge your brain matter a little I suggest you visit ALL the links below and watch those guys, when you have time!\nAnd Vote BERNIE SANDERS 2016.. vote Hillary and you will still be paying $40K for you liberal_arts degree with slightly lower interest rate. Vote Bernie and get free college and maybe weed too.\n\nIf you wish to find out who funds the firecrotch royal house of Windsor bitch (Hillary) go to www. Opensecrets. org, type in each of the candidates names, look at whos giving them money, then go to Wikipedia and google and see what those assholes ( their donors) have done in the last 50 years..(It aint good)\nAlso watch these guys below\n\nhttps://youtu. be/xWZkHozvDfM\nhttps://youtu. be/0ejyN32QFGs\nhttps://youtu. be/caRZGfQ6J3I\nhttps://youtu. be/ibKK5fPoB5k\nhttps://youtu. be/_PuX74PlN6M\nhttps://www. youtube. com/user/thomhartmann\nhttps://www. youtube. com/channel/UCpU4j-LN_aibXA1gONvWzxw\nhttps://www. youtube. com/channel/UCYWIEbibRcZav6xMLo9qWWw\nhttps://www. youtube. com/channel/UCtBqVgzL_cDv_t9o2hFiXXg\nhttps://www. youtube. com/channel/UCIAwfMwkb-OLrwnDAj4cLbA\nhttps://www. youtube. com/channel/UCZYZh4I9iDGSdjMpuxlzD0g"}