{"doc_id": "1840", "name": "2016_08_humanities_student_major_29_harrypotter", "namespace": "we1sv2.0", "metapath": "", "pub": "harrypotter", "title": "2016-08-humanities-student-major_29_harrypotter.txt", "pub_date": "2016-08-01T00:00:00Z", "Sentiment": "0.131", "Subjectivity": "0.322", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "724", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d5zf2ok", "Reddit_id": "d5zr6hs", "Subreddit_id": "t5_2qiqi", "Commenter": "midnightdragon", "length": "4160", "content_scrubbed": "**What class will you be teaching? At what time would you prefer the class meets? Would this be a regularly repeating class meeting, or a one-time lecture? How many students do you want in your class?**\n\nI will be teaching \"History of the Moving Picture: How Muggles Developed Their Own Magic\", a class dedicated to the history and art of muggle films.\n\nMy class will be an extra-curricular lecture series that NEWT-level Muggle Studies students may take that will be held on Wednesday nights from 7pm-9pm each week for the whole school year. This class is only for students who really want to delve into the arts and entertainment of muggles, and because I only accept NEWT-level the class should be rather small.\n\n**How long will you be a guest instructor for? Are your classes consecutive or will you be doing various courses over the year? Is your course a one-time exclusive?**\n\nI will want to be a guest instructor for the entire school year if I want to properly educate the students in the entire history of muggle cinema. The decision about making this class a regular part of the curriculum will be dependent on how well-received the class is by the end of the school year. \n\n**What is your teaching like? Can you share a lesson plan with us?**\n\nBecause of how small the classes will be, I will be spending half the time lecturing and the other half of the time opening the class for discussion and, if I get proper approval on the use of muggle technology on school grounds, we will also view segments of films for study and critique.\n\nA typical layout for a lesson plan would be as follows:\n\n- Introduction to technology/decade that class will be about (such as cinematograph or the 1920s) (10 min)\n\n- Lecture that grazes over the reading assignment for the class, giving more details and explanations (50-60 minutes), take questions when needed, but hold off until I open up to discussion\n\n- Class Discussion on reading/lecture and film sample watching (60 min)\n\n**What sort of homework assignments do you plan to give our students?**\n\nHomework will mostly consist of reading and writing the occasional short essay on the reading, not more than a foot of parchment. But because this is extra-curricular, homework won't be a big part of the class so instead the readings and essays would be strongly encouraged if they wish to pass their exam at the end of the year and receive credentials for taking the class.\n\n**Are you a teacher who uses practical lessons or written/reading lessons?**\n\nIt will be a good mix of the two, again pending the approval of using muggle technology on school grounds. If that happens, I will be bringing in devices and tools used to make films and will have some class periods where the students can go around and use said devices to better learn and comprehend the art of filmmaking. At the same time, history is also crucial so many of the class periods will be spent discussing the history of filmmaking.\n\n**Describe how you would like to begin your first class, or tell us about a previous teaching experience you are proud of.**\n\nWhile teaching this class over at Beauxbatons (the French wizarding world is particularly linked to muggle cinema since the Lumiere brothers, commonly acknowledged as the first men to create modern cinema, were in actuality wizards who liked to tinker with muggle technology) it was so well-received that instead of it being an extra-curricular class it ended up being a staple for students of all ages. I've since handed off the class to a colleague so that I can try and develop the class here at Hogwarts.\n\nIf given proper approval, I would love to begin my class by sharing a classic film like \"Citizen Kane\" or some Buster Keaton/Charlie Chaplin films to get students excited for the class, expose them to early cinema and impress upon them the fact that this technology is still very new despite it being over 100 years old.\n\nIf given the opportunity to teach this class, I would be thrilled. Though it may not seem altogether too valuable, the necessity of wizards to merge with the muggle world is growing larger every day and this class would help facilitate that merging. \n"}