{"doc_id": "156", "name": "2016_06_humanities_student_major_1479_badeconomics", "namespace": "we1sv2.0", "metapath": "", "pub": "badeconomics", "title": "2016-06-humanities-student-major_1479_badeconomics.txt", "pub_date": "2016-06-21T00:00:00Z", "Sentiment": "0.036", "Subjectivity": "0.376", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "540", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4hyrm6", "Reddit_id": "d4is6pd", "Subreddit_id": "t5_2wbw4", "Commenter": "pickup_sticks", "length": "2945", "content_scrubbed": "None of this is new. When I got out of college in 1990 the economy was in the shitter, we were about to go to war with Iraq and Gen X was being called a bunch of lazy whiners. (Seriously, we were.)\n\nHere are some of the things we *didn't* have:\n\n* If you wanted a job, you had to read want ads in the newspaper and send your resume in the mail with a stamp, knowing that most of them would go straight to the shit can.\n* The ability to look up any data about any location (cost of living, unemployment rate etc) or jobs (average salaries). I really had no idea about average compensation for various fields beside vaguely knowing that finance paid well.\n* If you were thinking of moving somewhere, not much information was available except for talking to friends (a long distance phone call) or writing the local chamber of commerce for information.\n* Networking was much, much harder. There was no meetup. com or industry focused web site that listed upcoming events. Good luck trying to meet with someone in an industry you want to work in. (I remember sending dozens of letters to record companies because I thought about working in the music business. I got two responses, both for unpaid internships.)\n* Relatedly, you couldn't sign up for email newsletters about topics and industries that interested you.\n* We obviously didn't have cell phones, but we still had to pay about the same amount for a home phone, plus an answering machine, and long distance calls were pricey. And if you moved to another city, your phone number changed and there was no easy way to share that information with friends.\n* If you were broke and wanted to sell your TV you had to pay a fee to place a for-sale ad in the newspaper. No free postings on Craigslist.\n\nI'll grant that in some ways the employment market is more competitive now. But for me at least it would've been much easier today. I had a liberal_arts degree and eventually taught myself programming using books. But that only happened after I lied about my computer skills and talked my way into a temp gig. There were no code schools, to say nothing of the terabytes of free online courses.\n\nAnd if you want to start a company, there[.] a shit-ton of free info online about everything from business plans to legal issues to accounting to marketing to hiring to... you name it. I had to buy books and magazines. I used to steal Wall_Street_Journals from offices where I temped because I couldn't afford a subscription.\n\nI'll also grant student loan debt is a much bigger issue now, and I don't know the solution. But I have friends who only paid off their loans 20 years out of college, so it[.] not like it was a cakewalk back then either. I have one friend who has *never* paid his off and still has shit credit nearly 30 years later.\n\nPS Teenagers today will never know the anxiety of calling a girl you like and having her dad answer the phone. \"Hello s-s-sir, m-m-may I please speak to Sally?\""}