{"doc_id": "2001", "name": "2016_08_humanities_student_major_1492_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2016-08-humanities-student-major_1492_AskAcademia.txt", "pub_date": "2016-08-21T00:00:00Z", "Sentiment": "0.168", "Subjectivity": "0.379", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "319", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4ytjgn", "Reddit_id": "d6qe42b", "Subreddit_id": "t5_2sakj", "Commenter": "riggorous", "length": "1682", "content_scrubbed": " I've been thinking about doing a Master[.] in Cultural Studies, Political Science, or History since I can't really get into English and I'm tired of reading about old white people.\n\nThis is kinda funny, because you are guaranteed to be reading about white people, possibly more white people than English, in all of those fields. I mean, history and political science are pretty much the quintessential old white men disciplines.\n\n I'm accruing a lot of debt, but I'm hoping that it'll all pay off.\n\nThis is the kind of thinking that lands people in /r/personalfinance with an OP such as \"I have 200k in student loans for a humanities major; how do I pay it off with my minimum wage job?\".\n\nThe way you make your resume stand out for any major is by tailoring it to what you offer and what you want to do. So far, I'm not really clear on that. \"I don't want to read about old white people\" isn't a skill and isn't a goal. I can tell you that how many majors and minors you accrue and your extracurriculars are of marginal, if any, importance to grad programs. A 3. 5 is okay and the quant GRE isn't going to matter as long as you don't completely bomb it. As person to person, though, if this is true\n\n I don't have family support and I live in public housing and I'm afraid of going homeless one day.\n\ngo work for a bit and pay off some of those loans before going to grad school. Going to grad school because you don't know what else to do with your life is kind of a privilege for the rich kids whose daddy can foot the bill and then some. An MA in the humanities won't make you much more employable or make you understand what you want to do. And please don't take out more loans."}