{"doc_id": "198", "name": "2016_06_humanities_student_major_1957_screenwriting", "namespace": "we1sv2.0", "metapath": "", "pub": "Screenwriting", "title": "2016-06-humanities-student-major_1957_Screenwriting.txt", "pub_date": "2016-06-27T00:00:00Z", "Sentiment": "0.071", "Subjectivity": "0.191", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "759", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4qp4kj", "Reddit_id": "d4qrurf", "Subreddit_id": "t5_2qupf", "Commenter": "stuwillis", "length": "4522", "content_scrubbed": "We subsidise many industries. We are spending $50 billion to build subs in South Australia to generate 2,800 jobs (and, well, Subs -- but part of the deal was keeping the jobs local). Mining is subsidised, too. The car industry was for a very long time - now it[.] gone. Manufacturing was too, and it[.] gone as well. Corporate welfare is still welfare. You don't want your economy to become a banana republic, as you create points of weakness. The very reason we have international trade deals is in order to negotiate how much or how little we can subsidise industries. The arts creates jobs and it creates economic activity. Complaining about arts funding is - in my opinion - just a soft target. Tax breaks are just another form of funding. It[.] about how you incentivise that activity, and how you measure those results against your outcomes.  \n\nFor you, finding a market is a measure of success, right? Well, Last Cab to Darwin did find a market. It did good business for a low budget adult drama. see http://thescreenblog. com/screenintel/reality-check-last-cab-to-darwin-the-numbers/ -- it had merit, feasibility and marketability. It was such a good model for how Australian films can be made to work theatrically that it[.] being replicated at the federal level with the Family Films Fund and at the state level with ScreenNSW[.] new amplifier program looking at adaptations.\n\nSure, there[.] a lot of films we've made that don't work. Things have gotten worse because the film industry is - as a whole - struggling with anything that[.] not microbudget or tentpole. We can't do the latter. But we can do the former taping into the offset especially since it has been lowered. If you cashflow for $250,000 and then use \"reinvestment\" to push your budget to $500,000 then you can access a 40% tax offset that will then let you cashflow that reinvestment. Films are using that model. Storm Vision has turned into a slate of films: Infini, Terminus, SFv1 and the new one they're shooting now. Ticket to Ride also a great business model all operating outside the funding system.\n\nThe tax offset which is guaranteed once you hit the minimum QAPE (you need to work out how to cashflow it tho). There is actually no question of merit or art. It[.] a good system for getting films made, but t doesn't necessarily make better work. I couldn't finish watching and producers are making sustainable businesses out of it. But it doesn't mean the work is better. I couldn't finish Infini. \n\nPart of the problem imnsho is that there is no incentive within the indie industry for paying for script development. They simply don't have the budgets to justify it. Most Australian writer[.] I know don't get much from script options, it[.] all based on principal photography. \n\nSo script development funding helps that - it[.] research and development. It[.] not a lot of money. It[.] highly competitive. Most of the agencies require finance plans as part of them offering funding, unless you're already established (and there[.] a cap to how much you can access without market attachments). It[.] quite rigorous. And daunting if you're outside of the system. They certainly don't just give money to self-absorbed film students. \n\nIf you increase the pot for funding, then you increase the supply of market-ready scripts that producers who use the offset can access... But I tend towards being an Keynesian in my economic theory\n\nBut, as said in my first paragraph, its about how you want to incentive production. There[.] no reason that the \"market\" driven approach of the tax offset cannot coexist with other forms of funding - whether it be production investment, marketing funding, enterprise funding or whatever. They all encourage economic actives in different ways with different metrics of success. We gave enterprise funding to Matchbox, they became a powerhouse and were sold to UCP. And now they've got the bench to do some heavy hitting deals.\n\nFWIW Australian[.] *do* watch Australian content. Our television - reality and scripted - does very well both locally and internationally. (But it had to be supported through local content quotas). Part of that parallels the worldwide increase in appetite for serialised content. Which is why I support the raising of the offset for television production from 20% to 40%\n\nPS: From what I understand, Peter Jackson was well supported by the NZ government to get LOTR going on an infrastructural level. And his work was well supported before that. It was a bet that paid off. Like George Miller."}