{"doc_id": "1979", "name": "2016_08_humanities_student_major_1273_askanamerican", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAnAmerican", "title": "2016-08-humanities-student-major_1273_AskAnAmerican.txt", "pub_date": "2016-08-17T00:00:00Z", "Sentiment": "0.112", "Subjectivity": "0.356", "Score": "75", "Upvotes": "75", "Downvotes": "0", "Wordcount": "988", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4y92ne", "Reddit_id": "d6m8voc", "Subreddit_id": "t5_2uah7", "Commenter": "ablative_heatshield", "length": "5565", "content_scrubbed": "I have a bunch:\n\n1.) College should not be 'free.' There are many funding opportunities available for students who cannot afford school, not just private loans. If you are $250,000 in debt from a private university with a useless major (which you switched 3 times) and unremarkable college experience, that is your own damn fault. There are affordable universities and colleges out there. Stay in state and plan ahead and make damn sure your time in college pays off. American universities aren't the best in the world because they are free. They are the best ultimately because they are rich. I am glad I go to school in the US. My time in university is paying off because I made it that way. \n\n2.) American primary/secondary education isn't shit. I went to a mediocre if not below average high school with bright kids and some kids who didn't give a shit. My teachers were dedicated and we had a broad liberal_arts education that emphasized critical thinking and problem solving. It was not all exam based. Go to a country where your entire college career is determined by one exam, if you don't like the US education. And most US high schools have band/orchestra, theatre, dozens of varsity sports, clubs, philanthropic organizations, technology education, etc. High school is awesome if you take advantage of the opportunities. \n\n3.) I hate seeing the shooting deaths that occur in this country. But gun control alone won't solve anything. I agree there can be more background checks, limits on magazines, whatever. But if no one is going to address mental health, drug laws, and poverty, then these deaths will continue. I don't believe the_rights of law abiding citizens should be infringed due to the actions of idiots. \n\n4.) Healthcare is a big issue on reddit. I definitely believe in a safety net for the poor, and I don't think *anyone* should have to go into large debt due to an illness, but most americans get by, believe it or not. Reddit completely blows this shit out of proportion. It is not a perfect system but the US ultimately is the one with the best hospitals, most research spending, and best care. When someone in some foreign country has some severe or rare condition, they fly to the US for treatment. If you are middle or upper class, the responsibility is put on you, so take responsibility by getting insurance. I am not gonna argue right vs. wrong, but the US spends by far the most on medical research, both privately and publicly. The US is home to many (if not most) of the world[.] drug companies. Whereas other countries place price caps on American drugs, the US government does not. It cannot. Not with lobbying and special interests. Companies will fight tooth and nail to ensure that never happens (and why shouldn't they? they want to make a profit; they are putting in the R&D; they are the ones inventing cures for the whole world). The rest of the world piggybacks off US drug company drugs whereas Americans-- the companys' primary market, get screwed. \n\n4.) Yes, America spends on science. I hear so much BS on reddit on how the US doesn't spend on science; it only cares about its military (which by the way, also spends on science and technology), etc. Ridiculous. The US government (never mind the private sector) spends hundreds of billions on science, research, and development. No one outspends the US. NASA alone, whose budget is about $20 billion, outspends the ESA, Japan, and Russia combined. My school (a state university) spent over $800 million last year on research.\n\n5.) I believe any decent employer should offer vacation, sick leave, and other benefits. Especially if they wish to hire the best talent, these are the incentives to attract that. However, I don't think it is the place of the US government to mandate vacation days and the like. Like seriously, do you really think Apple grew out of a garage because the US government swooped in and said, \"hey woah there, you need to give your employees 10 weeks paid vacation!!\" Get real. Ever wonder why the US has so much wealth? Why all the big businesses are here? Why so many people start their own small businesses, and are able to grow them? Why so many start ups are here? Why foreigners come here to create their wealth? Why successful people from other countries come here to keep their wealth? \n\n6.) Tipping is NOT a big deal in America. Never in my life have I encountered anyone who gave a shit until I heard Europeans on reddit complain about it. Most service workers, hair dressers, etc. are completely content with getting paid in tips. They make more with tips then they could ever make on some \"livable\" wage. Without tips, staff would get fired and prices would go up. Food in the US is cheap. The portions are big. The service is great. I am fine with paying a 20% tip. If you don't like it, then don't pay the tip. Simple. Or, don't eat out. \n\n\n7.) There is a big loser mentality on reddit. Lots of self-loathing americans who think that all their problems in life are caused by the inaction of the US government in saving them; as if they'd be happier in another country... maybe they would, because a lot of folks here, all they wanna do is sit at home and play video games and maybe work 20 hours a week. IDK... I rather just work hard when I am young, know my circumstances, be smart about it, and keep most of what I earn. The US is damn good place to be if you are motivated and have a vision for yourself. The resources are here, make your own damn path and live an adventurous life. \n\n\nSorry for ranting... that[.] all. "}