{"doc_id": "1849", "name": "2016_08_humanities_student_major_90_criticaltheory", "namespace": "we1sv2.0", "metapath": "", "pub": "CriticalTheory", "title": "2016-08-humanities-student-major_90_CriticalTheory.txt", "pub_date": "2016-08-02T00:00:00Z", "Sentiment": "-0.08", "Subjectivity": "0.458", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "856", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vo38w", "Reddit_id": "d60um5h", "Subreddit_id": "t5_2tmcb", "Commenter": "[deleted]", "length": "5291", "content_scrubbed": "My own personal view would differ dramatically; as far as I am concerned, whatever you say you want to study, education is largely there to hide the world, and keep it running, not to reveal it. 'Theory' as one detail of modern ideological life, fails its subject, whatever theoretical value its stipulations have. Look, I've just survived and rediscovered how 'we/ stern life' - shorthand for modern capitalism - actually works. Its a criminal racket, one that unites capitalism, the commercial control of education, and the operation of the state, and their various actors; its class ideologies are hackneyed dogmas for a society whose meaning is the operation and retention of a global class system of vast disparity and incredible crime, everywhere, its grosss ideas are largely religion, in some sense, its information systems are its mind-grease, its populations represent the functioning (or disfunctioning) of a distributed systems whose worst illusions are political. Academia is a guilty idiot. Anyone inspecting principle sectors of commercial media, as slices of its global systems, would have intercepted what now illuminates them - and that will remain untaught in critical theory classes, film studies, media studies degrees: these people have lecturer[.] salaries to pay and a classroom, all too often, of disintersted students part of the 'God[.] gift' reality of modern study, most of whom will end up in commercial ideological control of the arts or worse ('Is spam art' - they meant to ask if art was spam, but lacked the balls). \n\nModern media is obviously biased, less obviously a coherent system of coercive information control and mass manipulation and propaganda; and less obviously still is the fact that independent media is thereby a necessary illusion where history, lives, commercial scandals, state crime, go equally unrecorded for dependent reasons. Modern product manufacturing is obviously wasting everyone[.] time, overpriced, and costly for the planet (\"If I'm impotent that I might as well look impotent\" may as well be the cry of the suited morons behind business capitalism in the city, prostitutes in hand - sorry), and less obviously the alternatives are a necessary cultural illusion that has failed and become part of the product. Capitalism is obviously disempowering, ruinous, locally as it is globally, a destructive criminal, peddler and global crank, parliamentary democracy is obviously a fraud; less obviously the unions are a lie about an alleged working class that is anything at all to the_right people and a mass-middle class to everyone else, and the futility of their version of parliamentary democracy that incorporates the crime in the name of classes they actually produce as the global poor, locally or globally, and with criminal capitalism at any scale that they are seen to protect. Like hippy, like internet, like critical theory, like Indymedia, like fashion colours, votes and degrees and the modern cult. \n\nThe impression is a shell-game, on a massive scale; the hypothetical question is 'where is it then'? In the Hitch-Hiker[.] Guide to the Galaxy series, a giant computer called Deep Thought is built to answer the satirical question of 'life, the universe and everything' (to which the equally absurd answer is '42'); the philosopher[.] union object, since a computer capable of doing away with their pursuit of knowledge by simply answering the question will put their trade out of work: in consolation it is pointed out that the task will take millions of years, during which time they will be able to profit, and afterward by debating the answer (the production of the answer of course begs the question, at which point another computer, called the earth, is built to provide it). Shell game. \n\nAfter forty years of finding myself a target of capitalism in all its forms, of finding my mother and myself were surrounded in society, targeted and stalked, spied on, sabotaged, and my life deliberately swept away by a criminal racket that in turn describes how capitalism actually runs, of surviving a decade-and-a-half of criminal commerce, its attendant criminal state, ossified ideologies, and zombie public, it is obvious. From the bent 'Labour' state and its colourful illusions, to the street crims and rapists, from knife crime to bent police, Irish cultists, Jewish media moguls, directors, or their bent detractors, from invented fascism to the riots, it is obvious. I commented elsewhere on the privatisation of prisons and the consequences of a system where it is profitable to incarcerate, leading to the obvious: but this is the general condition, from state sectors and the NHS to company executives, quango and waged politicians, or the consumer, all profit dependents of a system, even if merely perceived as the wage, and regardless of whether they believe it is enough or not. And again, experience and the truth prove it. Shell game. \n\nLaing once suggested that before a nuclear war can come about it is necessary to lay waste to our own sanity - and then detailed how this process comes about in modern British life, while advocating that the dreadful had already happened. My own terrible experiences illuminate their condition: if you want to learn walk away, suffer and if you're lucky you will find. "}