{"doc_id": "33", "name": "2016_06_humanities_student_major_303_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2016-06-humanities-student-major_303_college.txt", "pub_date": "2016-06-03T00:00:00Z", "Sentiment": "0.164", "Subjectivity": "0.417", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "565", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4mh0wz", "Reddit_id": "d3vi2kd", "Subreddit_id": "t5_2qh3z", "Commenter": "cr42", "length": "3332", "content_scrubbed": "Physics student here. Graduating this year, and going on to graduate school in physics. \n\n even though my college is supposedly 'prestigious' (whatever that may mean) my peers are not motivated and very few are even planning to pursue physics later\n\nAre you at a liberal_arts college? I suppose culture varies department to department, but it strikes me as odd that \"very few\" of your peers are even planning to pursue physics later on. \n\n what are the things that motivate you/help you get through the more menial parts of it?\n\nI knew – or at least had a *very good* idea of – the problems that I wanted to study before I even started as a physics major. Things like dark matter have always bothered me, and I went into physics knowing that people were actively studying this and that it looked very different from the classes that I was taking. \n\nSo, when I took intro E&M or upper-division thermodynamics and found them to be absolute drudgery at points, I knew that this wasn't a fair representation of physics or physics research. You need to know these topics for the Physics GRE, sure, but beyond that and graduate school qualifying exams, you're free to pursue your interests independent of any restrictions imposed by courses. \n\nIf you know what research/problems interest you and can do something to learn about/study/research/etc. them during your time in school, it will make taking the necessary courses more tolerable. Hopefully you like most of your classes (for example, I absolutely *loved* upper-level quantum), but you shouldn't feel bad if you don't like them all; it doesn't mean you're a failure or \"not cut out to be a physicist.\"\n\n Also what are your fields of interest that you wish to pursue which may not be 100% related to physics?\n\nI'm interested – in both academic and non-academic senses – in a lot of areas outside of physics. For example, I have studied a bit of philosophy and political theory, and I'm definitely interested in learning more about machine learning and other computing-related topics during graduate school, and I enjoy mathematics quite a lot (algebra, topology, analysis, etc. are all very interesting subjects that I like reading about). The last two are, admittedly, merely tangential to physics, as opposed to being completely unrelated, but this is not nearly an exhaustive list. One of the cool things about being in academia is that you're always learning, so I learn all sorts of fun things about far flung fields in talking with friends. \n\n And what are the things you enjoy apart from physics; extracurriculars and all?\n\nAs far as extracurricular things, I will play pretty much any sport that I can. Generally, that means soccer, football, and volleyball, but I also like playing basketball, and I would play baseball/softball a lot more if it was more conducive to pickup games. \n\nI also do a lot of science outreach with (middle school, high school, etc.) students, which is really rewarding.\n\n**TL;DR I'm a physics student about to start graduate school, and the whole reason I made it through undergrad was that I knew exactly what I wanted to study/research. Also, I do stuff besides physics (sports, talk to kids about science, and also learn about other fields). We exist, I promise, and you'll meet a lot more people like that if you go to graduate school!**"}