{"doc_id": "1929", "name": "2016_08_humanities_student_major_806_evangelion", "namespace": "we1sv2.0", "metapath": "", "pub": "evangelion", "title": "2016-08-humanities-student-major_806_evangelion.txt", "pub_date": "2016-08-12T00:00:00Z", "Sentiment": "0.052", "Subjectivity": "0.26", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "653", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6eymf1", "Reddit_id": "d6ez6jc", "Subreddit_id": "t5_2r6ex", "Commenter": "gwern", "length": "4617", "content_scrubbed": "Yeah, that[.] wrong. They don't even give a source. I've submitted an update (Contribution #160812-193908-037000). Here are the sources I dug out of my [archives](http://www. gwern. net/otaku):\n\n---\n\n \"My own impression of Anno-san is a feeling like he[.] not human. He[.] big, hunches over, and seems to resemble an Evangelion.\"\n\n--Kunihiko Ikuhara; translation by [Numbers-kun](http://forum. evageeks. org/post/548445/Ikuhara-on-Kaworu/#548445). Excerpt from the interview \"'そのままの君ていいよ'という魔力\"/\"The magic of 'you're fine just the way you are'\" in October 2008 book on Kaworu Nagisa, [_ALL ABOUT 渚カヲル A CHILD OF THE EVANGELION_](http://www. tokyo3cn. com/bbs/thread-15512-1-1. html) ([other photos](http://batman691. blog. me/50040137156)).\n\n Asahi Newspaper publishes a weekly magazine \"AERA.\" AERA 08/31/1998 issue dealt with an interview with Hideaki Anno.\n\n As you know, he is 180 cm tall. He is a kind of giant for normal Japanese.\n\n-- http://web. archive. org/web/20071207235755/www. geocities. com/Tokyo/4081/file425. html#3\n\n Yamaga presented as a fairly respectable, athletic young man with an inner passion for creative and financial success in the film world, when he arrived at college in 1980 - just like Kubo, the freshman protagonist of _Otaku no Video_, which Yamaga wrote under a pseudonym. The college he attended was no Todai or Gakushuin, but the arts university of Japan[.] heavy industrial center, Osaka. Walking through the quad one day early on in his student career, he found himself suddenly in the midst of a live-action battle between wild costumed students, one side dressed as ninja, the other in SWAT gear. \"When that becomes a daily occurrence, what am I supposed to say?\" Yamaga exclaimed to American fans in 1997 upon a visit to Silicon Valley[.] massive annual anime gathering, Fanime Con. Then, a tall, gangling, and mysterious upperclassman introduced himself not with the customary hello but by confiding that he knew practically every line in _Space Battleship Yamato_ (_Star Blazers_) by heart. \"I think I forgot what was normal at that point\", recalled Yamaga.\n\n-- _Japan Edge: The Insider[.] Guide to Japanese Pop Subculture_, 1999 ISBN 156931-345-8; contributors: Carl Gustav Horn, Mason Jones, Patrick Macias, Yui Oniki, Matt Thor; ['Anime: Overview; \"As You Are, As You Were, As I Want You To Be\"; Future Trend/Collection/Bio'](https://www. dropbox. com/s/dwxkg8mwexnqlkz/1999-japanedge-childrenmiyazakicocacola. pdf), by Carl Gustav Horn\n\n Arriving at Studio Khara, the animation studio Anno founded in 2006 after leaving Gainax, I was escorted into a meeting room whose walls were lined with models of battleships and other war machinery - a long-time Anno obsession. When the man himself strode into the room - looking taller and more robust than his rather weedy-looking photographs - and I asked him about the models, he told me, as though he'd heard the question too many times to count, that a friend had built them.\n\n--[\"Hideaki Anno: emotional deconstructionist\"](http://www. japantimes. co. jp/culture/2014/10/18/films/hideaki-anno-emotional-deconstructionist/), Mark Schilling 18 October 2014\n\n `Sadamoto`: Yeah, he ended up doing the storyboards and the direction, and [saw] he didn't have enough people. Yamaga-san began searching for talented people in Tokyo, and when he asked Akai-san about it, [Akai] told him to use [an old] schoolmate of his in the manga studies program at the Tokyo University of Art and Design. So Mahiro Maeda, seeming not to want to go by himself, invited me to go with him. I had an interest in animation, so I assisted [on _Macross_] for about a year. During that period, I would from time to time catch sight of Anno-san. [I noticed,] \"there is this tall fellow who sometimes walks around in his bare feet\" (laughing).\n\n--\"Yoshiyuki Sadamoto[.] First Meeting With Director Anno\" (Schizo); Numbers-kun[.] translation: http://1731298478. tumblr. com/post/52689158259/sadamoto-i-first-met-him-when-i-worked\n\n `Student`: Do you like milk?\n\n `Anno`: I like milk? I used to get milk from all my friends that didn't like milk and drank it. I grew so tall because of milk.\n\n--_Hideaki Anno Talks to Kids_ (http://eva. onegeek. org/pipermail/evangelion/2010-April/006154. html)\n\nThe actor playing Hideaki Anno in _Blue Blazes_,  Ken Yasuda, is himself 174cm. (http://asianwiki. com/Ken_Yasuda)\n\nOne can also see in group photos that Anno is above average, not way way below average like 5 foot 1. (He is, for example, much taller than Hayao Miyazaki, who is 5 feet 5 inches: https://67. media. tumblr. com/a79075b5b57e534f712a00383c4ec534/tumblr_mlc1xrOCb31qb0mqao1_500. jpg )"}