{"doc_id": "148", "name": "2016_06_humanities_student_major_1425_todayilearned", "namespace": "we1sv2.0", "metapath": "", "pub": "todayilearned", "title": "2016-06-humanities-student-major_1425_todayilearned.txt", "pub_date": "2016-06-21T00:00:00Z", "Sentiment": "0.092", "Subjectivity": "0.433", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "298", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4hv7th", "Reddit_id": "d4hw06z", "Subreddit_id": "t5_2qqjc", "Commenter": "eliottruelove", "length": "1647", "content_scrubbed": "I graduated High School and went to work right away, not in the field i could have went to college or university for (Graphic Arts, I was top of my tech school class). \n\nI then quickly realized that the wages earned in food service or retail weren't enough to get by unless you worked overtime and weekends, and the construction trades, even on the slightly higher side, were only just enough to get by.\n\n And it wasnt a matter of just working more, I literally dont have the physical stamina or health to do that. \n\nSo I struggled, but made do.\n\n And then my contemporaries who went to college thinking I threw my talent down the drain graduated, and ended up becoming fry cooks, waiters, and employees for Walmarts, Targets, and working at the mall. \n\nSo I personally know how much of a struggle it is, and I DON'T have student debt because I bucked the trend of everyone going to college and getting a good job and living happily ever after because I guessed, and guessed right, that if everyone goes into the arts field there will be no jobs by the time I graduate. \n\nSo everything is relative. \n\nMeagerly Earning is not in comparison to other generations or anything, it is real according to the here and now, the reality. Yes it[.] more than many years ago, but when the cost of living tripled and the wages only doubled (not exact figures, just hyperbole), that[.] gonna be difficult. \n\nThis could be because I have moderate health issues that make me struggle, and because they don't maybe they could work more., when I cant. \n\nBut again, I had a 4-5 year head start because of not going to college, and no significant debt, so I don't know."}