{"doc_id": "5", "name": "2016_06_humanities_student_major_61_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2016-06-humanities-student-major_61_changemyview.txt", "pub_date": "2016-06-01T00:00:00Z", "Sentiment": "0.018", "Subjectivity": "0.298", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "567", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4m1exb", "Reddit_id": "d3rroeq", "Subreddit_id": "t5_2w2s8", "Commenter": "sp0ck06", "length": "3551", "content_scrubbed": "Many of those newer humanities, especially those that ironically emphasize \"Critical Theory,\" are actually teaching students to avoid critical thinking and clear communication. Instead, they teach fealty to an ideology in which everything in the world must be viewed through their \"lens\" of race or gender or whatever, no matter how irrelevant. They worship deliberate obscurantism in the writing of people who use a lot of fancy words to hide the fact that they have nothing reasonable to say. They teach students to value themselves and each other on the basis of how many underprivileged demographic checkboxes they can check, not their character or their accomplishments. They teach students to fight ideas they don't like by shouting down the people who present them instead of offering cogent counter-arguments. They have brought nothing of value to society, and they're injecting plagues like \"microaggressions,\" \"safe spaces,\" and \"de-platforming\" into the lexicon.\n\nThis is just a rant with no real argument or viewpoint, and seems to regurgitate the same old talking points of the anti-humanities crowd.  I might as well argue that astronomy is stupid and useless because it doesn't really do anything to improve my day to day life and it wastes money.  I don't have anything of substance to say beyond that, but eh, that[.] how it seems to me!\n\nWhat is this argument?  That *every* humanities class that isn't history \"brings nothing of value to society?\"  \n\nAcademia would be vastly better off if these pseudointellectuals were all fired and their funding redirected to S. T. E. M., history, or the productive arts.\n\nThe \"productive arts\"?  What are those?  Video games, I'm guessing?\n\nHistory, at least, has something in common with science: you're trying to ascertain objective facts about the world, and holding each other to certain standards of evidence.\n\nThe presupposition here is that anything that is \"like science\" is inherently more valuable that anything that is not like science?  Not really a valid position.  And history is not just about ascertaining objective facts about the past, its about *understanding* the past comprehensively, which often means offering different interpretations of events and people and their motivations.\n\nThey don't even know what critical thinking is.\n\nI don't think this poster understand what critical thinking is.  Critical thinking is not simply stating objective facts and leaving it at that. \n\n these people never actually get to have their ideas criticised\n\nWho are \"these people\"?  Every non-STEM academic?  \n\nwhereas in some majors like gender studies, the opposing narrative is classified as \"hate speech\" and banned.\n\nWhat are you talking about?  Banned?  Do you have a specific example?\n\nNo offense OP, but this entire post just reeks of an anti-PC reactionary STEM-lord rant.  There are zero actual arguments presented.  What view are we supposed to be trying to change here?  This is an incoherent mess that ironically is a perfect example of feels over reals.  The original poster took one class based on Carl Sagans book and thus feels qualified to condemn dozens of academic fields without once referring to specific example of any of his statements?\n\nThey worship deliberate obscurantism in the writing of people who use a lot of fancy words to hide the fact that they have nothing reasonable to say.\n\nWho is \"they\"?  What writing?  What constitutes something \"reasonable to say\"?  Somehow I doubt that you or the OP has ever actually read anything in any of the fields hinted at."}