{"doc_id": "162", "name": "2016_06_humanities_student_major_1524_femalefashionadvice", "namespace": "we1sv2.0", "metapath": "", "pub": "femalefashionadvice", "title": "2016-06-humanities-student-major_1524_femalefashionadvice.txt", "pub_date": "2016-06-22T00:00:00Z", "Sentiment": "0.113", "Subjectivity": "0.331", "Score": "30", "Upvotes": "30", "Downvotes": "0", "Wordcount": "248", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4pbet6", "Reddit_id": "d4jj70b", "Subreddit_id": "t5_2s8o5", "Commenter": "luckyduckling", "length": "1572", "content_scrubbed": "first WAYWT for me in recent memory. i'm a 28-year-old PhD student in the humanities living in the PNW. my clothing budget is tight (we'll talk about my tattoo budget later...). comfort is most important to me, but i try to marry comfort and style most of the time. i'm 5'2. 5\" (the . 5 is super important!) and kind of petite all over. my goals are to put on real clothes every day, be comfortable, and use what i've got in my closet so i can see where the holes are in terms of need/want. \n\n1. i'm cheating and using a fit from [last week](http://i. imgur. com/x5jzllr. jpg) when i was in California. here[.] [another](http://i. imgur. com/1fPnUiQ. jpg) of me being awkward. cardigan, t-shirt, and jeans are Madewell, belt is J. Crew, shoes are Nike. (i know my pant legs are uneven in these pictures and it[.] driving me a little bananas.)\n\n2. fit from [Monday](http://i. imgur. com/tBfk46Q. jpg). sorry for the grainy pictures; i'm still trying to figure this whole photo thing out. [another view](http://i. imgur. com/zf4Z1gW. jpg). flannel and t-shirt are Madewell, belt is J. Crew, jeans are Rag & Bone, sandals are Chacos. you can't see the necklace but it[.] [this](http://i. imgur. com/vwcCiHh. jpg) by Elaine Ho. \n\n3. today[.] fit: [first view](http://i. imgur. com/LsjE2kn. jpg) (+ cat), [second view](http://i. imgur. com/nQRtglp. jpg). plaid and t-shirt are Madewell, jeans are Levi 501s, shoes are Betula. i can't tell if the cuff on the jeans is too big and i should get them hemmed. for now they feel ok.\n\nhopefully the first of many WAYWT posts! constructive criticism welcome."}