{"doc_id": "209", "name": "2016_06_humanities_student_major_2069_indiancountry", "namespace": "we1sv2.0", "metapath": "", "pub": "IndianCountry", "title": "2016-06-humanities-student-major_2069_IndianCountry.txt", "pub_date": "2016-06-29T00:00:00Z", "Sentiment": "0.168", "Subjectivity": "0.481", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "987", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4qfw6u", "Reddit_id": "d4slft4", "Subreddit_id": "t5_34kjy", "Commenter": "Reedstilt", "length": "5768", "content_scrubbed": "#The Eastern Path\n\nThe Eastern Path will be most familiar to students of Ilvermorny, as it is the indigenous tradition to which our school owes the greatest debt. As it is currently practiced, the Eastern Path emphasizes the studies of herbology, potions, curse-breaking, and divination. In ancient times, the Old Wakondagi also mastered the arts of geomancy and Patronic Charms that have long since been lost. For all their wisdom, the Old Wakondagi fell to their own folly in the 5th Century, leading to a nearly complete loss of magic from a huge swath of North_America in an event known as the Binding of the Council.\n\nBy the 5th Century, the influence of the Old Wakondagi spread from the shores of the Atlantic to the slopes of the Rockies. Everywhere they pursued new ways to unravel the Mysteries of magic, and in particular hoped to claim powers that had thus far been the purview only of other Beings. The miagthushka, elf-like Beings that form their own societies throughout North_America, became increasingly concerned at the power the magicians' accumulated.  According to the miagthushka accounts from the Payiihsa Nation, Keesaakosita Mamahkiihsia - their leader at the time - devised a plan. \n\nWhen the Great Council of Wakondagi convened, he walked among them, secretly offering to teach each all he knew of magic on the condition that they would never speak a word of what they learned to anyone. So tempted, the Old Wakondagi all agreed and all failed to see the trap Mamahkiihsia had laid for them. From that day, no magician of the old Eastern Path could teach magic. As the old masters died, their arts and their knowledge died with them. Of course, many magicians doubt that Mamahkiihsia could be so clever or so powerful, or the Old Wakondagi so foolish, for such a scheme to have been successful and blame some yet unknown cause for the temporary loss of magic in the region. Perhaps they are right. The effects of the Binding appear to have been more far-reaching and long-lasting the Payiihsa account would suggest.\n\nFollowing the Binding, only the use of magical plants persisted with any level of continuity, as such skills can be taught without ever speaking a word if the student is dutifully observant. Those with a proficiency for divination arose from time to time, though that it has always been a skill that is more cultivated than taught. Armed with only these talents, the New Wakondagi gathered on the banks of the Mississippi and in 1054 finally broke the curse that had long withheld the ability to teach magic. This first new generation of magicians established the Eastern Path in the city of Nondse Wacpe, and from here the New Wakondagi set about hoping to restore the grandeur of their predecessors. Because of their influence, an archaic Dhegiha dialect is the most commonly employed lingua magi in the Eastern Woodlands, though it is not as dominant as Inuit or Nahuatl is in the North and Southern Path. \n\nThe 1130s saw the rise and redemption of the Iroquoian Dark Wizard Tadodaho. When Tadodaho abandoned his wicked ways in 1142 and helped establish the Haudenosaunee - the Iroquois Confederacy - he also initiated a schism within the Eastern Path. The New Wakondagi initially taught only those who could demonstrate ancestry with the Old Wakondagi and, consequently favored those of high birth. While Tadodaho himself had benefited from this elitism, he became convinced that if magic remained only in the hands of the powerful, there would be too few to stop him, or another like him, should he once again fall to the Dark Arts. He proposed to the Grand Council that anyone who displayed a talent for magic should be permitted to learn, provided they can find a mentor willing to instruct them. The majority of wakondagi disagreed, fearing that magic in the hands of many was more dangerous than in the hands of a few, but they had no authority of stop the Iroquoian delegation from pursuing such a course if they chose to do so. While the elitist faction of wakondagi continued to look down the more egalitarian faction established by Tadodaho as reckless, as the centuries rolled on, they found themselves increasingly outnumbered. By the early 17th Century, the egalitarian wakondagi were the overwhelming majority. \n\nMuch has been made about the absence of wands from magic in the Eastern Path. While it is true that wands were introduced to the area from Europe, practitioners of the Eastern Path have long had their own magical tools which are typically more subtle than those wielded elsewhere and are often incompatible with the use of wands. The most commonly used is the magic bundle. The bundle is a satchel made from the specially prepared animal skin. Otter or ermine is prefered while snakeskin is shunned. Like wands, the bundle receives its initial magical spark from some part of a magical creature, such as a the jeweled scale of horned serpent, the claws of a water panther, or a strand of hair from a flying head. Unlike wands, which can be purchased, a bundle must be crafted by its owner or inherited from a mentor or relative. Without an heir, the bundles become dangerously unstable and must be destroyed. To avoid this problem, most are now enchanted to seek out an appropriate heir upon the death of their owner. Over time, magician fills his bundles with tokens of his power, and each further augments his power, allowing the magician to perform feats that few others could perform - wand or no wand. Today the art of bundle-making is practiced only by the most traditional magicians of the Eastern Path as most have come to prefer the immediate benefits of a wand over the long_term investment of a bundle. As yet, no one has devised a technique that would make the two tools compatible."}