{"doc_id": "1998", "name": "2016_08_humanities_student_major_1456_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2016-08-humanities-student-major_1456_college.txt", "pub_date": "2016-08-20T00:00:00Z", "Sentiment": "0.16", "Subjectivity": "0.369", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "365", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6pm2rj", "Reddit_id": "d6po3ur", "Subreddit_id": "t5_2qh3z", "Commenter": "SnowblindAlbino", "length": "2112", "content_scrubbed": " We may need educated people but we also need workers who are making money. Which is why I don't believe using money you don't have to pay for school you don't need is the_right thing for many students.\n\nThat[.] not a problem with the educational system as much as with the economy. Back in the 1950s-- the high point for \"family wage\" jobs that could lift people into the middle class --we had a strong manufacturing base and strong unions. Both are gone. Today we have a service economy and very close to *no* family wage jobs; it[.] pretty much impossible to be in the middle class today without two full-time wage earners in the household. \n\nFix the economy and to some extent the educational system will be sorted in the process. It[.] also important to recognize that while it *seems* like everyone goes to college today, only about a third of American adults hold four-year college degrees, and <12% hold graduate degrees. \n\nSo it[.] clearly a false assumption to claim that \"most jobs require college degrees\" since the large majority of employed Americans don't hold degrees. The challenge, really, is that most *good* jobs require at least a college degree today-- that is what has changed --so that a college graduate will on average earn $1M more over their lifetime than a non-college-graduate. Again, though, that[.] not a problem with education, it[.] a problem with our economy; we need more living wage jobs for the majority of workers who don't hold college degrees. \n\nBut in practice raising wages would mean the end of WalMart[.] \"low low prices\" that allow 1/3 of our population to pretend they are middle class and the 1/10th of the population that holds stock in corporatations that benefit from low labor costs would have to give up their dividends. So until the US decides to look more like northern Europe, we probably won't fix the economy. Thus the only logical solution for individuals is to differentiate themselves in the marketplace by becoming one of the 1/3 of workers who holds a college degree, even if s/he doesn't need it to complete the tasks necessary to succeed in their job."}