{"doc_id": "1989", "name": "2016_08_humanities_student_major_1362_oculus", "namespace": "we1sv2.0", "metapath": "", "pub": "oculus", "title": "2016-08-humanities-student-major_1362_oculus.txt", "pub_date": "2016-08-19T00:00:00Z", "Sentiment": "0.097", "Subjectivity": "0.418", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1686", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4yhooz", "Reddit_id": "d6nt238", "Subreddit_id": "t5_2uni5", "Commenter": "bekris", "length": "9527", "content_scrubbed": "*GOOGLE TRANSLATE*\n\n\n**VGNetwork. it: At the booth of Cologne we tried Unspoken, developed by Insomniac and offers the player multiplayer adventure in amagical world, where we will have to do with the arts of magic and face duels with strokes of wand. The game has a strong multiplayer component, but there will be also the possibility to face an offline campaign?**\n\n\n\nJason Rubin: Unspoken will be playable exclusively online, even if some of the games available for Oculus support local multiplayer. At the moment it is not possible to give players the chance of a multiplayer on one PC, even if you can connect two computers on the LAN and can play together, but always with a computer for display.\n\n\n**VGNetwork. it: Do you think that in the future it will be possible to provide players the opportunity to play multiplayer games on the same computer with multiple devices?**\n\n\nJason Rubin: It 'a problem that we have not put ourselves at the time. The point is that Oculus Rift manages to be comfortable when using it because it transmits at 60 frames per second and it succeeds because it requires a very powerful computer to do it. Allow the use of multiple viewers on a single PC would lead to a reduction in the quality that makes each game unplayable. For this reason we have always been so clear how stringent than the specifications of the system and we do not want to remove the restrictions if the latter can bring a drastic reduction in quality. Obviously in the future things could change, not only in terms of household PC computing power but also as regards the possibility that in a house there may be more than one Oculus. At present it is inconvenient but then again, in the future we could have that.\n\n**VGNetwork. it: One of the largest community in the PC world is that of modding. How does Oculus against the current scene, you are in favor or against?**\n\nJason Rubin: Oculus has absolutely no objection against the modding, it is clearly a matter mostly for developers who still do not believe it is a problem, far from it. What worries us as producers is the possibility that a hack you wear your players out Oculus ecosystem, outside the Store. Like, if someone wants to create a mod to turn a hypothetical game in something related to a saga like Star Wars, for us that[.] fine. At a time when this game was released on another platform, then we would be faced with a problem, but if it were not so we would speak more modding but to intellectual property theft.\n\n**VGNetwork. it: And 'understandable, moreover, the same thing is happening to HCT and his Lives.**\n\nJason Rubin: Exactly. If you create a mod for play Vive no problem. But if you post in another store, even distributing free modding exceed the limit and transform them all in business. Although it is not for profit, there is still a commercial use, this distinction is, as long as things are done according to the rules, no limits for those who want to create the mod.\n\n**VGNetwork. it: The decision to make us play games you do not need such a large movement range as some competing technologies (Lives) was desired? We are worried about not having space in the house to take advantage of comprehensively VR.**\n\nLet[.] say that the hardware possibilities are all there, but at the moment we are focusing on this type of security, fully playable in small spaces, even in front of their PC (something like a rectangle approximately 2. 5x1. 5 for our demo). We often think of the problems that the requirement of a large space can arise for users who live in big cities like los_angeles, Milan or Paris, where housing prices have not really indifferent and it is very difficult to take advantage of a gaming space virtual reality. \n\n**VGNetwork. it: What problems implies in terms of developing a migration from a VR game technology \"normal\"? There are substantial differences in the work on the two versions?**\n\nJason Rubin: More than difficult and complex steps, is a speech about the kind of game in which you work. Of course, there are games that work well without Vr, for example Project Cars. It 'a great driving game that works as a \"traditional\" format, but because of its realization was born to turn VR: Who has not dreamed of looking around the cockpit and on the track, but still speak of a transition in very simple virtual reality. There are games that brought in a basic version would fail to replicate the same feeling you get with the viewer, for example, the control system or the camera movement through your head and this applies to many other sports titles. One of the games in development but we have not shown is based on basketball: imagine you pass the ball, move in the field, making a dunk in the basket, it is a kind of experience that changes dramatically depending on how it is played. Basically the difference is development cycles, for instance a chapter of Madden is developed by following a certain procedure, but if we want to bring the experience of American football on VR, then you should not only deal with new problems, but a new approach to the game in accordance with the development of technology. So yes, there are experiences that can work even without VR, but there is no doubt that this technology can lead to new gaming horizons never before possible.\n\n**VGNetwork. it: Another type of very popular games from PC gamers are the type FPS arena, whose main feature is an extremely fast gameplay. This kind can also work on VR without giving problems?**\n\nJason Rubin: Well, we are sure enough, we can not forget that the VR, despite its potential in the future, is a technology that imposes restrictions on some development methods, as well as the very evolution of the video game. I'll give you a practical example: I am thirty years working in the industry and twenty years ago I created Crash Bandicoot, in an age where the 3D was the leading technology for the entire industry. Being something new, though, there were things that 3D ran well, but also others that do not work: all this has still led to a radical change of platformer in years to come, a new vision which included you Crash Bandicoot but also Super Mario 64 Shigeru miyamoto, are very different games from what we used to consider platform until recently, as the old Mario or Sonic games. Over the years we still managed to pull off more and better things to this day with Uncharted that, on balance, is a Crash Bandicoot with a summary of the progress made ​​so far. With virtual reality things are similar: talking about the FPS, it took twenty years to go from Doom to Call of Duty, yet the basic concept has always been to immerse the player with limbs sticking out from the screen, to put it very rough. Obviously things have changed a lot, but in the case of virtual reality this approach is not enough: we want to find new approaches to the genre. At the end of the month will come Damage Core, a game we've been working me and my team with the children of High Voltage Studios in Chicago, and that will be the first FPS thought for Oculus and virtual reality. There will come a day when rigiocandolo, just like Doom, we laugh over for its backwardness, perhaps not in twenty years, but in ten or even five, but today is one of the best FPS for virtual reality on the market. Staying in the argument FPS, you have got to try Bullet Train, a tech demo that Epic has created for Oculus. At year end, we will release a complete game ever created by Epic that is already technologically most advanced Damage Corp, not so much in terms of gameplay as a technical level and with the arrival of Oculus Connect 3 show the new generation of shooter. Proceeding with the development of new games with continuous improvements, maybe visually not up to games like Call of Duty, but more advanced in terms of controls and interaction, understanding that the FPS is the most difficult genre with which we will have to do because of the movements required for the player that are very complex to manufacture in a virtual environment as one in which Oculus work. \n\n**VGNetwork. it: The thing makes perfect sense, indeed the same Oculus Rift, through the various stages of development, has managed to solve one of the major issues, namely the motion sickness. What was the key to eliminating the problem almost completely?**\n\nJason Rubin: The solution is simpler than you might imagine and runs' in part to the physiology of the human body: through the inner ear and the eyes we can perceive our movement and that of any other thing around us . In virtual reality our \"technology\" is not working properly because the movement is not perceived from the inner ear in the same way you perceive your eyes and this leads some players to suffer the effects of motion sickness. The games that have tried to stand, however, do not generate this effect due to the effect of locomotion that reproduces reality smoothly. Rather different for some of the most intense games that use the controller to move the camera, a disconnect that can lead to some problems. Certainly the problem is not solved at 100% and certainly a lot of games that will come out will be playable for most players but, at the same time, cause of motion sickness to others. In relation to the question that you did to me before, going forward in the development we can better understand the dynamics that lead some players to suffer from motion sickness but Oculus will always try to focus on games that are playable without problems by all, this is definitely our Main target.\n"}