{"doc_id": "89", "name": "2016_06_humanities_student_major_966_theredpill", "namespace": "we1sv2.0", "metapath": "", "pub": "TheRedPill", "title": "2016-06-humanities-student-major_966_TheRedPill.txt", "pub_date": "2016-06-13T00:00:00Z", "Sentiment": "0.035", "Subjectivity": "0.433", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "763", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d480mpr", "Reddit_id": "d481cqp", "Subreddit_id": "t5_2ve1u", "Commenter": "stonepimpletilists", "length": "3990", "content_scrubbed": "Oh, that doesn't even being to describe.\n\nThe female messes were absolute cock fights. The female bathrooms would often have idiots getting [.]urprise' periods and jamming up the plumbing, to the point where every ship would have a female hull tech, because the guys weren't gonna deal with it. the only thing keeping them from ripping each other apart was that 'one bitch' that they all could hate together, gave them focus off each other. But that poor girl would be crying weekly, and the coxn would have his plate full of the drama.\n\ntheres the \"fucking\" issues, but a good coxn will post a chick out of there the second it becomes a problem, besides, a vast majority have little impulse control with the meals, and will baloon up, so you've really only got a 2 year window before they are unfuckable anyways, the ones who stay in shape tend to be married off to a civilian, and those girls (as rare as they are) tended to be the stable ones. 90% of women married another service member, and you guys think AWALT at your fucking liberal_arts university is horrible? Oh, my special little snowflakes, i have stories that will make your balls suck right back up, trust me... You have no idea how AWALT can manifest until you've seen a woman on a boat who[.] half ass good looking, with 200:1 AF/BB.\n\nOn top of that is the pressure. i had a subordinate who I was training for message traffic as a ready duty comms boat. When things started to get hectic, she would literally freeze, and just blank out, like a deer in the headlights. In order to keep our captain out of the shit, i had to double time my workload to cover, and send her off to do the menial shit, otherwise my PO2 would have to be up there, and then hell would break loose. If it wasn't for the general safety of todays military, and our countries posture (plus the 7th fleet as backup) I can see it costing, which sucks, because you never lose one sailor, you either all come home, or you all don't. but that[.] speculation on my part.\n\nthe other two. One was a screeching harpy, but generally got better once the boys collective told her to shut her clam or fuck off. Though she got the MSO billet, because it got her out of the room 24/7, by giving the position for guys who are usually burnt out from their workloads. the other one was what you'd think of here as a 'femenist'. Put her with the savant of our watch (who had an anal fetish with 18 year olds, and no filter) and me, because i was the only watch sup who could deal with it without a head sized hole in the bulkhead. God she was useless, almost as useless as my supervisor, but he had the good sense to stay the fuck out of the way and go try to brown nose a promotion.\n\nThe funny part was when she moved from reserves to reg force (of which they are inflated a good 2 ranks) and had my boss rank her #1 because [.]he shouldn't have to earn it twice' which would have been fine, had she earned it the first time. The other 5 of us I was friends with joined shortly after (we were too damned valuable to lose at the time) but it was rather annoying to have her as our peer.\n\nGranted, One of the best sailors I worked with was a 5' polish chick from butfuck poland, but out of the 20 women I've sailed with, she[.] the only one i would say yes to a second round. Was more of a pro than many of the guys, but she[.] the exception that proved the rule IMO\n\n#The reason I'm posting my ranty amendment is for this.\n\nthis one 3 month period... this glorious period, when all the boys looked around, and realized that all the girls had been posted off, and it was a guys only section... Was a collective sigh, and we had a real moment.\n\nWas the greatest 3 months in a CCR I've ever had. And I don't have a problem with women on board... Same as you don't mind kids in your resturaunt, but it[.] just a different, wonderful beast when they aren't in your workspace.\n\nSo yeah, no idea who GLO talked to in the service, but they didn't give him enough of the details.\n\n/rant"}