{"doc_id": "29", "name": "2016_06_humanities_student_major_266_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2016-06-humanities-student-major_266_college.txt", "pub_date": "2016-06-03T00:00:00Z", "Sentiment": "0.133", "Subjectivity": "0.297", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "432", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4mcqfq", "Reddit_id": "d3utnb1", "Subreddit_id": "t5_2qh3z", "Commenter": "the_myleg_fish", "length": "2534", "content_scrubbed": "Units work differently here, judging from your question. What you call a unit, we call courses. In a semester system, each course would be worth about 3 units. In a quarter system, each course would be worth about 4 units (which are more like...\"points\", and you need a certain amount of units in your major and in general in order to graduate). That number depends on your program and university. In both quarter and semester systems, you end up taking about 15-16 units, normally (I think). \n\nAs I'm only familiar with the quarter system, full time in the quarter system is considered 12 units, or at least 3 classes. In the semester system, there are 2 standard semesters per school (Fall and Spring) year and 2 optional semesters (Winter and Summer). Semesters, from what I know, last about 15 weeks? Ish? Maybe. In the quarter system, there are 3 standard quarters (Fall, Spring, Winter) per school year and 1 optional quarter (Summer) and each quarter lasts about 10 weeks, with the exception of summer school. \n\nIn US Universities, you take 2 years of general ed classes (usually intro classes to many of the different majors offered, like english, math, psychology, philosophy, communications, Anthropology, Biology, chemistry, you get the point). It[.] to get you more well-rounded and knowledgeable in more subjects, I suppose. \n\nThese classes tend to have mostly multiple choice exams simply because it[.] easier to grade them in a large lecture hall (sometimes with 200-300 students). For most classes (in the quarter system), you tend to have at least 1 midterm and 1 final, but many classes would have 2-3 midterms and 1 final. It depends on your professor, really. To find out if your professor is worth taking, use ratemyprofessors (though with those with limited number of reviews, take it with a grain of salt). \n\nWhen you begin taking classes for your major, depending on your department, I suppose there will be less multiple choice and more short answer or essays. Since my major was a humanities major, I got a lot more essays and basically no multiple choice. \n\nThe exams, research papers, and projects are usually worth the majority of your grade. The actual percentage will depend on the professor but you'll need to do a good job on those if you want to pass the classes. A few of my professors took attendance, but most didn't and didn't really care whether you were there or not. Though in the smaller classes, your professor is more likely to notice that you're not there. \n\nSorry about the long answer! Lol"}