{"doc_id": "1854", "name": "2016_08_humanities_student_major_151_the_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "The_Donald", "title": "2016-08-humanities-student-major_151_The_Donald.txt", "pub_date": "2016-08-02T00:00:00Z", "Sentiment": "0.023", "Subjectivity": "0.389", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "330", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vw6qt", "Reddit_id": "d61z9cp", "Subreddit_id": "t5_38unr", "Commenter": "drunkwithblood", "length": "2495", "content_scrubbed": "The most famous atheists all correctly recognise Islam as being far worse that others.\n\nRichard Dawkins: ['There are no Christians, as far as I know, blowing up buildings. I am not aware of any Christian suicide bombers. I am not aware of any major Christian denomination that believes the penalty for apostasy is death.'](http://www. breitbart. com/national-security/2016/01/12/professional-atheist-dawkins-says-christianity-bulwark-against-something-worse/)\n\nChristopher Hitchens (who despised the Clintons, btw): [speaking about the inevitable clash between Islam and the West](https://www. youtube. com/watch?v=3V9XxxDs3kI)\n\nSam Harris: ['There are very few of us who lie awake at night worrying about the Armish - this is not an accident... they are unlikely to hijack planes and fly them into buildings](https://www. youtube. com/watch?v=yuq4svdUP_M)\n\nDon't blame the atheists, blame the social relativists and the cultural Marxists pushing their agenda. As Sam points out in his endlessly relevant article 'Sleepwalking toward Armageddon':\n\n But there is now a large industry of obfuscation designed to protect Muslims from having to grapple with these truths. Our **humanities and social science departments** are filled with scholars and pseudo-scholars deemed to be experts in terrorism, religion, Islamic jurisprudence, anthropology, political science, and other diverse fields, who claim that where Muslim intolerance and violence are concerned, nothing is ever what it seems.\n\nIt is these academics and SJW students who are the problem. Not people who have valid reasons for lacking a belief in any god.\n\nWish Sam Harris would hurry up and get on the Trump Train!\n\nTrump pushes for so many of the same things he does: the moral courage to actually *name* your enemy and for our leaders to speak honestly of the link between Islam and terror; willingness to [profile people](https://www. samharris. org/blog/item/in-defense-of-profiling); he[.] [pro-gun](https://www. samharris. org/blog/item/the-riddle-of-the-gun); and Sam is even closer to Trump on [torture](https://www. samharris. org/blog/item/why-id-rather-not-speak-about-torture1) than anyone I've heard, especially any liberal! ('Nevertheless, I believe that there are extreme situations in which practices like \"water-boarding\" may not only be ethically justifiable, but ethically necessary—especially where getting information from a known terrorist seems likely to save the lives of thousands (or even millions) of innocent people.')"}