{"doc_id": "73", "name": "2016_06_humanities_student_major_800_makeyourchoice", "namespace": "we1sv2.0", "metapath": "", "pub": "makeyourchoice", "title": "2016-06-humanities-student-major_800_makeyourchoice.txt", "pub_date": "2016-06-10T00:00:00Z", "Sentiment": "0.156", "Subjectivity": "0.507", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "828", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nbvmy", "Reddit_id": "d444kjw", "Subreddit_id": "t5_2w8em", "Commenter": "darkdragon2344", "length": "4468", "content_scrubbed": "**School**: Ej Har; I mean yeah it really only make sense to go  to a school that doesn't care where powers come from, morals lead to weakness of the mind, and your body is only as good as the mind.\n\n**Classes**: \n\nFull Year Ki: It offers flying, and I will always take a flying option.\n\nFull Year Assassination: Ideally a battle can be won *without* conflict.\n\nFull Year Stealth: Should really help with that whole no conflict thing.\n\nFull Year Physical Training: To really use my previous abilities I'll need to be in shape enough to maximize them.\n\nFull-Year Tactics: Assassinations require a lot of planning, so it would be nice to be good at planning.\n\n**Companions**:\n\nScal: How could I not take Scal, his only downside is a less than stellar past.\n\nCassiopeia: Cass is a bit of a quirky one, but she[.] generally a good person, and hard to go against.\n\nDax: Dax kinda reminds me of me, so of course after I met his brother in Ej Har I went to tell him as soon as possible.\n\nEloise Avery: Alright, I'll be honest Eli is a bit creepy, actually, she[.] really creepy, but as soon as she saw me she ran up and asked to be my healer. How could I say no to a cute face like that?\n\nInas: Inas is even better than me at assassination which is quite the feat considering her weapon is bigger than me.\n\nEvents:\n\n*Great Tournament*:\n\nGreat Hunt (First 4 Years): The Great Hunt is a good time to practice my techniques, and there[.] really no one better to take than the freaks themselves Inas and Eli.\n\nBattle Royal (5th Year): You know I've been spending all this time focusing on staying hidden, but its important to know how good I am in upfront combat. Skal, Eli, Dax, Inas, you guys are coming with me. Cass you can even get the front row, but I know you don't like all the loud noise, so I won't be too disappointed if you don't come.\n\n*Harvest Festival*:\n\nFund Raising (First Two Years): Nothing like a good haunted house, and when you've got the creepy mad scientist (Eli) and her two relentless henchmen (Me and Inas) after you the whole time it becomes so much better. Be careful not to run into the house[.] mistress (Cass) or she may just capture you and turn you into a doll. Of course, Skal and Dax will be bonding and selling tickets at the entrance.\n\nEscort (Third Year): Whoa, a ghost with emotions! Hold on one sec, let me go get Cass, this is exactly what she[.] been hoping for.\n\nGeneral Activities (Fourth Year): We've hosted a lot of things, so this year we're just gonna chill and see what others are hosting.\n\nBasilisk[.] Den (Final Year): Huh, an invite to the Basilisk[.] Den, seems like a good idea to bring this to the Headmaster for an epic looting raid for the school.\n\n*Grand Summit*:\n\nBattle of the Arts (First Year): Come on guys let[.] go see what[.] at the culture show, I wanna know what other schools are doing!\n\nBattle of the Arts (Second Year): BOTA was pretty great last year, but this year let[.] show them what we've got. I can see it now, Cass reanimates an army of skeletons to fight, and Dax and Skal demolish them, of course we'll have some pig[.] blood nearby for Skal. Then[.] when the skeletons are down Cass \"reanimates\" me and Inas, fog descends on the stage, and we try to assassinate assassinate Skal and Dax, but make a small slip up. Eli heals them and both sides have an epic clash with Skal and Dax, the heroes, emerging victorious.\n\nResearch Proposal (Third Year): I'm interested in what new info we have on various things, so I'm gonna go check it out this year.\n\nResearch Proposal (Fourth Year): That[.] a great breakthrough you've made Cass! Let[.] go present it at the Grand Summit, don't worry, I can do most of the talking.\n\nSecurity (Final Year): Alright guys let[.] show those other schools what we're made of and kill those thieves!\n\n*The Gathering of Life*: I'll just hang out at this one, parties don't really interest me, I'll be taking a different one of my friends as my guest each year. Except for Dax and Skal, those two are inseparable, so for my last two years I went on blind dates with Selena, who was nice, I got to see what Nobility is like, and she got to see what the perspective of someone who is commonly thought of as the lowest of the low was like. I didn't like her coddling though, I'm perfectly capable on my own. I also went with Kit and she was really fun, overall the kind of person I'd like to hang out with, and since this my last year I probably will.\n\nReally nice cyoa this one. Major props."}