{"doc_id": "220", "name": "2016_06_humanities_student_major_2155_femradebates", "namespace": "we1sv2.0", "metapath": "", "pub": "FeMRADebates", "title": "2016-06-humanities-student-major_2155_FeMRADebates.txt", "pub_date": "2016-06-30T00:00:00Z", "Sentiment": "0.071", "Subjectivity": "0.447", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "1017", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4qlwpo", "Reddit_id": "d4u9g3p", "Subreddit_id": "t5_2y44v", "Commenter": "Sunjammer0037", "length": "5943", "content_scrubbed": "Well, I'm glad that the cause of women performing worse isn't discrimination or women being dumber than men, but women being less confident than men. Confidence issues are easier to fix than outright lack of intellectual capacity or talent.\n\nBut they're still by no means easy to fix. It[.] not the first time I hear how women are less confident than men, and it[.] certainly worrying. *How* can we fix this, though? Obviously traditional gender roles don't work, but it seems to me that neither does the modern approach of coddling women. (Not to say that women are generally coddled, but in certain liberal feminist areas they might be). I don't know if my mindset is shared by others of if I'm an exception, but whenever somebody tries to coddle me, I can get three types of reaction - either I get annoyed, scared, or encouraged. I know this seems like very different ways to react. I get annoyed when I feel I'm competent at the task but I'm assumed at being incompetent and therefore receive extra help, which is in this case unwanted because I think I don't need it. Whereas if I know I'm incompetent at the task, extra support can either encourage me - it means I have a chance to improve myself by learning even if currently I lack the skill/knowledge. However, if I'm feeling on the fence, I'm not sure whether or not I can do this, or generally am in an unsure and uncompetitive mood, coddling can make me scared. If I don't know where I stand in regards to this task, being coddles kind of activates the belief that I won't be good at it and therefore will *need* help.\n\nLike I said, I don't think women are coddled in all aspects of their life, but in some Western countries women in STEM certainly can be. I think at this point it[.] become an issue where feminism itself is shooting women in the foot rather than helping them. When you're told all your life how STEM fields are stacked against you and you must be extremely brave and prepared to face constant sexism and harassment in order to prevail there, is it any wonder so many women lack confidence? It[.] easy to imagine how they get discouraged much easier than men, if they - either consciously or not - take every failure as a confirmation that their gender is an obstacle. And this obstacle is ultimate because you can't do anything about it (aside from sex change surgery, I guess...). If you think failed cause you didn't try hard enough, you can decide to try harder next time. If you think you failed because you weren't experienced enough or didn't know enough, you can decide to improve yourself and then try again. The only reasons I can imagine that would seem to make it fruitless to ever try again are something inherent, something you can't change about yourself. Belief that you just don't have it in you mentally (too low IQ, inherent lack of talent, etc) is one of them, your sex would be the other.\n\nSomething to consider - [this study I found a few days ago shows that in Armenia girls are equally as competitive as boys in both traditionally masculine and feminine tasks (or what Western societies consider masculine and feminine tasks, the perceptions of those children were different) and girls were actually more competitive than boys in the task of running, and boys and girls are equally confident in their abilities](http://papers. ssrn. com/sol3/papers. cfm?abstract_id=2397117). The funny thing is that, like the study points out, Armenia is much less gender-equal than most Western countries, and it referenced another study that also found no difference in competitiveness between boys and girls in Colombia (which isn't known for being very gender-equal either). Those two countries don't seem to have any relevant cultural similarities that could explain them having the same results. So it[.] clear that this can't be explained by traditional gender roles - something that usually gets all the blame in Western countries.\n\nCould the main factor actually be feminism? Neither Armenia nor Colombia have much of this infamous 3rd wave feminism that[.] so prevalent in some Western countries. Could it be that feminism is actually not increasing but destroying women[.] confidence? Women are constantly told they're not good enough - they're constantly reminded of how they don't earn as much as men, how there aren't as many women in top positions as men, how women simply aren't achieving as much as men, etc. Lack of women in STEM fields (only in certain STEM fields, to be exact, but few people seem to differentiate) is just one of expressions of this - one of the things women are constantly told they're failing at and it[.] seen as an emergency and something should be done about it. It seems only normal that women[.] confidence could take a blow from all that - especially if things like gender quotas are set in action or, downright outrageous, female-only chess competitions, which literally treats being female like a mental disability. I'm willing to bet Armenia doesn't have this \"let[.] have female-only everything related to competition or STEM because it[.] obvious women can't handle competing with men, they must be treated with extra support\" bullshit that[.] apparently quite prevalent in America. I'm from a post-Soviet country myself and it certainly doesn't exist here. I've never seen any \"female-only\" STEM event or course, or any specific attention or campaigning for more women in STEM, or any implication that women are suffering from huge discrimination and there must be more women forced into STEM. In fact, out of my high school class all but a couple of women went on to major either in STEM or medicine. There was a lot of pressuring from teachers to choose STEM because humanities and social_sciences were  oversaturated and had really poor job prospects. There was no separate mention of women - neither encouraging nor discouraging more women to join STEM, this pressuring was aimed at both male and female students."}