{"doc_id": "1861", "name": "2016_08_humanities_student_major_233_makeuprehab", "namespace": "we1sv2.0", "metapath": "", "pub": "MakeupRehab", "title": "2016-08-humanities-student-major_233_MakeupRehab.txt", "pub_date": "2016-08-04T00:00:00Z", "Sentiment": "0.079", "Subjectivity": "0.453", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "420", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4w42sk", "Reddit_id": "d63yo4c", "Subreddit_id": "t5_32g1x", "Commenter": "fortheFading", "length": "2412", "content_scrubbed": "I just saw Temptalia[.] swatches for the new Viseart Bijoux Royal palette. It[.] pretty! It[.] totally my thing! In fact, it[.] so my thing that I already have a dupe for every single colour (the only iffy one might be that deep emerald shade, and it[.] still probably in either my Makeup Revolution Give Them Nightmares palette or one of my 88 palettes). I was looking at the swatches and going \"that[.] Heartleaf or Aztec Gold, that[.] Medieval Haunting, that[.] Hotsy Totsy, that[.] Tutankhamun, that[.] @#$%!, pretty sure that colour is in Naked2...\". It[.] getting surprisingly easy to do this now. (I'm not really sure where you can even get Viseart in Canada anyway.)\n\nI haven't put on makeup in a couple of weeks because it[.] all packed up. My mom is getting the top floor of the house repainted and the bathroom renovated, so almost everything is stuffed away somewhere downstairs. \n\nI soon need to go through my makeup to figure out what[.] coming with me when I move back to the university dormitories (for what might be my last year, I may be graduating next spring). I won't have the excuse of getting up too early to apply it this semester since three days a week, my classes don't start until 11. \n\nSpeaking of classes, in the span of one day, I was registered for three different math classes. I'm an ~~Arts~~ Humanities student (they *just* changed the faculty[.] name and I never remember it) but I still have a requirement of a quantitative course for graduation. The university also abruptly ended the math program I was in for financial reasons (which admittedly, doesn't give credit, it[.] a build-up program to reteach *everything* and as it had been a decade since I had done any math, it was very useful), so I've been bouncing around from course to course. I've finally registered for an algebra/trigonometry math course after getting a special waiver (because technically, I was ineligible for *any* low-level math courses until I finished the program - the math department is clearly still working out how to deal with everyone who was in said program), which is kind of an advanced version of the math course I just did so parts of it should be very familiar to me. In any case, other than that math course, I've ordered every required text I need. 13 novels/anthologies for about $65 - everything is secondhand (because trying to cite an ebook, as I found last semester, is extremely difficult). "}