{"doc_id": "120", "name": "2016_06_humanities_student_major_1211_askwomen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskWomen", "title": "2016-06-humanities-student-major_1211_AskWomen.txt", "pub_date": "2016-06-17T00:00:00Z", "Sentiment": "-0.045", "Subjectivity": "0.347", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "263", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4doiwe", "Reddit_id": "d4dovli", "Subreddit_id": "t5_2rxrw", "Commenter": "Drakkanrider", "length": "1458", "content_scrubbed": "Well here[.] the thing.  It[.] harder to FAIL at humanities, social_sciences, etc.  So it[.] easier to coast, and the students who don't want to do much work are going to gravitate to those fields.  But that doesn't mean there aren't students who are hard_workers, brilliant, and legitimately interested in those things either.  However, it is at least as hard (sometimes harder!) to really excel at those fields.  There were something like 2,000 psych students at my university of 16,000.  And I was one of maybe 4 to receive an award for my thesis, one of only a handful to get highest honors, one of maybe a couple per year that impressed a professor enough to take a grad seminar from them.  Distinguishing yourself from the pack is extremely, extremely difficult when there are over 2,000 students vying for the positions you're applying for, the scholarships and awards you want, the graduate schools you're applying for, etc.  So sure, maybe a bunch of those psych students didn't give much of a fuck and just wanted to coast by getting Cs.  But for those of us who cared, who wanted to excel, we worked at least as hard as the hard_science majors.  Like I said, I had friends in hard_science majors who never put as much work into their degrees as I did and did just enough to coast.  I had others who worked really, really hard, just like me.  The point is, every degree has both of those kinds of people.  It[.] just *harder* to be a coaster with some."}