{"doc_id": "197", "name": "2016_06_humanities_student_major_1951_israel", "namespace": "we1sv2.0", "metapath": "", "pub": "Israel", "title": "2016-06-humanities-student-major_1951_Israel.txt", "pub_date": "2016-06-27T00:00:00Z", "Sentiment": "0.021", "Subjectivity": "0.325", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "245", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4q9whu", "Reddit_id": "d4qm49h", "Subreddit_id": "t5_2qhvo", "Commenter": "chhena", "length": "1717", "content_scrubbed": "There is [an essay](http://www. amchainitiative. org/wp-content/uploads/2016/01/Interrogating-the-Academic-Boycotters-of-Israel-on-American-Campuses. pdf) (*pdf warning*) which briefly examines the first \"strong vs weak\" point.  \n\nThe author surveyed 938 boycotting faculty, 86% of whom are in Social Studies or Humanities, and then specifically examined those in either English or Literature, which account for 21% of the total boycotters. The vast majority of those in English/Literature have interests in at least one of the following areas: race, gender, class, and empire.\n\n One possibility is that all four areas represent ideological paradigms which divide\n the world into oppressed and oppressor along the lines of Race, Gender, Empire, or Class,\n making it a short ideological leap to seeing the Palestinian-Israeli conflict in the same\n binary terms, casting the Palestinians as the oppressed and the Israelis as the oppressor.\n Moreover, these areas of study all grew out of, and to some extent continue to have ties to\n social movements such as the civil rights movement, feminism, anti-imperialism, and\n Marxism, which were established to pursue \"social justice\" for the oppressed by\n combating the \"evils\" of the racist, sexist, colonialist, capitalist oppressor,  a fact which makes for the blurring of the lines between scholarship and activism. The linkage\nbetween scholarship and activism inherent to the study of Race, Gender, Empire, and Class not only helps to explain the disproportionate number of English faculty among the\nacademic boycotters of Israel, it also helps to explain why some faculty feel justified in\nbringing their anti-Israel activism onto their campuses and into their classrooms."}