{"doc_id": "1893", "name": "2016_08_humanities_student_major_504_engineeringstudents", "namespace": "we1sv2.0", "metapath": "", "pub": "EngineeringStudents", "title": "2016-08-humanities-student-major_504_EngineeringStudents.txt", "pub_date": "2016-08-08T00:00:00Z", "Sentiment": "0.045", "Subjectivity": "0.297", "Score": "64", "Upvotes": "64", "Downvotes": "0", "Wordcount": "1129", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4wts2v", "Reddit_id": "d69xr8i", "Subreddit_id": "t5_2sh0b", "Commenter": "thunderstrut", "length": "6505", "content_scrubbed": "1.) Don't buy textbooks - give a buddy $50 and photocopy all the homework problems from the current edition. Then buy (or download) an older version of the text for a fraction of the cost. My favorite reference texts that I use at work are 35+ years old. \n\n2.) Shoot for perfect on every assignment. These should be treated like free points. I made the mistake of never doing homework, and while I performed well on exams my overall grade would tank simply due to the homework component. \n\n3.) When it comes to lab/group project partners - pair up with people you communicate well with, not the \"smart\" kids. If a professor already favors a student it will be hard to stand out when paired with said student. \n\n4.) THIS IS CRITICAL - When it comes to group projects/assignments make a schedule of responsibilities and communicate it via email within the group. Even if it[.] a small assignment make sure that you have a paper trail logging how work was distributed. It[.] not your job to motivate and steer other students, and you shouldn't be penalized when they fail to perform. This is kind of a shitty outlook, but I've been paired with lab partners who were trying to flunk out so their parents (financial backers) could let them switch majors.\n\n5.) Remember, you are the client - don't forget that. It[.] hard to stand up for yourself when you are in a different city in a new environment but it is absolutely critical that you do. If you think a professor is being unfair go to the dean. If your advisor isn't \"advising\" (as was my experience), go to the dean. Unfortunately the academics can become somewhat complacent under tenure and forget that it[.] kids like you bankrolling their institution. \n\n6.) Join only one or two career-related extracurricular organizations and become heavily involved. Try to find something that interacts with local professionals. When I look at resumes I don't care what extra-curricular activities you have listed if, when I ask you about them, you stare back with a blank face trying to remember what was said during that single meeting that you attended while semi-hungover. \n\n7.) **take this with a grain of salt, as everyone learns differently*** Don't fall into the trap of \"oh yeah, we're all going to study together while watching football.\" If you need to study then you need to study. Don't fool yourself by trying to study and have fun. Go to the library, read the chapter, do the example problems, wash, rinse, repeat. \n\n8.) Completely disregard Tip No. 7 if it involves studying with a member of the opposite sex (or same sex, whatever, it[.] 2016, go nuts). For some weird reason stress tends to be a fairly powerful aphrodisiac and, inversely, sex can be a great stress reliever. \n\n9.) Try to live as close to the engineering building as possible. You can walk the extra few blocks to meet up with your friends but a short commute makes it much more difficult to skip class when it[.] raining or snowing. \n\n10.) You are not going to finish that assignment on Sunday if you stay out drinking until 4am Saturday night. Don't lie to yourself, it[.] just not going to happen. Also, finishing the assignment before your 8:00am - not going to happen either. \n\n11.) Try to study at coffee shops whenever possible (as long as not too distracting). People will begin to recognize you and will sometimes approach you in extracurricular settings which can facilitate socialization. Something along the lines of \"hey, yeah, I see you all the time at Starbucks.\"\n\n12.) Adderall - if you think you need Adderall to help you study then go talk to a doctor about it, even the campus doctor will be able to help you. DO NOT self-diagnose yourself and get in the habit of taking it \"just for this test\" because the next time you have a test it will be significantly more difficult to study without the drug. Adderall is addictive and your mind builds up a tolerance very quickly. Also, remember that Adderall is just brand-name amphetimine salts, so don't let the trade name distract you from the fact that your'e just popping pep pills. \n\n13.) Find a good place on campus to poop. Ideally this will be one of those bathrooms that hasn't been renovated in 50 years tucked deep in the annals of the old humanities buildings. Having scoped out a good poop spot is critical, especially during finals when all the buildings are jam packed and you've been chugging coffee all day. \n\n14.) If your professor struggles with english, sit at the front of the class. My experience has been that when an individual isn't confident in his/her english he/she tends to mumble, making the lecture worthless for anyone sitting deeper than the third row. \n\n15.) Don't worry too much about getting in \"behavioral\" trouble with the university (I mean partying, pranks in the dorms, beer in the dorms, etc..) I got written up countless times during college and none of that stuff ever developed into anything. The exception to this is weed and cops. Don't be stupid about smoking dope on campus and don't fuck around with cops. You can mouth off to campus safety but as soon as the real cops get there you better straighten up immediately.\n\n16.) Eat breakfast. \n\n17.) Several colleges have \"weed out\" classes which are intended to knock-out anyone that can't keep up with the engineering syllabus (eg. statics, intro to O-chem, thermo, etc...). Many of these courses are taught by a professor who has been teaching the same course for the past 10 years and who gets off on making the assignments exceptionally difficult and tedious. There is, however, a strong chance that he/she is going to reuse the exact same material from last year including assignments and exams. Become friends with someone in your program who is a year or two ahead of you (you can make friends across grade levels in extracurricular programs) and see if you can get copies of last year[.] assignments/exams. If this raises some ethical hang-ups let me just present the following two points: 1.) The professor is getting paid well, and it[.] his/her fault for not changing up the course material. 2.) Any time I'm facing a difficult design the first thing I do is check what people did on past projects - that[.] the reality of engineering. \n\nHopefully that was somewhat helpful...\n\nEDIT: \n\n18.) When the professor begins working out example problems in class boost your performance up to 150% - wake up, take impeccable notes, and ask questions. There[.] an 85% chance those example problems will end up on the final exam. "}