{"doc_id": "1934", "name": "2016_08_humanities_student_major_853_anime", "namespace": "we1sv2.0", "metapath": "", "pub": "anime", "title": "2016-08-humanities-student-major_853_anime.txt", "pub_date": "2016-08-13T00:00:00Z", "Sentiment": "0.178", "Subjectivity": "0.454", "Score": "123", "Upvotes": "123", "Downvotes": "0", "Wordcount": "1575", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4xj61b", "Reddit_id": "d6fw649", "Subreddit_id": "t5_2qh22", "Commenter": "Daishomaru", "length": "8944", "content_scrubbed": "Today[.] subject is going to be about Apicius, duck, and eel dishes.\n\nTo be honest, this is gonna be not as interesting than the usual ones, as duck and eel dishes are, to be honest, kind of too broad a subject to talk about, because there[.] too much information to write about, and I'm already working on a much, much larger writeup on  Saury on the way.  I also suffered Writer[.] Block trying to write about some subjects, Eel in particular, because while Eel is enjoyed in both countries, eels kind of has dipped in popularity due to environment concerns in Europe.  I just made a much more simpler writeup for today, but for the Saury writeup, It will be a big one.  However, I did find some interesting things to talk about.  I also wanted to look up more information on some people, like Apicius, the dish Hayama claimed he based his duck dish on, and I also found interesting things. \n\nFirst, let[.] talk about Apicius, the man Hayama says his dish was inspired from.  He[.] a pretty interesting guy.\n\nFirst of all, Apicius was NOT born in the 16th century, however, I think I know why Hayama may have mistakened Apicius for a 16th century author.  He was actually 3 guys, one born in the 1st century BC Marcus Gavius Apicius, born in between, and a third Apicius around 200 AD.  Apicicus was not common as a last name in Rome, the name Apicius seemed to be what was most likely a nickname, or perhaps a Gourmet title.  \n\nWe're mostly going to focus on the second man, Marcus Gavius Apicius, because he is the one most recorded and famous one with the name Apicius.  From what I read about this man, he was a gourmet who was also a bit of a scientist in the cooking world, experimenting with many ingredients, including making a way to make a pork foie gras using the same method of making goose foie gras at the time (force feeding).   He also appeared to be a critic in many way, talking about fishing or telling other gourmets on how food should be cooked, and indeed may have set up an ancient standard on how to critique on Roman haute cuisine, kind of like an ancient Michelin Guide in a sense.  We're gonna need to talk about roman banquets to explain the important context.\n\nIn roman life, partying and banquets were seen as important amongst the rich and powerful, kind of like an \"I have a lot of money and I'm showing it off\" kind of way, and Romans LOVED showing off all their wealth.  They would throw many big parties with ingredients all over the empire (As Rome was so huge), and eat as much as they can.  They would bring in, poets, musicians, dancing girls on occasions,  get drunk, talking about stuff and life (Some of the stuff they talked about sounds just like an ancient 4chan, if Graffiti from Pompeii were to be [believed](http://www. pompeiana. org/Resources/Ancient/Graffiti%20from%20Pompeii. htm)), have a bunch of orgies, kind of like a wild party.  Anyways, one of the most important parts of the roman party and banquets was the food, and in Rome, the chef got a lot of ingredients to work from, because Rome was basically a huge part of the world, a size that Great Britain would only catch up to many centuries later.   Chefs were experimenters, and did grand projects, and one of the most respected jobs outside of politicians and being in the military was the baker, who made the food source of both the poor and rich.  So the Roman culinary world was filled with many novel and traditional cookery, and even after the Roman empire fell, many cuisines have Roman influences in them, such as France with their love of Bread and Italian Cuisine, making Rome some of the most influential in the arts of cooking aside from the New World (Basically, American ingredients like Tomatoes and potatoes.)\n\nSo yeah, Apicius, being a chef, experimenter, and gourmet kind of placed him in a unique spot in Roman culture.  Unfortunately, but also somewhat fittingly of a gourmet, he died when he found out he spent too much money on food, and fearful he would go poor, took his own life.  Thankfully, his works lived on and the recipe book of Apicius lived on, carried by probably Christian Monks protecting rare roman books, then translating them to English during the Middle ages/early renaissance, which is probably where Hayama gets his slight error from.\n\nBut anyways, on to duck.\n\nDuck was a commonly eaten ingredient in the European community, especially in French cuisine.  Duck hunting helped put meat on the table during the autumn and winter season, so duck hunting was very common around the area.  The Kings and queens in general loved eating ducks, especially the French Kings starting from Louis XIV, the sun king.   Louis XIV was a bit of an artsman and a designer, having personally directing the construction of the Versailles Palace himself, and he was also a gourmet, and his royal influence helped set up the cooking world on how gourmet food should be like.  Louis XIV LOVED duck dishes, like all rich people during this time, and so would his descendants Louis XV and Louis XVI.   \n\nWhen Japan allied with France, Meiji sent some Japanese people to study French cuisine in that giant super student exchange program, and the those Japanese people became the first French Japanese chefs, taking home with them foreign duck ingredients.  While duck was eaten in Japan, it was rare before the Meiji era, because the Japanese had a preference fish.  When duck recipes were taken from france and sent to Japan, there were more chefs experimenting with duck and giving duck more popularity.\n\nAround this time, one of France[.] most luxurious dishes, the Pressed duck, was invented.  Basically it was a defeathered duck shoved into a duck press, a contraption that, when tightened, would squeeze the duck until all the blood, including the marrow inside of the bone, was poured out into a pan.  The Pan filled with duck blood then had to it added wine and other ingredients, and then the duck was placed back on it, and the duck was pan-fried in its own blood and wine, if I got that[.] how you make the dish.  It was so delicious that the Tour d'Argant, one of France[.] oldest, most prestigious and luxurious restaurant, made it their signature dish.\n\nEmperor Showa himself loved duck dishes, especially from the Tour d'Argant, and he would order many duck dishes of many kinds.  One of his favorite duck dishes involved a whole duck stuffed with Foie Gras from a goose into the oven and then cut when serving, and it was said that he loved this dish so much, that when France and Japan re-allied after the war, one of the first things he did was buy this dish to eat.\n\nNow let[.] get on too eels.\n\nIn Japanese culture, there are two ways to butcher eel: back first or belly first, also called the Eastern style and the western style respectively.  The difference is, of course, where you filet the eel, because while the western side of Japan cuts the eel from the belly, the eastern side of Japan was filled to the brim with samurai warlords, so cutting the fish from the belly first was considered not only taboo (It had implications of seppuku, the Samurai suicide), but also extremely bad luck.  Some noted people who watch how the chefs filet their eel can note this way if they trained from an eastern chef or a western chef just by how they filet the eel.  Back then, and even still to this day,  the west and the east still debate on what is the true way of filleting, and the results are divisive, because different societies teach different butchering techniques, east vs west beliefs, different traditions, the East is the Capitol of Japan thus we are the true masters at eel butchering, etc.  There[.] too many things they toss around with this debate.\n\nEel is also very commonly eaten in Europe, especially in Britain, France, and Italy.  Compared to Japan, Europeans prefer stewed or boiled eel, where they cook the eel to this kind of gelationous texture, and then combine the eel with a nice thick sauce, like what some French and Italian people do or jelly the eel like what the British does.  Unfortunately, European eels are endangered from overfishing, because eels have been caught too much and didn't recover fast enough in Europe.  \n\nSpeaking on how I usually try to connect Japan into this for the sake of this anime, there was a case where some countries thought it would have been a great idea to sell European Eel to the Japanese, where both eels have similar flavors, but then the European Union cracked down on these sales because the Japanese ate so much eel back then that if they sold eel to the Japanese, the Japanese would, and I quote, \"Have literally eaten the entire European Eel population to extinction.\"  If I recall, one of these countries that REALLY wanted to do this was Britain, and, well, the EU cracking down on those sales pissed off some of the sellers.  \n\nAnyways, sorry if my writeups today were somewhat lacking today.  I promise I'll make it up next week."}