{"doc_id": "2028", "name": "2016_08_humanities_student_major_1806_writing", "namespace": "we1sv2.0", "metapath": "", "pub": "writing", "title": "2016-08-humanities-student-major_1806_writing.txt", "pub_date": "2016-08-24T00:00:00Z", "Sentiment": "0.011", "Subjectivity": "0.202", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "462", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4zfc2q", "Reddit_id": "d6veyv1", "Subreddit_id": "t5_2qh2n", "Commenter": "Marshmallow_Malice", "length": "2822", "content_scrubbed": "You'll have to forgive any strange formatting or typos as I'm on a mobile.\n\nI have worked as an English tutor and Student Assistant. My job was to help students with their essays for the humanities. These are a few things that came to my mind:\n\n1. Don't write the way you talk. Slang doesn't belong in college papers. (If you're writing a psychology paper this extends to needing to avoid contractions.)\n\n2. Answer the required question(s). No, really. Most professors will provide an essay prompt with multiple questions. Answer them all.\n\n3. Cite your sources. Every professor has different preferences for how sources are formatted. Tailor the paper to the person who will be grading it.\n\n4. Fill-in-the-blank online citation creation sites are tempting but tend to be flawed. Many are outdated. Pick up the resource guide your professor recommends and use it. \n\n5. Evaluate your sources before including them. Consider the validity of what you are reading. Who wrote the material? Who is the intended audience? Is it a scholarly source or media source? \n\n6. Include viewpoints that disagree with yours. Don't discount the counter arguments, rather discuss what claims they make and state an argument of your own in response. (This one is important, imo. Being able to address the other side of the issue with logical, thought out responses shows a good understanding of the topic. Also, don't be afraid to admit that the opposition poses a good point. Embrace the grey zone and ambiguity in the face of complex issues.)\n\n7. If you are going to criticize something, make sure you aren't whining. No professor cares if you found the material boring. \n\n8. Follow the formatting rules the professor provides. Little things like the wrong font or lack of a cover page can tick off valuable points from your overall grade.\n\n9. Proofread. (I'm guilty of not doing this enough. Last minute paper writing happens, but it[.] always a good idea to revisit the paper the day after you wrote it. Fresh eyes help you pick out errors, especially stupid ones, that escape your notice as you're writing.)\n\n\n10. Brush up on what plagiarism is and is not. Most universities have a very detailed list of possible infractions. Academic Dishonesty can lead to some serious consequences, including expelulsion, losing scholarships, and failing the course which can really mess you up if it[.] a pre-requisite for upper level courses.\n\n11. Take advantage of resources available to you. Writing centers, library databases, office hours, workshops on citation styles, etc.\n\n\n12. Relax. Take your time. Research thoroughly. Think through what you want to say. Write in whatever manner works best for you (multiple drafts, one draft, paragraph by disorganized paragraph that you Frankenstein together later, detailed outlines, no outlines, etc.)\n\n\n"}