{"doc_id": "208", "name": "2016_06_humanities_student_major_2059_tumblrinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrInAction", "title": "2016-06-humanities-student-major_2059_TumblrInAction.txt", "pub_date": "2016-06-29T00:00:00Z", "Sentiment": "0.076", "Subjectivity": "0.457", "Score": "132", "Upvotes": "132", "Downvotes": "0", "Wordcount": "284", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4qez2z", "Reddit_id": "d4sesct", "Subreddit_id": "t5_2vizz", "Commenter": "whatafoolishsquid", "length": "1620", "content_scrubbed": "Tbf, heterosexual pride day sounds kind of dumb, simply because my sexual preferences don't form my identity.  I wouldn't be proud to be homosexual either, but I can understand why they would have a \"Gay Pride\" movement because they've been told to be ashamed of it for so long.\n\nThat picture makes me really mad for a separate reason, though, which is the thing that first introduced me to the entire SJW bullshit movement in the first place.  I am straight, white and male, and I also grew up (relatively) poor in the South.  I lived in trailer parks, dumpy duplexes, my dad was in jail part of my childhood and working the night shift the rest of it.  After college, which I paid for myself, I did a fellowship abroad where I met a lot of people with this mindset who tried to tell me that being straight, white and male somehow made me more privileged than them, whose wealthy parents had paid for their outrageously expensive private liberal_arts education in the Northeast, simply because they were homosexual or a minority or even a woman.  Give me a fucking break.\n\nEDIT:  I would like to clarify that I'm not claiming I was \"underprivileged\" or something like that and therefore deserving of the coddling SJWs seem to think their pet groups need.  I said \"relatively poor\" because I know despite hovering around the poverty line most of the time, my family growing up was extremely advantaged compared to the vast majority of the world simply because we lived in the West, and really comfortable compared to many American families.  Which is exactly why I think all these Tumblrinas need to get over themselves."}