{"doc_id": "46", "name": "2016_06_humanities_student_major_457_videos", "namespace": "we1sv2.0", "metapath": "", "pub": "videos", "title": "2016-06-humanities-student-major_457_videos.txt", "pub_date": "2016-06-06T00:00:00Z", "Sentiment": "0.056", "Subjectivity": "0.227", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "401", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3xy6oh", "Reddit_id": "d3y9bkf", "Subreddit_id": "t5_2qh1e", "Commenter": "TwiztedImage", "length": "2277", "content_scrubbed": "Former college bookstore employee here.  I concur.\n\nAdditionally, a lot of the loose leaf books people are bitching about are bundled with software, and the code is the most expensive part. O-Chem book was $250. Online code, from their website, with no book, was $220. So in that case, the book WAS cheap (comparitively). \n\nOther times it[.] the publisher just being a dick and switching up some pictures, chapters, and or the foreword. \n\nSome profs are taking cuts (AKA: motherfuckin' bribes) to require new editions and certain packages.\n\nOther times, the prof is straight being lied to. They want to allow a used book, the vendor gives them an ISBN, and lost and behold, it[.] a new bundled package with online software the prof isn't going to use. I had a prof call my store and request us to stop selling the new versions for her class. We stopped. She called the next day and said the school was forcing hee to use that book because it was a trusted publisher and there was no time to make the changes (whatever that means). She meant well, but lost that battle. \n\nNow I worked at a independent bookstore off campus. We only serviced one major school and one junior college. Buyback sucks.... every time. \n\nSTEM classes? Somewhere between 10 and 30% return. Liberal arts major? Just go fuck yourself; you'll be better off. STEM classes have more expensive book AND they use them for longer. Psychologists books changed yearly; sometimes every semester. Calculus? Same book for 7 years.\n\nThe store isn't buying them to help you, the student, out. They're buying them trying to hedge bets on what class is going to use it next year. Campus bookstores would typically have better initial prices (right around finals), while off campus independent stores would be a bit lower initially but would give steady prices even later on after the campus store got done buying all 12 books for a 500 person class. That way they can advertise that they have used books next time around. \n\nWhen Barnes and Nobles owns the campus bookstore; you know you aren't going to get a good chance at a used book or a good buyback price..\n\nPS: just putting this here to add to the comment from the guy above me. Not trying to preach to the choir(him). He[.] right on, I just wanted to elaborate a bit."}