{"doc_id": "1847", "name": "2016_08_humanities_student_major_73_rutgers", "namespace": "we1sv2.0", "metapath": "", "pub": "rutgers", "title": "2016-08-humanities-student-major_73_rutgers.txt", "pub_date": "2016-08-01T00:00:00Z", "Sentiment": "0.066", "Subjectivity": "0.381", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "404", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vmmsw", "Reddit_id": "d60l6fe", "Subreddit_id": "t5_2risk", "Commenter": "felixinfinite", "length": "2452", "content_scrubbed": "CS major here. First, I would say my answer is biased, I have little to no idea about ECE. But I would like to give you a small insight into the field. \"You like coding\" does not mean \"you have to get a CS degree\", but \"getting a CS degree\" does mean \"you have to code, and know how to code.\" Getting a CS degree also sounds like a good jump into a coding career. \n\n \n\nI sure like to recommend you to take a look at a book: [Getting a Coding Job for Dummies!](https://www. amazon. com/Getting-Coding-Dummies-Nikhil-Abraham/dp/1119050944)\n\n \n\nSo being a coding professional, you can choose to get one of these entry-level coding occupations:\n\n- Mobile Developer: code application that runs on mobile devices. Responsible for app performance, user interaction and interface (UI&UX).\n- Software Developer: develop computer programs, code for hardware, software and networking systems.\n- Database administrator: Organize data properly using database software. Make sure data is secured and control authorized access to the database.\n- Web Developer: Design and create websites. \n- Data analyst: Analyze data using statistics and machine learning to generate insights.\n- Quality Assurance analyst: Test program to ensure that features perform according to specifications.\n- etc.\n\nEach job is unique and to move from one to another requires a training period\n(Source: the book I told ya! p. 15)\n\n \n\nIf you are a research-oriented kinda person, you can choose to take a couple of years to do research after graduation. There are a wide range of research fields in CS, say Cryptography/Computer Security, Artificial Intelligence, etc. Taking a research path does mean that you have to specialize in one of those fields.\n\n \n\nNow go back to Rutgers, if you decide to switch to SAS, unfortunately, you will have to take a bunch of core curriculum courses like humanities and stuffs like that. To me, it was a waste of time (sorry, people might actually like it). CS electives are way way better, (and cool too!). The CS major is a credit intensive major. Some classes are project based in which project might range from medium to large. Those projects actually help you grasp the theory aspects in class. The CS electives would, in fact, cover most of the coding occupations I listed above. ( except web developer, this kind of developers mostly self-taught. And I don't feel like they have a class for this role at Rutgers. )"}