{"doc_id": "1855", "name": "2016_08_humanities_student_major_165_india", "namespace": "we1sv2.0", "metapath": "", "pub": "india", "title": "2016-08-humanities-student-major_165_india.txt", "pub_date": "2016-08-03T00:00:00Z", "Sentiment": "0.05", "Subjectivity": "0.417", "Score": "19", "Upvotes": "19", "Downvotes": "0", "Wordcount": "701", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vwn2d", "Reddit_id": "d6277pw", "Subreddit_id": "t5_2qh1q", "Commenter": "core69x", "length": "4161", "content_scrubbed": "Islam will create extreme problems in India and it is one of the most problematic and political religions\n\nhttps://np. reddit. com/r/india/comments/3wruix/if_the_numberpopulation_of_hindoos_and_muslims/\n\nhttps://np. reddit. com/r/india/comments/3wxhp5/askindia_if_the_numberpopulation_of_hindoos_and/\n\n\n\nLots of Indian muslims put or have started to put Islam before their country and that[.] extremely problematic\n\nIncrease in the number of Muslims will lead to eroding of the Dharmic and indigenous identity of the land of India.\n\nIndian muslims have conspired with Muslims from Bangladesh to bring them into the nation all for the sake of religion and no sense of loyalty to the state they live\n\nThis influx of muslims from Bangladesh will heavily damage the fabric India as those people have no sense of love whatsoever for India they only look at it as a launch pad while at the same time they heavily look down upon the culture,religion,practices of land that they have started to live in on and their religion definitely plays a part in this looking down aspect\n\nThe demographic change will be disastrous for the north east and Bengal and the politicians will not do anything about cause all they care about is fucking votes. Hopefuly the somewhat protectionist maybe xenophobic attitude in the north east will allow it to continue to have it[.] distinct identity and not be eroded by the Islamic forces, Bengal seems to be a somewhat lost cause ( maybe their culture not really promoting masculinity much and being more focused on the arts stuff has a influence in this ) Edit - Southern Uttarakhand is also becoming also heavily muslim dominated.\n\nThis purposeful change in demography is also visible in Ladakh where it has been observed that attempts are being made by Muslims to convert Buddhists in to Muslims, so I think center should create Ladkah as a separate state or union territory  \n\n\nDemocracy is holding India back giving voting rights to people who can't think for themselves in the long_term is the best way to put an axe on one[.] own feet. India required a cultural revolution when it was formed it would have removed some of the extremely retarded practices that we carry on.\n\n(This one isn't really controversial as per me) India never existed as a nation it is the basterd child of British Raj, India as a socio cultural unit though similar to Europe existed for a long time and maybe one of the oldest such socio-cultural units, region extends from Pakistan to Bangladesh, the North Eastern region wasn't really part of it it always had it[.] completely separate and distinct identity the only reason it was included in India was because the British drew some lines and saw it fit to call it India (I wonder why the line were drawn in such a manner)\n\nTHere has to be some sort population reduction program specially the Bihar Up region as they have one of the most back ward and disgusting culture and practices every place they go they create some sort of ruckus no wonder randia always has discussions to kick them out lol no wonder Nepal too has a problem with them\n\nThe incarceration rates should be increase and private prisons should be brought on and more death penalties as the saying goes in hindi \"laato ke bhoot baaton se nahi maantey\"\n\nIndia will never become a superpower instead it will be a major source of poo in the loo type memes if things continue to go on the way they are going and our people definitely will become the least respected people in the world\n\nIndian culture is the reason rapes happen in they way they do. \n\nEdit - also on the putting islam before the nation part I forgot to add how for some reason or the other large number of indian muslims have more devotion/respect/love towards other islamic republics like Pakistan, Saudi etc instead of the very country they stand on and their ancestors lived on\n\nBy 2050 when the nation has the largest Hindu and Muslim population, the largest population in the world, the looming water crisis and various other problems I think there will be mass unrest on an unprecedented scale which might even escalate to a civil war leading to further breakup of our nation"}