{"doc_id": "1917", "name": "2016_08_humanities_student_major_674_losangeles", "namespace": "we1sv2.0", "metapath": "", "pub": "LosAngeles", "title": "2016-08-humanities-student-major_674_LosAngeles.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.047", "Subjectivity": "0.288", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "261", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6cqzua", "Reddit_id": "d6crtgg", "Subreddit_id": "t5_2qht0", "Commenter": "EngineerinLA", "length": "1716", "content_scrubbed": "False equivalency. The fact that historically women-only colleges are a prestigious choice for many smart women is a better determining factor. \n\nAlso since when is being in congress a marker of success? Most of them are just rich (senators) or professional politicians, which privileged liberal_arts college grads can afford to enter in to. \n\nThanks for the \"facts\" from an opinion piece by the way. And the Forbes link to the \"30%\" on the Businessweek list of \"rising women in corporate America\" (whatever that means) is to a women[.] college booster site, not Businessweek. \n\nA group of people trying to maintain a status quo that benefits them being biased. Well paint me green and call me broccoli. \n\nAlso this from the article you cherry picked bad stats from:\n\nPhysical and social separation from men is not the goal of a women[.] college; today almost all are in consortiums or close proximity to co-ed colleges.\n\n[Also this:](http://www. forbes. com/sites/ccap/2012/02/16/the-male-female-ratio-in-college/#755f1b415250)\n\nOn a national scale, public universities had the most even division between male and female students, with a male-female ratio of 43. 6–56. 4. While that difference is substantial, it still is smaller than private not-for-profit institutions (42. 5-57. 5) or all private schools (40. 7-59. 3).\n\nOne might ask: \"But maybe there are just more women in the USA?\" From the same article:\n\n It should also be noted that the national male-female ratio for 18-24 year olds is actually 51-49, meaning there are more (traditionally) college-aged males than females.\n\nSo should we get some male only colleges going?! Nope. Creating artificial environments is sticking to old vestiges of sexist stereotypes. "}