{"doc_id": "1968", "name": "2016_08_humanities_student_major_1182_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2016-08-humanities-student-major_1182_changemyview.txt", "pub_date": "2016-08-17T00:00:00Z", "Sentiment": "0.086", "Subjectivity": "0.338", "Score": "132", "Upvotes": "132", "Downvotes": "0", "Wordcount": "1192", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6kysvl", "Reddit_id": "d6l3x9l", "Subreddit_id": "t5_2w2s8", "Commenter": "woxihuan", "length": "6708", "content_scrubbed": "The person you're responding to has put it beautifully. These are all conversations that have applications and context, as compared to the kind of Humanities-based philosophy that takes writing and complexity as its object, and focuses *reflexively* on the person who is writing and their linguistic dexterity. Basically, what it translates to is \"my thinking about this thinking is important, so let me demonstrate that to you and make you work for it so that you'll appreciate me.\" This is *super* complicated, even though though it reads on the surface as \"your writing makes you an asshole.\" \n\nIt[.] tied into, I think, a kind of class inequality - the ivory tower elites have the time and energy for metacognition (thinking about thinking) and linguistic rabbit holes that come from the free time to be really into the details of language. Laypeople and people with practical focii don't have the time to spend on endless nuances and torturous (twisty) grammar. They're busy getting things done, so there[.] no time to dwell on the details. \n\nNow, here[.] the problem: reducing things too much is contagious, and leads to ignoring details, which leads to ignoring people[.] opinions, which leads to ignoring people, which leads to a society of assholes. Broadly - you see how much I'm leaving out with this simple reduction? I do that because I've read the details from Foucault and Berlant and Butler and name-drop, name-drop, name-drop. Having read and studied those detail-oriented (but awful) writers, I can say with a pretty good degree of certainty that A leads to Z. Now, if I'm convincing people about that so that I can write policy about a complicated series of relationships, here[.] the kicker: **I need to be able to talk at both levels.** \n\nI need to give the easy analogy, the one that leaves things out, but as an intellectual, I have a responsibility to know that I'm not bullshitting and that I know my stuff when I'm giving the easy analogy to people who don't need that extra information. I moderate for my audience. \n\n*On the other hand*, I need to be able to read, think, and respond with all the complexity possible because that is my responsibility; that is my sacred trust as an educator, as an intellectual, as a human who has taken on the role of trying to understand humans and make shit better. If I can't do the complex work, reading, and writing, then I am not doing my job seriously enough. \n\nBut I need to take my job seriously, not myself. It happens, in academia: we forget and get caught up, because we're also humans. So our egos come out in our writing. \n\nAlso, it[.] a super-broken, competitive system, so we learn to specialize and be experts so we can have homes, cars, food, and families. We get lost. We get lost in words. We get lost in our brains. We also forget what it[.] like on the other side, when you're new and approaching the ideas in increasing complexity, and how alienating it can be. We get caught up in being experts.\n\nThat[.] okay - it happens. When you turn into an asshole is when you kind of sigh and roll your eyes at the beginner and move on without them. When your important work stops taking the time to define complicated words in parentheses. When you start to flagrantly use more than one semicolon in a sentence. When you adopt the \"up by your bootstraps\" way of thinking. When you start imagining the uneducated as Others and you *want* them to struggle. \n\nAnd guess what? This happens to **all of us**. We all have to work at it. Once we get good at something, we want recognition, whether we're electricians or bodybuilders or Derrida or presidents. It[.] *hard to go back to being an amateur,* because we all want to assure ourselves that we're past that in our one area. It[.] why millionaires haggle for ten percent off shoes. It[.] why Lauran Berlant writes like a asshole. It[.] why ex-smokers cough at second-hand smoke. We need affirmation. \n\nIt[.] also inexcusable that, knowing that, we choose to pretend we were never amateurs. Those people that do that are the jerks. The people that never let up with the jargon, that talk to first years like they're grad students knowing they doing get it, the ones that assume laypeople just need to get a dictionary and work a little harder to look up every second word - they're assholes.\n\nThis is a really important topic for me. I'm white trash, basically. Not a nice term, but I grew up in poverty and in a single-parent home with little educational aspirations because socially, there[.] not a lot of upwards mobility, and my mom never even finished high school. I'm a layperson at heart, foundationally. \n\nBut I worked hard and was lucky, ended up as a teacher teaching five year olds to 15 year olds, and learned how to talk to them. You have to break down big ideas really simply, and it[.] good practice.\n\n And now, I'm a graduate student finishing my MA in English in four months. I really really struggled with the language in our program texts and theory. I still do. I'm not good at bullshitting when I don't understand things, but I noticed that[.] what most people do in academia at this level; fake it until you make it, and then fake it some more.\n\nI don't do that very well. I *can* write and talk like that, but I don't want to for the most part, so I keep my writing pretty simple. However, I still need to understand things at the highest level of complexity to break them down into simple terms. \n\nI had to learn to do this when I was teaching ESL grammar. You have a very limited vocabulary to explain a really complicated rule, so you learn to translate knowledge. I think this kind of knowledge translation is so essential it should be taught as part of all graduate programs.\n\nUnfortunately, it hasn't been, so we have a system full of people who can't translate knowledge and concepts at the top, and a bunch of people who just aren't going to get there at the bottom. In the middle, you have people who can translate knowledge, but not many. Picture an hourglass. It[.] jammed up so that the good ideas just aren't getting down to the bottom to spread out and mix up, and that[.] a problem.\n\nBut the solution isn't to get rid of the complex stuff at the top. We do still need that. The better solution is to emphasize translation and transmission through a middle ground, I think. Really focus on understanding why people write defensively and promoting work that is a hybrid, a mix, of complex and simple. It[.] problematic, because it takes more time and effort, but I hope that if programs and professors can include conversations about this problem as part of their programs, then we can stave off some of the worst asshole writers before they get stuck at that point."}