{"doc_id": "1938", "name": "2016_08_humanities_student_major_897_cringeanarchy", "namespace": "we1sv2.0", "metapath": "", "pub": "CringeAnarchy", "title": "2016-08-humanities-student-major_897_CringeAnarchy.txt", "pub_date": "2016-08-13T00:00:00Z", "Sentiment": "0.128", "Subjectivity": "0.531", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "618", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6gaztl", "Reddit_id": "d6gc8xx", "Subreddit_id": "t5_35j1r", "Commenter": "MrWinks", "length": "3481", "content_scrubbed": "You made some good points so i'll take it further to give you a chance to make the best conclusion. There[.] a whole school of philosophy on this, and it has conflicting views on the function of education, so i'll explain the two common ones and what it would mean under each.\n\nFor the poor or lower class, finding work is vital and they cannot have the luxury of exploring their character and becoming well-rounded people or any bullshit like that. That[.] one view, that the function of education is for allowing people to find work, which in the broader scope can even be said to function as a way to allow people to contribute somehow in some way, which would somehow benefit others or even possibly society (that[.] all kind of a leap but whatever, the view is that the function of it is for people to find work and society to benefit from better skilled or knowledged working people.\n\nAnother view of the function of education is not necessarily to find work, but to be a better overall person in general for one[.] own sake and for society. This is the idea behind the liberal_arts education, which emphasizes on \"[facilitating] close interaction between faculty and students, and whose curriculum is grounded in\" the liberal_arts, which include the arts (music, etc), the physical and social_sciences, philosophy, literature of any and all languages, history, and general humanities courses and such. Basically it focuses on teaching you from a lot of different things so that you learn how to think as a person and be better and more well-rounded. This is argued to be a luxury of people with money and a dream, but impractical to 18 year old Cindy who[.] mom is struggling with two jobs and who needs to find a job to provide for her own baby.\n\nIf someone argues that education is for the sake of society by making better workers, then tax money going to people that take flaky shit like gender studies are probably and totally wasting our fucking money. But then a lot of shit becomes bullshit and argued not to be practical for school at all and I would almost say taht college becomes career training and we'll have a bunch of morons that don't really know shit about history, critical issues, how to write or give a good argument for a paper or report, and would would then hold the keys to the nation with their own votes while only concerned with being empowered to know enough to do work.\n\nIf someone argues that education should be for the sake of making better people who could think and contribute as \"true humans\" that appreciate the modern world[.] complexities (yeah purposefully making it sound this way) then things like gender studies are cool and fine because they could teach people something so long as those fields were not full of shit and actually true to their \"intention\" (because this is the case, since gender studies is often seriously toxic as fuck and full of bullshit biases). But then this would assume people could totally afford to take the time to do this shit and learn this \"meaningless\" shit instead of going straight to work.\n\nSo yeah, that[.] how it often goes. I think personally that it[.] good that we have mandatory schooling for children until highschool, but that there is the option to drop at at a certain age (16?) because some people seriously and absolutely have to go straight into the workforce. What we can take away from that and apply to college, idk, since I know it[.] probably more complicated the more you think about it."}