{"doc_id": "1835", "name": "2016_08_humanities_student_major_13_guitar", "namespace": "we1sv2.0", "metapath": "", "pub": "Guitar", "title": "2016-08-humanities-student-major_13_Guitar.txt", "pub_date": "2016-07-31T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.239", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "286", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vhu8d", "Reddit_id": "d5z624c", "Subreddit_id": "t5_2qi79", "Commenter": "wrigh003", "length": "1604", "content_scrubbed": "I think the lack of general musical literacy of the public at large is a greater existential threat to music in general than the lack of innovation in the construction of the guitar.\n\nAsk some joe off the street whether a chord or scale is major or minor, and you'll get a \"huh?\" 99. 5% of the time. Ask someone to sing anything, anywhere - even \"Happy Birthday\" and you'll get an embarrassed head shake and a bad joke about how you're better off not hearing it. \"Classical composer that[.] not Mozart, Beethoven, or Bach: GO!\" <crickets\n\n*Music* is dying. Not just the guitar. Give your kids piano lessons. Make them listen to old stuff that they wouldn't otherwise hear. Teach them about jazz and blues and why the pentatonic scale was banned by the church.  Speaking of: get them a pair of headphones and cue up a Youtube video of a choir in one of those cathedrals in Europe. Watch their eyes light up as they get chills. Demand support for the arts in the curriculum your school board draws up. This shit is important. Mathematicians and engineers will take our culture to space, I hope, but if we don't adjust some things, there won't be much of a culture to transport.\n\n/rant\n\nRecent innovations:\nfanned fret/ multiscale guitars\n7-8-9 strings\namp emulation that sounds right, finally\nboutique effects pedals making all kinds of crazy sounds\netc. \n\nYou don't have to play a Strat, Tele, or Les Paul if you don't want to, either. I had a great American Standard Tele once upon a time, but have had way more fun with weird Japanese and Korean sort-of Strats and Kinda Pauls ever since. Way more fun."}