{"doc_id": "1903", "name": "2016_08_humanities_student_major_605_guitar", "namespace": "we1sv2.0", "metapath": "", "pub": "Guitar", "title": "2016-08-humanities-student-major_605_Guitar.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.077", "Subjectivity": "0.322", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "349", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6bolui", "Reddit_id": "d6bq8e4", "Subreddit_id": "t5_2qi79", "Commenter": "bhrgunatha", "length": "2071", "content_scrubbed": "Despite OP saying it[.] self-paced, I don't think it is a self-paced course (where you can watch the videos and take quizzes at any time). it doesn't show up in the catalogue when you select self-paced courses in Humanities.\n\n**Time:** Some courses run in sessions and the deadlines are set for a particular session e. g. Week 1 to be completed by 10th August. if you miss a deadline, you can continue with the material and then wait and automatically join the next session to catch up with the missed assignment. It may be that all courses are session based now they are all on the new platform.\n\n**Enrolment:** You will **not** stop anyone from enrolling if you do sign up - there are no limits (that I know of) for participation. As far as I know you can \"audit\" all courses for free, but some courses won't allow you to take exams or have quizzes marked unless you pay.  \n\n**Effort:** I took the very first run of this course - I've played classical guitar for many years and could already read and understand music notation. I took it for the theory. Despite the title using Fundamental and claiming to be for beginners, it is an extremely dense course. For example if you're a guitarist that knows some basic chords and reads tabs, but not music, you will find it *extremely* challenging. Fundamental means they literally start from scratch and teach you notes, time, simple and compound meters, time signatures and complex counting, clefs, scales; major, minor (natural, harmonic and melodic), key signatures, modes, intervals, chords and inversions, triads and sevenths, modulation, cadences,  melodic and harmonic analysis. The quizzes and exercises weren't simple multiple choice rote learning, they're designed to fully test your understanding of the material. This leads to the final exam where you submit a harmonic analysis of a movement of a classical piece of music. \n\nIt[.] a very intense, but very rewarding course. \n\nIf that[.] too much, you can always simply download the videos and material to absorb later without taking part in the quizzes and exam. \n\n"}