{"doc_id": "1973", "name": "2016_08_humanities_student_major_1224_dallas", "namespace": "we1sv2.0", "metapath": "", "pub": "Dallas", "title": "2016-08-humanities-student-major_1224_Dallas.txt", "pub_date": "2016-08-17T00:00:00Z", "Sentiment": "0.077", "Subjectivity": "0.341", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "574", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6lbpwo", "Reddit_id": "d6lhnxf", "Subreddit_id": "t5_2qnkr", "Commenter": "dallaschap", "length": "3328", "content_scrubbed": "The bigger picture? The bigger picture here is that you are not going to magically convince people to walk, bike, or take public transit by artificially restricting the supply of parking. That[.] simply not how it works. If you want to encourage the use of other transit methods, you need to make those methods better so that people have less of a demand for parking.\n\n You think that by building parking garages, you encourage people to drive, but this is wrong. The reality is reversed. People want to drive, and that demand encourages developers to build parking garages.\n\nI think you're incorrectly lumping everyone into one category.  Yes, by not building this parking garage, there will be certain subset of DFW residents who will likely never visit this park.  But for those people, literally 99% of the metroplex caters to them (car-friendly, ample parking, and minimal walking).  Why spend so much money and effort trying to change the 1% of the metroplex that isn't convenient for this group of people?  Can this group of people not utilize the free parking at West Village along with the free Trolley? \n\nThe bigger picture is that we are not at a point as a city where we can satisfy everyone[.] needs by pretending that cars don't exist. Progress demands a balance of investment in both car-oriented development and pedestrian-oriented development. And the great thing about this proposal for KWP is that it does both.\n\nTake a look at the metroplex.  It[.] entirely car-oriented, with VERY FEW pockets of pedestrian-oriented areas.  Even our pedestrian-oriented areas are pathetic when you compare them to other major cities.  The scale is completely tipped in favor of cars, which is why I'm so strongly against pushing it even further in that direction when it comes to our most successful pedestrian project ever.\n\nAnd no, parking does not inherently harm the park. You say that \"more cars will zip in and out of downtown\", but why? This proposal would actually remove car traffic from downtown bevause parkgoers won't have to drive around the Arts District to seek parking anymore.\n\nIf there is less parking, those people driving around for parking, may decide that it might be easier to take public transportation next time, thus removing cars from the road all together.  Yes, in some cases, what you're saying is true.  In the long_term, less parking will encourage people to start considering other modes of transportation, which is what Downtown needs.\n\nYou also say that this parking garage will take up prime real estate, and thats correct. But you're incorrect in saying that it could be \"better used\" by shops and restaurants - without this parking garage, that entire proposed section of the park is going to stay a big canyon with a highway in it. I don't know how you measure \"better used\", but IMO a parking garage + pedestrian bridges + restaurants and shops is a much better use than keeping that space as a big hole in the ground.\n\nLet it stay a big canyon then.  Let[.] build the extension later when it[.] feasible to do so without the garage.  I'm in no hurry to extend this park.  KWP is such a small (albeit significant) part of Downtown, so I'd rather see more of an effort spent on bringing some of that energy to other parts of the area.  The recent changes to the Art Museum was a good start."}