{"doc_id": "110", "name": "2016_06_humanities_student_major_1120_compsci", "namespace": "we1sv2.0", "metapath": "", "pub": "compsci", "title": "2016-06-humanities-student-major_1120_compsci.txt", "pub_date": "2016-06-16T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.38", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "647", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4o8ioh", "Reddit_id": "d4bc9eh", "Subreddit_id": "t5_2qhmr", "Commenter": "watchinggodbleed", "length": "3609", "content_scrubbed": "I'm at a big research University now, and while it wasn't for CS, I attended a small, liberal_arts focused boarding school from middle to high school. So I have some level of experience from both sides, at least in the general school atmosphere.\n\nResearch\n\n* Tons of opportunities for anything you could want, with massive resources to boot.\n* Largely impersonal. Depends on the size of the CS department, but no one in my classes are really friends with each other, and you typically only know the teacher if they're good. \n* Teaching is second to research. There are a few really good instructors, but they typically get snapped up quickly to go work at the Big 4. And the ones left have a quota of research papers to write and just want you to do the homework and get the fuck out. People are here cause they want to do research or are looking for an in between job, not to teach.\n* There are recruiters and professors looking for students to get on their projects constantly, I get emails about once a week from people who are hiring or looking for research assistants.\n* Enormous, 30,000 kids at my school, but can get upwards of 70,000. Plenty of new people to meet and ways to reinvent yourself. \n\nLiberal Arts (high school, atmosphere is similar though judging from friends who attend small liberal_arts colleges now) \n\n* You will get to know everyone very well. You'll come to your teachers' house and babysit their kids for some extra cash. They will become your friends. Or else you'll be very lonely. \n* People came here because they enjoy learning and enjoy teaching it to you.\n* Depending on who your professors know and how well known the school is, you might be overlooked by employers or professors looking for research assistants, not because it[.] a bad school, but because it[.] 2,000 people and in the middle of bumfuck Ohio.\n* Tiny. What bonds you form will be intense, but there[.] no where to run should you not like who you're around or those bonds break. \n\nI would go back to a liberal_arts atmosphere if I could. There the focus is intensely on learning the material and making education a wholesome and enjoyable experience for everyone. There might be more immediate opportunities at a big research University, but few teachers give a shit, and a lot of the time I feel as if I'm paying them a bunch of money to get the same experience I could punching terms into Google, and a lot of the time Google ends up being the better instructor. This is strictly for undergrad though, I wouldn't know about a masters. And my experience at my school ensures I won't be coming back to find out. \n\nEdit: I did think of another benefit to being in a big research University, the fuck off attitude causes you to grow and mature more in my understanding. This could be just a difference in my family/financial situation, but liberal_arts environments can lead to lots of coddling. They're such tiny and insular environments they're almost like little sanctuaries that forgot the outside world doesn't have cleaning staff or school supplied housing. My friends from high school are often in nice dorms or school provided apartments, which they never have to think about. I on the other hand asked my university where the dorms were my second year, to which they replied with a \"fuck you kid\" and kicked my still-soft bum off into the city to find an apartment where the pipes rattle to the 24/7 sounds of the motherfucking coal plant 50 yards away from my room. You have to become an adult quickly, perhaps quicker than you like to, but the lesson has to happen someday, and might as well be then. "}