{"doc_id": "1920", "name": "2016_08_humanities_student_major_699_giftofgames", "namespace": "we1sv2.0", "metapath": "", "pub": "GiftofGames", "title": "2016-08-humanities-student-major_699_GiftofGames.txt", "pub_date": "2016-08-11T00:00:00Z", "Sentiment": "0.142", "Subjectivity": "0.443", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1499", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4x58k8", "Reddit_id": "d6d5sz9", "Subreddit_id": "t5_2tb4r", "Commenter": "JayTheWalker", "length": "8671", "content_scrubbed": "[Mfw I see this post](https://www. youtube. com/watch?v=U6MlaIe1ljs)\n\n\n\nI cannot begin to describe how much I want Deus Ex: Mankind Divided. I've been a fan of the series for half a decade now, I own all of the games (except Mankind Divided, obviously) and am working to complete my collection of the books and comics. It is by far one of, if not my absolute favorite franchises and it[.] hard to overstate how much I enjoy it. I've been watching Mankind Divided like a hawk since the day the trailer first leaked and can safely say that even if it[.] not everything the marketing says it will be, I'll still love the latest Deus Ex experience regardless of how garbage it could be. I mean that; I actually enjoyed even Deus Ex: The Fall.\n\n\n\nMankind Divided takes everything I love about the series and redefines it, it brings Human Revolution and the original full circle and unites the franchise both gameplay-wise and story-wise. Bear with me, I'll explain later what I mean by that, but the way they've executed the changes to the art style, gameplay and the progression of the overall plot is just perfect IMO. They've made the levels bigger and more densely packed with detail, the largest level is around a square kilometer in size! The choices have more consequences, and the environment will evolve to match your actions (killed all the civilians in Prague? Watch everything get boarded up and closed down, and prepare for a psych evaluation from your Interpol buddies). For instance, in the speech confrontation with Talos Rucker, he'll respond to your actions earlier in the level. If you killed his men to reach him, he'll be more resistant to attempts to persuade him and will use your actions against you. If you played it carefully and knocked out his men instead of killing them, he'll be more open to reason. Speech confrontations never happened like this in Human Revolution, only what you said and did in the conversation would ever matter and the original Deus Ex didn't had confrontations where you could convince them with your words, but it did have consequences for your actions on a greater scale than Human Revolution.\n\n\n\nFrom what[.] been shown there[.] been a huge departure gameplay-wise from Human Revolution, and I can't wait to try it out. Instead of the battery system for your augmentations you have a single bar displaying how much energy you have, a la the original Deus Ex and Dishonored. Some augmentations restore power after use, others don't. On top of the returning augmentations from Human Revolution, now there[.] the Titan Shield, remote hacking, Icarus Dash, Tesla gun arm, nanoblade launcher, explosive nanoblade launcher, taser tracking flechettes and even more they haven't revealed yet, and they're going to be awesome to mess around with. I'm not usually a big fan of combat-focused builds, but now that the Titan Shield is a thing I'm definitely going to change that on my second playthrough. They've brought back ammo variations as well, such as EMP rounds which can disable electronics (robots, tripwires, augmented people, etc). There[.] been a large focus on making the environments a playground for you and your tools, much like it was in the original Deus Ex; more than just the power bar and the ammo they've brought back Biocells (which can be used to charge up your power bar OR power up objects in the environment) and Multitools that can hack keypads you wouldn't have been able to hack otherwise. Weapons can finally be modified on-the-fly, and the upgrades aren't objective benefits to have, they have a time and place for their use. There[.] so much more versatility and options to how you react and utilize the environment, and it[.] blown me away because it wasn't something I expected them to do.\n\n\n\nThe art style changes are phenomenal, they've refined Human Revolution[.] style and given it a more bulky, dystopian look. The cyber-renaissance aspect is still there and plain as day, but the environments are also more complex and filled with hidden nooks and secrets. Locales are brimming with detail, each area has its own culture and flavor to it, like the tight, claustrophobic, dirty and make-shift corridors of Golem City that are flooded with litter, cables and makeshift art to bring a bit of happiness to its dreary inhabitants, or the more open and natural scenery of Prague, blending classic buildings with sharp and defined high-tech machines. But more than that, they've taken so many steps to reunite the artstyle of Human Revolution with Deus Ex. The darker colors and bulky machinery still look near-future but also feel like they wouldn't look out of place in a graphical overhaul of the original Deus Ex. As a fan who was a bit annoyed at the discrepancy between the two I couldn't be happier with their art department. It might not be as beautiful as Rise of the Tomb Raider, but with how much though and effort has been put in I can't complain. Adam Jensen[.] apartment belongs in r/RoomPorn even more than it did before.\n\n\n\nThe story is, naturally, a continuation of Human Revolution. So many long-standing questions are about to be answered, like what David Sarif has been up to or if Malik died or not. We finally get to see the Juggernaut Collective in action, and potentially a reveal of who their leader, Janus, is. Then in Breach mode there[.] all sorts of lore goodies coming out, like some possible hinting at VersaLife experimenting with the Gray Death after they've been involved in some unexplained test subject deaths. It[.] been rumored  by the community that this is where we start to see the Illuminati falling and Majestic 12 taking its place and I can't wait to see it in action. In general I just really want to know what happens next and be introduced to another cast of well-thought out characters and a world overflowing with depth, atmosphere and believability. I can't begin to describe how excited I am to see what happened after the Aug Incident at the end of Human Revolution.\n\n\nMankind Divided is just everything I've wanted out of a Deus Ex sequel. New choices, new locations, new experiences, new music, new weapons, new augmentations, new everything. Deus Ex games have always been tightly knit yet expansive stories, and you've always been able to choose the way you want to play. As a series that isn't technically open-world, it[.] got more freedom than most games that actually are. They're always so well realized and believable, and you always have the choice of how to act and who to be. It[.] always been the perfect franchise for me: choices have consequences, well-thought out stories and lore, believable characters, physical augmentation, conspiracy theories, mystery and action all rolled up into a sci-fi near-future setting. I've loved the series since I first laid eyes on it and I've loved everything about Mankind Divided from the word go.\n\n\n\nOver the past few years ever since I got into gaming I've always had to miss out on Launch for some reason or another. Metro Last Light, too young for the R rating and my PC wasn't good enough; Arkham City, didn't have enough money; Human Revolution, didn't have enough money; Halo 5, didn't have an Xbox One; Fallout 4, PC wasn't good enough; XCOM 2, didn't have enough money and my PC wasn't powerful enough. Even the first game I seriously got into, LEGO Universe wasn't even available in my country for a year. I've missed out on every major release each year and had to sit back and wait for years or suck it up and watch a playthrough, and now Mankind Divided is my first chance to be there and be part of the excitement of a game[.] launch, the laughing at random glitches and the shock of how the game[.] story went down. I really don't want to have to play catch-up again or get spoiled on the events of the game, leaks are already out and about and I don't want to have to shut out the series for months again.\n\n\n\nI'm sorry, but I don't know much cyberpunk outside of Deus Ex to offer. While I don't think it should count, Hacknet is considered cyberpunk by Steam and it[.] a very fun, cheap game that will give you a few hours of entertainment.\n\n\n\nSorry for the enormous post. I just really want to get Mankind Divided, it would mean the world to me.\n\n\nUnfortunately, you never specified if this is an RNG-based giveaway, so after having written approx. 1,400 words over three days on why I want Deus Ex Mankind Divided I really [hope the RNG is merciful.](https://youtu. be/yhIVJdp4u48?t=14s) \n\n\n\nSteam ID:\n\n\n\nEven if I don't win, I want to thank you for doing this giveaway. A lot of people can't afford to buy AAA games at launch and you will have made someone[.] year brighter, so thank you :)\n\n"}