{"doc_id": "104", "name": "2016_06_humanities_student_major_1097_compsci", "namespace": "we1sv2.0", "metapath": "", "pub": "compsci", "title": "2016-06-humanities-student-major_1097_compsci.txt", "pub_date": "2016-06-15T00:00:00Z", "Sentiment": "0.156", "Subjectivity": "0.364", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "742", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4o8ioh", "Reddit_id": "d4atrww", "Subreddit_id": "t5_2qhmr", "Commenter": "perib", "length": "4140", "content_scrubbed": "I go to a small liberal_arts school for cs and it[.] been great! I second most of whats already been said, where you go to undergrad isn't as important as you'd think. No matter where you go you can still get into a good grad program or a good first job which will have more of an influence on what you could do. That being said, I personally believe that there are many advantages to a small liberal_arts college, it may in fact be better than a large university for undergrad.\n\nDo you know what area of research you could be interested in? That would be important in making a decision.\n\nIf you don't know what exactly you want to do (which, lets be real, you don't. You may think you do, but you don't. You'll change your mind many times throughout college as you get new experiences. Trust me.) then a liberal_arts college is a great place to explore and try new things. Being well rounded is very useful, especially in cs. You may know how to code, but if you don't know anything about the world and can't apply it, you're useless.\n\nA liberal_arts college will give you a broad perspective on a lot of subjects. This is great for research because often you'll get someone who specializes in one small thing, but then they struggle to expand their thinking in new ways, or are missing key skills needed in research. (ex, neuroscience majors who can't math for their life. They're pretty much useless irl for most labs) I see this way too often.  \n\nYou can definitely find research experience at a small college, but you do have to be proactive about it. Do your research into what professors are doing there in your field of interest. I have had a lot of success getting opportunities. An advantage of a small school is that you do have a LOT more contact with teachers, even outside your department. This makes it a lot easier to get to know other people[.] research, expand your horizon, and network for positions. I've gotten to know professors well who have influenced me and written great letters of recommendations (well I assume cause I got in to places). My college is known for sending people into phd programs, but several students each year also go work for companies like Google, Microsoft, Oracle etc. Every year we get recruiters from these companies. (Alumns especially). \n\nI can share my experiences and how a liberal_arts college has help me. At first, going into my first year I thought I would like to be a biology/premed major. So I took those classes. Then I became interested in neuroscience, so I took some of that too. Eventually I realized I really enjoyed math and compsci as well, because the computational aspect of neuroscience was the type of work I liked best. So I then I decided to major in computer science. So I'm only halfway through college right now but I have a lot of neuroscience and computer science experience which has been a huge advantage and helped me into some competitive programs/opportunities. I feel like at another school I wouldn't have had the opportunity to try as many new things and find my niche. \n\nThe summer after my first year I got into a neuroscience program which was a good jump start on my resume. The past year I worked in a neuroscience lab at college where I used my cs skills to program a task and my neuro knowledge to analyze the results. Currently I'm at a computational neuroscience lab as part of a competitive summer program. The lab I'm in develops computational neural network models of brain activity, and I'm actually writing code to do things too! It[.] very exciting. And this coming year I'll be working with a professor who does machine learning. I feel like having both a neuroscience and computer science background has definitely gotten me into these opportunities, I would not have been able to be useful in these labs without a solid foundation in both. A liberal_arts college has definitively prepared me for doing real work in this field. \nI'm kinda just rambling, so apologies.\n\n Feel free to pm me with any questions! I've been through this process and seen others through it, it[.] stressful, so let me know if there[.] anything I can do to help!\n"}