{"doc_id": "139", "name": "2016_06_humanities_student_major_1351_sooners", "namespace": "we1sv2.0", "metapath": "", "pub": "sooners", "title": "2016-06-humanities-student-major_1351_sooners.txt", "pub_date": "2016-06-19T00:00:00Z", "Sentiment": "0.108", "Subjectivity": "0.389", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "505", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4ox9mg", "Reddit_id": "d4gd8vz", "Subreddit_id": "t5_2r5kj", "Commenter": "CrimsonYllek", "length": "2893", "content_scrubbed": "Don't worry: about 90% of your fellow incoming classmates will be having all the exact same thoughts between now and August. You're right on schedule, as far as these things go. Here[.] how you make it through your first year:\n\nFirst, doing well in class is your top priority. \"Sorry, I can't, I've gotta study,\" should always be an acceptable excuse both with friends and family. This is why you're here, this is why you're spending all this money, and this is what[.] going to have the greatest long_term impact on your life, either positive or negative. Go to every class and you'll already be ahead of half the class. Do the most basic reading/prep for class and you'll be in the top 25%.\n\nSecond, that said, do well in school but don't expect to be the best in school. You're in a big pond, now, and if you spend too much time comparing yourself to others you'll always find someone who is amazing at this or that (while overlooking the fact that most would like to be as good as you at a bunch of other things). And while school is your top priority it is not your only priority. Meeting people, being social, and pursuing other hobbies is important, too. In fact, nearly all of the most important lessons you'll learn at this stage of your life will come from outside any classroom.\n\nThird, the best way to meet people in college is through shared interests and activities. And the easiest way to find that is through groups and clubs. If you're passionate about something (or even just kind of curious), someone else is too, and they've probably already organized a club for it. Show up, shake someone[.] hand, participate, and voila. You'll be rolling in new friends in no time.\n\nFourth, regarding parties, yes, you'll get invited. Sometimes you'll come across an open invitation. Show up, hang out, don't start any arguments or break anything, and you'll probably be invited back. But you should know parties are really, really overrated in my book. They're loud, messy, sometimes unexpectedly dangerous, terrible for meeting people, often filled with drama and politics, and overall a waste of time. They're rarely like what you see on TV where everyone is having fun and a bunch of crazy things happen. Usually it[.] a bunch of people crammed into a sweatbox of a room awkwardly yelling at each other, all trying desperately to be impressive, and coming up with lame excuses to drink dangerous levels of alcohol so they can try to block out their self doubt. You'll make much better memories hanging out with a handful of people, watching movies or playing games, sharing experiences and genuinely getting to know each other.\n\nFinally, take a few classes totally outside your major. If you're a STEM major, take a few philosophy classes, or some ancient history. If you're a Liberal Arts major, try Physics or Astronomy or Zoology. You'll probably be glad you stepped outside your box."}