{"doc_id": "155", "name": "2016_06_humanities_student_major_1473_asktrumpsupporters", "namespace": "we1sv2.0", "metapath": "", "pub": "AskTrumpSupporters", "title": "2016-06-humanities-student-major_1473_AskTrumpSupporters.txt", "pub_date": "2016-06-21T00:00:00Z", "Sentiment": "-0.066", "Subjectivity": "0.365", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "705", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4imcma", "Reddit_id": "d4iqalv", "Subreddit_id": "t5_3cr3o", "Commenter": "FLSverker", "length": "4758", "content_scrubbed": "It[.] hard to imagine the problem behind one strict, uniform curriculum until you think about education in practice. \n\nThe U_S is full of multiple different approaches to education. Common_Core threatens to center that to just one approach. There[.] a difference between creating a barebones minimal standard and adopting a uniform approach, which is what Common_Core strives to do. And it[.] dangerous.\n\nEvery approach to education is bound to have problems where some misconceptions are promoted, yet they get corrected thanks to the diversity of educational approaches in the U_S. People interact with each other, share their knowledge, and then life continues on. Some misconceptions are harder to disprove than others, but with the internet, the difficulties of communication are lowered significantly, and the correct information spreads faster. \n\nNow, after Common_Core is implemented, imagine what will happen when it churns out a generation of kids with many misconceptions? With such uniform ignorance, there will be a slow dissemination of the correct ideas! People who thought differently would be viewed as crackpots. The ramifications could be severe for economic growth, political literacy, etc. Yes, ignorance would get even worse than from today. It[.] a step backwards. \n\nAnd we already know that Common_Core standards are somewhat garbage, as you can tell from the widespread outrage against it. [There are significant problems in its English and math education](http://poorrichardsnews. com/michelle-malkin-has-the-facts-about-common-core/). Common_Core is largely experimental, inadequate, and in many cases, incomplete. \n\n-- -- \n\nMath:\n\nStanford University professor James Milgram, the only mathematician on the validation panel, concluded that the Common_Core math scheme would place American students two years behind their peers in other high-achieving countries. In protest, Milgram refused to sign off on the standards. He[.] not alone.\n\nProfessor Jonathan Goodman of New_York University found that the Common_Core math standards imposed \"significantly lower expectations with respect to algebra and geometry than the published standards of other countries.\"\n\nUnder Common_Core, as the American Principles Project and Pioneer Institute point out, algebra I instruction is pushed to 9th grade, instead of 8th grade, as commonly taught. Division is postponed from 5th to 6th grade. Prime factorization, common denominators, conversions of fractions and decimals, and algebraic manipulation are de-emphasized or eschewed. Traditional Euclidean geometry is replaced with an experimental approach that had not been previously pilot-tested in the U_S\n\n-- --\n\nEnglish:\n\nTake the Common_Core literacy \"standards.\" Please. As literature professors, writers, humanities scholars, secondary educators and parents have warned over the past three years, the new achievement goals actually set American students back by de-emphasizing great literary works for \"informational texts.\" Challenging students to digest and dissect difficult poems and novels is becoming passe. Utilitarianism uber alles.\n\nThe Common_Core English/language arts criteria call for students to spend only half of their class time studying literature, and only 30 percent of their class time by their junior and senior years in high school.\n\nUnder Common_Core, classics such as \"To Kill a Mockingbird\" and \"The Adventures of Huckleberry Finn\" are of no more academic value than the pages of the Federal Register or the Federal Reserve archives — or a pro-Obamacare opinion essay in The New_Yorker. Audio and video transcripts, along with \"alternative literacies\" that are more \"relevant\" to today[.] students (pop song lyrics, for example), are on par with Shakespeare.\n\nEnglish professor Mary Grabar describes Common_Core training exercises that tell teachers \"to read Lincoln[.] Gettysburg Address without emotion and without providing any historical context. Common_Core reduces all 'texts' to one level: the Gettysburg Address to the EPA[.] Recommended Levels of Insulation.\" Indeed, in my own research, I found one Common_Core \"exemplar\" on teaching the Gettysburg Address that instructs educators to \"refrain from giving background context or substantial instructional guidance at the outset.\"\n\nAnother exercise devised by Common_Core promoters features the Gettysburg Address as a word cloud. Yes, a word cloud. Teachers use the jumble of letters, devoid of historical context and truths, to help students chart, decode and \"deconstruct\" Lincoln[.] speech.\n\n-- -- \n\nAs you can probably tell, Common_Core is probably fucked. And while I understand the sentiment, since the American education system needs a serious form, this is **not** the way to do it. "}