{"doc_id": "49", "name": "2016_06_humanities_student_major_479_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2016-06-humanities-student-major_479_AskAcademia.txt", "pub_date": "2016-06-06T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.351", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "346", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4mv6cm", "Reddit_id": "d3yns63", "Subreddit_id": "t5_2sakj", "Commenter": "lneutral", "length": "1875", "content_scrubbed": "I was in almost your exact position three years ago at a small university in Ohio. I can't claim to have definitive answers, but here[.] my two cents:\n\n1. Use questions to demonstrate your interest in the position, alignment with their institutional philosophy, and yes, practical things like what books the previous professors used. Don't worry - if you get the job you can always ask more questions later. See if you're a good cultural fit, because that[.] one of the reasons you get interviewed.\n2. You might get asked about your own graduate work. I did, a lot. Remember the high points and low. What lessons did you learn, and what advice would you give students that you wish you had? Also, be ready to reflect on any past teaching you did - things like TA'ing labs or lectures you gave.\n3. Mine was not super high, and almost impossible to negotiate, but then again, it was a liberal_arts school under some financial difficulties. It was around $55,000. I hadn't finished my PhD yet when I was hired, so I was told it would be bumped up and I would receive a promotion when I defended, but I don't know if that[.] standard practice.\n4. A suit is always acceptable, but especially if they want you to give a lecture as part of your interview (which was the case) or if the day is long (also the case) don't be afraid to take the coat off and roll up the sleeves. Khakis are probably okay, especially if professors teach in jeans there. Ask: is this the kind of department that would get hung up on the difference between business casual and formal?\n5. I don't know how to answer this. You could probably express interest in starting as early as possible, especially if it isn't just \"I need money,\" but you can come across as enthusiastic.\n\nGood luck! If you get it, I hope you'll find it a rewarding experience. I miss teaching a lot, even if I was only there for a year."}