{"doc_id": "13", "name": "2016_06_humanities_student_major_133_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2016-06-humanities-student-major_133_AskAcademia.txt", "pub_date": "2016-06-01T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.255", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "324", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4m4p1f", "Reddit_id": "d3sm6yr", "Subreddit_id": "t5_2sakj", "Commenter": "girlscout-cookies", "length": "1721", "content_scrubbed": "This is undergrad, right? Then no. \n\nI mean, first, I doubt they'll give it back to you. But either way, no.\n\nI also picked a Big 10 state school over a pricey liberal_arts college, and graduated debt free. I cannot, cannot, *cannot* overstate how much not having student loan debt changed my life. It gives you so much flexibility after you graduate: when you don't have student loan payments cutting into your income, or you don't have the frantic pressure to find a job right away that will let you even *make* those payments, you can do a lot more. I'm now in a PhD program. A PhD program would have been a much riskier endeavor if I also had $50,000 of loan debt waiting for me at the end of it, and I probably would have done something else.\n\nAnd not having to work during school? That means that all the hard_work you put into college is all going straight to your education-- I know plenty of people who worked really, really hard in college, but a lot of that work was just spent trying to make a living and get through in four years. They worked as hard as I did, but my work went farther because I got to spend most of my energy focused on academics (and the jobs I did have were jobs like being a writing tutor and a research assistant).\n\nFinally, Purdue is still a *very* well-respected school, esp. in the Midwest. You'll get a good education there; what you're paying $40,000 is prestige, and I don't think it[.] worth it when you have the option to avoid debt entirely. When you apply to grad school, people will notice that you went to Purdue-- my Big 10 school (Iowa) is not as highly ranked as Purdue but people still know my professors and know where my degree came from. School[.] what you make of it. "}