{"doc_id": "1940", "name": "2016_08_humanities_student_major_923_roanoke", "namespace": "we1sv2.0", "metapath": "", "pub": "roanoke", "title": "2016-08-humanities-student-major_923_roanoke.txt", "pub_date": "2016-08-13T00:00:00Z", "Sentiment": "0.173", "Subjectivity": "0.415", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "471", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6go56s", "Reddit_id": "d6gqw97", "Subreddit_id": "t5_2s6k8", "Commenter": "primetyme00", "length": "2652", "content_scrubbed": "I've lived in Roanoke county (10 minutes from the city) for 10 years.  Here is a breakdown:\n\n**Crime:** I never ran into shady people, been robbed, or felt threatened.  I did not live in the city, but I was in Roanoke county which was 10 minutes from downtown.\n\n**Pollution:** This is not an issue.  There really isn't pollution downtown or in the county.\n\n**Town:** Town itself is fairly stagnant.  It isn't going up or down really.  It may be good for the arts, but there isn't much in the way of tech.  It does have a small town feel, but everything is in walking distance.  In my 10 years, the city hasn't changed all that much.  With that being said, there are festivals pretty much every month.  \n\n**Food:**  If you like eating out, I found restaurants are fairly cheap, and there are a good amount of kid-friendly places.  You can easily find a go-to place for when you can't decided what you want to eat.\n\n**Shopping:**  There are two major malls, but both are, in my opinion, going downhill.  Tanglewood mall is a small, clean mall that doesn't offer a lot (but it makes a nice indoor walking circle.)  Then there is Valley View, which is the 'big' mall.  They have your standard stores around there.  Downtown has shopping as well, but many of the businesses are open for a short time, shut down, and new businesses open.\n\n**Groceries:**  Kroger and Food Lion are the majors.  I liked Kroger because I could get discounted gas.\n\n**Traffic:**  Traffic really can only get back on the interstate after the workday ends, and around the Valley View shopping area.  It isn't terrible, but it has gotten worse over the years.  Roanoke isn't huge, so traffic isn't too much of an issue.\n\n**Schools:**  There are a variety of schools.  There are good schools on both the north and south side of Roanoke.  Salem also has a good school.\n\n**People:**  Generally nice.  I wouldn't say it is a very diverse place.  You can see the full gamut if you go people watch at the Valley View Wal-mart :P  Not that it is a bad thing, but I'd almost be that there are more people there with tattoos then without :)\n\n**Entertainment:**  There are live bands, several social dance clubs, running groups, hiking, boating, etc...  You can find softballs leagues, volleyball, and some pretty good frisbee golf courses.  I didn't have much of a problem finding things to do.  Again, since Roanoke isn't huge, it makes getting to places to do things pretty easy.\n\nOverall, Roanoke isn't a bad place at all.  I met my wife, and had a son there.  We moved away from Roanoke, but we do still miss it there.  If you have a good, stable job lined up then you'll like it there.\n"}