{"doc_id": "183", "name": "2016_06_humanities_student_major_1741_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2016-06-humanities-student-major_1741_politics.txt", "pub_date": "2016-06-24T00:00:00Z", "Sentiment": "0.118", "Subjectivity": "0.388", "Score": "27", "Upvotes": "27", "Downvotes": "0", "Wordcount": "232", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4mt7q4", "Reddit_id": "d4mtzg0", "Subreddit_id": "t5_2cneq", "Commenter": "ReadySettGo", "length": "1479", "content_scrubbed": "I actually agree with many aspects of what you're saying, but the *current* regime where we guarantee loans provided by third parties rather than simply subsidizing the cost of tuition makes no sense for students at all -- it only benefits a class of middlemen. \n\nIn addition, I would even advocate straight-up price controls on tuition. College education isn't a physically scarce commodity like Cadillacs or iPhones. The cold, hard economic value of college degrees really comes (in my view) from the [signal that a formal degree sends to employers that a college grad is likely to be a good employee.](http://www. econtalk. org/archives/2014/04/bryan_caplan_on. html) This further addresses the point you made about the relationship between formal education and having an educated society, and it[.] the reason why your earnings potential won't suddenly skyrocket if you watch an Open Lecture series from Yale on Youtube, hence giving you essentially the same training that Yale grads have but without the certification. \n\nI also personally think we need to encourage more people to go into vocational and technical training rather than traditional four-year universities. You don't need a liberal_arts education to lead a happy or a fulfilling life, and frankly encouraging too many people to get them simply dilutes their value. \n\nI don't necessarily agree, however, that the person getting the education should pay for it directly and I would be happy to elaborate if need be. "}