{"doc_id": "1935", "name": "2016_08_humanities_student_major_889_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2016-08-humanities-student-major_889_ApplyingToCollege.txt", "pub_date": "2016-08-13T00:00:00Z", "Sentiment": "0.016", "Subjectivity": "0.321", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "259", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6g7z2w", "Reddit_id": "d6g9az0", "Subreddit_id": "t5_2y2r8", "Commenter": "remithehobbit", "length": "1450", "content_scrubbed": "* I remember putting down some interdisciplinary medical-related major. The reason was because they wanted my SAT IIs to be related to my major, and I'd only taken subject tests in the humanities. \n\n* At both Penn and NYU I applied to their College of Arts & Sciences. \n\n* \"Why Penn?\" was the prompt, or something along those lines. I wrote about why I was interested in my intended major and my medical experiences in Nepal; I also wrote about some of their extracurricular opportunities I was interested in.\n\n* Yes, I was also accepted to NYU[.] Shanghai campus as my second choice. I did not put down Abu Dhabi as I had no interest in studying there.\n\n* UPenn was really pretty. I was only there for a few hours so I can't speak to it too well. Lots of traditional red brick – lots of open green spaces. UofT St. George is in the middle of downtown Toronto, huge mix of pretty and ugly buildings. I only saw NYU from the top of a bus on a hour of NYC during Columbia admit weekend. It[.] way downtown, 100% urban, complete lack of campus.  \n\n* NYU gave me nothing, Columbia[.] FA set my family[.] contribution down to less than $5K US plus a scholarship to waive my work-study contribution for my first two years.\n\n* I applied to all the Ivies (rejected all except Brown, deferred), and Stanford (rejected), Rice (rejected), USC (rejected), a bunch of the UCs (accepted all), UofT (accepted), McGill (accepted), UBC (accepted), Queen[.] (accepted)."}