{"doc_id": "1969", "name": "2016_08_humanities_student_major_1187_relationships", "namespace": "we1sv2.0", "metapath": "", "pub": "relationships", "title": "2016-08-humanities-student-major_1187_relationships.txt", "pub_date": "2016-08-17T00:00:00Z", "Sentiment": "0.095", "Subjectivity": "0.257", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "443", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4y5u4o", "Reddit_id": "d6l5r0n", "Subreddit_id": "t5_2qjvn", "Commenter": "delta_14", "length": "2361", "content_scrubbed": "It sounds like this is a dealbreaker for you. I had the same situation with an ex of mine. I'm similar to you--I'm naturally ambitious, I work very hard to achieve my goals, and for the most part I've done very well. \n\nMy ex was an incredibly smart and talented person, but had zero motivation. He got into a good college, but dropped out after a semester because he \"didn't want to take classes he didn't feel like taking.\" I suggested he attend a school that didn't have liberal_arts requirements, where he could focus on one major. Nope, nothing came of that. Just like your boyfriend, he would talk about wanting to do things, wanting to get a job, wanting to achieve XYZ. But when push came to shove, he did nothing. He'd sit at home, sleep, watch movies, work out, smoke weed. He also lived with his parents, while I lived in an apartment I paid for.\n\nAt first, I thought I could deal with it. He was also very supportive and proud of me. But as time wore on, it became a bigger and bigger issue. He'd complain about how he didn't make any money (because you don't have a job...), how his friends were always too busy (because they are in school, and have jobs)... etc. I did everything I could to help him... I honestly did too much. \n\nI scheduled and took him on college tours. Revised his resume. Set up his linkedin, set up a lunch with my dad to talk about what he wanted to do with his career... the list goes on. At the end of the day, he did nothing about it. He was never proactive. I had to break it off, because my goals and ambitions were simply too much of what makes me who I am.  \n\nMy next (but ex, for different reasons) boyfriend was completely different. He had goals and dreams that he was working on making a reality. It was a completely different relationship. Instead of me feeling like I was dragging around some lethargic man-child, I felt like I had someone who was an equal in the relationship, who I could talk to and support. \n\nWhat I think you need to do is sit him down and let him know this is a dealbreaker for you. Because if he doesn't do a complete 180, what is going to happen? You'll get married and have to drag around this human ball-and-chain forever? Luckily, you're still young. There[.] someone out there for you. \n\nTrust me. I spent way too long and wasted too much time myself. Go out there and find your equal :) "}