{"doc_id": "59", "name": "2016_06_humanities_student_major_672_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2016-06-humanities-student-major_672_AdviceAnimals.txt", "pub_date": "2016-06-08T00:00:00Z", "Sentiment": "0.177", "Subjectivity": "0.404", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1071", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d41kp7t", "Reddit_id": "d41t62v", "Subreddit_id": "t5_2s7tt", "Commenter": "DanifC", "length": "5700", "content_scrubbed": "First of all, thank you, and /u/ktease636 for asking, that means a great deal to me. \n\nAnyways, about him! He was one of the best people I've had the pleasure of knowing, and everyone that knew him felt the same. He was one of those people that never met a stranger. Though he wasn't the most sociable guy, anyone that met him left for the night with a new great friend. He was loving and damn hilarious. \n\nHe was also good at everything he tried! He was a killer [bass player](http://i. imgur. com/3YouT1e. jpg), and people even said that he was the best bassist in Charlotte when his band was still playing. In all honesty, if it hadn't been for his fierce loyalty to his friends in the band, he probably could have become a very prominent bassist. \n\nIn addition to being a great musician, my dad was also an incredible artist. He mostly did [abstract drawings](http://i. imgur. com/oevIJZ0. jpg), usually in ball point pen. It always astounds me to look at his art and see the amount of detail, time, and patience that went into each one. \n\nFor a living, he was a remodeler. He was great at carpentry and woodworking. Here[.] an antique [phone](http://i. imgur. com/BfHGoKS. jpg) that he restored after finding it in his parents' basement. \n\nBut he wasn't just gifted in the arts -- he was extremely intelligent, too. He didn't have too many accolades or anything on that front, but most of my favorite memories of him are when I wasn't able to sleep, so I'd go out to the living room where he slept (he couldn't sleep in a bed) and just spend hours having these deep conversations about everything with him. \n\nHe was adventurous, too. He once hitchhiked from Oklahoma City (where he was living at the time), to Mexico City, and back! But one of his most adventurous moments was when he met my mom. He was doing some work in Charlotte, and went to a restaurant/bar one night that happened to be the place my mom was hanging out at. She had gone to powder her nose, and when she came back, my dad stood in her way until she looked at him. He just said, \"What, you don't like my shoes?\" My mom thought that was weird, but looked down at his shoes, to see that they had holographic hotdogs on them (lol). So my mom just said, \"Well that[.] a new one,\" and went to have a drink with him. He was just in town for the rest of that week, and he ended up going back to OK City that weekend to pack up so he could move to Charlotte and be with my mom. Here[.] their groovy engagement [photo](http://i. imgur. com/0NN9vzO. jpg).\n\nMy dad was 63 when he died. He wanted to live terribly badly, but he had a large list of serious medical problems -- emphysema, congestive heart failure, hepatitis c, and liver cancer, to name some of them. He actually had a fairly good prognosis in summer 2013 -- he was going to have open heart surgery to get his heart strong enough to have a liver ablation and a transplant, if I'm remembering correctly. It was looking good, and they even said he would be able to go back to work in a few months, but he had to be housed in a rehab center after his open heart surgery. Unfortunately, the staff gave him a roommate that was there with MRSA... We didn't know until 3 days after they had moved his roommate into his room. How anyone thought it was acceptable to put a patient with a highly contagious bacterial infection in the same room with someone who was recovering from *open heart surgery* (or anyone, for that matter) is beyond me. His wound got infected and by the time it cleared up enough to go ahead with the liver surgeries, his cancer had spread too far and they could no longer do them. Amazingly, he did survive for another year and a half after that, but his body finally succumbed in March 2015 after 7+ years of fighting. \n\nAs for me, it[.] been really hard. I was 19 when he died. He[.] not going to be able to be a part of a lot of major points in my life like seemingly everyone else[.] parents are. I lost my best friend when he died. We knew that he would die at some point... But for over 7 years, he just... didn't. So I think I just kind of got in the mindset of, \"Oh well he hasn't died yet, why would he now?\" So when he did, it was still kind of a shock, especially since like 4 days before he died, the hospice nurses said he would have at least another 6-8 weeks. The suddenness of it was gut wrenching. Expected yet extremely unexpected. It was a crazy thing to endure. I don't have any siblings, and I don't really have many friends, so after the first week or so of sympathy cards and messages, it was incredibly lonely. Nowadays, some days are harder than others. Just two days ago, I heard a song and thought that I would have to show it to him, and then it hit me like a train again that I can't do that. It[.] weird when that happens... Like he[.] dying all over again. \n\nAnyways, I will say that his passing has helped me reinforce my faith in God. I never really wandered away, but a few things happened the day of his death/leading up to his death that really spoke to me. This comment is already a novel, so I won't delve into the day of his death or any of that too much right now, but if anyone would like to know more about that, I can elaborate. \n\nOh, here[.] a picture of us when I was a [baby](http://i. imgur. com/fYdw4M9. jpg). Are we cool or what? I'm so lucky to have had him as my father and best friend. \n\n Thanks to anyone who has read this. Sorry this ended up so long -- I guess I've had a lot I've been wanting to share about him. Any other questions/comments are welcome!\n\n***TL:DR*** -- *My dad was a gifted gentle giant who died too soon. He made the world a better place. I miss him a lot but I am so grateful to have him as my father.* "}