{"doc_id": "2006", "name": "2016_08_humanities_student_major_1559_cornell", "namespace": "we1sv2.0", "metapath": "", "pub": "Cornell", "title": "2016-08-humanities-student-major_1559_Cornell.txt", "pub_date": "2016-08-21T00:00:00Z", "Sentiment": "0.056", "Subjectivity": "0.285", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "425", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4yyso3", "Reddit_id": "d6ri251", "Subreddit_id": "t5_2r0sd", "Commenter": "t3hasiangod", "length": "2495", "content_scrubbed": "I was a bio major in CAS, and my best friend was a bio major in CALS.\n\nSimilarities:\n\n* General coursework for the major are identical between both colleges. This also goes for the concentrations you can take.\n* Resources and opportunities were the same, as biological sciences is a \"special\" major than spans 3 different colleges, so everything is centralized\n\nDifferences:\n\n* Tuition. CAS offers grants, since its an endowed college. CALS, as far as I know, does not. So depending on where you fall in the financial aid area, you could pay less to attend CALS, if you're a New_York State resident, versus going to CAS. On the other hand, if you're in a situation like me, even if you are a New_York State resident, you could end up paying less to go to CAS rather than CALS. Unfortunately, financial aid is rather opaque about this, but I would recommend applying to CALS if you're in-state. Otherwise, go for CAS.\n\n* Graduation requirements differ between the colleges. As a CAS student, I **had** to take 5 distribution courses (had to fulfill 4 out of the 5 \"categories\" [you could double up on one]: historical analysis, cultural analysis, literature and the arts, knowledge, cognition, and moral reasoning, and social and behavioral analysis), a course that covers pre-1900 history outside of the Western world (can be two classes, one on pre-1900 history and one outside of the Western world), and a language requirement (11 credits in a single language or pass a 2000-level course). As a result, my schedule was fuller than his, particular towards junior and senior year. However, because of the wide variety of classes to choose from, it didn't really impact my academic experience, and I thoroughly enjoyed my distribution requirements. I ended up getting a minor in history because I discovered that I loved the subject, and I very nearly got a minor in psychology as well (1 credit short). CALS has different requirements than CAS. They don't require you to take a foreign language, for example.\n\n* You get a BA from CAS and a BS from CALS, but that doesn't really matter if you're going to grad school or applying to jobs.\n\n* Your alumni resources, and other on-campus resources, vary. CAS has a larger alumni network since its the largest college. This doesn't really matter too much, since you're a Cornell alumnus/ae first, rather than a CALS/CAS alumnus/ae. Your advising offices are also different, and have different resources, though they pull from a nearly identical pool. "}