{"doc_id": "37", "name": "2016_06_humanities_student_major_364_cmu", "namespace": "we1sv2.0", "metapath": "", "pub": "cmu", "title": "2016-06-humanities-student-major_364_cmu.txt", "pub_date": "2016-06-04T00:00:00Z", "Sentiment": "0.149", "Subjectivity": "0.332", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "485", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3w84pa", "Reddit_id": "d3we4fl", "Subreddit_id": "t5_2r87b", "Commenter": "WellHeresMyFourthAcc", "length": "2924", "content_scrubbed": "Sample schedule that[.] somewhat similar to my own freshman year (this will be closest to yours if you've got ECE as your first choice as more than a mild preference)\n\n**First sem**:\n\n18-100 (Intro ECE)\n\n15-112 (Fundamentals of Programming)\n\n76-101 (Interp & Argument)\n\n33-141 (Physics I)\n\n**Second sem**:\n\nAnother engineering intro\n\n33-142 (Physics II)\n\n21-127 (Concepts of Mathematics)\n\n15-122 (Principles of Imperative Computation)\n\n\n\n\n\nYou have to take 18-100 your first year to declare an ECE major. 15-112 and 21-127 are prereqs for the CS side of things, but be sure to not take 18-100, 15-112, and 21-127 all at the same time. If you're not comfortable with 15-112, there[.] also 15-110 which won't really help with your degree but will kinda-sorta prepare you for 15-112. Interp and a second engineering intro are freshman requirements in that they're courses you're supposed to take freshman year but they can't really enforce the requirements until graduation and you won't be hurt if you put them off. 33-141 and 33-142 also aren't huge requirements, you can delay them a bit, but I'd recommend getting them out of the way sooner rather than later. 15-122 is the first real CS course (delving into more than just programming and touching upon theory; it[.] the course that should prepare you for any technical data structures & algorithms interviews as a side effect, and a prereq to 18-213, the ECE software/systems core).\n\nCommon variations from my year:\n\n- taking Interp second semester or later (usually due to having later registration)\n\n- taking 15-110 first semester if you're really uncomfortable with programming; I'd recommend registering for 15-112 at first in either case because you can drop down during the first week or so (15-112 is a lot of work, but people tend to be more scared of it than they should be, and it[.] something you'll have to tackle as an ECE anyway)\n\n- taking Calc 3-D, Matrices, another math elective, or a humanities/gened elective instead of one of the physics courses (Physics I-Physics II aren't really part of the main trend, I just stuck them in there in the \"generic elective\" slot)\n\n- taking 18-240 (ECE Digital core) or 18-213 (ECE Software/Systems core) early and delaying your second intro\n\n- taking 18-100 second semester if you're not able to get in\n\nFreshman year is the least flexible year when it comes to scheduling, since you need to get 18-100 (and basically 15-112, and 21-127, to avoid delays) in by the end of Spring semester, and the vast majority of freshmen take out Interp as well, since it[.] designed as a freshman course. Beyond that, people just generally start chipping away at their math/science electives or their gen ed requirements, maybe explore a bit (don't hesitate to take courses like 16-865 if they pique your interest).\n\n\n\n\n\nI'd also recommend discussing this with your advisor. They've got a better bird[.]-eye view than any of us."}