{"doc_id": "75", "name": "2016_06_humanities_student_major_836_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2016-06-humanities-student-major_836_AskAcademia.txt", "pub_date": "2016-06-11T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.347", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "429", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nl3g0", "Reddit_id": "d453qs4", "Subreddit_id": "t5_2sakj", "Commenter": "pentad67", "length": "2348", "content_scrubbed": "Unless your advisor actually wrote the paper with you, so that he or she wrote large sections of it, which the two of you then combined with sections that you wrote, then do not put your advisor as a co-author. History is very different from the scientific fields that many of the people here are from and co-authoring an article in history means that the two of you actually wrote it together.\n\nIt is the job of an advisor to help you hone your questions, to suggest literature to read, to give extensive feedback on the content, structure, and writing of the thesis, and it sounds like your advisor performed those tasks quite well -- that is still not the same as co-authoring. What you should do to acknowledge the help is to put a footnote either at the end of the first sentence of the article, or the last, thanking your advisor for their help (and anyone else who contributed, read drafts, etc), along with the statement that any errors that still remain are yours and not theirs -- you can see examples of this in the acknowledgement sections of most academic books in history and many articles as well.\n\nYou should also talk to your advisor about your plans to turn it into an article for publication to see if they agree (since you said it was someone else who made that suggestion). I would expect that the advisor, if they agreed it was publishable, would be invaluable in giving advice, reading drafts, even more than when it was a thesis, on how to convert it into publishable form, where to send it, etc. This still is not the same as being a co-author. It[.] just the expected job of an advisor in history. \n\nFinally, one point you may not have considered, your advisor probably would not want his or her name on your article. First of all, to me at least, it would seem dishonest, like I was stealing one of my student[.] work and attaching my name to it (this is very different than the sciences). I know there are professors in the Humanities that do this but it seems highly unethical to me. Second, and no disrespect to you is meant by this, the level of an undergraduate thesis is perhaps not something your advisor wants his name on as an author. This doesn't mean that it[.] not good, but usually an undergraduate thesis will just be at a lower level than an article written by someone with years of experience in the field. \n"}