{"doc_id": "1991", "name": "2016_08_humanities_student_major_1394_nyu", "namespace": "we1sv2.0", "metapath": "", "pub": "nyu", "title": "2016-08-humanities-student-major_1394_nyu.txt", "pub_date": "2016-08-19T00:00:00Z", "Sentiment": "0.218", "Subjectivity": "0.448", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "698", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4yi5wk", "Reddit_id": "d6ojnl9", "Subreddit_id": "t5_2rbpf", "Commenter": "fencermedstudent", "length": "3702", "content_scrubbed": "LSP grad here! I think it is called the core program now. Like you, I also heard some not so great things about LSP, but I was determined to make the most of it, so after finishing the program in two years, I transferred over to CAS and graduated with my BA in 2014. My diploma is exactly the same as all BA degree holders from CAS and has no mention of LSP (although I wouldn't mind if it did)\n\nLSP program pros:\n\nThe tuition was slightly lower than if I had attended CAS, so I saved a few thousand for the first two years of school (idk if this is still the case for your class) \n\nThe LSP classes are supposedly less difficult than the general requirement courses for CAS (higher GPA/grades for classes that are basically required for all undergraduates)  \n\nMy liberal_arts background makes me stand out when I apply for jobs in any health/STEM related fields. (I am PROUD to list the liberal studies program on my resume and it always comes up on interviews) \n\nEasy and automatic transition into CAS \n\nLSP program cons:\n\nSome CAS kids will look down on you. Even my CAS friends would make slightly offensive comments about the program (but it[.] ok bc some of them are unemployed and watched me land my dream job and get into med school straight out of college) \n\nYou will have to apply if you want to transfer to Tisch or Stern and I heard that the chances of getting in aren't that great. If you are dead set on business or performance arts, I would probably go to another school and focus on that (but who knows maybe you are a hustler! ;)\n\nUnlike the CAS kids, you have to take your general requirements courses in the first two years. This means that you will only have room for one elective each semester, for your first four semesters (2 years). This won't be a problem if you plan out your four year schedule and spend all of your elective courses on classes that will count towards your degree. For example, I was set on being pre-med so I made sure that I took my pre-requisites for higher level science classes early. This could also count as pro too since your last two years of school are completely wide open for you to do whatever you want, while other CAS seniors may be scrambling to fit in their writing 101 course that they neglected taking earlier. Planning out your four year schedule is easy if you have a goal in mind. I managed to fit in the LPS program, a BA in psych, a minor in chem, and all pre-med classes in 3 years!! (In addition to volunteering at a hospital, working part_time jobs, publishing research in a psych lab, and being a varsity NCAA athlete; so seriously no excuses!) \n\ntl;dr You get what you put into it, seriously. I milked the LSP program for what it was worth and I am so happy with my life right now. Whatever program or university you attend, it[.] up to you to make the best out of what you have. Good luck! \n\nEdit: didn't mean to make my essay longer, but I just read the comments above me. Sadly, I truly honestly believe that if it weren't for the LPS program, I might not have gotten into NYU. I compared my SAT score and GPA w some of my CAS friends and theirs were all higher than mine. Maybe that[.] not the case for other people whose applications got sent to LPS, but this is just my impression. Supposedly, the program was designed for students who would best benefit from small classes (aka hand holding). Who knows if that is true and honestly who even friggin' cares. If it were true, then I got to say that the program served its purpose bc my experience at NYU chewed me up and spat me out and made me so much tougher than I ever was. You go kick ass no matter what program you're in!! Make LSP proud and be proud that you're in LSP!!! "}