{"doc_id": "164", "name": "2016_06_humanities_student_major_1559_tumblratrest", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrAtRest", "title": "2016-06-humanities-student-major_1559_TumblrAtRest.txt", "pub_date": "2016-06-22T00:00:00Z", "Sentiment": "-0.025", "Subjectivity": "0.375", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "617", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4j9k0v", "Reddit_id": "d4k5yot", "Subreddit_id": "t5_2wiar", "Commenter": "SuyinSue", "length": "3745", "content_scrubbed": "There are no sources, half of the \"info\" is made up, \nmost of the other half overdramatized.\n\n The Greens are notorious for their efforts to legalize Pedophilia \n\nWhat? .... like ... What? That is made up BS.\n\n The \"Green Youth\" division prides itself with posting pictures of members urinating on the German flag on social media. They also support the mass influx of millions of young, fertile Muslim men to \"thin out\" the German people as Joschka Fischer, former Foreign Minister, put it.\n\nSo much Drama... it was like two or three youngsters who posted these pictures, \n\nno need to act like the world is going down.\n\n(Funny how these are the people who make fun of others being easily offended.)\n\n For these reasons the Greens are accused of putting forward the proposals, camouflaged as promoting \"tolerance\", in a deliberate attempt to destroy the traditional family and further lower German birth rates.\n\nGuess the illuminati or jews (or both?) are behind that /s\n\n The Gender insanity has reached critical levels in Germany \n\nI live in a pretty big city in germany and this is like our smallest concern.. \n\nso what if lgbt people get treated equaly, what[.] so bad about that?\n\nLive and let live.\n\n Soon it may become a hate-crime to imply that there are only two genders as it has already become for opposing mass immigration\n\nMore drama.... you can still say whatever you think, it only becomes a crime, \n\nwhen you call out for a crime, for example:\n\nit[.] perfectly fine to say: \"I'm against immigration, Human/Religiongroup XYZ sucks, I hope they die\"\n\nbut it[.] not fine to say: \"I'm going to burn/Somebodyelse should burn/We should burn the building they are all in\" \n\n\n Every paper, letter or official statement has to be \"gendered\" by including additional symbols for two or more genders to avoid discrimination accusations, for example \"Sehr geehrte(r) Herr/Frau\", \"Sehr geehrte Student*innen\" or \"Sehr geehrte Studierende\" (new Neutral form) is used to address males or females and students respectively rather than using the terminology that was common for centuries.\n\nWhat? All these examples include only the male and female form.\n\nSehr geehrte Frau (female) Sehr geehrter Herr (male), they just shortened it, deal with it.\n\nSehr geehrte Stundenten (male) und Studentinnen (female) also got shortened to Student*innen.\n\nSehr geehrte Studierende includes male and female students and is just the plural, what[.] so bad about that? \n\nNot everything that is common for centuries is a good thing or sounds good...\n\nThis is considered by many as an attack on the German language\n\nIt[.] not like they made these words up ... they existed before, calm down.\n\nDespite making up just a small percentage of the general population\n\nSo minorities don't deserve the same rights? \n\nChildren in as early as 4th grade are subjected to explicit sex education, including homosexuality and trans-sexuality. Parents are afraid to speak up in fear of being called homophobe.\n\nThat[.] what I learned in my biology lessons 30 years ago too, get over it, it[.] nothing new... \n\nway to dramatize things.\n\nDon't we have anything serious to worry about?\n\nthe ruling parties (Green and CDU) in the State of Baden-Wurttemberg stated in their program that the most important scientific fields for research to keep Germany competitive are \"Gender Studies\", political sciences, Philosophy and the Arts. It is no surprise that this mindset produces insane proposals as the one put forward by the Greens.\n\nWait so... political science, philosophy and the arts make us insane now too? \n\nBut I thought especially these fields are some of these they were proud of? (Kant and Bauhaus anyone?)\n\nDamn our lifes must be pretty fine if this is what we worry about nowadays.\n"}