{"doc_id": "161", "name": "2016_06_humanities_student_major_1507_tumblratrest", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrAtRest", "title": "2016-06-humanities-student-major_1507_TumblrAtRest.txt", "pub_date": "2016-06-22T00:00:00Z", "Sentiment": "-0.045", "Subjectivity": "0.493", "Score": "16", "Upvotes": "16", "Downvotes": "0", "Wordcount": "662", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4pa5fh", "Reddit_id": "d4j9k0v", "Subreddit_id": "t5_2wiar", "Commenter": "xternal7", "length": "4358", "content_scrubbed": "For those of us who use RES and were like \"dafuq is this about\", here[.] some more info from youtube.\n\nAfD politician Steffen Koniger ridiculed the Greens in the Brandenburg Parliament for their proposal of a \"Campaign for Acceptance of Gender and Sexual diversity, Self-Determination and against Homo and Trans*-phobia in Brandenburg\" as well as \"Giving equal rights and societal equality for LGBTTQQ (Lesbian, Gay, Bi-sexual, Trans, Two-spirit, Queer, Questioning) people in Brandenburg\" by quoting 60 of the Genders considered by Leftists to be actual identities - they're straight from Facebook[.] Gender option list.\n\n [...]\n\nThe Greens are notorious for their efforts to legalize Pedophilia and normalize transsexuality for children - high ranking party officials like Daniel Cohn-Bendit openly spoke about their sexual experiences with kindergardeners. The party also stands for a complete abolishment of Germany[.] national borders: The \"Green Youth\" division prides itself with posting pictures of members urinating on the German flag on social media. They also support the mass influx of millions of young, fertile Muslim men to \"thin out\" the German people as Joschka Fischer, former Foreign Minister, put it.\n\nFor these reasons the Greens are accused of putting forward the proposals, camouflaged as promoting \"tolerance\", in a deliberate attempt to destroy the traditional family and further lower German birth rates.\n\nThe Gender insanity has reached critical levels in Germany: Soon it may become a hate-crime to imply that there are only two genders as it has already become for opposing mass immigration.\n**Every paper, letter or official statement has to be \"gendered\" by including additional symbols for two or more genders to avoid discrimination accusations, for example \"Sehr geehrte(r) Herr/Frau\", \"Sehr geehrte Student*innen\" or \"Sehr geehrte Studierende\" (new Neutral form) is used to address males or females and students respectively rather than using the terminology that was common for centuries.**\n\nThis is considered by many as an attack on the German language as well as poisoning to the minds of schoolchildren and university students. Much-needed funds for infrastructure are allocated to discuss the need for 3rd bathrooms and rewriting government templates to be gender-conform, possibly costing millions each.\n\nA very loud, tiny minority now forces their insane ideology on the heterosexual society, calling anybody that disagrees with their policies a \"homophobe\" or bigot. Despite making up just a small percentage of the general population, transsexuals and homosexuals are ubiquitous on Television, in movies, newspapers and billboards. Children in as early as 4th grade are subjected to explicit sex education, including homosexuality and trans-sexuality. Parents are afraid to speak up in fear of being called homophobe.\n\nThis out-of-control political correctness has also lead to huge taxpayer funding of absurd university courses. For example the ruling parties (Green and CDU) in the State of Baden-Wurttemberg stated in their program that the most important scientific fields for research to keep Germany competitive are \"Gender Studies\", political sciences, Philosophy and the Arts. It is no surprise that this mindset produces insane proposals as the one put forward by the Greens.\n\nFrustrated Germans who are fed up with the insanity of Gender-Ideology and want a healthy, normal family and their tax dollars spent on their own people rather than foreigners or a screeching minority of cultural Marxists found hope in the new Alternative for Germany, which got up to 25% of votes in some states from the get-go.\n\nEmphasis mine, I'm quoting it again because apparently this was the problem that caused this:\n\nEvery paper, letter or official statement has to be \"gendered\" by including additional symbols for two or more genders to avoid discrimination accusations, for example \"Sehr geehrte(r) Herr/Frau\", \"Sehr geehrte Student*innen\" or \"Sehr geehrte Studierende\" (new Neutral form) is used to address males or females and students respectively rather than using the terminology that was common for centuries.\n\nThis still doesn't make it clear how retarded this would be, since \"Sehr geehrte(r) Herr/Frau\" isn't too big deal and isn't even remotely as retarded as inclusion of \"identities\" other than male/female."}