{"doc_id": "1871", "name": "2016_08_humanities_student_major_322_columbiyeah", "namespace": "we1sv2.0", "metapath": "", "pub": "ColumbiYEAH", "title": "2016-08-humanities-student-major_322_ColumbiYEAH.txt", "pub_date": "2016-08-05T00:00:00Z", "Sentiment": "0.089", "Subjectivity": "0.348", "Score": "38", "Upvotes": "38", "Downvotes": "0", "Wordcount": "872", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4wc91y", "Reddit_id": "d65ysu9", "Subreddit_id": "t5_2scbs", "Commenter": "p4lm3r", "length": "4946", "content_scrubbed": "So far weather is covered. So I will try to touch on the rest. \n\nColumbia[.] food scene is truly off the charts for a city our size(I am moving closer and closer to dropping that qualifier). We have excellent traditional restaurants (Motor Supply, 116, Terra, Bourbon, Oak Table is pretty swell) we have next level brunch spots- brunch is a way of life(Gourmet Shop, Publico, 116, DiPrato[.], Cafe Strudel, Oak Table), we have a pretty great variety of ethnic/ethnic fusion- Baan Swan(thai fusion), Camon(best sushi), 2 Gingers(indian), Harambe(ethiopian), Good Life Cafe(vegan, raw food), Menkoi Ramen(seriously good Ramen, get extra veggies) Paraiso Del Inca(Peruvian), Blue Cactus(southwestern/korean) and seriously the list goes on and on. There are bars that range from straight up dive bars that I wouldn't recommend to dive bars like Whig and CJ[.] and quirky bars like ArtBar that has a great vibe. \n\nWhile we are on food- there is a Farm To Table event at the in-town sustainable farm, City Roots, where a host chef cooks for ~100 people at City Roots. It is a fantastic event, similarly, there is a huge event where they shut down one of the major bridges downtown and line the street with a long table and serve several hundred people- and this is top level, not some chincy thing. It is called the Gervais Street Bridge Dinner. \n\nThere are also places to dance if you are into that like Blue, Social and others down in an area called The Vista. Main Street is quickly becoming the new real hotspot with several resturants and a wine bar opening soon- as well as a bowling alley. \n\nMain Street is also home to our independent theater Nickelodeon and Tapps Art Space, which has almost constant art shows with 4 or 5 artists in residence. On Saturdays, the city shuts down 2 blocks of Main Street at the Art Museum and has  a city market where you can taste some of the best food Columbia has to offer, buy fresh produce, fresh local meats, local artwork, and enjoy the buskers while you shop.  \n\nSpeaking of theaters, we have a few stage theaters in Columbia, most notable is Trustus theater. They are the only professional theater in Columbia and put on amazing cutting edge shows. Really a fantastic venue, also in The Vista. \n\nWhen it comes to culture, Columbia is definitely a city that likes to have festivals and events. From 5 Points St. Pats, Rosewood[.] Crawfish Festival, City Roots Mardi Gras, River Rocks music fest, Cayce Tartan Fest, Jam Room Music Fest, 5 Points Chilli Cookoff... I mean it is non-stop in the spring and fall. Seriously, there isn't a week that I don't have 3 notifications on my phone telling me that I have events to attend- tonight, in fact, is Brew at the Zoo, which is where they have craft brew vendors set up through our world class Riverbanks Zoo and Gardens. \n\nI guess that brings us to our people. Columbia is this beautiful little island of acceptance in the deep south- we even have a Pride parade that marches down Main and rainbow flags go up for pride week (Sept 6th this year for the parade and concert). \n\nI guess I will put it into a national perspective when I talk about Columbians, I am white and I was in the center of the KKK rally/ New Black Panther rally last year when we took the confederate flag off the statehouse grounds. While many cities tend to devolve into rioting- and I'm not saying it was all peaceful, but the statehouse grounds held two groups whom desperately were at odds, and not a single person was harmed. \n\nIf you enjoy collegiate sports... that is certainly a thing here. Tailgaiting is almost year round between USC football and USC baseball. While we are on sports, we also just got an award winning new minor league baseball stadium. \n\nColumbia, and the people here, are fantastic. \n\nI should mention that getting into the arts scene opens up a whole new level of Columbia. It seems that we are unique in that tech, arts, restaurateurs, the music community, entrepreneurs, non profits... they all have this solid core together in this city and as soon as you get in the fold, the whole world opens up. You could start by joining the Soda City Connector facebook page, and following the 1million cups facebook page, and the Tapp[.] Art Center Page, the Gallery 701 page. Those will get you started. Come to events. Talk to strangers. People here love to talk.  \n\nI would be remiss if I didn't also cover the infrastructure in and around Columbia. While we are still working to be a bike friendly city, it is working. We just opened another greenway, with another in the planning stages. The Eastern side of the Saluda/Broad rivers are lines with miles of walking trails which are to be extended all the way to the Zoo. The West side of the Congaree river also has ~10 miles of walking trails lining the river. \n\nI used to be dismissive of Columbia, but in the last decade, this city has grown into its own sort of cultural identity. \n\nAlso, it is $*&% hot. "}