{"doc_id": "206", "name": "2016_06_humanities_student_major_2040_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2016-06-humanities-student-major_2040_AskHistorians.txt", "pub_date": "2016-06-28T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.23", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "249", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4qc63j", "Reddit_id": "d4s2g3n", "Subreddit_id": "t5_2ssp3", "Commenter": "SheepExplosion", "length": "1524", "content_scrubbed": "Not particularly, no - or at least not in the West.\n\nBefore the universities got going in the twelfth century, learning was dominated by monasteries and wandering \"masters\". The latter had no formal certification - who would give it to them? - although they required episcopal permission to set up shop. They attracted students through their reputation, and often their students could attract other students, etc. forming what we might call a \"school\", the most famous of which is probably the one centered around Anselm of Laon (at Laon) around the year 1100. \n\nThe university itself is the product of several of these masters forming a corporate body. Indeed, that[.] what *universitas* means - a community or corporate body. At this point, academic ranks began to be formalized, as did a regular course of study, with all students starting as bachelors of the arts, and some progressing on to the lofty heights of master of theology. Various schools developed specialties; one went to Paris for theology and Bologna for law, for example. Note that at this point the title of *doctor* was not frequently given and there was no regularized way of attaining it.\n\nAs the university systems formalized, all sorts of sartorial methods developed for signifying one[.] academic rank, most unique to particular universities. Hoods, hood length, stripes on the sleeves, large sleeves, sleeve lengths, and the like are all vestiges of these methods you can still find when everyone puts on their wizard[.] robes for commencement today."}