{"doc_id": "1886", "name": "2016_08_humanities_student_major_454_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-08-humanities-student-major_454_AskReddit.txt", "pub_date": "2016-08-08T00:00:00Z", "Sentiment": "-0.031", "Subjectivity": "0.334", "Score": "31", "Upvotes": "31", "Downvotes": "0", "Wordcount": "299", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d68ps2j", "Reddit_id": "d68w2pe", "Subreddit_id": "t5_2qh1i", "Commenter": "Picklestasteg00d", "length": "1857", "content_scrubbed": "Thanks for the compliment. It[.] been forever since I've been summoned. \n\nAnyway, welcome to Meme History with Picklestasteg00d. Today, we will discuss \"You like that, you fucking retard?\"\n\nThis comment originated in an AskReddit thread titled \"What is the worst thing someone has said to you during sex?\"\n\nu/Blackbyrd82 responded with:\n\nNot me, but an old friend of mine.\n\nReally quiet, soft-spoken, polite guy. A total gentleman and a graduate student in the liberal_arts. Also, pretty inexperienced, tentative, and vanilla sexually.\n\nHe[.] dating this really cool girl for maybe two months. She is much kinkier in bed. She floats the idea of dirty talk, and apparently likes to be objectified, even demeaned a bit, from time to time. He[.] hesitant, but wants to please her and doesn't dismiss the idea outright. Changes the subject and figures that they'll revisit the idea another time.\n\nAnyway... they have sex a few days later for the first time since the conversation. Really going at it doggystyle, and she tells him to talk dirty to her. He says that he can't think of anything to say, so he says nothing, and she then repeats the request, but the second time she is not fucking requesting, but demanding it.\n\nHe comes up with: \"Yeah... you like that, you fucking retard?\"\nHe[.] never struck me as one for embellishment, so I believe him. He said that was it for sex that night, although they are still together two years on now.\n\nThis comment has been gilded thirteen times as of now. It[.] also referenced in *nearly every thread*.\n\n[Link if you want to see it for yourself.] (https://www. reddit. com/r/AskReddit/comments/1y6lhe/what_is_the_worst_thing_someone_has_said_to_you/cfhtedq)\n\nSo there you go, u/lukeyj4212.\n\n*****\n*This has been Meme History with Picklestasteg00d. If you ever want an explanation of a meme or meta, call my username. Thanks.*"}