{"doc_id": "66", "name": "2016_06_humanities_student_major_732_flashlight", "namespace": "we1sv2.0", "metapath": "", "pub": "flashlight", "title": "2016-06-humanities-student-major_732_flashlight.txt", "pub_date": "2016-06-09T00:00:00Z", "Sentiment": "0.075", "Subjectivity": "0.369", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "344", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nbz36", "Reddit_id": "d42o373", "Subreddit_id": "t5_2qjmy", "Commenter": "dotMJEG", "length": "2068", "content_scrubbed": "OK So I'm not positive what version of this witchcraft actually comes from, but here[.] my quick $0. 02 from various college exploits that touched on this a couple times. I'm also not exactly an expert in the area, but I dabbled, and studied what amounts to \"Light and human experience\" as my major (don't ask, fucky liberal_artsy BS).\n\nFirst, that link seems like exactly what you say, semi-new-age BS. However, there is actual scientific evidence (**[found it, I knew it was Renssellear[.] LRC](http://www. lrc. rpi. edu/education/outreachEducation/L&HInstitute. asp#. V1m_Relm2lI)) to suggest that exposure to red AND blue light over the course of the day does offer psychological and physical benefits. For example, the main thing I remember was that in older folks, exposure to a certain (I'm fairly sure it[.] a balance) amount of red/ blue light helps their Circadian rhythm and enables them to fall asleep faster/ longer. This included both conscious exposure, AND interestingly, while asleep, goggles were used that pulsated red and blue lights.\n\nBlue lights themselves have also been shown to help relax humans in general, and this is being applied to a few modern airliners, a light blue ambient lighting. \n\nThere was a lot beyond this but I don't dare speculate that far. So my **TL;DR is:**\n\nYes, there is such a thing as therapy through lighting. No, it does not involve you staring directly into a red light 3 inches from your face. I was also told that simply blasting one or the other onto your face did nothing, *how* you were exposed played a big roll, and to what extent. This seems like someone read up on the above, threw out the actual facts of the tests, and sold it *as-seen-on-TV*. As for how it helps skin and aging- well the principle of it is basically that it helps set your circadian rhythm which has the benefits of aiding sleep and reducing stress, both of which will greatly have an impact on you psychologically and physically, i. e., no more pimples. \n\nRouted in actual science, unfortunately seems to also ignore that scientific method. "}