{"doc_id": "41", "name": "2016_06_humanities_student_major_411_anime", "namespace": "we1sv2.0", "metapath": "", "pub": "anime", "title": "2016-06-humanities-student-major_411_anime.txt", "pub_date": "2016-06-05T00:00:00Z", "Sentiment": "0.204", "Subjectivity": "0.503", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "364", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4mp12j", "Reddit_id": "d3x6bx3", "Subreddit_id": "t5_2qh22", "Commenter": "Karmic_thread", "length": "2397", "content_scrubbed": "**Revolutionary Girl Utena** was the most relevant thing I finished. Great series, it[.] hard to binge watch because of Ikuhara[.] style of repetition, that made it sometimes feel like a chore to watch; that[.] a thing that did better in Penguindrum in my opinion. One thing it has above Penguindrum is the characterization, specially for the secondary cast, since they're not only walking ideas or themes, they are fleshed out a lot, each one having their personal arc resolved in a three part sub plot that develops through the different major arcs. This is also something Penguindrum could've done if it had more time to air, like maybe 3-4 more episodes, but we know that[.] not possible.\n\nI found Ikuhara[.] designs to be quite distinctive, specially the eyes, here[.] [Miki](http://vignette2. wikia. nocookie. net/utena/images/5/5d/Miki. jpg/revision/latest?cb=20120526185715) from Utena and here[.] [Shouma](http://vignette2. wikia. nocookie. net/penguindrum/images/3/38/Chara_shoma. jpg/revision/latest?cb=20110724215931) from Penguindrum.\n\nI loved the concept of a character drama disguised as an epic story of castles, swords, duels and magic transformations. A lot of its themes are so real and graphic, with so many layers of symbolism that it[.] hard to believe it[.] aimed to young girls. You-Know-Who is one hell of an antagonist, and makes the other antagonists in the series seem like breast-feeding babies in comparison. I find remarkably incredible how the artstyle and the animation picked up for the last third of the show; I was blown away by the car sequence the first time I saw it. The background music for the duels is always epic and amazing. The duels don't have insane choreography or animation and are quite repetitive, but that[.] not the focus once you realize the show is about: the influences of the past, the first love, domestic abuse, unrequited love, love triangles, jealousy, sexuality and a lot more.\n\nSadly I'll have to sail the seas to find the movie.\n\n[](#madsaitama)\n\nMy rankings for Ikuhara shows:\n\n* Mawaru Penguindrum: 10/10 and one of my favourites.\n\n* Shoujo Kakumei Utena: 9/10 and I think it made it into my top 10 with one of the most underrated historical [openings ever.](https://my. mixtape. moe/owhjpz. webm) The second half is pure bliss.\n\n* Yuri Kuma Arashi: 8/10 and I want to highlight how awesome the [opening (NSFW)](https://my. mixtape. moe/zbpbth. webm) is."}