{"doc_id": "2007", "name": "2016_08_humanities_student_major_1567_houston", "namespace": "we1sv2.0", "metapath": "", "pub": "houston", "title": "2016-08-humanities-student-major_1567_houston.txt", "pub_date": "2016-08-22T00:00:00Z", "Sentiment": "0.033", "Subjectivity": "0.245", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "1243", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4z0obz", "Reddit_id": "d6ruikb", "Subreddit_id": "t5_2qj1l", "Commenter": "PiousAugustus", "length": "7643", "content_scrubbed": "Houston[.] two public universities - which sit practically across the street from each other in the Third Ward - share the same roots, their histories a local reflection of racism that long plagued public education across the nation.\n\nThe precursors to the University of Houston and Texas Southern University were started in the 1920s, as a segregated college system when the Houston school district launched two junior colleges: One for whites, one for blacks. Over decades the two grew into full universities and morphed into public institutions. Some have suggested the two be rolled into one university. That never happened and probably never will. The reason, in large part, is rooted in issues of race.\n\n\"Locale and racial identity gave birth to these campuses, aided by the state, creating separate and unequal institutions, building parallel campuses with adjoining borders and service areas, and spending extraordinary legal and political resources to maintain these insular enterprises,\" Michael A. Olivas, director of UH[.] Institute for Higher Education Law and Governance, who is also serving as interim president of UH-Downtown, wrote in 2005 in an article in the Cornell Law Review.\n\nBoth schools began in 1927, when the Houston school board agreed to fund the creation of two junior colleges: Houston Junior College and Houston Colored Junior College.\n\n\"Things started very quickly,\" said Mary Manning, an archivist at UH.\n\nBy the fall of 1927, 232 students had enrolled in the white school. Seventy-five students enrolled in the black college. Just seven years later, by 1934, the student body had grown to more than 900 at the white college and 700 at the black college. The Houston school board decided to make them full four-year private universities. The Houston Colored Junior College became the Houston College for Negroes. Houston Junior College became the University of Houston.\n\nThe universities eventually moved to permanent homes, just blocks from each other. Millionaire oilman Hugh Roy Cullen donated 53 acres to the black university. He gave money to help UH begin building its campus, declaring that the school must always be a college \"for working men and women and their sons and daughters.\" Left unsaid was that those men and women must be white.\n\nBy the 1940s, Texas was becoming a major battleground in the fight to end school segregation. The college that would become Texas Southern was at the heart of it.\n\nIn the 1940s, the University of Texas at Austin[.] law school denied admission to Heman Marion Sweatt of Houston because of \"the fact that he is a negro.\" His case, argued by Thurgood Marshall, for whom TSU[.] law school is named, would eventually go all the way to the Supreme Court. Before it got there, Texas lawmakers got to work trying to build a case to show black students in Texas had equal - but separate - opportunities in the state. They bought the flourishing black college in Houston for $2 million in 1947 and set to work building a school that at least seemed equal to UT.\n\nAnd thus, Houston[.] first public university was born - not as an effort to expand educational opportunities, but to keep the state from having to integrate its flagship in Austin. If state leaders could show black students had their own version of the University of Texas, then the courts, state leaders hoped, wouldn't require the white University of Texas to admit black students.\n\nBy the time Sweatt[.] case reached the Supreme Court in 1950, the newly renamed Texas State University for Negroes was nowhere near equal to the much older and more established UT-Austin. In a ruling that was influential to the landmark Brown v. Board of Education decision that struck down the \"separate but equal\" segregation of the time, the Supreme Court decided UT had to admit Sweatt.\n\nAlmost immediately the state lost interest in the black college they'd established in Houston. In 1951, the Legislature cut its budget by 40 percent, said James Douglas, a longtime law professor at TSU.\n\nFor more than a decade, TSU was the only public university in Houston. \"Ironically, it shared a city street and border with the private white institution established originally by the Houston school district,\" Olivas wrote. Though the University of Houston is now one of the most diverse universities in the nation, it was long a school for whites. As a private school, it didn't have to integrate in the 1950s like UT-Austin did. In rejection letters from the time, UH President Clanton W. Williams pointed black students toward nearby TSU or the reluctantly integrating UT-Austin.\n\nUH eventually changed its policies and admitted its first black student in 1962. Its status as a private school didn't last long. In 1964, the state moved to make it public in an effort \"to eclipse the neighboring black institution,\" Olivas wrote. Texas Southern leaders, predicting as much, objected.\n\n\"The argument TSU made was rather than opening another public university, you ought to put more money into TSU,\" Douglas said. \"This was in the '60s, and you know how far that argument went with the white leadership in Texas. ... In 1964, I don't think the people in Austin really thought integration was going to stick. ... I don't think they ever thought this whole idea of having two universities close to each other was ever going to be a problem.\"\n\nThe idea of integrating the two schools was floated, somewhat seriously, by the Legislature in the mid-1980s, Douglas said. Such talk stopped, however, Douglas said, when Wilhelmina R. Delco, an Austin Democrat who chaired the House Higher Education Committee at the time, pointed out that, by law, if the two were combined, they would have to take the name of the school that first belonged to the state: Texas Southern University.\n\n**Timeline**\n\n*1927*\n\nHouston school board creates two junior colleges, one for white students and one for black students.\n\n*1934*\n\nThe junior colleges are turned into two private, four-year universities: the University of Houston and Houston College for Negroes.\n\n*1946*\n\nHeman Sweatt is denied admission to University of Texas at Austin law school because he is black. His case later reaches the Supreme Court.\n\n*1947*\n\nTexas buys the Houston College for Negroes for $2 million. It eventually becomes Texas Southern University, the first public university in the city.\n\n*1962*\n\nThe University of Houston admits its first black student.\n\n*1999*\n\nThe federal government finds Texas is underfunding TSU and Prairie View A&M. Texas agrees to give the schools extra funding.\n\n*Collegiate religious education begins in Houston in 1947*\n\nAs public higher education in Houston was being born through an effort to keep schools segregated in the mid-1900s, religious universities began to flourish in the city.\n\nIn 1947, the Basilian Fathers, a group of Catholic priests devoted to teaching, established the University of St. Thomas, a Catholic college in the Montrose neighborhood. The first class of 40 students, according to the Texas State Historical Association, was taught by eight faculty members.\n\nSt. Thomas originally offered liberal_arts degrees to undergraduate students, but eventually began adding graduate programs, beginning with the School of Theology in 1968, through which students could earn a master of divinity degree.\n\nIn the 1960s, the Baptist General Convention of Texas established a four-year liberal_arts college in Houston, according to the Texas State Historical Association. A freshman class of 191 students attended the college in 1963. The college grew rapidly over the next decade and became Houston Baptist University in 1973."}