{"doc_id": "81", "name": "2016_06_humanities_student_major_873_gamerghazi", "namespace": "we1sv2.0", "metapath": "", "pub": "GamerGhazi", "title": "2016-06-humanities-student-major_873_GamerGhazi.txt", "pub_date": "2016-06-11T00:00:00Z", "Sentiment": "-0.052", "Subjectivity": "0.377", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "367", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4np0hp", "Reddit_id": "d45qpo0", "Subreddit_id": "t5_33oia", "Commenter": "dayum-son", "length": "2214", "content_scrubbed": "For better or worse, Overwatch is a shooter that attempts to be a \"Greatest Hits\" collection of shooter tropes and ideas targeted towards people who aren't into shooters. In other words, it[.] a shooter for people who aren't into any other shooters (and I'm not talking about the artstyle when I say this.)\n\n\nWhen it comes down to it, an awful lot of Overwatch[.] characters can be described as \"the character that resembles ___\" ex. Pharah is \"The character that resembles Tribes\", Lucio is \"The character that resembles Titanfall\", Soldier 76 is \"The character that resembles Battlefield.\" This kind of approach sounds good on paper, except the problem is that because the maps have to work with all these potential different types of play styles, the end result is that the characters abilities have to be 'toned-down' in order to work within the maps. This, in turns leads to the characters feeling too \"one note\" gameplay wise, with each character only really working within a very specific context.\n\n\nMind you, this was intentional by Blizzard as they designed the game with the idea that players would be constantly switching from character to character. However, the end result is that players are switching between very strictly defined \"roles\" with very little wiggle room to experiment with new tactics and approaches.\n\n\nOn another note, \"one note\" applies to a lot of the characters in terms of their actual \"character\" too, and frankly most of Overwatch[.] characters come off as either broadly stereotypical, annoying, kinda culturally appropriative, or all 3 simultaneously (looking at **you** D. Va.) To me, Overwatch[.] diversity comes off as kinda iffy when all the characters are either offending, annoying, or just really boring.\n\n\nAlso, I can't help but just not like the artstyle. I mean yeah, it[.] nice to see less gray grimy grimness (except maybe Killzone, but it gets a grandfather clause I guess) but for god[.] sake I'm not sure if \"Dreamworks Asthetic\" is any better to be totally honest.\n\n\nAll in all.............. I don't get it. Then again, I'm the type of person who thinks Quake 3 is the pinnacle of competitive shooters so my opinions as faaaaaaarrrrr off from the majority of players."}