{"doc_id": "1891", "name": "2016_08_humanities_student_major_493_aprogressiveparty", "namespace": "we1sv2.0", "metapath": "", "pub": "AprogressiveParty", "title": "2016-08-humanities-student-major_493_AprogressiveParty.txt", "pub_date": "2016-08-08T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.394", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "931", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d69k18c", "Reddit_id": "d69qlg4", "Subreddit_id": "t5_3fozl", "Commenter": "light_cmdr", "length": "5244", "content_scrubbed": "I respectfully disagree with your stance on standardized tests. I was a student from the 90s until '04. I cannot tell you how boring it is to be strictly taught the things that would be on the test and practically nothing else. I, fortunately, was raised by parents and teachers who taught me the value of self-education. I didn't wait for teachers to teach me something, I sought out the information for myself when I wanted to know something. But my students don't have that drive or simply aren't raised that way. \n\nWe cannot allow curriculum to conform to a test because it does not allow for creative teaching and it does not allow students to learn other basic skills they will need in life. Never in my schooling was I taught how to balance my own check book, how to establish credit, how to maintain my credit, how to buy a house, etc. These are the basic skills that all students need to learn that standardized test will not teach.\n\nFurthermore, we use the test as a way to punish teachers for students who fail the test who may simply be bad a taking tests. This isn't fair and is a perfect way to drive out good teachers who simply want to teach.\n\nIn regards to Common_Core, I encourage you to look no further than social media to see how people make fun of how simple concepts are taught using Common_Core. We don't need to replace it right away, but we need to look at other options by qualified people, not politicians.\n\nWith regards to your point on field trip funding, I must again respectfully disagree. In order to balance out my emphasis on S. T. E. M, we must expose students, especially children to the sciences and the arts so they attain and appreciation very early. An 8 year old doesn't care about college when they care about dinosaurs. If we can take a 1st grader to a natural history museum to see the bones of a dinosaur first hand, that could be the spark they need to want to continue learning more about biology, history, or archeology. And not just sciences. Students who live in areas rich in American history should also be exposed to these sights so they have the ability to see how we lived, how far we've come, and perhaps apply classic concepts with new ideas.\n\nYour approach on funding for trade skills is a much better approach. I agree completely.\n\nIn regards to school boards and teachers, corruption is a very common thing in school boards and I'm speaking from personal experience. Where I live, we've had two school boards abolished and replaced by state appointed managers because of infighting and corruption. Yes, we vote in people we feel are right for the job, but when the turn out is less than 1% of eligible voters, you end up retaining the people who shouldn't be allowed to stay. In the case of the school district I worked in, it was severe case of cronyism. The superintended at the time had divided the board members and when it was necessary to oust him for controversies, the side of the board that was loyal to him disagreed with everything the others didn't. As a result, we had a deadlocked school board that couldn't vote on anything.\n\nAt the very end before the board was replaced, the infighting had gotten so bad, school board members were having their cars vandalized by family members / friends of other board members as well as one board member have her house shot at with a sawed-off shot gun. \n\nAs for my \"three strikes rule,\" at some point we have to accept the fact that there will be some kids who simply don't care and don't want to be in school. You can lead a horse to water, but you can't make him drink. School resources end up being spent more on the kids who don't want to learn rather than those who are trying to get out of their bad situations.\n\nI'm not prepared to defend my view on free public colleges and universities right now, but give me time to do some research and I'll get back to you.\n\nIn addition to what I've already written, I have a few more points.\n\nSchools should receive subsidies or incentives for implementing physical education classes, which should focus on nutrition and weight management in addition to fitness.\n\nPersonally, I'm fine with giving students access to proper fitness centers and have personal trainers teach students the values of nutrition and exercise. We should have coaches simply to coach and nothing else.\n\nOnline AP courses should be made available nationwide. Making these courses would even the playing field for students from rural or poor communities to compete for more prestigious scholarships and acceptance to more prestigious schools.\n\nI will do you one better and make the argument that all high school courses should be taught at the college level so they don't have to be taken in college. This will lower the cost of a college education and make students more prepared. \n\nFrankly, I think the current state of school lunches is unacceptable. We should provide additional funding and guidelines for school lunches, such as what constitutes a vegetable (i. e. not pizza) and money to hire kitchen staff who will actually cook.\n\nAt one time, actual food was served in schools. I was actually just chatting with family members about this point the other day. It[.] been done before, but it[.] expensive to do. "}