{"doc_id": "72", "name": "2016_06_humanities_student_major_798_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2016-06-humanities-student-major_798_funny.txt", "pub_date": "2016-06-10T00:00:00Z", "Sentiment": "-0.005", "Subjectivity": "0.322", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "274", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d440qhb", "Reddit_id": "d443sfe", "Subreddit_id": "t5_2qh33", "Commenter": "Tobro", "length": "1529", "content_scrubbed": "You are saying my comment is rape culture? Rape culture is the Mongolian Horde and the ancient Greek man-boy love dynamic. Those are cultures that openly advocated rape and even expected it. When I use the word culture I'm referring the collective society at large and how it treats the subject. In the culture of the U_S rape is condemned. It[.] condemned in the arts, in film, in print, in all media. My point was that a comment on a message board does not equal the culture of the country. There are insensitive people who make horrible comments, and more evil people that commit rape, but this is not the norm, it is a rarity. People who make these comments hide in anonymity for a reason, because our culture would condemn them.\n\nI don't resent people that speak up, I resent you equating the vast majority of men in the country with the very few who actually commit rape. That[.] what you are doing when you say we live in a rape \"culture\".\n\nIt[.] tragic that many rapes go unpunished, but there is a simple reason for this. The testimony of a single person (the victim) is not sufficient evidence to convict an offender without other evidence. Rape is most often committed in private places with no witnesses. In many cases there is not the physical evidence available to prosecute the offender and convict them beyond a reasonable doubt. We cannot imprison people if the victim[.] word is the only evidence of the crime. The nature of the crime means it[.] more difficult to prosecute than a theft or a murder, and it sucks. "}