{"doc_id": "1984", "name": "2016_08_humanities_student_major_1315_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2016-08-humanities-student-major_1315_AskHistorians.txt", "pub_date": "2016-08-18T00:00:00Z", "Sentiment": "0.143", "Subjectivity": "0.403", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "375", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4ycy6t", "Reddit_id": "d6mvjrs", "Subreddit_id": "t5_2ssp3", "Commenter": "The_Manchurian", "length": "2063", "content_scrubbed": "I was going to ask which country you lived in, so I could advise you appropriately, but then I realised that was silly: if you live anywhere in the Western world (which I'm going to guess you do), becoming a History professor is incredibly, incredibly difficult.\nIn British universities, most of the young History lecturers at mid-tier universities went to Oxford or Cambridge. I don't know, but I'm going to guess that in America similarly most mid-level universities are hiring Ivy-League PhDs only. \n50% of students who really love History and want to do it as a job are going to be looking to become a Professor.\n95% of PhD History students are going to be looking to be a Professor.\n\nIf you love History, and want to study it so that you don't go mad with boredom at university, that[.] fine. But job-wise, you need to know that you're probably studying \"Generic but respectable Humanities degree.\" Employers will look at your CV and think \"Yes, this person has got a degree, and it[.] not something stupid and easy.\" The chances of you getting a job that is looking specifically for History is absolutely tiny.\n\nIf you don't want to do Accounting as a job because you find it boring... your best bet is to finish your Accounting degree and then look for a job that[.] not Accounting. It might be worth changing your degree to something you find more interesting with prospects for a more interesting job (this depends on how the Degree structure in your country works, and how far you are through it: I'd recommend this for a 2nd year American student but not a 2nd year British student). But not History.\n\nIf you just enjoy learning History, then frankly you're better off just reading a lot of History books in your own time. \n\nI loved History and Politics. I did History and Politics as a Degree, and I got a History MA.\nMy job has nothing to do with History, and that[.] the same with everyone else I know who did History. I used to have a friend who has a History PhD and hoped to become a History professor: last time I talked to him he worked at the DMV."}