{"doc_id": "177", "name": "2016_06_humanities_student_major_1680_nostupidquestions", "namespace": "we1sv2.0", "metapath": "", "pub": "NoStupidQuestions", "title": "2016-06-humanities-student-major_1680_NoStupidQuestions.txt", "pub_date": "2016-06-23T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.325", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "617", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4pj408", "Reddit_id": "d4ls6n4", "Subreddit_id": "t5_2w844", "Commenter": "MasterEk", "length": "4085", "content_scrubbed": "Previously, if you were trans, it would be unlikely that you would have a place to express that. You would likely repress or closet that issue, with a series of run-on effects for mental health and wellbeing. \n\nIf you disclosed your condition, you would experience extreme stigma and discrimination. You could expect violence, sexual abuse. You could expect to be ostracised or fired. If you told a medical professional, you could expect to get treated for mental illness, which might include medication and institutionalisation. \n\nTrans people were a visible minority in certain contexts. These were mostly in queer communities, and in allied communities (like feminist groups). Whatever prejudices gay and lesbian communities had, they tended to be much less prevalent than straight communities. This was a known part of some queer scenes. In public discourse, though, these were simply lumped together.\n\nIn the 1980s, trans communities were probably more visible than afterwards. New_York[.] underground arts and fashion communities really had this as a feature of their existence. [Paris Is Burning](https://www. youtube. com/watch?v=hedJer7I1vI) (1990) touches on the diversity of those scenes. But even in Auckland, New Zealand (popn. C. 800 000 at the time) I remember trans people being present in the cultural life of some neighbourhoods.\n\nPeople underestimate the impact that HIV/AIDS had on these scenes, particularly in New_York. The outcomes for trans people were really bad, generally, with high rates of prostitution, abuse and drug use. There are other sociological factors, but HIV was a massive problem.\n\nDuring the 1990s, when I was at university for the first time, trans issues were very real, and a significant topic of academic discussion in the humanities, with [Judith Butler](https://en. wikipedia. org/wiki/Judith_Butler) at the center of discussion. Gender theory did quite a lot of work all at once—it linked feminist and queer issues, but it also opened the space for discussions of trans issues, and later for disabled issues. \n\nThe 1990s saw a significant transformation of popular discourse. [Political correctness](https://en. wikipedia. org/wiki/Political_correctness#1990s) became a major target for conservative and reactionary commentators. This changed the character of the culture wars that were happening, and ensured that any discussion of trans issues in the mainstream media was piecemeal and problematic. There was an active campaign to silence discussion of trans issues.\n\nSince the 1990s, a few things have happened. \n\nLGB communities have won a huge number of cultural battles across the West, with broad acceptance for anti-discrimination policies, live-and-let-live attitudes, and marriage rights. The pace of this has been flabbergasting. One of the things that has been exposed through this is the appalling treatment of trans people in our societies. This has also led to a (limited) mainstreaming of queer culture. Because of cultural connections between those communities, this makes trans people more apparent.\n\nThe medical profession has reappraised treatment for gender and sexuality, and no longer views being trans as a disorder. Moreover, there is medical acceptance for hormone treatment and gender reassignment surgery. These have improved and become more accessible. This makes it easier to be trans.\n\nBut the biggest change is probably to do with the internet. This has allowed the development of virtual spaces and communities for trans people, and allows for the much greater connection. It has opened up alternative media which have covered trans issues. Mainstream media can access trans communities.\n\nSo you've got a situation where the old issues remain, but the being trans is more visible and accessible. Trans people are still subject to violence, abuse and discrimination from their friends, family, medical professionals, people on the street, educators and schools, and employers, but they are more likely to be able to find safe places and communities, and more likely to be able to communicate that experience.  \n"}