{"doc_id": "138", "name": "2016_06_humanities_student_major_1350_negareddit", "namespace": "we1sv2.0", "metapath": "", "pub": "Negareddit", "title": "2016-06-humanities-student-major_1350_Negareddit.txt", "pub_date": "2016-06-19T00:00:00Z", "Sentiment": "0.108", "Subjectivity": "0.267", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "397", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4g8igt", "Reddit_id": "d4gcu0w", "Subreddit_id": "t5_2vsbl", "Commenter": "Brom_Van_Bundt", "length": "2614", "content_scrubbed": "Laying aside the inherent contradiction in having a \"higher standard\" in something admittedly subjective, I'm really confused as to whether you think curricula should be decided by professors (\"professors at Yale have a higher standard than your average student, or layman\"), \"customers\" (\"Anyone paying that much money to attend Ivy should rest assured that the education they are receiving is world class\"), or by decisions made by former professors (\"Teaching the classics has always been the standard at Ivy league institutions\"). I think it should be professors; \"consumers\" don't always want to read the classics or be engaged with the humanities at all, and going only by decisions made by former professors runs into a bit of a problem, since literature has changed since, say, Yale was founded in 1718.\n\n\nIf you're arguing \"planned diversity bad/only the classics are worth reading,\" however, you probably don't want to say \"professors at ivy league universities should decide what constitutes a good curriculum\" because often they are either leading the charge towards more diversity or taking an interest in non-\"classic\" works that are interesting from a cultural or historical perspective. In academia there[.] a big pressure to publish, and in order to publish you should (ideally) make an original contribution, something that[.] a lot easier to accomplish if you're analyzing a relatively less-studied work. Just to give an example, here[.] a review of a book by a Harvard professor using writings by Matthew Lewis (author of \"The Monk,\" a decidedly non-\"classic\" work) as a jumping off point to discuss the transatlantic slave trade--a double sin according to a \"only read the classics\" point of view: http://scholar. harvard. edu/files/vbrown/files/brown-reaperreview-caires. pdf?m=1404838073\n\n\nThe way this debate usually plays out is that professors create more diverse curricula and then people from outside academia whine about the decline of the classics in diversity-loving liberal academia in the editorial pages or complain that these programs are a waste of funding while still leaving the actual work of studying and teaching the classics to those diversity-loving liberal academics. \n\nOh, and if anyone studying the classics puts forward any new idea that relates to minorities or other perceived liberal constituencies (maybe the \"dark lady\" of the sonnets wasn't white! maybe the early sonnets are kind of homoerotic!) they're an diversity-loving liberal revisionist. I'd say that these armchair literati and curricular designers are the people who \"complain about race\" in this situation."}