{"doc_id": "1842", "name": "2016_08_humanities_student_major_44_judaism", "namespace": "we1sv2.0", "metapath": "", "pub": "Judaism", "title": "2016-08-humanities-student-major_44_Judaism.txt", "pub_date": "2016-08-01T00:00:00Z", "Sentiment": "0.092", "Subjectivity": "0.391", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1559", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vo66w", "Reddit_id": "d5zyy6h", "Subreddit_id": "t5_2qi67", "Commenter": "betwixt613", "length": "9486", "content_scrubbed": "pt 2\nMany biblical laws copy rules that were accepted in Mesopotamia, Egypt and Canaan centuries and even millennia prior to the establishment of the kingdoms of Judah and Israel. If biblical Judaism gave these laws any unique twist, it was by turning them from universal rulings into tribal codes aimed primarily at the Jewish people.\nJewish morality was initially shaped as an exclusive tribal affair, and remained so to some extent until the 21st century. The Bible, the Talmud and many though not all rabbis maintained that the life of a Jew is more valuable than the life of a gentile, which is why, for example, Jews are allowed to desecrate the Shabbat in order to save a Jew from death, but are forbidden to do so if it is merely to save a gentile (Babylonian Talmud, Yoma, 84:2).\nSome Jewish sages argued that even the famous commandment \"Love your neighbor as yourself\" refers only to Jews, and there is no commandment to love gentiles. Indeed, the original text from Leviticus says: \"Do not seek revenge or bear a grudge against anyone among your people, but love your neighbor as yourself\" (Leviticus 19:18), which raises the suspicion that \"your neighbor\" refers only to members of \"your people.\"\nIt was only the Christians who selected some choice morsels of the Jewish moral code, turned them into universal commandments, and spread them throughout the world. Indeed, Christianity split from Judaism precisely on that account. While many Jews to this day believe that the so-called \"Chosen People\" are closer to God than other nations are, the founder of Christianity – Saint Paul the Apostle – stipulated in his famous Epistle to the Galatians that \"there is neither Jew nor Gentile, neither slave nor free, nor is there male and female, for you are all one in Christ Jesus\" (Galatians 3:28).\n\nA Tibetan Buddha statue. Buddhism is among a handful of religions that have influenced billions, for better or worse. Vivek Prakash, Reuters\nAnd we must again emphasize that despite the enormous impact of Christianity, this was definitely not the first time a human preached a universal ethic. The Bible is far from being the exclusive font of human morality (and luckily so, given the many racist, misogynist and homophobic attitudes it contains). Confucius, Laozi, Buddha and Mahavira established universal ethical codes long before Paul and Jesus, without knowing anything about the land of Canaan or the prophets of Israel. Confucius taught that every person must love others as he loves himself about 500 years before Rabbi Hillel the Elder. And at a time when Judaism still mandated the sacrifice of animals and the systematic extermination of entire human populations (the Amalekites and Canaanites), Buddha and Mahavira already instructed their followers to avoid harming not only all human beings, but any sentient beings whatsoever, including insects.\nJewish physics, Christian biology\nOnly in the 19th and 20th centuries do we see a truly extraordinary Jewish contribution to humankind as a whole – namely, the role of Jews in modern science. In addition to such well-known names as Einstein and Freud, about 20 percent of all Nobel Prize winners in science have been Jews, though Jews constitute less than 0. 2 percent of the world[.] population. But it should be stressed that this has been a contribution of individual Jews rather than of Judaism as a religion or a culture. Most of the important Jewish scientists of the past 200 years acted outside the Jewish religious sphere. Indeed, Jews began to make their remarkable contribution to science only once they had abandoned the yeshivas in favor of the laboratories.\n\nPrior to 1800, the Jewish impact on science was limited. Naturally enough, Jews played no significant role in the progress of science in China, in India or in the Maya civilization. In Europe and the Middle_East, some Jewish thinkers such as Maimonides had a significant influence on their gentile colleagues, but the overall Jewish impact was more or less proportional to their demographic weight. During the 16th, 17th and 18th centuries, Judaism was hardly instrumental to the outbreak of the Scientific Revolution. Except for Spinoza (who was excommunicated for his trouble by the Jewish community), you can hardly name a single Jew who was critical to the birth of modern physics, chemistry, biology or the social_sciences. We don't know what Einstein[.] ancestors were doing in the days of Galileo and Newton, but in all likelihood they were far more interested in studying the Talmud than in studying light and gravity.\nThe great change occurred only in the 19th and 20th centuries, when secularization and the Jewish Enlightenment movement caused many Jews to adopt the worldview and lifestyle of their gentile neighbors. Jews then began to join the universities and research centers of countries such as Germany, France and the U_S. Jewish scholars brought from the ghettos and shtetls important cultural legacies. The central value of education in Jewish culture was one of the main reasons for the extraordinary success of Jewish scientists. Other factors included the desire of a persecuted minority to prove its worth, and the barriers that prevented talented Jews from advancement in more anti-Semitic institutions such as the army and the state administration.\nYet while Jewish scientists brought with them from the yeshivas excellent discipline and a deep faith in the value of knowledge, it is hard to say that they also brought a helpful baggage of concrete ideas and insights. Einstein was Jewish, but the theory of relativity wasn't \"Jewish physics.\" What does faith in the sacredness of the Torah have to do with the insight that energy equals mass multiplied by the speed of light squared? For the sake of comparison, Darwin was a Christian and even began his studies at Cambridge intending to become an Anglican priest. Does it imply that the theory of evolution is a Christian theory? It would be ridiculous to list the theory of relativity as a Jewish contribution to humankind, just as it would be ridiculous to credit Christianity with the theory of evolution.\n\nPhysicist Albert Einstein (1879 - 1955) standing beside a blackboard with chalk-marked mathematical calculations written across it. Hulton Archive, Getty Images\nSimilarly, it is hard to see anything particularly Jewish about the invention of the process for synthesizing ammonia by Fritz Haber (Nobel Prize for Chemistry, 1918); about the discovery of the antibiotic streptomycin by Selman Waksman (Nobel Prize for Physiology or Medicine, 1952); or about the discovery of quasicrystals by Dan Shechtman (Nobel Prize for Chemistry, 2011). In the case of scholars from the humanities and social_sciences – such as Sigmund Freud – their Jewish heritage perhaps had a deeper impact on their insights. Yet even in these cases, the discontinuities are more apparent than the surviving links. Freud[.] views about the human psyche were very different from those of Rabbi Joseph Caro or Rabbi Yochanan ben Zakkai, and he did not discover the Oedipus complex by carefully perusing the Shulhan Arukh (the code of Jewish law), or the Mishnah.\nTo summarize, the Jewish emphasis on education and learning probably made an important contribution to the exceptional success of Jewish scientists. However, it was gentile thinkers who laid the groundwork for the achievements of Einstein, Haber and Freud. The Scientific Revolution wasn't a Jewish project, and Jews found their place in it only when they moved from the yeshivas to the universities. Indeed, the Jewish habit of seeking the answers to all questions by reading ancient texts was a very significant obstacle to Jewish integration into the world of modern science, where answers come from observations and experiments. If there was anything about the Jewish religion itself that necessarily leads to scientific breakthroughs, why is it that between 1905 and 1933, 10 secular German Jews won Nobel Prizes in chemistry, medicine and physics, but during the same period not a single ultra-Orthodox Jew or a single Bulgarian or Yemenite Jew won any Nobel Prize?\nLest I be suspected of being a \"self-hating Jew\" or an anti-Semite, I would like to emphasize that I am not saying Judaism was a particularly evil or benighted religion. All I am saying is that it wasn't particularly important to the history of humankind. For many centuries, Judaism was the humble religion of a small persecuted minority that preferred to read and contemplate rather than to build empires and burn heretics at the stake. Anti-Semites usually think that Jews are very important. Anti-Semites imagine that the Jews control the world, or the banking system, or at least the media, and that they are to blame for everything from global warming to the September 11 attacks.\nI would say to the anti-Semites: Get over it. Jews may be a very interesting people, but when you look at the big picture, you must realize that they have had a very limited impact on the world. Throughout history, humans have created hundreds of different religions and sects. A handful of them – Christianity, Islam, Hinduism, Confucianism and Buddhism – influenced billions of people (not always for the best). The vast majority of creeds – such as the Bon religion, the Yoruba religion and the Jewish religion – had a far smaller impact. One of the central and most beautiful values of Judaism is modesty. We would do well to take this value to heart."}