{"doc_id": "67", "name": "2016_06_humanities_student_major_734_daystrominstitute", "namespace": "we1sv2.0", "metapath": "", "pub": "DaystromInstitute", "title": "2016-06-humanities-student-major_734_DaystromInstitute.txt", "pub_date": "2016-06-09T00:00:00Z", "Sentiment": "-0.017", "Subjectivity": "0.331", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "497", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d42kcdb", "Reddit_id": "d42qcig", "Subreddit_id": "t5_2whek", "Commenter": "thereddaikon", "length": "2877", "content_scrubbed": "The thing is, starfleet not being a military organization is simply impossible given the way the universe has been written. If they had made space less of a cold war with multiple entities vying for power and occasional wars, terrorists, raiders etc then Starfleet would really only need weapons for the occasional emergency and self defense against giant sentient space predators that eat ships or something. But with the existence of groups like the Borg, Klingons, Romulans, Cardassians and the Dominion having a standing professional military is not only unrealistic but also negligent on the part of the federation. These groups clearly would take advantage of a weak federation and capture, kill or enslave it[.] population if given the chance. There is also the reality of how starfleet has been portrayed. They have military rank and culture, they have dedicated combat vessels, their officers train and study tactics and combat ops. They look like a military, and there isn't anything wrong with that. Just like starfleet, the US Navy spends 90% of its time doing peaceful things, and a great deal of it is involved in science and exploration. The Antarctic station was started by the military and is supported by it in a big way, the search and discovery of the Titanic and Bismark were technically military operations, DR. Ballard is a retired naval officer (active at the time) and woods hole is funded by the DOD for the most part. \n\nWhat we end up with in the show is a weird middle ground between what Roddenberry wanted and what he ended up creating. He wanted an optimistic future free of war, what we got was something a bit more realistic. Because of that starfleet is a paramilitary organization that has many of the duties and trappings of a military but is reluctant to be it. I can excuse the way the Borg attack in TNG was handled by the fleet being wholly unprepared for them and being taken by surprise but afterwards a responsible government would have ensured a buildup of starfleet to defend it[.] member planets properly. The Dominion war should have been a cakewalk by comparison. It wasn't and once again starfleet was shown to be poorly prepared for a real shooting war. Part of their responsibility is to defend the federation. Not because their charter says so, but because of the reality of the world they live in. Necessity demands it. That doesn't mean we need to see an overly militarized starfleet like the Terran Empire, but it should look a lot more like a real navy. Instead of scientist who cosplay military officers, we should have officers who are well educated. The vast majority of humanities' great explorers were military men and women. Neil Armstrong and Buzz Aldrin landed on the moon in the name of peace and science but if there had been Klingons waiting for them I have no doubt they would have busted a cap in their asses. "}