{"doc_id": "2027", "name": "2016_08_humanities_student_major_1798_law", "namespace": "we1sv2.0", "metapath": "", "pub": "law", "title": "2016-08-humanities-student-major_1798_law.txt", "pub_date": "2016-08-24T00:00:00Z", "Sentiment": "0.127", "Subjectivity": "0.554", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "491", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6vaa4n", "Reddit_id": "d6vd4gh", "Subreddit_id": "t5_2qh9k", "Commenter": "epoxyresin", "length": "2843", "content_scrubbed": "Yeah, that[.] probably true in a university setting.  I think in a lot of cases people worry with the unions about the dismissal process (make it too hard to fire incompetent people), but from when we've talked about it, I don't think we're so worried about that.\n\nAnother thing that we are worried about, and we don't necessarily have any specific fears, but is that we (physical science students) would be in the same bargaining unit as the humanities students, and that in some cases our interests might not align.  We already get paid more than they do, and especially we get paid for being a research assistant, while they don't.  We worry that our union representatives might say, well, the science students already have it pretty good, we're not going to push as hard to get stuff that benefits them, but are going to push harder for stuff that benefits the humanities students.  Especially, while anyone in the bargaining unit can run to be a union officer, we think it[.] likely that students in the humanities and social_sciences will be much more likely to do so, and will therefore be over-represented in the union leadership (and again, might push harder for their interests than our interests).  We currently have an unrecognized union on campus (who will likely be the ones pushing for certification), and currently they are certainly tilted towards the social_sciences in the members and leadership.  The solution, you might say, is for us to get more involved with the Union, but again, we feel like we have a pretty good thing happening right now, so we don't see a huge need to change.\n\nAt NYU they've dealt with some of this by excluding science students who are RAs from the bargaining unit, (figuring that TAs in the physical sciences have more or less similar duties as TAs in the social_sciences), and that seems to work out OK, but it would mean that we'd be switching from in the union to out of the union from semester to semester depending on how we were getting paid.    Again, not that there[.] necessarily anything wrong with that.\n\nI think in general, my department is not super opposed to unionizing, but on the other hand we don't have any major issues that we think would be helped by unionization, and we are hesitant to change things when things are pretty good currently.  There[.] certainly no guarantee that salary would increase, and in fact we're definitely on the upper end of stipends already, so it[.] hard to point to other schools and say \"see, they're getting more\".  Healthcare is something that unions can push for, but we're generally fairly satisfied with our health insurance.  It could be better (lower deductible/lower copays, dental and eye insurance being subsidized), and maybe a union could get a better one for us, but it[.] not like we don't have anything, like t0talnonsense talks about."}