{"doc_id": "1972", "name": "2016_08_humanities_student_major_1218_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-08-humanities-student-major_1218_AskReddit.txt", "pub_date": "2016-08-17T00:00:00Z", "Sentiment": "0.1", "Subjectivity": "0.324", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "808", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6l5mqk", "Reddit_id": "d6le2aq", "Subreddit_id": "t5_2qh1i", "Commenter": "Chemins", "length": "4513", "content_scrubbed": "I have an undergraduate and graduate degree in music (composition, specifically). I will be there first to admit that music is ABSOLUTELY a burger-flipping degree if you don't do your stuff. There are a lot of degrees that will basically land you a job immediately. Music is not one. Having gone through the process and taught people going through my process, the ones that do nothing other than the minimum that is required, graduate, and say \"WHO WANTS ME,\" and then complain about not having a job totally brought it upon themselves. Music is a really difficult career path. The degree is genuinely meaningless in most contexts (though it helped my job search tremendously).\n\nI'm going to try to help here as much as I can with unsolicited advice to increase success.\n\n1. The first thing to consider is whether or not this field is for you. Most people start majoring in music because it is all that they know. Their friend group is in band/orchestra, they did honor ensembles, etc. That is not a good reason to major in music.\n\n2. After you have decided to major in music, you need to be relentless with your practice. It doesn't matter if it is instrumental, vocal, composition, production, whatever. You should be spending a minimum of four hours a day on your craft, and then another 2-4 listening to/studying music. Particularly study music that you hate. As a composer, I find a lot of benefit from listening to music that I don't like. I don't like Copland at all, but I love that people like him. I listen to his music and take what I can from it. I figure out what I don't like, and I don't use those sound events in my own writing. Yes, listening takes a long time. It is important. I am alarmed at how many music majors don't listen to an hour of music a week, or a month. This makes for long days of study, but that is what you signed up for when you picked the major. You have time during the weekend to screw around a bunch. You must hone your craft to be competitive during the weekend.\n\n3. After you start listening to a bunch of music, see if you start noticing something missing for you musically at your university. Say that you wish there was an ensemble that focused on baroque/early music, but there isn't. Start one, and name it. Make it a separate group from the university and recruit. You might get enough good students in to warrant traveling to neighboring cities/states to perform. If you found a group and perform often, that looks very impressive on a CV/resume. It shows initiative and will help you get a job in some arts field, maybe in development or administration.\n\n4. If you play something like euphonium and know that a solid orchestra job will never be in your future, start looking at positions in the arts right now. It doesn't matter what year you are. Check out this site for a good reference: https://www. nyfa. org/Jobs\nFilter the results to just show music positions. Check out any of them and see what the requirements are, like [this](https://www. nyfa. org/Jobs/Show/82646fe6-7947-48d9-a346-c9fd2c91060b) one at National Sawdust. The first thing I would do, and I have done this in my own life, is create an music based organization to raise money for charitable causes. Whatever the events are, I would then spearhead everything and do as much of the work as possible, even if I have friends who would help. This is purely to be able to talk about all of your responsibilities. If asked why you couldn't manage handing the tasks off to other people, say that you wanted to make sure you had the skillset yourself for your future. I would then look and see what other things I could do during my undergrad/grad school time, and I would try to make my resume as appealing as possible. By the time you are ready for a job, that position I posted will be long gone. Most will have similar requirements, and you will have yourself set up to have a job in the arts that understands your being a working musician. \n\n5. Never turn anything down. Ever. Gig as much as possible, put everything on your CV. If you are a composer, write for everyone that asks. Ask to write for people. Send out Hail Mary emails to major performers for feedback. Do stuff constantly.\n\nI'm missing things, but it is totally possible to have a great career in music. It is a horrible degree choice if you don't put in the work, but showing some initiative and doing a ton of quality work will really open the doors for you. If you are music ed or music therapy, enjoy the guaranteed employment."}