{"doc_id": "103", "name": "2016_06_humanities_student_major_1083_writingprompts", "namespace": "we1sv2.0", "metapath": "", "pub": "WritingPrompts", "title": "2016-06-humanities-student-major_1083_WritingPrompts.txt", "pub_date": "2016-06-15T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.437", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1444", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4o8kvc", "Reddit_id": "d4amjkf", "Subreddit_id": "t5_2s3nb", "Commenter": "wercwercwerc", "length": "8126", "content_scrubbed": "From the rows of wood-crafted seats, I watched as my fellows stepped forward to receive their future with open grins, and wide arms. There were tears, shouts of joy, pledges of future victories; There were bold claims of battles to be won and honor to be had. Hope and youth held hands upon that stage, and I saw it clearly- but most of all, held in my gaze there were the *Beasts.* \n\nTiny shapes of beautiful form, those mystic creatures prized and held above all else, soon to be linked for life with the others of my youth.\n\nMy eyes widened as I saw them present, bright scales, feathers and fur gleaming with an aura of power as their small forms were handed off to those upon the stage. The sum of all those who came here had worked for, a creature soon to accompany us on our journey out into the great world beyond the School itself. A spiritual guardian to the conflicts that would inevitably come once we stepped beyond these walls.\n\nFor an aspiring Mage, there is no greater joy than receiving your spirit-link. It is more than a coming of age, more than a right of passage- although it is both of those things for certain: Receiving your beast is what gives you status in the world. It is proof that you have done what so very many wished they could have done, and been rewarded by the highest magnitude. \n\nA companion, guardian, and friend for life.\n\nWhile many are provided what is willed to them by the Council, most people ranked high enough upon the ladders of influence chose a traditional creature, usually putting their names on the list the first year of University. Traditionally, this is known as the recommended time to do so, if one is able. Breeders and trade agreements made the whole selection process rather complicated- and for the more popular creatures there was the simple issue of supply and demand. Still, some of privileged houses will let the decision simmer, perhaps uncertain what creature could match their personality or potential career.\n\nOf those last, there were many to choose from, and many a beast might be either a great asset or a troublesome anchor. You rarely see a local healer with a spirit-linked creature of war.\n\nStill, there were favorites: Animals linked to great houses of the past, Royalty and bloodlines of utmost significance. Though a painful truth for some, between Griffin and Drake, there were always those who scored beneath the rank of honors who were left to choose from another branch of beast. The option to place your career on hold for a year and hold seniority on the next drafting was a privilege only left to the richest of students. Most settled with an alternative option, and choosing those among the spares.\n\nAt the age of nine, I had been enlisted to the Enlightened Academy from recommendation by the headmaster who had run Turner[.] Orphanage. A chosen favorite of moderate potential, the name alone of my sponsor had pressed me towards the service without question. Since that time, I had spent my hours of day light training for the spark of magics, and refining what few talents in the arts I seemed to possess.\n\nRunic engraving was my strongest, but I had been blessed with a small affinity for illusion, and a strong resonance for the written scrolls of alchemy. The lack of serious respect to any of these fields aside, my grading among the other subjects had not been failing marks, though rarely could I claim they were far beyond passing either.\n\nStill, I had come with recommendation by a powerful name, and had been drafted all the same- even for talents of lesser importance. I could not forcibly command nature to my will (not by any significant degree of use anyways), I could not wield a sword in combat with any great success (although I thankfully had a knack for the shield), and I couldn't summon spirits or giant bouts of fire.\n\nAll this came together a a fixed point of depressing reality. On a battlefield I would be next to useless cannon fodder, and from the those among the University[.] Elite, my presence might even be seen as a wasted investment. I would earn my sponsor money, certainly a career of engraving was potentially lucrative given time and experience, but I would never bring them fame.\n\nNever fame, never glory. My presence was simply a diversification upon their investment of many. A potential diamond in the rough, that turned out to be polished glass instead.\n\nAs I watched yet another face of beaming pride walk off the stage before me, shoulder now perched upon be the unmistakable green scaled rope of a fledgling drake, I could not help but feel the terror well up in my chest. The ordering of all those in front of my had been decided not only by grade, but also by status. Those of Royal birth and Noble house would find themselves weighted towards the far, far north of the graduates. Those of Lesser houses further still... but those of no house? Those of simple recommendation, without an ounce of Noble blood far back as their generations were known?\n\nLast. \n\nThose choose last, among the scraps and runts of litters: The dregs of those Mystic beasts.\n\nAnother name was called, another figure rose, and another bout of cheer erupted. Quieter each time, as families and student left the great stone enclosure, heading out to the great world beyond. From where I sat, it seemed all the world would come to pass before my own name was spoken.\n\nI wondered, not in fear or even envy, as that list continued to be read. Curiosity took me at my core in an odd sensation, not quite excitement- not quite terror. In moments, my name would be spoken, and they would present me with a creature that would link to my very soul. A creature that might have powers far beyond my own, given time. A creature that would never betray me, never leave me short of death or command.\n\nI could not fully imagine such a thing. To be able to rely on something so fully, to take something of such potential for granted...\n\nFrom my daze, I awoke only as the figure beside me rose, beginning the long walk from the farthest row in which we sat, approaching the stage. I was alone, watching on in silence as they received the smallest Silver-Wolf Cub I had ever seen, runic seals of Life and Spirit still freshly burnt across its hide.\n\nThen my name was called. Beyond my footsteps, nothing greeted that announcement but a solemn silence.\n\nAs I approached the stage, I saw the Archmage[.] face grow stern, necklace of crystal and power glowing as his hand drafted the seals they hand already summoned perhaps three hundred times before my arrival. The metals swirling from the reservoir he undoubtedly held in another plane for this very occasion, forming up to seal along a single ring, crest of proof and study gleaming into the light of its own summon.\n\nMy right hand felt heavy as it set itself upon my finger, metal snaking along my skin with cold touch. Then I stood, nervous, terrified, but past anything- I felt something I had known to be more dangerous than anything I had ever witnessed in all my studies. No matter what violence of fire, ice, or lightning could bring.\n\nHope.\n\nThe cloaked man approached with slow and careful steps. Ancient symbol of Beast Master held firm upon the purple silk, golden cuffs and embroidered cloth. His eyes held mine captive, deep brown swirling with the essence of mana and experience. A man who had seen thousands of souls just like my own, walking past with a future link- a future beast. Eyes that had seen kings, peasants, nobles, genius and failure all the same.\n\nThen they closed, and his head shook once. \n\nSuch a simple motion. Slow, patient and practiced. The quiet tell of immeasurable sentencing, the most painful blow he could ever deal.\n\nAnd so I felt it then, let it slide along my neck- the blade which can both defend a spirit, or wound it greater than any beast.\n\nHope.\n\nWith a ring upon my finger proof, the last new soul stepped from the stage under the watching gaze of the wizened Archmage. There I left, past beyond the walls of stone, the gates of spiraled iron, and the cobblestones of wore and careful make.\n\nThere I walked, alone as I had ever been."}