{"doc_id": "1992", "name": "2016_08_humanities_student_major_1412_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2016-08-humanities-student-major_1412_college.txt", "pub_date": "2016-08-19T00:00:00Z", "Sentiment": "0.131", "Subjectivity": "0.34", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "290", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4ylt87", "Reddit_id": "d6opz5h", "Subreddit_id": "t5_2qh3z", "Commenter": "ccbellwether", "length": "1537", "content_scrubbed": "I did three years at a small liberal_arts college before dropping out with a very low (<2. 0) GPA. I started out doing bad and it just got worse- I had gone through a major family-related crisis just before starting school, plus I had always been a straight A student and the pressure to keep that going finally got to me. Academic advising and student mental health resources didn't do much. \n\nThat was May 2014. Since then I've had 3 jobs, living in as many cities, some of that time living at home and some with roommates. I've learned more about myself doing that than my whole life put together before that. I'm about to live at home again and start community college, and transfer to the local public 4 year university once my GPA is good enough.\nI also got a LOT of therapy, that helped me look at my actual issues and not \"Let[.] get you just stable enough to do your schoolwork\".\n\nEveryone I know has graduated too and I've felt pretty dumb and worthless for not having a degree. But I also met a lot of people while working that were in the same boat. There[.] no shame in living at home if that is better for you (and your family doesn't mind). There[.] no deadline for finishing school- that 4 year straight line is not the reality for most people.\n\nSo I'd say, if you want to take the time off school and get a job, do it. Spend that time thinking about what you really need to do to get better. Get professional help if you want/need it. \n\nI hope this was coherent, I just thought I might have some relevant insight for you."}