{"doc_id": "1899", "name": "2016_08_humanities_student_major_547_videos", "namespace": "we1sv2.0", "metapath": "", "pub": "videos", "title": "2016-08-humanities-student-major_547_videos.txt", "pub_date": "2016-08-09T00:00:00Z", "Sentiment": "0.047", "Subjectivity": "0.328", "Score": "109", "Upvotes": "109", "Downvotes": "0", "Wordcount": "431", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6anx77", "Reddit_id": "d6aqtqe", "Subreddit_id": "t5_2qh1e", "Commenter": "firo_sephfiro", "length": "2651", "content_scrubbed": "Which is why we need legit teachers to inspire these people so they can be productive members of our society. Though it isn't really the teachers' fault as much as the system itself, which forces educators to produce numbers. We've fully inserted capitalist mentality into our school system and now everything is about maximizing profits. Instead of dollars it is standardized test scores. \n\n\nPublic schools get funded from the government who doles out a certain amount based on test scores. It wasn't always like this, though it was bad before too. At the turn of the century the prevalent attitude was that the U_S was falling behind the rest of the developed world, academically. The Bush administration attempted to address the failing school systems but ended up making things so much worse. Despite protests, there was bipartisan support for implementing the euphemistic \"No Child Left Behind\" act which basically turned schools into standardized test factories. Instead of addressing the issues individually and instituting real ways to improve the education system, they turned it into a blanket shakedown system: get good test scores, get money. All else be damned. \n\n\nIt[.] all rather cut-throat. It forces administrators to do anything they can to get good test scores and sufficient funding to keep their school afloat. Teachers are under ridiculous stress to get their students to perform well on tests or they lose their jobs to someone who will. We want to intuitively believe that a good teacher will result in good test scores for their students, but it[.] not like that. The tests don't gauge intelligence or a well-rounded education. The students are not taught complex concepts or how to think critically anymore, they are taught to memorize and repeat words and numbers. Students are being removed from classes with borderline test scores and all kinds of elaborate methods of padding the numbers have been documented across the country over the past decade and a half. \n\n\nThe standardized tests are mostly all math and reading. The humanities and arts programs in public schools across the country get virtually no funding and are bordering on virtual non-existence in many places nowadays. Kids no longer learn a foreign language, or an instrument, and they certainly aren't learning social_studies or anything about the world outside of their bubble. \n\n\nJeff Bliss isn't a genius but he is intellectual and the system is failing him, as it does many others. His frustration is reasonable, if a bit misplaced. I wonder how many Da Vincis, Newtons, Einsteins, and Teslas are wasting away on standardized tests in public schools.  "}