{"doc_id": "180", "name": "2016_06_humanities_student_major_1711_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2016-06-humanities-student-major_1711_AskHistorians.txt", "pub_date": "2016-06-24T00:00:00Z", "Sentiment": "0.015", "Subjectivity": "0.371", "Score": "17", "Upvotes": "17", "Downvotes": "0", "Wordcount": "1555", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4pho7j", "Reddit_id": "d4m9o02", "Subreddit_id": "t5_2ssp3", "Commenter": "shotpun", "length": "9614", "content_scrubbed": "Well - before we get into the 1930s we'll need some prior context. By [.]ome' I mean a truckload, and the vast majority of this response, so bear with me.\n\nNeal Ascherson[.] *The Struggles for Poland* happens to have an incredibly extensive section on interwar Poland so most of this information is synthesized from there but I also found a few details in Norman Davies' *White Eagle: Red Star*.\n\nThe Poland we see on the map between the First and Second World Wars was launched into a fight for its life essentially seconds after its rebirth. This was, indirectly, the result of border disputes in all directions - the borders with Germany and the Soviet Union were essentially dotted lines because nobody who drew them up actually knew what the hell a \"Poland\" was or where it was supposed to go in the world (this is a generalization, but the borders were certainly impromptu). In fact, the borders were mostly produced by large-scale uprising carried out by Poles from Lithuania to the Czech Republic and from Ukraine to Germany, fueled by literal centuries of pent-up nationalism. The border situation was not helped by the Russian Civil War; it was an ongoing affair and both sides didn't exactly plan to send love letters to the Polish land they used to own.\n\nSo, what better way to settle these disputes than with more armed conflict? The Polish army moved east, and the borders followed suit as cities like Vilnius and Minsk (the modern-day capitals of Lithuania and Belarus) came under Polish control. This was mostly Soviet territory, but the aforementioned civil war was the primary Soviet concern so resistance to this push was largely nonexistent. \n\nJust as tensions come to a head, though, we'll have to digress. One of the most important aspects of these few months in particular were their political implications. The Polish head of state at the time, Jozef Piłsudski, represents the far side of a very important dichotomy. This was the future of Poland as a nation, an issue on which opinions were pretty clearly split. The first, more achievable option was to become a nation-state - a country run by Poles and populated by Poles for the benefit of Poles. This movement was led by one Roman Dmowski, who acted as an important ideologue although he never wielded much political clout. With all the rampant nationalism flying around, this movement looked pretty appealing. However, the ease of the eastern march of the Polish Army revealed a second, perhaps grander future for Poland. This was a plan for the restoration of the borders of the long-dead Polish-Lithuanian Commonwealth, and something which Piłsudski became increasingly invested in. He even implied that his reasons for doing so were to protect Soviet minorities from evil Russian imperialism. It looks utterly insane on paper, but [this](https://upload. wikimedia. org/wikipedia/commons/4/4e/Mi%C4%99dzymorze_%28Intermarum%29_1919-1921. png) was his initial plan for the Polish nation as it moved east into Polotsk and Kiev. Right - politics over.\n\nSo it was that the Polish march through Belarus and Ukraine led to a violent counteroffensive in May of 1920 - doubly so as the Reds had begun to achieve dominance in the Russian Civil War. Unsurprisingly, the Red Army rolled the Poles out of Soviet territory, but they went further, wishing to spread the revolution. Soon half of interwar Poland was under Soviet control. The Battle of Warsaw itself began in August. Some Soviet troops wheeled around the northern side of Warsaw as others headed towards Lwow in southern Poland. Dangerously thinning his front lines, Piłsudski himself led a daring offensive in the sparsely defended plains between these two cities and ended up completely routing Soviet forces before invading the U_S S. R. a second time. This would permanently change the map of Europe as the Soviets had previously threatened to bring the revolution of workers around the world to Warsaw, Berlin and beyond.\n\nThe aftermath of the Polish-Soviet War was precisely what led to the foundation of the Polish state of the 1930s. Particularly, an awkward compromise was made when Piłsudski realized that he couldn't possibly have his cake and eat it too. He ended up annexing sizable Ukrainian, Belarusian, and Lithuanian territories; not enough to become a truly multinational empire like the Polish-Lithuanian Commonwealth or even the Soviet Union, but just enough for minorities to be rather frank about how much they hated their overlords and wanted to be with others of their nationality. The three aforementioned communities were split in two by interwar Poland, which ended up being an acceptable solution for nobody - Soviet, Polish, or otherwise. This is the cornerstone of 1930s Poland, a nation in which the people are unsure whether they should support something similar to German nationalism or Soviet multinationalism. \n\nOne of the most amazing things about Poland in the interwar period was how politically screwed it was. To put things in perspective, the first Polish elections were in 1922 and no party won a majority but the first president was leftist Gabriel Narutowicz. He would be assassinated while at an art exhibition a few days later. A new leftist president, Wladyslaw Sikorski, was put into place but would be forced to resign in 1923 over an inflationary crisis. This time the successor would be Wincenty Witos, a member of the political right. A violent strike ensued across the country, carried out by leftist workers, and by December of 1923 Witos had left his post. The next government would last until 1925; the next, until 1926.\n\nThe [constitution](http://libr. sejm. gov. pl/tek01/txt/kpol/e1921. html) of Poland at the time placed presidential terms at seven years (see Article 39). Not a single term would be completed, especially since Poland was about to become a dictatorship.\n\nThe 1926 resignation of Alexander Skrzynski was the turning point in this failed democratic experiment. The administration could not find a suitable successor, as Skrzynski was the leader of a centrist all-party government in a nation where political tensions were at a head. In the end, Wincenty Witos planned another rightist government. Piłsudski, who had been running the political left from behind the scenes for most of this escapade, struck back at this. A bloody struggle in the streets of Warsaw resulted in his ascension to the presidency once again. By 1930, after much more political intrigue and general ridiculousness, most political figures in Poland abhorred the Piłsudski administration which had essentially become an authoritarian regime. A Stalin-esque purge of government officials began as democracy began to collapse. Piłsudski died in 1935; although most Poles disliked him by then, all remembered how he had saved their independence fifteen years before, and much mourning was carried out by the population. \n\nWhat of foreign policy in the 1930s? In 1933, the brand-new German Reich and Poland engaged in political warfare over the Free City of Danzig/Gdansk with both sides hoping to gain more influence over the port. Instead, results were inconclusive and a treaty was signed in 1934 promoting peace and friendship between Poland and Germany. This was a massive faux pas by the Polish. They had essentially expressed to the West that they were welcoming of Hitler, and (far worse) had convinced themselves that a balanced settlement with Germany could be reached. This would continue at least until the late '30s when Germany annexed the Czech Republic and Austria while setting up a puppet government in Slovakia. In this way, Poland had diplomatically isolated itself. This would eventually come to pass, but it would be too late as the Polish people found the blitzkrieg at their front door. \n\nMeanwhile, the situation with Polish minorities was actually improving, at least in the short-term. The treaty with Germany had pleased the Germans around Poznan in western Poland, and Ukrainians felt grateful in a somewhat twisted way to live in a state which was slightly less malicious and authoritarian than the Soviet Union. The Jewish community, despite massive waves of anti-Semitism by most conservative, Catholic Poles (which is often overlooked today), experienced a rebirth during the 1930s and became visible in the arts. Jews made up so much of the legal and medical professions that they were officially banned from entering them in 1937. \n\nBy 1937, the political situation was looking bleak. The Spanish Civil War and the establishment of the Popular Front in France produced a new desire for government reform in Poland. The 'Morges Pact' was a center-right political alliance drawn up in Switzerland, but it never succeeded in defeating the current regime. Surprisingly, Josef Stalin invited leaders of the Polish Communist Party to Moscow in 1938. He claimed that they had been disillusioned with the workers' revolution due to the influence of improper nationalism, and ended up arresting and then murdering most of them. The only Polish victory in this period was the occupation of the small, Polish-majority Cieszyn region in Czechoslovakia. It, too, would become German soon enough.\n\nThe final nail in the coffin was that the Polish government utterly refused to set up any alliance of any sort with the Soviet Union. This was, to an extent, understandable - there was no telling what the Red Army might do as it crossed the Vistula and the entirety of Poland to reach the front lines. Instead, a pact was signed between Germany and the Soviets in August, and Polish independence was all but a distant nightmare."}