{"doc_id": "1964", "name": "2016_08_humanities_student_major_1158_cfb", "namespace": "we1sv2.0", "metapath": "", "pub": "CFB", "title": "2016-08-humanities-student-major_1158_CFB.txt", "pub_date": "2016-08-16T00:00:00Z", "Sentiment": "0.072", "Subjectivity": "0.329", "Score": "24", "Upvotes": "24", "Downvotes": "0", "Wordcount": "724", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6kilrn", "Reddit_id": "d6kiwu3", "Subreddit_id": "t5_2qm9d", "Commenter": "DEP61", "length": "4391", "content_scrubbed": "We are a Division III Football program from Kalamazoo College in Kalamazoo, Michigan. Located right across the street from the much larger Western Michigan University, our small, liberal_arts college hosts only about 1500 students, at least a quarter of whom participate in NCAA Athletics. \n\nOn March 22, 2016, the story broke that our school was found guilty of having unintentionally violated NCAA policy by distributing financial aid on the basis of participation in extracurricular activities, namely, high school athletics. No money was awarded on the basis of ability and students who chose not to continue playing in college received the same treatment in their financial aid analysis, but NCAA rule prohibits Division III athletes from receiving any money on the basis of athletics. The story as reported by mlive. com can be found at http://www. mlive. com/sports/kalamazoo/index. ssf/2016/03/kalamazoo_college_athletics_fa. html and the official NCAA report can be read here. http://www. ncaa. org/sites/default/files/INF_KalamazooCollegePublicInfractionsDecision_20160322. pdf\n\nIt can be clearly seen in the NCAA report that our school had two options going forward. Either a) repackage the athletes on a team by team basis, altering the individual financial aid of the students, but allowing them full participation in their upcoming season, or b) leave teams as is with their original scholarships and forfeit their eligibility for postseason competition. After confirming with the NCAA representative multiple times that the report was correctly interpreted, the administration opted to repackage 10 of the 18 varsity athletic teams and leave the others as is, as the amount of money the students would lose could have been detrimental to their abilities to continue playing their chosen sport as well as staying enrolled at the college. The first team to be put on this list was of course the largest one, the football team. While no one was certainly happy with the decision, we accepted that it had to be done, forfeited our postseason eligibility, and moved on. \n\nAll was well until the evening of August 11, the night before we began fall camp, when the college sent out an email informing us that the NCAA had, effectively, changed its mind on the matter. Now, any team that allowed an ineligible athlete to participate in competition would have to forfeit said competition and the school would be susceptible to further repercussions moving forward. \n\nOn Monday evening, we received our new financial aid packages, and had the choice to either continue playing and lose the money, or quit the team before our first game on September 3 and keep our original package. While not every player was affected, some of us find ourselves looking at an extra 5,000 to 10,000 dollars a year just to continue playing we game we love, and many of those players would no longer be able to afford their education if they accept the repackaged aid. \n\nWhile we acknowledge that the school did violate an NCAA policy, we as athletes were completely unaware that any such activity was occurring and feel that the entirety of the punishment was forced upon us and us alone. In addition, the most recent ruling was given to us at a time far too late for us to apply for most scholarships, loans, or even research the possibility of changing schools. As a result, we risk losing several members of our team and the other teams at the school face a similar fate when their repackaged aid is released in the coming weeks. We are presently researching our options for raising the money to help those of us that were affected, such as crowdfunding, scholarships, etc., but at the moment we really need the publicity. The NCAA has continually pushed back the date for the school[.] appeal and shows no interest in hearing us anytime soon, and the most recent ruling seems to have been swept under rug in the eye of the public. \n\nAs Division III athletes, we know that we will never really have the chance to turn pro, but we continue playing the game because it[.] our passion. Due to circumstances beyond our control, the NCAA is now attempting to take this passion away from us and has given us no time at all to seek other opportunities. We need more people to hear our story if we want any chance of fighting these unfair penalties that have been forced upon us. Thank you for your support.\n\nHow[.] that?"}