{"doc_id": "77", "name": "2016_06_humanities_student_major_845_portland", "namespace": "we1sv2.0", "metapath": "", "pub": "Portland", "title": "2016-06-humanities-student-major_845_Portland.txt", "pub_date": "2016-06-11T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.31", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "256", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nmgxg", "Reddit_id": "d459aak", "Subreddit_id": "t5_2qi2i", "Commenter": "Swissarmyspoon", "length": "1526", "content_scrubbed": "Marching bands are expensive. The arts tax can hire some teachers and give them some funds for paint, books, and maybe a field trip, but doesn't go far enough for a Marching band.\n\nMany Portland Public Schools don't have a full-time band teacher with marching band experience. They might have a part-time music teacher, and maybe that person might know about band...\n\nThe schools that have any kind of band program are poorly equipped, with a teacher who is not given all the necessary time or administrative support, and 70% of the kids are probably playing on the cheapest possible imitations of real instruments. Those instruments wouldn't last 20 minutes outside.\n\nAlso there comes equipment costs. Marching band needs extra gear that you don't need in the regular classroom. Good uniforms will cost $300-$600 per student. Outdoor instruments come with costs too, ranging from $250 for a pair of cymbals, to $5000 for a tuba. Yes, there are some indoor instruments that can work as outdoor instruments, but they are more expensive instruments that the kids may not be able to afford for themselves. And if they can afford them, they might not want to take them outside.\n\nTo be considered \"well equipped\", a high school band program of 100 students requires about $750,000 of equipment. The mega-bands of the south will often have 2 million dollar inventories. A \"poor\" band program will still have an inventory worth at least $150,000. A good high school art classroom needs only a few thousand dollars worth of equipment."}