{"doc_id": "194", "name": "2016_06_humanities_student_major_1873_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2016-06-humanities-student-major_1873_GradSchool.txt", "pub_date": "2016-06-26T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.374", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "484", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4oyou2", "Reddit_id": "d4p1wba", "Subreddit_id": "t5_2r4r8", "Commenter": "MoragLarsson", "length": "2655", "content_scrubbed": "This is exactly my approach and it[.] working wonders.  My MA was a crazy year where I regularly put in 12 hours or more a day.  Nearly destroyed all my social relationships and had no less than three nervous breakdowns.  Now I'm in my second year of a PhD and I work on average somewhere between 6-8 hours a day.  Zoloft helps with anxiety, but I credit most of it to my schedule and some chill time.\n\nI have a relatively set schedule for my day (I'm a late starter so I don't bother trying to get work done before noon and train my dog and do chores instead).  I HAVE to stop working by 9pm unless I'm really enjoying what I'm doing (usually writing up a chapter).  The rest of the night is for dog walkies, TV, mini-spa night, a glass of wine, video games or whatever else I want.  I take my \"weekends\" whenever my chef fiance has time off - though not all of it is spent with him.\n\nI also have a standing Monday WoW night with my friends out east.  I start work a little earlier on those days, but I start my week with 4-6 hours of chatting about nerdy crap and swapping music recommendations which puts me in good stead for the rest of the week.\n\nI've taken up body weight exercises and stuff that requires no equipment or the gym so I can do 30 day challenges and that sort of thing throughout the day when my butt gets squishy from sitting my office chair.  I work from home, so that may not be possible but I hate wasting the 40 minutes getting to and from the gym.\n\nYeah, sometimes I have to grade 75 undergrad papers in a week, but those are rare and are typically followed by two days of nothing but Dark Souls and puppy snuggles.  And also that[.] about the only time I drink copiously.  Seriously, avoiding the trap of \"it[.] grad school, drink ALL the beer!\" is good practice.  Save that bottle of wine you've been eyeing for incredibly sad distance ed papers on the European witch hunt.\n\nIf it sounds like I'm slacking: I'm presenting at three conferences (two international) this year.  I'm having a chapter published in a collection from a major academic history publishing house.  I've got one of the best federal scholarships a humanities student can get in Canada.  I passed my comprehensive examinations with an A+ on both.  My research trip to Scotland is almost entirely paid for by scholarships based on merit.  I'm balancing multiple departmental committee assignments with great feedback.  I'm the book review editor for a highly-respected academic journal.\n\nMy CV puts me in a really good spot for a TT job (if they ever start hiring more than contracts in the humanities ever again).  You don't have to kill yourself to succeed.  "}