{"doc_id": "79", "name": "2016_06_humanities_student_major_860_makeyourchoice", "namespace": "we1sv2.0", "metapath": "", "pub": "makeyourchoice", "title": "2016-06-humanities-student-major_860_makeyourchoice.txt", "pub_date": "2016-06-11T00:00:00Z", "Sentiment": "-0.007", "Subjectivity": "0.386", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1775", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d45izeh", "Reddit_id": "d45j0w2", "Subreddit_id": "t5_2w8em", "Commenter": "Astral_MarauderMJP", "length": "9824", "content_scrubbed": "*Like many student soon to graduate, I'm not entirely scared of graduating. I don't think that any of us graduating kids are actually afraid of graduation. What most graduates fear is that strange period after graduation where you are kind of adrift in the world. Some students don't have to worry about this as they are going to be picked up by merchant guilds, or magi-tech companies before they even begin to feel adrift. But others will have a harder time getting out of the limbo state that graduation leave some students in.* \n\n*And like many graduating young adults, all of us are lying as asses off about not being afraid of that transition period. As of right now, I am a little bit scared of that fact myself. Admittedly, I have a job planned out for later but I don't know how well that will pan out. My father is a high-ranking nobles and he has set up an interview with a well-known adventuring guild.* *Sadly because they are well known, they require an entrance test to be completed and they haven't told me or my father about what that entrance test is going to be. So while I can say \"I have some irons in the fire,\" I don't know if they aren't going to melt or not.* \n\n*I removed the clothes I had fallen asleep in and dipped a toe in the water. It was freezing, which is good as a cold dunk would wake me up and clear any sort of residual drowsiness I could have had. I walked over to the large rock that was half in and half out of lake and climbed up it. It was dark so I decided to play it safe and not dive in but jump, making a huge splash as I went under.* *The second I hit the water, I could feel my muscle retract and relax as they attempted to stave of the freezing temperate of the lake. I stayed under the frigid water for a minute or so before coming back up for air, gasping as I did so.* \n\n*The cold was refreshing but not as distracting as I would have hoped. I was hoping for a momentary distraction from what I had to do today and sadly this wasn't as big as distraction as I needed.* *I needed a distractions from what I'm scared of today for a different reason. Because it[.] something that I hate doing more than anything I can think of which includes Prof. Layton[.] literally impossible remedial classes.* \n\n*I have to perform a speech. Not just any speech, the Valedictorian speech.* \n\n*I was surprised to say the least because from a grades standpoint; I was only middle tier. I didn't fail at every written test like Trap-Catcher did but I wasn't a strait As student like Sorte. I asked them what made them choose me as their Valedictorian and they explained in this school, the term Valedictorian was a bit different than how it was used at other schools.* *At St Flares, a Valedictorian wasn't determined by grades or scholastic accomplishments, but was a student chosen by the teaching faculty that most represent the qualities of being an Adventurer of St Flares Academy. Apparently I was what most of the faculty agreed on.* \n\n*While this was inspiring, encouraging and even humbling to a degree it was also an incredible burden of anxiety and stress because you didn't want to betray their expectations.* \n\n*Pile that one with my downright fear of speeches, I was dreading every second leading to my inevitable speech. While some people might say that its preposterous for a bard to be scared of speech, I can understand their disbelief. I am not afraid of public performances at all and I will never shy away from performing in the audience as my participation in the Battle of the Arts performance displayed. But public speaking is different.*\n\n*I can believe in my ability to sing and carry a tune because I am a near master on the guitar, violin, lute, shamisen, banjo or any other string instrument. But removing that string instrument and removing any semblance of a beat or rhythm turns me into a babbling buffoon.*\n\n*I shuddered a bit from fear of my encroaching doom as I grabbed the cleansing crystal and began to flow magic through it. I let the magic coat my body before eventually dunking myself back into the water, all the while thinking of my speech and reciting over and over in my head.* \n\n*I think the worst part about the speech is that the faculty haven't told anybody that I'm the Valedictorian. They are going to ask the Valedictorian to come and give his speech and I am supposed to follow. It[.] essentially a surprise to everyone there. They have even advised me to not tell people as to keep my speech free of bias and interference.* *I ended up only telling Duxix and making swear to tell nobody else but that didn't relieve any of the stress and anxiety.* \n\n*After dunking myself one more time, I threw the cleansing gem near my pile of clothes and attempted to relax entirely, floating on the water surface. I let myself float there for a while, just attempting to relax and forget about the speech. Yet every time I did managed to relax, my body tensed up again as I inadvertently began reciting my speech in my head.*  \n\n*I don't know how long this small cycle happened but it was interrupted when The Fog began to immerge. Without thinking about it, I called the deactivation phrase for the illusion, \"Terintaurum\" and the spell dissolved away. Yet after this, someone called out in surprise and fear, \"Hello? Who[.] there?\"*\n\n*I recognized the voice right away and called back, \"Hey Kit. What are you going here?\"* \n\n*\"Astral?\" She said as she climbed the rock that I had dived off from a little before, \"You there?\"* \n\n*\"Yeah. I'm here. What[.] up?\" I answered as I stopped my floating to tread water.* \n\n*\"Nothing. Just taking a morning bath. Is it cold?\"* \n\n*\"Freezing.\" I replied with a smirk that she returned. She starred at me for a bit longer before she asked in a tentive voice, \"Are you skinny dipping in there?\"* \n\n*I mockingly look down at myself for a bit, pretend checking to see if I have any clothes on and finally reply with another grin, \"Why yes, yes I am.\"*\n\n*\"Gross.\"*\n\n*\"What? I'm pretty sure we've done this before.\"* \n\n*\"No we haven't!\" She cried out in disgust and obvious embarrassment. She tended to get all embarrassed whenever somebody got naked which would always confuse me because she wasn't the one who got naked.*\n\n*\"Whatever, just get in. The water is freezing.\" I say as I splash some water and her. She jumped back a little, her tail doing that cute thing I love when she is frightened, that little twitching and jumping which is always adorable.* \n\n*\"Whatever. Just don't come too close!\" She said as she slowly slipped into the water. Eventually, after a couple of [.]trategic retreats' out of the water, she was fully submerged. Nothing was said for a while as she took out her own cleansing gem and did her business as I continued to tread water, thinking about my speech, which prompted me to ask, \"Hey, Kit. What time is it?\"* \n\n*\"About, 6:15.\" I nodded but didn't say anything else. Silence hung in the air again before I heard Kit ask, \"Alright, what[.] up?\"* \n\n*\"Excuse me?\"*\n\n*\"Something bothering you. What is it?\"* \n\n*\"I'm sorry, you seem to be looking for gold where there isn't any.\" I replied, chuckling a bit.* \n\n*\"No something is bothering you, else you would have either made fun of my choice or wardrobe or noticed the lack of distance between us.\" She replied and it was only then did I see that she was around an arm[.] length away from me and was so red, I could call her a tomato and someone would agree with me.* *I immediately jumped a bit and put some more distance between us before laughing a bit at my own embarrassment as I said, \"Geez, that must have taken way to much courage on your part. You sure you aren't a bit sick?\"* \n\n*\"Shut up Ass-tral,\" She replied with her usual taunt towards me, \"I'm asking if you're alright and you're deflecting which means you're not so what[.] up?\" She finished in a serious tone.* \n\n*I played with the idea of toying with her for a bit longer but then another scary and altogether sobering thought occurred to me. This could be the last time I see her. I don't mean that in the 'I'm going to die' sort of last time but the other kind and in truth worse kind, just drifting really far apart.* *That is the worst way to lose someone and because of that sobering thought, I gave up trying to be pretty and jokey, to have at least one final, intimate, moment with one of my good friends and rivals.* \n\n*\"I'm a little scared actually.\" I said as I slowed down treaded water.* \n\n*\"Of what? Graduation?\" She asked her voice just hinting that she is surprised at this development.* \n\n*\"No. Well, not really... Promise me you won't tell anybody this in the next couple of hours.\"* \n\n*\"What are talking about?\"* \n\n*\"Promise me!\" I repeat with a bit of a plea to my voice. She gave a sigh and nodded waved her hands dismissively as she said, \"Yes. Fine. I promise, now what is this about?\"* \n\n*I took a deep breath as droned out, \"I'm performing the Valedictorian speech.\" At least she was taking this well because after hearing this she burst out laughing. I let her laugh for a while, and I only realized then that her laugh was hilarious in its own right; with a snort and whizzing sound as she went back up for air.* *It was hilarious and it took a good amount of self-control to not laugh at her laughing. Eventually though, the laughing subsided and she took a couple deep breaths to calm herself down as she asked, \"OK. No, really. What[.] up?\"* \n\n*\"Well I told you but if you want to laugh again, I can repeat myself.\" I replied with a smile.* \n\n*\"...You're being serious?\" She asked with disbelief written across her face, \"You're the Valedictorian for out graduating class?\" I nodded and she flipped, \"There is no way! Impossible! I've seen your grades, you can't be the Valedictorian. You've skipped classes multiple times! How is this possible!?\"* "}