{"doc_id": "28", "name": "2016_06_humanities_student_major_264_femradebates", "namespace": "we1sv2.0", "metapath": "", "pub": "FeMRADebates", "title": "2016-06-humanities-student-major_264_FeMRADebates.txt", "pub_date": "2016-06-03T00:00:00Z", "Sentiment": "0.007", "Subjectivity": "0.363", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "536", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4me20v", "Reddit_id": "d3uqsps", "Subreddit_id": "t5_2y44v", "Commenter": "_12345", "length": "3414", "content_scrubbed": "Some excerpts\n\n________\n\nThis past spring, I had a very different experience while serving as a visiting professor at the State University of New_York at New Paltz. I'd been hired to teach an undergraduate journalism seminar that focused on polarizing, divisive subjects: abortion, immigration, Islamophobia, the gun debate, campus rape. Issues likely to touch sensitive nerves, in other words, and to stir considerable discomfort among my students.\n\nSeveral of the students in my class felt strongly about these issues. A few chose to write term papers that drew on personal experiences as well as on research and interviews they did. But no one in the class seemed uncomfortable talking about them. Nor did anyone object when I told them that, especially when reporting on issues close to their heart in which they had a personal stake, it was essential to talk to people whose opinions they did not share and to imagine things from multiple points of view, including views that disturbed or repelled them. None of the students called for \"trigger warnings\" to be placed on any of the books or articles on the course syllabus, despite the fact that several contained vivid descriptions of abuse and violence. When students aired criticisms of the readings in class discussions, the objections were about the quality of the work, not the offensiveness of the content.\n\n.................................\nFar from entitled, the students I met seemed overburdened and financially strapped, members of what Robert Kuttner has aptly termed \"the shafted generation\" in the pages of this magazine. It[.] possible that their experiences and struggles aren't representative, of course. But this possibility is rarely considered when it comes to students who attend the Ivy League universities and elite liberal_arts colleges where the culture wars have grown especially heated of late. Last October, a lecturer sparked an outcry at Yale after writing an email that suggested students should be allowed to wear whatever Halloween costumes they wanted, even if this offended some people. (The firestorm prompted the faculty member to resign.) In December came the story about students at Oberlin protesting culturally insensitive cafeteria food. Both of these stories made national news, deepening the perception that nothing is too trivial to cause liberal college students to take offense nowadays. Even the dining hall fare must be politically correct! Lost in the commotion was the fact that only a small group of extremely privileged students attend institutions like Oberlin and Yale.\n\n.............................\nIn March, a throng of New Paltz students walked out of their classes and marched across campus, carrying bullhorns and a banner that read: FREEZE TUITION.  Afterward, they flooded Cuomo[.] office with phone calls. The protest kicked off \"20 days of action,\" a campaign launched by New_York Students Rising, a statewide organization pushing to defend public education and to raise awareness of how difficult it is becoming for many students to access. Unlike the uproar about cafeteria food at Oberlin, none of this made national news.\n\nThose who bemoan political correctness on college campuses often associate it with a reflexive form of identity politics that is notably blind to one form of privilege: class. But young people at less-rarified institutions seem acutely aware of inequality and class. \n"}