{"doc_id": "1884", "name": "2016_08_humanities_student_major_417_techtheatre", "namespace": "we1sv2.0", "metapath": "", "pub": "techtheatre", "title": "2016-08-humanities-student-major_417_techtheatre.txt", "pub_date": "2016-08-07T00:00:00Z", "Sentiment": "0.098", "Subjectivity": "0.363", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "269", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4wkx4s", "Reddit_id": "d67u0lh", "Subreddit_id": "t5_2r2ne", "Commenter": "bjk237", "length": "1632", "content_scrubbed": "Professional LD here. Couple of pieces of advice:\n\n-If your goal is to become a professional lighting *technician* (protip #1 - stop saying \"techie\" - the professional community finds it childish and pejorative), then a background in computers, electrical engineering, and networking will serve you well. Lighting technology is exploding at a rapid pace, and production electricians need to know network infrastructure, control protocols, low voltage systems, motor control, etc. Check out http://etcp. esta. org/ to see what ETCP, the major trade certification program, requires of its test takers (you won't be ready for that for more than a few years though).\n\nIf, however, you are looking to become a DESIGNER, then in my personal opinion it[.] more important to have a well rounded education in liberal_arts and humanities. Design is about collaboration, critical thinking and reading, an understanding of history and historical context, and a keen sense of visual curiosity. Most of my colleagues came to theater design slightly later in life (in college or after), and the richer your background and more varied your interest, the better prepared you'll be to engage with directors, producers, and collaborators.\n\nIn short, don't worry about specializing too early. Get a good education in something you're passionate about, do and see as much theater as you can, and if you continue to be excited by lighting design THEN start to narrow your focus. A BFA or an MFA is only one avenue to a career as a designer, and it can be an expensive side track if you aren't certain it[.] something you want to do for the rest of your life."}