{"doc_id": "96", "name": "2016_06_humanities_student_major_1037_pics", "namespace": "we1sv2.0", "metapath": "", "pub": "pics", "title": "2016-06-humanities-student-major_1037_pics.txt", "pub_date": "2016-06-14T00:00:00Z", "Sentiment": "0.138", "Subjectivity": "0.439", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "252", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d49l5se", "Reddit_id": "d49megz", "Subreddit_id": "t5_2qh0u", "Commenter": "--Danger--", "length": "1599", "content_scrubbed": "fire all the shitty teachers       \n\nhire teachers who have a minimum of 2 post-graduate degrees: one in education (at the elementary, middle, or secondary level) and one in their subject area (History, Math, Biology, English, whatever). the person at the front of the classroom should be extremely knowledgeable about his subject area and should know many strategies for how to help students learn it.        \n\nmake all parents value their children[.] future happiness and success in an America where highly skilled workers will be in such great demand that we'll be importing them all from abroad if we're not producing them here at home.       \n\nstaff schools well enough to be sure that no kids fall through the cracks.         \n\nequip schools as if they were training facilities for the world[.] brightest, most knowledgeable, healthiest, and most diversified workforce--proper science labs, fully stocked; listening labs and language acquisition equipment and technologies; clean classrooms that are comfortable to be in and not overcrowded; physical facilities to help kids learn how to maintain their bodies and to teach them the joy of being fit; facilities for music and the arts, including student literary magazines and newspapers; and on and on and on.         \n\noh, and my personal favorite change: administrators who deal with discipline to let teachers get on with teaching, who screen teachers from parents so parents can't try and dictate what is taught in the classroom, who understand why we can't teach that jesus lived with the dinosaurs, and who fucking do their jobs for once! "}