{"doc_id": "179", "name": "2016_06_humanities_student_major_1710_4chan", "namespace": "we1sv2.0", "metapath": "", "pub": "4chan", "title": "2016-06-humanities-student-major_1710_4chan.txt", "pub_date": "2016-06-24T00:00:00Z", "Sentiment": "0.141", "Subjectivity": "0.492", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "282", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4m8382", "Reddit_id": "d4m9aat", "Subreddit_id": "t5_2qh4w", "Commenter": "Tundur", "length": "1751", "content_scrubbed": "I support soft socialism in the British style. Strong welfare state, critical industries owned by the state, land reform. I also think that private enterprise should be encouraged but strongly regulated. I support the monarchy, and believe the unelected House of Lords are fine as they are- hereditary peers and Lords Spiritual included. Education should be free at the point of service for critical industries, and scholarships provided for a small number of students non-critical fields like the Humanities. Funds should be available for workers to buy their businesses and turn them into cooperatives, reducing the power of the capitalist class in a fair and non-disruptive manner. UBI should be seriously looked at as a goal which can be achieved in a matter of decades with investment in research, education, and automation. A distinction must be made through regulations between international finance banks and local banks/building societies, allowing one to have the freedom they need to keep London as a global financial capital and the other to operate safely so as to avoid domestic crashes due to international risk-taking. I would devolve powers from Westminster so that instead of EVEL we have a true federal system (with ultimate sovereignty still residing in the Crown). Worker[.] rights are already very strong in the UK, so I have no specific wishes there.\n\n\nThe obvious problem is with nationalisation- profit motives are an easy way of keeping a business efficient and nationalisation can remove that. We would need to carefully look at how the administration could be set up to avoid the problems experienced last time around. \n\nBasically social democracy like we have in much of Europe but taken a step further way from liberalism."}