{"doc_id": "170", "name": "2016_06_humanities_student_major_1651_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2016-06-humanities-student-major_1651_changemyview.txt", "pub_date": "2016-06-23T00:00:00Z", "Sentiment": "0.124", "Subjectivity": "0.441", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "360", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4kvedx", "Reddit_id": "d4lbveu", "Subreddit_id": "t5_2w2s8", "Commenter": "DickAnts", "length": "1928", "content_scrubbed": "I used to teach general chemistry courses at a large (30,000+ students) US university, where we would routinely have 300-400 students enrolled in a class, and most were freshmen and sophomores. There were so many students who had little to no passion for the subject. They may have 'liked science a little bit' in high school and then were encouraged by their parents to pursue a STEM degree (because it pays well!), but once they get to college they quickly realize they don't really have a true passion for it. So they don't put forth a full effort and end up with a C, even though they are certainly intelligent enough to get an A in the course. I don't know how it is for every field, but the markets are so saturated with C-level talent with B. S.[.] in chemistry and biology that its actually pretty difficult to find an entry-level job in those fields unless you were an A-level student. \n\n\nIf you're not passionate about a subject, you can really hurt yourself in the long run. After 4 years of studying a subject you are pretty lukewarm about, you may have a long, uphill job search ahead of you -- and you hold out hope for... what exactly? That you can get a job that you can 'tolerate' and make decent money?\n\n\nWhat I'm trying to say is: being a C-level student doesn't help you unless you are in a field that is verrrry in-demand (and I suspect there are fewer of these than you think). If you're options are 1) 'tolerate' your field of study and get a degree, then end up with a job you don't have any passion for, or 2) love your field of study and get a degree, then end up with a job you don't have passion for (this is how most people view the outcome for liberal_arts degrees)... who is truly wiser? I'd side with option number 2. If you're fortunate enough to have a passion for STEM, you should fucking do STEM. If you're pretty lukewarm on STEM, don't rule out other areas of study that you might enjoy more."}