{"doc_id": "1963", "name": "2016_08_humanities_student_major_1152_writingprompts", "namespace": "we1sv2.0", "metapath": "", "pub": "WritingPrompts", "title": "2016-08-humanities-student-major_1152_WritingPrompts.txt", "pub_date": "2016-08-16T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.277", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "1352", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4y22sd", "Reddit_id": "d6kfchs", "Subreddit_id": "t5_2s3nb", "Commenter": "OldKingClancey", "length": "7515", "content_scrubbed": "Porton gazed out of the ship[.] window towards the planet known as Earth, he'd been here before but the blue beauty never failed to stun him. There was something so amazing about watching this small but brilliant little speck live and thrive. He was so entranced he almost never heard his friend Hargarth come up behind him.\n\n\"Port, get your ass in gear, General wants to see you.\"\n\n\"Are you really going down there?\" \n\n\"Got to, orders are orders.\"\n\n\"But why us? Why now? What does the General know about the humans that we don't?\"\n\n\"You ask too many question Port, just see the General before the drop-off.\"\n\nHargarth left, shaking his head. Porton was his best friend since childhood but he'd always been too much of a thinker for his own good, how he'd managed to find a place for himself in the army he'd never know.\n\nPorton took one more look out of the window before leaving for the General[.] Quarters. General Azarok was one of the oldest and most respected commanders of the fleet, he was the veteran of over 50 wars and despite his age, his missing left eye and his crippled right leg, he could still be found on the battlefield.\n\nHe was also the brain behind Project Sapiens.\n\nPorton knocked on the door, he could hear the tapping of the General[.] walking stick getting louder as he approached the door, eventually opening it to reveal the immaculately kept and perfectly organised chamber. Even from where he was standing, Porton could see the magnificent view of Earth from the General[.] massive window on the other end of the room\n\n\"Port, I've been expecting you, come in.\"\n\nPort did as instructed \"Thank you sir, you sent for me?\"\n\n\"Indeed I did.\" Azarok closed the door behind him. \"I hear you've been having second thoughts about the invasion.\"\n\n\"Yes sir, I was just thinking that...\"\n\n\"No need for formalities Port, this is off the record. I just want to hear your thoughts.\"\n\nPort thought for a second, wondering how best to approach the subject, he decided that Azarok wouldn't stand for bullshit so he wouldn't give him any.\n\n\"Sir I think the invasion is a mistake.\"\n\n\"Do you now, how so?\"\n\n\"I fail to see what[.] wrong with the humans sir, minor issues, nothing that can't be fixed. We've faced these issues before and worked them out, never have we actually felt the need to launch a full-scale attack before. I just don't think deletion is the answer.\"\n\nThe old General smiled, recognising a younger version of himself in Porton, if he survived this war he would make a great Colonel one of these days.\n\n\"You're smart Port, maybe too smart for your own good. But you don't have the experience that I've lived with. What we're dealing with isn't just a case of saving the humans from a toxic environment, they are the toxic environment, we've given them chance after chance after chance but still the same mistakes keep happening, they're not learning and we have to admit that this is a failure.\"\n\n\"But sir, just look at them, the technology is years ahead of what had in the same time period, the medical advances just as good, they are learning and at an exponential rate. In a thousand years they could become their own self-sufficient colony and join the federation.\n\nAzarok sighed, it was a difficult thing to admit you're wrong, it[.] even more so to admit that someone else is right but there[.] nothing to be done.\n\n\"Port, did I ever tell you about the first time I went to Earth?\"\n\n\"Not personally sir but I've heard the story, you went not long after their first started building colonies an civilisations.\"\n\n\"Yeah, back when I could see and walk properly. I showed myself to them, taught them how to build structures, how to read and write They took me as a God, built pyramids to honour their dead, wrote stories about my teaching, told tales about what I'd brought to them. But I was too hasty, I was so excited to see them evolving so quickly I didn't even imagine the consequences of them not being ready for the truth. For millenniums I've been forced to watch them take my teachings and twist them, lying for their own causes, hating others who do not follow the path they set out for themselves. I've watched that and I've waited for them to evolve out of it, to see them build into the utopia I designed them for. But they never did.\"\n\nAzarok turned and looked out the window towards his planet, his baby, a single tear fell from his good eye as he remembered the hours and the effort that went into it[.] creation.\n\n\"You're right Port, the humans are learning, but they learnt too much too fast, they were never designed to be this advanced, they don't even understand what[.] happening and it[.] bred ignorance and hate amongst themselves. If we don't do something now, then in those 1000 years you mentioned, there won't be colony to join the federation.\"\n\n\"But extinction sir? After all you've worked on?\"\n\n\"Not extinction, resetting. We set back the humans to an appropriate level, then we'll let them rebuild from the ashes.\"\n\n\"It[.] a massacre.\"\n\n\"It[.] a cull, the humans have outgrown themselves Port, we need to save them from themselves. And it kills me, it really does, I love the humans, they're smart, compassionate, adventurous, they are in all ways a perfect experiment. But due to my actions, they have been unable to reach the heights I had planned for them.\"\n\nPorton sat in stunned silence, unsure about how to react to The General[.] truth of the invasion being for humanities benefit, not its destruction. He felt Azarok[.] hand on his shoulder.\n\n\"I do not expect you to understand, but you have to accept this is the_right course of action.\"\n\n\"I can't sir, I can't tell myself that this is the only choice we have, nor can I be a part of an organisation that will allow it to be so.\"\n\n\"Are you presenting your resignation Porton?\"\n\n\".... Yes sir, I believe I am.\"\n\n\"Could I ask you a favour then? Could you hold off until after the invasion, when the humans are reforming they'll need a guiding hand, I'd like that hand to be yours. I shall teach you everything I know and even find a position for you that allows you to work independently from the army, you do not have to follow their orders any longer.\"\n\n\"But sir I can't... I mean, I would be honoured sir.\"\n\n\"Thank you Port, that will be all.\"\n\nPort shook hands with The General as a courtesy then left, a little worse for wear after their meeting, his future had been changed in a big way and he wasn't sure what to make of it.\n\nInside his chambers, Azarok made the call to ready the invasion.\n\n\"Sir?\"\n\n\" Major Jaxkal, this is General Azarok. Is the fleet ready?\"\n\n\"Ready and waiting sir, just give the order.\"\n\n\"Excellent. I believe this is to be my last war Major so I would like it on record that Lieutenant Porton is to be trained as my replacement following my retirement, is that clear Major?\"\n\n\"Yes sir, noted and logged.\"\n\n\"Very well. You may begin the invasion.\"\n\nThe ship creaked into life and slowly began its descent towards the planet[.] surface, fighters ready in the hangers, the city levelling weapons primed on the sides, they were a bonafide killing machine.\n\nAs the deep blue of Earth moved closer and closer to Azarok[.] window he reached into his desk drawer and pulled out two items. The first was a bottle of Earth liquor he'd picked up on one of his travels, having developed a taste for the smooth beverage, he took a long swig out of the bottle, savouring the taste as long as he could.\n\nThe second item was a pistol, closing his eyes he placed to his temple and pulled the trigger."}