{"doc_id": "1843", "name": "2016_08_humanities_student_major_58_negareddit", "namespace": "we1sv2.0", "metapath": "", "pub": "Negareddit", "title": "2016-08-humanities-student-major_58_Negareddit.txt", "pub_date": "2016-08-01T00:00:00Z", "Sentiment": "0.145", "Subjectivity": "0.308", "Score": "67", "Upvotes": "67", "Downvotes": "0", "Wordcount": "871", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vnxzz", "Reddit_id": "d606kxt", "Subreddit_id": "t5_2vsbl", "Commenter": "onelookandsinking", "length": "5486", "content_scrubbed": "This kind of circlejerking is not only anti-intellectual, but it demonstrates that the Redditeurs engaged in the jerking circle have no idea of what they're talking about. \n\nSome interesting reading and notes: \nFrom the Atlantic: \"Though the decline of the humanities is getting a lot of attention now, the major drop in enrollments happened between 1970 and 1985. Humanities enrollments dipped from 17. 2 percent of all degrees in 1967 to around seven percent in the early 1980s. In 2011, humanities degrees still constituted 6. 9 percent of all bachelor[.] degrees. In other words, the decline stabilized ten years before current freshmen were even born.\"\n\nAnd again: \"Current debates were sparked by a much smaller decline. In 2011, there are seven percent fewer students studying the humanities than there were in 2009. The current downward drift is a gentle slope in comparison to the 1970s, when humanities enrollments fell off a cliff.\"\n\nThose are from an article discussing the idea that there[.] a \"crisis\" in the humanities right now, when, in reality, students have been leaving the humanities for some time. \n\nhttp://www. theatlantic. com/education/archive/2013/12/the-real-reason-the-humanities-are-in-crisis/282441/\n\nTranslation? The idea that there is a throbbing, veiny army of librul ES JAY DUBYEWS out there graduating from schools without STEM programs is unfounded. Here[.] some more interesting facts. \n\n\"Study finds a significant decline over the last 20 years in number of institutions whose missions align with the [liberal_arts] sector.\"\nhttps://www. insidehighered. com/news/2012/10/11/study-finds-liberal_arts-colleges-are-disappearing\n\n\"English departments at U. of Maryland and elsewhere respond to drop-offs -- some of them steep -- in english_major.\" \n\nhttps://www. insidehighered. com/news/2015/01/26/where-have-all-english-majors-gone\n\nSo where does this leave us? Many college students going into their studies now are focusing on business and marketing, and a large percentage of them are entering, you guessed it, STEM. So why does this attitude of elitism and superiority persist? \n\nIt persists because of the \"I Could Do That\" phenomenon. Skills that require technical training and instrumental knowledge such as those in STEM are \"fail/win\" skills-- you either know how to do them or you don't. Skills in the humanities tend to be \"soft\" skills, which are both highly subjective and have a low barrier to entry. Listen to many students in STEM (and I have) and you'll hear them saying, time and time again, \"writing is easy. Given enough time, I could bang a book or essay out.\" (That[.] a real quote.) \n\nNow for some psychology. When young people feel marginalized or ostracized, they move toward skills that will distinguish them-- areas in which their competence demonstrates \"mastery,\" not just familiarity with material. These young people also are drawn toward the \"just the facts\" aspects of science. Despite the fact that many wonderful scientists can tell you that soft skills are necessary for their work, Redditors aren't there for that. They're there for superiority, for the idea that their line of work or study sets them apart. In addition to this, Reddit[.] audience tends to emphasize monetary success because they tend to participate in a largely consumerist and product-oriented economy. Therefore, they fetishize the work that will grant them the greatest status in that world. \n\nHumanities and liberal_arts are often about learning how the world is interconnected, and (at least in my classes) are about learning that your experience is just one among billions of equally valuable ones. \n\nThat[.] not a very Reddit-friendly idea. \n\nIf Redditors really wanted to give life advice, they would give something similar to the advice that I give my students. It goes something like: \n\nThere[.] a \"five year flip\" in the job market. Many of the openings that your families and friends tell you about are reflective of data or anecdotal evidence from about one to five years ago. In reality, by the time you hear that a job opening exists, decide it[.] a good idea, go to college for two to four years for it, and graduate, that job has been taken by someone else. Now, sure, you probably hear about jobs that are \"always in demand,\" such as manual labor, but those jobs don't require college degrees-- if you want one of them, go get it. \n\n(In reality, there[.] lots of data that says it[.] getting pretty hard to find good apprenticeships, and that as the job market gets tougher it get tougher in those careers as well, but that[.] an economics discussion that[.] not up our alley today.)\n\nIf you're going to college for marketing because you think marketing on Snapchat is fascinating, you're not in the_right path, because that will be gone when you graduate. Everything will have changed, and everything is going to keep changing, at a faster and faster pace, as the future accelerates the job market. \n\nIn reality, you're much better off figuring out what you like, and what you're good at, and following it. Hone your skills, double-down on your abilities, and become an assured worker. Learn to communicate, to read everything well, be it data or books, and learn to be adaptable. You can train yourself in a job on your laptop or at an internship or intensive. What you're doing here is to train YOURSELF. \n\nAnyway, that[.] my two cents. \n\nSource: I'm in academia. If it[.] not obvious from my emphasis on its importance, I teach communication. "}