{"doc_id": "207", "name": "2016_06_humanities_student_major_2049_uncensorednews", "namespace": "we1sv2.0", "metapath": "", "pub": "uncensorednews", "title": "2016-06-humanities-student-major_2049_uncensorednews.txt", "pub_date": "2016-06-29T00:00:00Z", "Sentiment": "0.053", "Subjectivity": "0.33", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "297", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4qe0qj", "Reddit_id": "d4saypy", "Subreddit_id": "t5_2yck5", "Commenter": "HRE_Implying", "length": "1796", "content_scrubbed": "Pomona[.] new Latinx club was actually planning on creating a 'SPOC calling-out' committee\" to target Latino students who did not agree with them,\n\nAh,  that takes me back to when I was active in my university[.] conservative students organizations.   In my first year I had a little spat with Latino studies people (and some other humanities hipsters) because some harpy felt like I was betraying \"our race\".  I was actually completely unaware we had a Latino studies department and I had never met any of them before.  The people who make lists like SPOC are obsessed with finding things that offend them.   They'll look through pages and pages of social media posts and records to find any \"traitors\".   \n\nAt first you feel a bit intimidated by all of the people swarming you,  especially when it[.] your fellow \"conservatives\" who are criticizing you.  But it makes your convictions more firm and it makes you stronger.  You have to be strong because a good number of university conservatives support nonsense like safe spaces and open borders,  you'll eventually find yourself with no allies. It took a while,  but I eventually felt pride when people yelled \"xenophobe!\",  or when I was accused of betraying my fellow non-whites. \n\nI became more and more hard-right as the years went on though.  Eventually I was so disillusioned with all of these \"conservatives\" I quit student politics suddenly in the middle of my fourth year.  I toyed with the idea of starting my own far-right/paleocon association but I was too burned out from my studies and political infighting to care,  and I was going to graduate in a few months anyway,  so  the association probably would have died with my graduation. \n\nThose cocksuckers at the conservatives association still send me emails about donations too.  \n"}