{"doc_id": "2008", "name": "2016_08_humanities_student_major_1586_latestagecapitalism", "namespace": "we1sv2.0", "metapath": "", "pub": "LateStageCapitalism", "title": "2016-08-humanities-student-major_1586_LateStageCapitalism.txt", "pub_date": "2016-08-22T00:00:00Z", "Sentiment": "-0.061", "Subjectivity": "0.312", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "260", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4yspmx", "Reddit_id": "d6s5hgz", "Subreddit_id": "t5_39qgx", "Commenter": "DrSalv", "length": "1429", "content_scrubbed": "That thread pissed me off when I saw it. Guess what classes these people always want to replace : Arts and Humanities. Every fucking time, it[.] : \"Yeah fuck history and French and English and psychology, every child should be forced to be a STEMlord! Who cares if they suck at sciences and math, force them to take coding too!\" I've even see people argue for taking shop classes out of schools in favor of computer classes. If you are not good at, or don't like coding, why should you be forced into it? That[.] what secondary education is for. School should be a general education and include a broad amount of subjects. Not forcing hardore math and sciences on unwilling students.\n\nI always take shit like this personally, because at my high school the only electives were advanced maths and sciences. There was 1 history class available, and shop classes were underfunded as fuck. I barely passed maths and physics because I had no other choice. I did an Arts degree and got amazing grades, and I loved every second of it. That[.] what I'm good at and I love it, why should people like me be prevented from having this in school? I may never get a job, but at least I didn't go into STEM and fail out after a year. I fucking despise STEM because of their fucking arrogance. Fuck off and leave the few Humanities classes left alone. Just because you hated French class in high school does not mean all liberal_arts are worthless."}