{"doc_id": "44", "name": "2016_06_humanities_student_major_445_goodlongposts", "namespace": "we1sv2.0", "metapath": "", "pub": "goodlongposts", "title": "2016-06-humanities-student-major_445_goodlongposts.txt", "pub_date": "2016-06-06T00:00:00Z", "Sentiment": "0.124", "Subjectivity": "0.387", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1140", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4mr9ka", "Reddit_id": "d3xv265", "Subreddit_id": "t5_35ei4", "Commenter": "annnm", "length": "6483", "content_scrubbed": "It[.] a neat long post, but i'm not sure his post lives up to its own hype. My numbers correspond to his numbered points:\n\n. 1. i think it[.] better to see aggregate data. there[.] no doubt, for instance, that some car dealerships take some people for a ride. But at what proportion? Certainly a car salesman who claims to have the lowdown on the trade is going to claim that he has encountered a lot of nasty practices. and indeed, those claims can be true. But truly, it cannot be THAT bad. there[.] an MSRP, for instance. you can't upsell a 19kmrsp corolla for 30k to that many people. you might get a shittier deal, and on average a lot of people do, but on average, a lot of people also end up with a great deal. Add in a lot of lemon laws and we have to come to some sort of middling conclusion where it[.] probably bad on its worst day but not as bad as its worst critic would have you believe. \n\nan industry insider is certainly in a position to see the worst, but only listing the worst could simply be a side effect of only remembering the worst. for instance, at my alma mater, i don't ever recall seeing a book at the store that was 200% higher than online. i basically always bought online after comparing with my own bookstore. And by my senior year, my bookstore was price matching amazon. Given the fact that amazon clearly exists, how many of these deals are being, \"celebrated,\" when you know that the students are obviously going to buy online? A lot of this logic really doesn't seem to make a lot of internal consistency. What proportion of modern students doesn't check amazon, for instance, for the normal price text? \n\n. 2&3. again, i'd like to see more data. how often does this happen? the PI of my lab is a tenured prof. she old. she teaches immunology. she[.] been using whatever edition of the kuby book forever. when someone else teaches that same class on a different semester, they use the same book. she[.] not under contract for the kuby book. she just prefers it, tells the bookstore, and they arrange it. i've also talked with some tenure track (read: not tenured) profs about their book assignments, and there wasn't much pressure on them. I'm at an R1 though, so maybe the institution is dealt with differently than for instance small liberal_arts colleges. it would not behoove any publisher to piss off an institution with 30k students and get blacklisted.\n\n. 4. i'd like more data on that. Something we have to note is that college students are increasingly pirating their texts. That means that for publishers to stay in business, they have to raise prices. the question is whether they're exploiting students. Mcgraw hill stock seems to suggest: yes. Pearson publishing stock seems to suggest: no. Perfect analyses? no. I simply expected more from an insider[.] view than, \"shit costs a lot when sold, but is cheap to produce.\" Analogically, indie games cost a lot, but are, \"cheap,\" to produce in the sense that it really doesn't cost much more to allow one extra download. the cost is in the production and risk. not every textbook is going to succeed. And you want an industry that[.] willing to continue to take such risks. It[.] a better argument for self-publishing imo. \n\ni'm not the greatest fan of publishers. i'm simply trying to see the issue from more viewpoints than just, \"publishers are complete and utter assholes,\" based on nothing more than the fact that the final product is expensive. Which is what i'm almost certain the majority of the commentors in that thread are coming from. It[.] not wrong, but somewhat shortsighted. this is very similar to the issue of drug R&D. There[.] literally no doubt in my mind that biomed industry and academic people view drug prices very very differently from the lay person for reasons unrelated to personal profit. That is only just to say that the lay interpretation of how any field work is often very incomplete. That isn't to say that lay-judgement can't be the best judgement. only that by the nature of their ignorance, probably isn't the most substantiated one. \n\n. 5. I agree with his analysis, but also disagree. teaching style and technique is constantly refined. The difference between, for instance, the first edition larson calc textbook is a miles away from whatever edition they're currently on. he[.] probably right that there doesn't need to be a new edition every year. but he[.] also wrong that there doesn't ever need to be a new edition. people are constantly making teaching innovations. to say that educational research always amounts to no actionable suggestions is somewhat anathema to my belief that we can always improve something with good research. And i do believe that there exists good educational research. one of my fav mentors was a primarily undergrad education researcher.\n\nalso, a fluid field like bio, which is my specialty, would very much benefit from constant new editions. only like 1-2 years ago did someone finally confirm that the lymphatics exists in the brain. this is a pretty fundamental finding. so much so that a lot of people thought it was already established. And of course there exist constant innovations in biotechnologies. to the point where a genetics text published but a decade ago would miss some of the most exciting new and relevant technologies of today such as crispr or next gen sequencing. I can see huge differences in such texts that might seem minor to a publisher. i don't expect a publishing employee to see the significance of changing the name of a protein that[.] been re-named by a professional society. But that[.] important. I once proofed a colleague[.] paper and corrected a protein name based on what i learned from a reference book. turns out the society for that system had decided to rename the protein to fit with a newer convention. that type of information is kind of important for the serious academic. Yeah, the internet has made all of that a bit outdated, but as a prof, that type of accuracy is somewhat desirable.\n\nthere[.] a lot of truth to the points he brings up, but also a lot of obvious misconceptions. i don't claim to be an expert. i'm not a prof. i don't work for a publisher. but i'm aware of the authors of such texts. and i'm aware of the profs who require such texts. in fact, my boss is one such person. And just as a person who thought about the topic and with something of a halfway decent connection to the prime players in that marketplace, the holes he leaves are somewhat glaring. "}