{"doc_id": "2032", "name": "2016_08_humanities_student_major_1851_unitedkingdom", "namespace": "we1sv2.0", "metapath": "", "pub": "unitedkingdom", "title": "2016-08-humanities-student-major_1851_unitedkingdom.txt", "pub_date": "2016-08-25T00:00:00Z", "Sentiment": "0.169", "Subjectivity": "0.349", "Score": "21", "Upvotes": "21", "Downvotes": "0", "Wordcount": "347", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6vxpf6", "Reddit_id": "d6vy5mm", "Subreddit_id": "t5_2qhqb", "Commenter": "Ziphoblat", "length": "1915", "content_scrubbed": "I did my SATs, and had my teachers telling me \"you need to revise for these, they're important\". I didn't, because I was 10 and didn't care about school. I achieved top results regardless. I did my GCSEs, and my teachers told me \"you need to revise for these, they're important.\" I'd heard that one before... so I didn't revise again. Got great results anyway. It[.] an easy spiral to get caught in.\n\nBut yes, it is my fault that I didn't put the work in at uni. I don't blame anyone else for that. However, I don't think I should have gone to uni in the first place. Even if I had have attained my degree, it would have contributed nothing towards my career prospects. Without it I'm still doing far better than the vast majority of people from my course who did graduate.\n\nI'm simply not interested in academia. I love to learn and expand my knowledge, but the whole format of university simply doesn't gel with my way of working. Being there didn't inspire me in the slightest. The problem is that nobody at school ever even mentioned the alternatives to us.\n\nThere are plenty of higher apprenticeship/school leaver style programs that will do *far* more for a certain type of 18 year old than going to university to study whatever liberal_arts of underwater basket weaving course they fall into. I was one of those 18 year olds, but I was never exposed to these options. I achieved good grades, so I ought to go to university. It was that simple to them. I believe that this stems from schools using the percentage of their students that go to university as a metric for their success as an educational institution. Not the number of them who end up in professional careers, or their average salary 10 years down the line, simply how many of them went to university. Past that point, they don't care. They weren't interested in my prospects for the future, just in getting me off to university for their metrics."}