{"doc_id": "3", "name": "2016_06_humanities_student_major_53_rwby", "namespace": "we1sv2.0", "metapath": "", "pub": "RWBY", "title": "2016-06-humanities-student-major_53_RWBY.txt", "pub_date": "2016-06-01T00:00:00Z", "Sentiment": "-0.007", "Subjectivity": "0.276", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "434", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4m0or6", "Reddit_id": "d3rnvfm", "Subreddit_id": "t5_2vhg0", "Commenter": "Arch1V3", "length": "2541", "content_scrubbed": "Edit: I'm making the below assumptions on that Cinder and Salem are working together and that all the dust wasn't completely used up by the end of the 3rd volume. \n\nI heard in one of the livestreams that Dust is mined and that it was heavily hinted at, that it is a limited resource. I think Cinder[.] and by extension Salem[.] ultimate plan is remove humanities' access to dust and force them to rely on such individuals who can access their insane powers without it; e. g. The Maidens and Silver Eyed Warriors. If you also notice in the starting conversation, Salem essentially says dust is the entire reason why civilisation still exists. If all of it were to be stopped or taken out of supply, then civilisation will collapse.\n\nDust fuels the entirety of all ranged weapons (some melee weapons work without dust, see for example the Crocea Mors), and without it all that remains are martial arts (Ren), semblances (Glynda) and the inexplicable (Seasonal Maidens and Silver eyed warriors). It seems that the majority of the armies (or Atlesean army atleast) are based on ranged dust weapons, so losing them would strike a major blow.\n\nWhat also stacks up with this is Ozpin[.] and Cinder[.] actions. For one, Cinder seizing the role of the Fall Maiden is removing 1/4 of the seasonal power from fighting the Grimm when the dust is all gone, let alone excluding wielding that power against the others. \n\nFor another, wildly speculating for a second, given Ozpin[.] conversation with Salem, it might be assumed he knows her plan to demolish civilisation (by removing dust). By putting all of his hopes into Ruby, a silver eyed warrior, he hopes to counter her. At the very end of the series, this is supported by Qrow[.] statement, that Silver eyed warriors were famous fighters, the antithesis of Grimm before civilisation, before Kingdoms, and while he didn't say this, it is implied; before dust. Edit: In addition, the entirety of the long_term members of the Inner Circle seen so far (those who protect the maidens), excluding James Ironwood due to his apparent short-term membership, wield no weapons which appear to use dust (Ozpin has a cane, Glynda her semblance and Qrow a clockwork powered scythe), despite its common usage among other experienced Huntspeople like Raven. \n\nHope that helps. Feel free to disagree, as I have only just watched the series, but as someone with a new perspective I thought this might help.\n\nEdit: One flaw with the above theory though is that the above-mentioned captured Dust would have to be hidden away. "}