{"doc_id": "184", "name": "2016_06_humanities_student_major_1745_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2016-06-humanities-student-major_1745_AskAcademia.txt", "pub_date": "2016-06-24T00:00:00Z", "Sentiment": "0.145", "Subjectivity": "0.394", "Score": "21", "Upvotes": "21", "Downvotes": "0", "Wordcount": "324", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4pp5zh", "Reddit_id": "d4mvikf", "Subreddit_id": "t5_2sakj", "Commenter": "Miles_Sine_Castrum", "length": "1903", "content_scrubbed": "I don't think there[.] going to be any immediate impact, but there[.] certainly going to be some big knock-on effects for higher education and the university sector in the medium-term (next 5 years or so). The two factors most relevant to postgraduate study (IMO) are both to do with money:\n\n* UK universities will attract a lot less EU master[.] students, particularly universities outside of the Golden Triangle (Oxbridge + the big London unis). This is because they will be paying higher fees (no more EU fees rate) and because there[.] no guarantee of being allowed to study or work in the UK beyond a masters, due to the need for visas. This will mean a drop in fee income for universities and departments, and will very probably affect humanities and social_sciences more, since masters fees very often subsidize their other activities. This will result either in budgets being slashed for departments or fees going up for UK students.\n\n* EU funding will no longer be available for research projects. EU grants fund a very big portion of science which goes on in UK universities (they're much less important, although not totally absent, in humanities and sco-sci). UK-based academics will no longer be able to bid for this kind of funding, and so will be able to employ less PhD, postdocs and invest in labs, equipment and cutting-edge research.\n\nNow, both of these problems could potentially be mitigated by extra investment in universities from the money (the mythical £350 million per week, or whatever it turns out to be) that the UK saves by leaving the EU. In fact, I believe that the Leave campaign pledge that these kind of things would be mitigated by increased funding in the event of a Brexit. However, the actual chances of this happening vary enormously based on your political opinions on Johnson, Gove and May: the people who will, in all likelihood, be controlling the purse-strings.\n"}