{"doc_id": "167", "name": "2016_06_humanities_student_major_1591_philippines", "namespace": "we1sv2.0", "metapath": "", "pub": "Philippines", "title": "2016-06-humanities-student-major_1591_Philippines.txt", "pub_date": "2016-06-23T00:00:00Z", "Sentiment": "0.129", "Subjectivity": "0.244", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "384", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4pg4ua", "Reddit_id": "d4ko6db", "Subreddit_id": "t5_2qjov", "Commenter": "Vordeo", "length": "2320", "content_scrubbed": "I don't have specific knowledge, but the way these things generally go, the transfer of classes from the Manila campus to Diliman probably would've taken some time, so I'd guess that only a couple of courses had started being held in the new campus?\n\nIn terms of backstory, 1950 was just a couple of years after the end of WW2, so I'd figure alot of Manila was still under reconstruction.\n\nNot exactly what you're looking for, but I was actually just looking at [this](https://www. facebook. com/AkoCKimfanpage/photos/?tab=album&album_id=899783093423304) collection of old Philippine photos, and they are time stamped, so maybe you can find something there that helps.  There[.] a bunch of pics, and I honestly haven't seen them all, so might even be a pic of UP in there somewhere.\n\nGood luck!\n\nEdit: Just ran across [another website](http://upd. edu. ph/history2/) while continuing to avoid doing anything productive.  Always interesting to learn more about my uni[.] history.\n\nArticle below:\n\nThe Old Diliman Campus – 1950s\n\nThere were only a few permanent buildings in the Diliman campus then: the Administration, later to be called Quezon Hall; Liberal Arts, now Palma Hall; Engineering, now Melchor Hall; Law, now Malcolm Hall; Education, now Benitez Hall, and UP High. Most of the rectangular-shaped structures in the map were quonset huts, whose G. I. roofing arced and also served as walls. The Conservatory of Music, precursor of the College of Music, was in Area 1, occupying what looks like quonset huts in the map.\n\nThe University Theater and the University Gym were at the back of the College of Engineering, and so was the Infirmary. The Social Hall, where monthly socials used to be held, was in a makeshift building just across College of Law (there was no Law Center yet).\n\nThe UP ecumenical chapel was a big makeshift hut, located near the present site of the Church of the Holy Sacrifice. There were eateries, including Little Quiapo, which were in the other end of the same site.\n\nThere was a golf course in Area 17, with the golf club house where the Faculty Center is now. There were several quonset huts which served as a dormitory for men, where Ipil and Yakal residence halls are now. There was also an observatory facing Tandang Sora st., near the College of Education and across the old UP High."}