{"doc_id": "1867", "name": "2016_08_humanities_student_major_286_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2016-08-humanities-student-major_286_AskHistorians.txt", "pub_date": "2016-08-05T00:00:00Z", "Sentiment": "0.055", "Subjectivity": "0.34", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "327", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d65990t", "Reddit_id": "d65aqry", "Subreddit_id": "t5_2ssp3", "Commenter": "restricteddata", "length": "1810", "content_scrubbed": "(Separately — and I tack this on because my wall of text has hit a limit — it is worth considering that the coalescing of technical disciplines around technical subjects often has to do with funding sources, as well. So it isn't just good-will or interest that makes cancer a major topic of medical research — it[.] the fact that there[.] also a lot of funding opportunities for studying it, so you can make a career while doing that. For something like cancer we're all mostly inclined to say, \"that[.] great, keep it up!\", though there are of course some who argue that the pie ought to be split up to other diseases and conditions as well. But for other funding sources it can get questionable. We know a _lot_ about the marine biology of coral atolls, for example, not because they are inherently interesting to scientists, but because the US and French nuked a bunch of them in the Cold_War and then wanted to know what the effects were, so funded a huge number of studies into them. We know a _lot_ about deep-sea geology not because it[.] inherently interesting but because the US Navy wanted to know how to hide subs down there. Heck, we know a lot about cancer _in part_ because people were worried about our post-apocalyptic futures. Our areas of \"deep\" knowledge around certain topics are often shaped by these kinds of forces. In history, there are some areas that have attracted a lot of funding interest — digital humanities, anyone? — but in general there is just a lot less money at play for both better and worse. I have been at panels where historians of Russia lamented that the end of the Cold_War killed a lot of funding opportunities, while others on the same panel pointed out that just because there was a lot of funding didn't mean there was a commensurate amount of good work being done.)"}