{"doc_id": "1944", "name": "2016_08_humanities_student_major_990_atlanta", "namespace": "we1sv2.0", "metapath": "", "pub": "Atlanta", "title": "2016-08-humanities-student-major_990_Atlanta.txt", "pub_date": "2016-08-15T00:00:00Z", "Sentiment": "0.013", "Subjectivity": "0.3", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "268", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6hwtwu", "Reddit_id": "d6i2cwv", "Subreddit_id": "t5_2qiq9", "Commenter": "ATL_Research_Drone", "length": "1665", "content_scrubbed": "Charter schools are quasi-public. Some tend to give neighborhood preference for admissions, like the Neighborhood School in Grant Park. A major reason they have lower prices per pupil is because charters aren't paying pensions to retired teachers like APS is. Charters are also typically allowed not to accept special education students who are more expensive to teach (just as note, one of the major expenses at the Department_of_Education[.] level is special ed and special ed is really costly). Another big reason charters have lower costs per student is because they, much like Teach for American, they tend to recruit recent liberal_arts graduates as teachers instead of experienced teachers. It[.] unsurprising to think that a charter school can hire a recently minted history or literature grad (who plans to teach for a couple of years before going to grad school) for less money than a unionized education major with 20 years of experience. Charters do typically have a lower cost per pupil, but the comparison to regular public schools is apples and oranges. I'm also not opposed to charter schools, because there should be innovation in education, but they are an entirely different beast compared with regular public schools.\n\nEdit: I forgot to mention \"Cream skimming\" which is another major issue with charters. It[.] not uncommon for charters to make the admission process very difficult under the assumption that it will weed out dumb parents who likely will have dumb kids (intelligence has a strong hereditary correlation, so making admissions difficult screws over the \"diamonds in the rough\" kids, but largely protects schools from likely idiots).\n"}