{"doc_id": "1864", "name": "2016_08_humanities_student_major_266_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2016-08-humanities-student-major_266_politics.txt", "pub_date": "2016-08-04T00:00:00Z", "Sentiment": "0.126", "Subjectivity": "0.23", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "276", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d64nqtk", "Reddit_id": "d64pv4s", "Subreddit_id": "t5_2cneq", "Commenter": "TheCodexx", "length": "1565", "content_scrubbed": "The system could be partially fixed by allowing some student loan debt to be defaulted all (at serious penalty to that person[.] credit), which would force schools to compete more than they do now. It would help ease the problem of schools not spending money where it counts: on quality of education. Bond money is used frivolously now compared to a decade or two ago, because the incoming students are fixed and there[.] no penalty once they owe something. That[.] money in the bank with zero risk.\n\nThe other part of the problem is simply that it requires more more hours now to pay for school and an apartment than it did fifty years ago. I'm not saying \"just raise the minimum wage\", because that doesn't fix the underlying problem of proportion meaningfully. But the amount of disposable income in the country needs to increase dramatically, or at least stop falling before nobody has any extra money left to spend.\n\nThe other half of the problem is with the students themselves: I don't know what to tell the Liberal Arts student who \"really wanted to find themselves, you know?\", or the English & Literature Major who really likes reading, but now can't find a job in said major. If you want to be employable, you need to learn a skill that[.] in demand, not expect demand based on where the supply is. \n\nThere is *always* trade school. There[.] always alternatives to a degree that will work better for some people[.] needs. It[.] less glamorous than claiming you have a degree, but it[.] a good way to make good money without breaking the bank on an education."}