{"doc_id": "1906", "name": "2016_08_humanities_student_major_623_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2016-08-humanities-student-major_623_UofT.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.085", "Subjectivity": "0.303", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "261", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6bgeyp", "Reddit_id": "d6c2ypr", "Subreddit_id": "t5_2rbaq", "Commenter": "m_c_pugh", "length": "1559", "content_scrubbed": "The first-year seminars exist so that first-year students can have a small-class experience.  That[.] the main selling point.\n\nThe secondary selling point is that it fulfills breadth requirements.  \n\nI'm not familiar enough w/ dyscalculia to know whether it[.] an arithmetic thing or a mathematics thing.  There[.] plenty of mathematics that has nothing to do with numbers and calculations.  I do know that a dyslexic can become a top researcher in the humanities but that they would have a harder time than someone who reads easily.  (I don't know if dyscalculia is a direct analogue of dyslexia or not.)\n\nIf you have dyscalculia then I'd encourage you to never stop trying just as I'd never tell someone w/ dyslexia to give up reading books.  And certainly a first-year seminar would be more fun than a section of MAT135.  That said, there are plenty of ways to fulfill breadth requirements! :o)  I was just posting the information as a general FYI.\n\nI've heard that math students are often frustrated in humanities courses in that while there are math courses created specifically for humanities and social science students (MAT271H) they can't find anything analogous in the humanities and social_sciences.  They just try to hunt for courses that don't require reading 200-300 pages per week.\n\nBecause of the way math books are written, by their second year in university many good math students have learnt that it may take an hour to puzzle out one paragraph of a book.  This often leads to very slow reading as the default approach to reading text.   :o)\n"}