{"doc_id": "1983", "name": "2016_08_humanities_student_major_1314_advice", "namespace": "we1sv2.0", "metapath": "", "pub": "Advice", "title": "2016-08-humanities-student-major_1314_Advice.txt", "pub_date": "2016-08-18T00:00:00Z", "Sentiment": "0.135", "Subjectivity": "0.394", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "614", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4ycz4h", "Reddit_id": "d6mvdur", "Subreddit_id": "t5_2qjdm", "Commenter": "swagberg", "length": "3434", "content_scrubbed": "Firstly, let me say that you shouldn't freak out. I had a similar experience to you, and managed to get into some really great colleges. Like you, I had a fairly poor GPA after my first year in Highschool. I improved somewhat sophmore year, but at the end of the year I stood with a 2. 8GPA. I realized (like you) that if I kept it up I would have a lot of difficulty getting into quality colleges, and I'd have trouble earning merit scholarships. \n\nHere[.] what I did from there on out. \n\n**I got involved**\n\nFreshman year,  I did very little but hang out with friends. From sophomore year onward, I got involved in clubs, sports, and other activities. I would recommend getting on this now, because that will put you in a good spot for leadership roles by the time you're a senior. My last year in Highschool I was VP of the Model UN team, Captain of the Tennis team, and Class President. When colleges review your application, the first thing they're going to see is your GPA, and if it[.] not on the high end of the spectrum, they're going to look for things that you might have been doing instead of studying. These activities really helped because they showed that I was active in my school[.] community, and my leadership roles demonstrated commitment, and that I wasn't just showing up at a meeting once a month for 30 minutes.\n\n\n**I did well on the ACT**\n\nIf the first thing your college sees is your GPA, the second thing they see are your standardized test scores. It[.] a proven fact that you can do better on these exams if you study beforehand. This doesn't have to mean that you need to shell out big bucks for a tutor, make sure you get a practice book and drill. I know a guy who improved from a 24 to a 32 with practice. This is arguably the easiest part of the whole equation because it matters nearly as much as grades, and with a couple hours practice every week your junior year, you can do really well.\n\n**I got better grades**\n\nIt sounds like you already know you need to do this, which is great. However, whatever the reasons are for your poor past performance, they aren't likely to completely disappear.  I don't know you, but I'll say that the way I improved academically was mainly through self reflection. I looked at my past academic performance, and I tried to figure out where I had gone wrong, why I lacked motivation, etc. Once I knew that procrastination and lack of organization was the problem, it became easy to work toward a better GPA. I also took mainly honors classes with a few AP courses thrown in, which helped show colleges that even if I didn't have the highest GPA, I was taking challenging classes. You aren't going to get your unweighted GPA to a 4. 0 at this point, but you could potentially have a high weighted GPA, and you can definitely show a lot of improvement going forward. \n\n\n\n\n\n\n\nLastly, what do you mean by \"good colleges\"? Do you mean good liberal_arts colleges (Pomona, Carleton, Vassar, Grinnell, etc), good large universities (Emory, Vanderbilt, Duke, etc), good state schools (UCLA, Michigan, Madison, etc) or the Ivies? Do you mean other schools entirely? There are plenty of great schools where you'll get an amazing education, even if they don't have the lowest acceptance rate. What are your goals here? Different types of schools review applications differently, so knowing what you're aiming for can be really helpful as you work to make yourself a better applicant."}