{"doc_id": "2013", "name": "2016_08_humanities_student_major_1610_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2016-08-humanities-student-major_1610_AskHistorians.txt", "pub_date": "2016-08-22T00:00:00Z", "Sentiment": "0.125", "Subjectivity": "0.403", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "592", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6rz8qv", "Reddit_id": "d6snfdl", "Subreddit_id": "t5_2ssp3", "Commenter": "khosikulu", "length": "3428", "content_scrubbed": "I have to level a lot of this with prospective graduate students who ask about applying to the program in my department.  Only in a very few fields are we competitive; we won't bring in graduate students we can't fund fully or award a useful PhD.  We also can't afford to make those funded offers to people who are most likely to go elsewhere, thanks to budget contraction, because by the time we go down the list our second-tier candidates have accepted other offers.  Some other humanities departments where I am have started in the second tier with offers, or increased unfunded admissions to pad numbers for purposes of improving institutional AAU standing in response to pressure from above.  The former is distressing, but the latter is, to me, nothing short of unconscionable academic malpractice.\n\nThe point about branding is very important, but sometimes it does reflect real competitiveness--in some fields, like mine, a school with good resources is well-known and carries a huge amount of weight.  If you go to Wisconsin, or Northwestern, or BU, or Michigan State, and get a PhD in African history with a known advisor, you stand a very good chance of getting a job.  But the skill-set you must master and your time to degree tend to be tougher to deal with and harder to get than they are for many other fields.  But any school that places people well, and has good metrics, also provides good support as a general rule, which means if you get in you should receive a funding package and have good opportunities for development that may include avenues beyond the professoriate.  /u/restricteddata is spot on about the abysmal conditions that exist in the job market at present, so you must stand out for many paths, but it is essential to have acceptable plans B and C (and so on) continually in mind.  My own doors for \"plan B\" and \"plan C\" did not finally close until I got tenure, because the insecurity became habitualized over time.\n\nThat raises another issue here: even if you don't go into it depressed, be aware that graduate school will heighten your mental stress [edit: emotional stress included] enormously.  Be sure you're ready for that as you can be--and keep in touch with people who can tell you when it[.] clear something is not right and push you to see someone.  Work-life balance is not only bad, it[.] almost nonexistent.  I've watched people[.] relationships (romantic and familial) collapse amidst graduate school, we've had two students actually suffer nervous breakdowns in our program here, and in my own PhD work I was unduly miserable for years until I realized that depression wasn't a failure on my part and it was OK to get help so that I could feel good about what I was doing again the way I had before.  Grad school tends to appeal to people who push themselves and internalize blame more than they should, when it really ought to be part of a great journey. Unfortunately, the do-or-die environment around so much of it, from exams to the job market and even beyond to (hopefully) tenure, does not help one bit.  But it does help to be aware of that particular peril, which we still don't talk openly about as much as we should.  Fortunately that[.] starting to change, but openness on these sensitive issues takes a backseat to the legal exposure a faculty member faces if they do anything other than simply point a student at counseling resources.\n\n[edits: wording, clarification]"}