{"doc_id": "1952", "name": "2016_08_humanities_student_major_1058_academiceconomics", "namespace": "we1sv2.0", "metapath": "", "pub": "academiceconomics", "title": "2016-08-humanities-student-major_1058_academiceconomics.txt", "pub_date": "2016-08-15T00:00:00Z", "Sentiment": "0.061", "Subjectivity": "0.299", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "1074", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6j42d6", "Reddit_id": "d6j5iq6", "Subreddit_id": "t5_2r6jd", "Commenter": "alandbeforetime", "length": "6448", "content_scrubbed": "Awesome, thanks for the elaboration. I'll try to respond as best as I can.\n\n What I would intend to do would be to study how the first human societies got started.\n\nThis would involve a lot of history and anthropology, which I didn't see in your original list. It[.] a very fascinating idea though, and I think you should pursue it if you choose to.\n\n Answer \"Why did the first individual family groups of humans decide to band together into tribes?\" & \"What were they hoping to accomplish?\" & \"How did they hope to accomplish it?\" & \"What worked and didn't work?\" & \"What corrupting influences acted on these societies and what were the antecedents and consequences thereof?\"\n\nThis is so complex that whole fields, plural, are working on deconstructing these questions. Top researchers often focus so narrowly that they debate over *just* the corrupting influences in e. g. Greek society, ignoring every other society in every other time period. And even then, the questions are innumerable. This might be an unachievable goal not because it[.] technically impossible, but because you don't have a long enough lifespan.\n\n Repeat #1 for all the stages of social advancement from tribes to nation-states to modern multinational organizations. Look for patterns of constructive and destructive, as well as limiting and delimiting practices and ideas. I would use economics to show that a given thing was constructive/destructive or limiting/delimiting.\n\nYou'd need several lifespans.\n\n I wouldn't be working on moral solutions. Morality is subjective. \n\nNo. Here I'm going to be very firm. This is wrong. Very, very wrong. Objectively wrong.\n\nFor starters: Morality, while potentially having a wide range of acceptable outcomes, is broadly agreed upon to be not fully subjective. It[.] rather unfortunate that full-blown cultural relativism has become a widely accepted position. Is indiscriminate genocide morally right or wrong? Even if you default to an answer like \"Well, the only reason we don't kill is because we're evolutionarily determined to propagate our genes\", at the very least, if we can almost all agree that indiscriminate genocide is a poor idea, then you could say that this is close to an objective moral fact. This is a very simplified explanation, and if you want more elaboration on it, I can attempt to provide some. There exists a large amount of literature refuting this exact idea though, written by minds far more brilliant than mine.\n\n Politics isn't\n\nWhat, exactly, do you think politics is founded on? Do you think politics is somehow separate from morality? That politics doesn't depend on complex moral philosophical concepts for its foundation? Why do we have government? Why did we form states? Why do we sacrifice rights for protection? Why should I be loyal to my own country instead of another? Why do we value loyalty at all? How do you define value? Can it be measured? Are all types of value commensurable?\n\n\n though it touches subjective topics, but those can be shown to be factually right or wrong.\n\nI don't know how you'd even begin to determine if something is right or wrong using scientific empirical standards. Is funding for the arts right or wrong? Well, it doesn't help feed the poor, sure. Should we just axe art education then? Or are the arts okay because they provide \"utility\"? Well, how much \"utility\"? What is utility? How can that be measured? Should we even be prioritising utility? Why not virtue instead? \n\nWas the invention of the automobile good or bad? On the one hand, it helped modernise society and gave us a lot of the comforts we have today. But it might also be a driving force in smothering our entire planet to death. How can we determine this given our perspective? Is a simple \"GDP up, therefore good\" sufficient to answer this? \n\nNor is economics subjective, for the most part. \n\nEconomics is not \"subjective\" (debatable, depending on your definition of \"economics\" but I'm going to broaden this out) in the same way physics is not \"subjective\" and is therefore not prone to moral subjectivity *within* its scope. But morality is *outside* the scope of physics, and therefore physics is not so much *un*biased as it is *unable* to be biased. The bias exists in what forces are driving physics to do what it does. The invention of the atomic bomb was a major breakthrough in physics, and the way atomic bombs work is an empirical fact. There is technically no bias in the atomic bomb, because nuclear fission can't be biased. But was the invention of the atomic bomb *good* for society? *Should* we have invented it? Can physics even answer these types of questions? (Hint: no)\n\n\nEconomics can model the effects of a policy on markets and on the behaviors of groups of people, right?\n\nYes, although with varying degrees of accuracy, and it[.] highly dependent on the assumptions you bake into the model. And any normative policy implications you draw out of the model will rest on political philosophical grounds, which in turn rest on moral foundations.\n\n And game theory is \"the analysis of strategies for dealing with competitive situations where the outcome of a participant[.] choice of action depends critically on the actions of other participants\", right? \n\nYes, broadly speaking. I think you might overestimate the degree to which game theory is able to accurately model the real world though.\n\n Isn't that essentially the axis that public policy and political theory spin on? Should it not therefore be possible to use economics and game theory to model whether a given policy or decision will have a net positive or net negative effect, given likely responses to it and its initial and intermediate effects themselves?\n\nNet positive according to whom? By what standards? GDP growth? Lifespan extension? Median household income? At a more primary level, I might ask you **why** having a higher GDP is the goal? **Why** having longer lives is the goal? **Why** having more money is the goal?\n\nI still absolutely hold that your goal is unachievable even in theory, even after you laid out the specifics of your plan, and ignoring how insanely broad it is. However, if you wish to pursue public policy for the more general reason that you wish to help others, and you wish to approach this using an economic lens, then I strongly encourage you to do so, but not because scientific empirical solutions to moral and political problems exist.\n\nHope this helps."}