{"doc_id": "1946", "name": "2016_08_humanities_student_major_1002_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2016-08-humanities-student-major_1002_changemyview.txt", "pub_date": "2016-08-15T00:00:00Z", "Sentiment": "0.156", "Subjectivity": "0.381", "Score": "31", "Upvotes": "31", "Downvotes": "0", "Wordcount": "397", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6i6req", "Reddit_id": "d6i864f", "Subreddit_id": "t5_2w2s8", "Commenter": "lkjhgfdsamnbvcx", "length": "2396", "content_scrubbed": "I think we're talking about two different things, both of which might use the term \"safe space\" in their policy or whatever.\n\nMy uni had a \"queer lounge\" and a \"women[.] room\" (ok. I think it was actually a \"Womyn[.] room\". Anyway...) which sound like what OP was talking about; a single room (well, one for either group) for women or LGBT students, I guess for situations like OP described. I know a Christian group also had a \"refuge\" that seemed to be a similar concept; lot[.] of clubs and other groups had rooms for various purposes.\n\nBut those [.]afe spaces' wouldn't stop anyone doing anything anywhere else o the campus, except in those specific rooms. (But the groups running the rooms might lobby on campus-wide policy, like anyone else.)\n\nThe other way [.]afe space' might be used is in campus-wide policy. Such policy might include phrases like \"this campus is a safe space for people regardless of race, sex, orientation, religion, etc\", then maybe detail \"we won't tolerate racism, sexism, anti-LGBT speech, etc\" or something along those lines. I think *this* is the kind of \"safe space\" your articles refer to. Uni admin, and/or student groups, might step in if they found a speaker was coming to campus who they thought might violate that \"no racism, sexism, anti-LGBT\" stuff. \n\nWhether they're sometimes overly prohibitive sometimes, I guess that[.] a matter of opinion, but I think that[.] a different issue to the \"queer/women[.] lounge\" kind of \"safe space\" OP mentioned.\n\nI've also heard people complaining about uni/college [.]afe spaces' talk about \"trigger warnings\" lecturers might use when discussing certain topics. AFAIK this is mostly at the discretion of individual lecturers, rather than any official policy of \"when discussing X you must give a 'trigger warning'\". (For the record, I did a few humanities subjects where we studied stuff like lynchings, Boko Haram sex slaves, etc. Never got a 'trigger warning', really. We *were* told \"just  be warned; this video is pretty violent\" once or twice, I think, with clips with executions and stuff.)\n\nI'm not saying these things are never used innappropriately, or mightn't sometimes contribute to an over-sensitive mindset, but I do think they are blown *way* out of proportion on the internet, where it can sound like this stuff has much more impact than it actually does. Although I guess it varies with different schools.\n\n"}