{"doc_id": "158", "name": "2016_06_humanities_student_major_1491_history", "namespace": "we1sv2.0", "metapath": "", "pub": "history", "title": "2016-06-humanities-student-major_1491_history.txt", "pub_date": "2016-06-21T00:00:00Z", "Sentiment": "-0.025", "Subjectivity": "0.317", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "339", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4ivq0n", "Reddit_id": "d4iy9uz", "Subreddit_id": "t5_2qh53", "Commenter": "ClashOfTheAsh", "length": "1837", "content_scrubbed": "It[.] compulsory from when you start school at around the age of 5 to when you finish secondary school at around 18. It[.] thought in the very same way as if it was English (only English, maths and Irish are compulsory for the last 3 years of secondary) despite the fact of it only being used in the real world by the people who teach it (a lot considering every primary school teacher has to know it) and for a select few government jobs that involve promoting the language in some way.\n\nSo imagine trying to stay motivated to study a subject for 13/14 years of your life, that requires the same amount of time, or more, as English and maths (these are the only subjects in our college entry exams that require two 2. 5 hour papers, but Irish also has a oral examination and a listening comprehension on top of this) all the while knowing that you are never going to use it ever again as soon as you sit that last exam. And like English and maths, if you fail your Irish exams you cannot progress to college.\n\nThen the curriculum is generally based on the most depressing stories (almost stereotypically so). For example the novel every 6th year student (the final year) in the country had to read when I finished secondary school was about the trial of a woman who killed her baby by putting it in the oven after she came out of [Magdalene Laundries](https://en. wikipedia. org/wiki/Magdalene_asylum). In 3rd year we had to study a short story on 2 boys who hid in bags on a ship for the adventure, which subsequently sunk in a storm and the boys were drowned, from the perspective of a third boy who drew the shortest straw so had to tie the bags so the sailors wouldn't suspect anything.\n\nKeeping the language alive is great and should be done, but my God it should be done so as part of the arts and not by forcing everybody to learn it."}