{"doc_id": "131", "name": "2016_06_humanities_student_major_1259_asianamerican", "namespace": "we1sv2.0", "metapath": "", "pub": "asianamerican", "title": "2016-06-humanities-student-major_1259_asianamerican.txt", "pub_date": "2016-06-18T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.206", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "348", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4e3w3g", "Reddit_id": "d4ehdpm", "Subreddit_id": "t5_2rfyw", "Commenter": "metsuken", "length": "1946", "content_scrubbed": "The Asian American community already has deep-seated cultural issues with pursuing the arts and this sentiment on top of that is why so many AA artists have a hard time feeling any sort of loyalty to their own demographic as a consumer group.\n\nAbout twice a month, I see someone post a thread about local Asian American film festivals, and each time I see those festivals ignored. How do you think Asian American actors even enter the mainstream in the first place? If you don't pay to watch these performers in AA projects or humanizing roles, then why would any major movie studio want to bother bankrolling these projects when a much bigger audience would rather laugh at the scrawny little Asian guy?\n\nBasically, these films have a huge impact because:\n\n1. It puts Asian Americans in the film industry to work.\n2. It tells our stories.\n3. It brings the performers and the crew exposure so they can get picked for bigger roles. \n\nIf someone never produced Better Luck Tomorrow, guess what? You would've never seen John Cho. He got his first indie break working with Justin Lin. Ludi Lin just got his first big break by getting cast in Power Rangers, but before that, he had to work up the ranks in a bunch of short films.\n\nThis \"all mainstream or nothing\" mindset is probably one of the biggest things nuking AA talent. Black consumers love Tyler Perry movies. A lot of the actors in his films would've never gotten work otherwise, and some have crossed over to the mainstream.\n\nSo if you essentially ignore AA projects because it[.] not \"mainstream\" enough for you or it[.] not gonna \"make a big impact\" on White America, put yourself in the shoes of someone in the project like that, trying hard to get any sort of Asian American work done period, because you are very, very far from having any kind of sway or power over mega-powerful movie studios. Would you feel any sort of loyalty to those same people once you made it onto the big stage?"}