{"doc_id": "1879", "name": "2016_08_humanities_student_major_378_islam", "namespace": "we1sv2.0", "metapath": "", "pub": "islam", "title": "2016-08-humanities-student-major_378_islam.txt", "pub_date": "2016-08-06T00:00:00Z", "Sentiment": "0.13", "Subjectivity": "0.485", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "657", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4whdg1", "Reddit_id": "d66z7ui", "Subreddit_id": "t5_2qhbp", "Commenter": "[deleted]", "length": "4336", "content_scrubbed": " \nIn his important work on *Orientalism*, Edward Said articulated the ways in which the Euro-American culture of power, embodied in its discursive formations, has represented, re-organized and eventually reconstituted the Orient, converting it into a counter image of the Enlightenment, a place that is precisely what Europe is not but one that must constantly strive to become European. Said[.] narrative, reflecting a particular conception of power and knowledge directly inherited from Foucault, remained faithful to the Enlightenment notions of secular humanism and anthropocentricism. Said was – and I suspect remained so to the end – blind to the profound effects of the Enlightenment distinction between the Is and Ought as well as between fact and value, thereby failing to see the necessary effects of the modern project in general, and the liberal project in particular. Said[.] work, liberal in every important way, saw light at the end of an era, one that still held some promise for a better future. But since the eighties and the nineties, Said[.] cherished values of secular humanism, and especially its implied but *ontologically* and *epistemologically* entailed anthropocentricism have been at the center of critique that recalls the disenchantment with the modern condition of a number of major intellectuals since the eighteenth century (ranging from Herder and Nietzsche, to Max Scheler, the Frankfurt School and beyond).\n\n But the critique has become both more trenchant and more urgent since Said wrote. The crucial matter of the survival of the human species was not atop that philosophical agenda, not even on Said[.] when he wrote his *Orientalism*; but now it is, and at every level. One can now speak even of a scientific consensus on climate and ecological crisis. Colossal environmental destruction; unprecedented forms of violence; the construction of lethal political identities; the poisoning of food and water; extermination of alarming numbers of species; melting of Himalayan, polar and other major glaciers; increasingly worrying health threats; indecent disparity between rich and poor; social and communal disintegration; the rise of narcissistic sovereign individualism; an alarming increase of mental health disorders; a \"growing epidemic\" of suicide, and much more (the list is long enough to require, literally, an entire ledger), are now calling attention to a revaluation of modernist, industrial, capitalist and chiefly (though not exclusively) liberal values. The increasingly proliferating and widespread understanding that the modern project, together with its knowledge system, is unsustainable (even in the relatively short run) is in the process of taking over center-stage, and not only in Western industrialized countries. Influential activist groups and prominent intellectuals in India, China and several other countries in Asia, Latin America and elsewhere, have come to realize that a major restructuring, if not overhauling, of the paradigmatic structures of modernity is now in order. The crisis affects the global village, and is not the concern of only particular groups or countries, although the genealogy of the sources of destruction are widely recognized as European and more recently Euro-American.\n\n [...]\n\n The critical global situation during the last three decades calls for a more\nprofound critique of the Orientalist project -- as it does of most others in the sciences,\nthe social_sciences and the humanities -- even as Orientalism stands now in its modified\nform (and despite the due recognition that Orientalism has somewhat changed course\nafter Said[.] critique). Said[.] own foundational premises are no longer sufficient, and in\nfact utterly inadequate. Secular humanism, anthropocentricism, and liberalism (all of which rest on a mechanistic view of the world), are increasingly viewed as too costly to\nmaintain, and an excessive and unjustifiable -- if not immoral -- overreach, and all this\nnotwithstanding their benefits (undoubted benefits with equally undoubted disastrous\nside-effects). In fact, it is precisely these benefits – supposed and real – that are directly\ntied to the pervasive destruction of nearly every aspect of modern human, animal and\ninsentient life (all of which, one can safely say, are experiencing, and living, the modern\ncondition)."}