{"doc_id": "1999", "name": "2016_08_humanities_student_major_1463_intj", "namespace": "we1sv2.0", "metapath": "", "pub": "intj", "title": "2016-08-humanities-student-major_1463_intj.txt", "pub_date": "2016-08-20T00:00:00Z", "Sentiment": "0.233", "Subjectivity": "0.443", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "317", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6pkt9c", "Reddit_id": "d6puao0", "Subreddit_id": "t5_2qowo", "Commenter": "saekheart", "length": "1876", "content_scrubbed": "As /u/GermanWineLover pointed out training in philosophy gives you amazing analytic thinking, abstraction, creativity, and writing skills, which are needed to be successful at anything. People are often short sighted and only think of a bachelors degree as a gateway to a job and a comfortable living. \n\nNothing wrong with that, but they have to realize that a philosophy bachelors (and really any bachelors) is more of a general education. philosophy_major often score amazingly well on graduate entrance exams. They score the highest overall on the general GRE (they score THE HIGHEST out of any major on the verbal reasoning and writing section, and they score the highest out of any humanities major in the quantitative reasoning section), they score 3rd or 4th highest on the GMAT, and they score the 2nd highest on the LSAT (the only major that beat them is math/physics). \n\nA popular career path for philosophy majors is law school. Not only do they score very well on the LSAT, but I would say that they are the best prepared for law school because of their extensive practice with reading complex text, accurately explicating it, and critically evaluating arguments.\n\nI have never met anyone or know anyone who knows a person with a philosophy degree that works at McDonalds. I don't even know where that stereotype comes from other than ignorance. A philosophy degree is unconventional, i. e. wherever you end up in your career will be interesting. It[.] not like you get a philosophy bachelors, then get a 9-5 job like most people. You might end up as a manager of a company or even as a programr. Where you end up in philosophy won't be what most people think of. None of my philosophy professors' classmates had trouble finding jobs after they graduated. They may not have all ended up in academia, but they all found well paying, enjoyable employment somewhere."}