{"doc_id": "84", "name": "2016_06_humanities_student_major_884_redpillwomen", "namespace": "we1sv2.0", "metapath": "", "pub": "RedPillWomen", "title": "2016-06-humanities-student-major_884_RedPillWomen.txt", "pub_date": "2016-06-12T00:00:00Z", "Sentiment": "0.253", "Subjectivity": "0.506", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "456", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nqhlr", "Reddit_id": "d462586", "Subreddit_id": "t5_2xing", "Commenter": "SirenOfScience", "length": "2399", "content_scrubbed": "TLDR; I love to sing, read, run, and I like to bake when I have the time.  \n\nBaking is fun to me because it[.] like non-toxic, edible chemistry.  I take my time, measure my ingredients and out comes a delicious treat instead of a solution to dissolve membranes, lol!  I also like baking because I can give it to someone as a gift or share it with a group.  My mother encouraged me to learn 3-4 dishes and desserts while I was in high school but I didn't really get into it until I got married.\n\nMy mother and I went to the art museum, symphony, opera, musicals, and ballets when I was young so I love all of the arts.  Singing was the one I loved most though!  I can sing while I cook, while I clean, and it[.] just the best hobby because it costs me nothing but brings me such joy!  I sing sometimes when I'm mad or sad to help me cope with my feelings.  I like to write songs when the mood hits me but I'm fine just learning and perfecting covers I have an emotional connection to.  When my husband and I were just dating we were pretty broke.  For birthdays and anniversaries, I'd learn a love song and give him a private performance as a gift.  I'm working on some guitar so I can accompany myself.  My mother and I would sing together in church so if I do ever have kids I'd love to sing with them too.\n\nMy mother and I also visited the local libraries and I'd consume books like a fire!  My parents would joke that their daughter got the bookstore and toy shops confused.  I like to read books that would've been assigned to me in a class at some point (Wilde, Nabokov, Eliot, Huxley, PKDick, Bronte, etc.).  Some are overrated but I'm glad I read them.  I also LOVE reading someone[.] favorite book.  I often ask for recommendations and enjoy seeing why a friend or family member fell in love with a story.  I read a ton of scientific articles and books for school/ work (neuro PhD student) so I do indulge in popular, geeky fantasy/ sci-fi like HP, ASOIAF, Neil Gaiman, and some comics/ manga.  \n\nLastly, I took up running on my own.  It helps me sleep better and I just feel better running 3-4 days a week.  I also like walking to work since I can decompress after a hard day.  Grad school is an emotional roller coaster so walking home then going for a nice run can really help me stay balanced.  I'd like to take up dance classes as it[.] both good mental and physical exercise at some point."}