{"doc_id": "100", "name": "2016_06_humanities_student_major_1065_osuonlinecs", "namespace": "we1sv2.0", "metapath": "", "pub": "OSUOnlineCS", "title": "2016-06-humanities-student-major_1065_OSUOnlineCS.txt", "pub_date": "2016-06-15T00:00:00Z", "Sentiment": "0.061", "Subjectivity": "0.274", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "311", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4a9xgo", "Reddit_id": "d4ab1n5", "Subreddit_id": "t5_34oss", "Commenter": "deltaentropy92", "length": "1935", "content_scrubbed": "Yeah I get what you're saying and I'm not trying to discount all that stuff. But take for example, the CS curriculum at\nmy alma mater (#1 in CS grad program). You take 7 CS classes:\n\n1) Bullshit freshman CS immersion course\n2) Principlea of Imperative Computation (sounds fancy but it[.] just a programming fundamentals class in procedural programming using Python - I took it)\n3) Principles of Functional Programming (OOP and functional\nmethods - a little more advanced than CS162 - I took it)\n4) Parallel and Seq Data Structures and Algorithms (data structures)\n5) Intro to Computer Systems (crash course in assembly)\n6) Great Theoretical Ideas in Computer Science (historical theory in algorithms and computing)\n7) Algorith Design and Analysis ( crash course in algorithms)\n\nThe remaining classes are 1 computing related elective (graph theory, combinatorics, computational discrete math), 1 computing application elective (human computer interaction, graphics, databases, AI), 1 logic class (like discrete structures), 1 software systems elective (OS, computer networks, parallel\ncomputing), 2 other electives, 4 engineering or science electives, humanities electives, a required minor, and finally 5 math courses including advanced calculus, linerar algebra, probability, and discrete math (i took all of them since I\nmajored in Stats). \n\nThe point here is that this curriculum is not much different\nfrom OSU under the understanding that you have already taken the necessary math and breath courses before OSU. And believe me, that doesn't matter. I took those math courses and forgot most of that shit besides the basic fundamentals like everyone else that graduated with me from this school. Knowing that OSU can be done as a part_time program online and it covers most of the same stuff as a highly regarded program is awesome. Unlike at other\nplaces where you can get a minor in CS by taking a\ncouple of HTML and VBA courses..."}