{"doc_id": "1900", "name": "2016_08_humanities_student_major_562_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2016-08-humanities-student-major_562_canada.txt", "pub_date": "2016-08-09T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.253", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "357", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4wyigc", "Reddit_id": "d6axlv0", "Subreddit_id": "t5_2qh68", "Commenter": "MatasterMatt", "length": "2120", "content_scrubbed": "It depends what for.  By and large the US has two strategic advantages in *most* facets of the North_American economy:\n\n1)  It has a market 10X the size of the Canadian market.  The population advantage immediately draws top talent from Canada in the arts (actors, musicians, etc), most sports, financial industries and transport industries.  \n\n2) Although the corporate tax rate is pretty similar, by and large, the top tax rates for high earners is less in the USA.  Put it bluntly, wealthy Americans do not have the same tax burden that wealthy Canadians do.  This can often times lead to Canadians moving to the US for tax purposes and for real estate investments.\n\nAnother factor is the integration of the North_American economy since NAFTA.  You pointed out engineers.  That works both ways.  I've met plenty of American petroleum engineers living here in Alberta, I've met plenty of American students going to school here, I've also met plenty of Americans in the transport industry.  The integration of our economies has encouraged the flow of labor and capital.\n\nSo, do I think there is a brain drain?  Well if we look at 'Canada' and the 'US' as if they are closed economies, then yes.  However, they are not closed economies and we have both benefited enormously from free trade.  \n\nThe only sectors where it makes a tangible difference tend to be sectors where the government has extended it[.] dominion.  For example, an exodus of Canadian health care professionals to the US is highly detrimental to Canada.  This is because of government interference on our side.  We have not treated medical care as a market good or service, we have restrictions.  Medical care in the US is also highly regulated and subsidized, and administrative costs that draw doctors to the US are artificially high.. but that[.] for another time and place.  A civil engineer going to the U_S, or a Programmer Analyst, on the other hand, do not really have many detrimental affects here.  In fact, more so than not their labor contributes to services and products that benefit both countries.\n\nI hope that all makes sense."}