{"doc_id": "1951", "name": "2016_08_humanities_student_major_1050_professors", "namespace": "we1sv2.0", "metapath": "", "pub": "Professors", "title": "2016-08-humanities-student-major_1050_Professors.txt", "pub_date": "2016-08-15T00:00:00Z", "Sentiment": "0.047", "Subjectivity": "0.228", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "1124", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4xukyc", "Reddit_id": "d6j0j0t", "Subreddit_id": "t5_2svhp", "Commenter": "remnbibi", "length": "6480", "content_scrubbed": "I disagree with blaming Republicans for this mess. A lot of people need to take responsibility for this, including everyone in both parties, the loan industry, and students and colleges themselves. \n\nEveryone was told they HAD to go to college to be successful, even though not everyone needs a 4 year traditional degree. Some college degrees should be for art history, psychology, social_sciences, education, humanities, music, art, or Classical studies. Other degrees should be for science, medicine, law, or business, etc. But college became a catch-all for any type of education after high school. Trade schools have become non existent, or stigmatized, and the idea of on the job learning like an apprenticeship is almost unheard of. So, you had more people going to pricey universities thinking that is what they had to do to get ahead. Many students would be better off in a two year community college or work training program than attending a university. Instead of taking 4 years of pre med, they could take two years of nursing. They would actually have a usable degree that pays well, and with less money out of pocket, when they graduate. But they got lured in by the expensive athletic facilities, luxury dorms, rock climbing walls, lazy rivers, and other crap colleges have built for the specific purpose of luring in freshmen. Many of them end up working at Starbucks or having to go back and get another 2 year degree in something like health care or some kind of job skills AA, which means more loans.\n\nThe government has been contributing to the cost of college by giving limitless money in subsidized loans. And private loans skyrocketed as well. Students take out loans they can't possibly pay back, but the colleges don't care, because they get their money. And students think, \"Oh, I have $100,000 in loans. When I graduate I will make $50k a year, so my loans are no problem.\" They don't understand interest, the job market, or how money really works. You had a lot of students taking out loans for $120,000 degrees, staying in college for 5 or 6 years, not working part_time, not getting scholarships, living like 4 years of summer camp, and not being realistic about their expectations after graduation. And when they graduate, they don't get back into the tax paying pool because they can't find a job. If college costs more than you are going to make in salary after working 5 years (AFTER the monthly cost of paying back the loans themselves), it[.] not a good financial decision. If you spent $100,000 to get a degree in elementary education, and you will make maybe $40K a year AND THEN have to take your loans out of that, it was an unrealistic decision. You will be eating Ramen noodles. You won't be buying a house or raising a family, because your loan payments are the size of a mortgage. You can only do so much with an art history or psychology Bachelors degree, and your job prospects are limited. No offense against them, as I teach Humanities--but you need to have a plan for your life. You need to get a degree in something that will pay off in the long run. And many BA degrees don't pay anything until you at least get a Masters--which costs more money. Students can't file bankruptcy, so they are stuck with those decisions. \n\n When you get a lot of free, government backed, easy money, people will spend it, and prices rise. Look at health care costs. When health care is subsidized, health care providers charge whatever it wants to charge and damn the cost. Colleges spend it on administration and perks that have nothing to do with education, and nobody stopped them. This is the same thing that happened with housing. Education is suffering from a bubble. Furthermore, there was that rash of predatory for profit colleges that were dipping into the same financial aid money pool--especially targeting Veterans--and those degrees weren't worth the paper they were printed on. So those people got government and private loans, that could have gone toward a real degree, and their degree will never get them a job. So now they are stuck with loans AND a worthless degree AND they can't file bankruptcy. Democrats and Republicans equally played into that mess.\n\nIn states with Republican governors, yes they cut taxes. That is what Republicans tend to promise their voters they will do in order to keep their jobs. So, blame the voters for that if you like. People don't like paying taxes--especially when their money goes to some colleges that look like 4 year vacations to outsiders. Colleges don't need a stadium that seats 90,000 people and pays coaches millions of dollars a year. These Republican governors have decided that college costs too much, and they need to make cuts. They do cost too much, and they DO need to make cuts. Getting rid of one administrator would be like a scholarship for 100 students.\n\nFinally, when colleges rely too much on government funding, they become beholden to the government. And the master will eventually tug on the leash. The government will start to tell you what you can teach and what your college mission should be when they become a major stakeholder in education. This is what happened. Instead of saying \"no thank you\" and trimming the fat, universities just kept taking that free money and got bloated. Especially in athletics and administration. Now, you have a situation like in Wisconsin where the government says we don't like your motto of education as a truth finding mission. We want you to churn out employees for the workforce. We want to see something for our tax dollars that will benefit the state. We don't see any benefit to philosophy majors and art history degrees. We don't like tenure professors because they complain about this stuff, so we want you to do away with tenure. They want to turn 4 year colleges into community colleges which have always been there to supply the workforce.\n\nGoing back to my original argument, it is good for society to have an educated trained work force which offers opportunities for advancement, but not everyone needs to go to a top tier 4 year college or a University to be educated. We used to do that as a society, where college was a separate thing from trade school, but then we got sucked into this idea that everyone needs to go to college. So college became as meaningless as a high school diploma for most Bachelor degrees. The people that sucked everyone into this idea were the same ones that benefit from student loans."}