{"doc_id": "1950", "name": "2016_08_humanities_student_major_1036_findapath", "namespace": "we1sv2.0", "metapath": "", "pub": "findapath", "title": "2016-08-humanities-student-major_1036_findapath.txt", "pub_date": "2016-08-15T00:00:00Z", "Sentiment": "0.06", "Subjectivity": "0.303", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "366", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4xvek3", "Reddit_id": "d6ir48g", "Subreddit_id": "t5_2wqq6", "Commenter": "theyrodeon", "length": "2038", "content_scrubbed": "Short answer: If you're in the US, the job market is *not* good. \n\nLong answer: Go to www. higheredjobs. com. Click \"Advanced search\" scroll down and check the box that says \"search by job title\" then run a search for graphic design. I found 46 jobs. Sounds great, but most of them are old postings, some from May of '15. Now, that doesn't necessarily mean everything, but it does mean that major employers in the higher ed sector aren't hiring graphic design instructors on a regular basis. \n\nThis is the site, along the the Chronicle of Higher Ed, that my colleagues and professors told me to use to find jobs. I graduated in 2015 from a major state university with an MA in who cares. I was an artist looking to make teaching my paycheck. Since then, I've had one teaching gig that lasted one semester. \n\nNow, it could work for you, if it[.] what you want, GO FOR IT. Work hard. Make friends with your colleagues on the faculty. Take extra teaching opportunities (pro bono art classes, working with adults on campus, anything) But don't assume that it'll be easy. There are so many people trying to get those 40 some odd jobs. A lot of them have MFAs and PhDs in art, design, etc. Plus experience.  \n\nWith an MA, you can be an adjunct instructor. As for pay, a lot of universities, especially liberal_arts programs, aren't paying much to their adjuncts. Why? Because the price of one full-time adjunct (with a PhD, in most cases) is much higher than paying two adjuncts to do the same job, part-time. Consider, too, how good it makes Universities look when they can say they X number of PhDs working at their institution. In short, their idea is that more PhDs = better school. \n\nSo, if you have a choice between saving money and increasing the reputation of the school at the same time OR hiring one person so they can have benefits, which choice do you make? \n\nAlso, TEDIOUS? Teaching can be hours of tedium, preparing and such, but it[.] not bad tedium, necessarily.  \n\nTl;dr (of this and my life) if you want to teach, get a PhD.      "}