{"doc_id": "1869", "name": "2016_08_humanities_student_major_303_politicaldiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "PoliticalDiscussion", "title": "2016-08-humanities-student-major_303_PoliticalDiscussion.txt", "pub_date": "2016-08-05T00:00:00Z", "Sentiment": "0.046", "Subjectivity": "0.304", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "569", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d65llvb", "Reddit_id": "d65ndbf", "Subreddit_id": "t5_2sfmf", "Commenter": "Unshkblefaith", "length": "3891", "content_scrubbed": " A national standard implies that every student needs the same education taught the same way to lead toward the same result.\n\nA national standard implies that every student needs to achieve the same level of competency. The methods are not mandated. This is the same kind of practice that we see with accreditation at the collegiate level. Methods are controlled at the state level, so if a particular implementation of common core does not address the individual needs of children, that is an issue caused by whichever group chose how to implement the standards.\n\n The math standards use a different teaching method that skips traditional and necessary understanding in favor of the current standard that isn't even concerned with getting the_right results.\n\nThe math standards require an understanding of the underlying mathematical principles that allow the algorithms you learned in school to work. When you understand these fundamental principles, then higher levels of mathematics are easier to learn. Furthermore, if I understand the mechanics of base-10 arithmetic, I can apply many of those same mechanics in base-2 or base-16 arithmetic. Under the common core standards, what would normally be taught as a college-level discrete mathematical structures course, is broken down and taught through a child[.] entire primary education. \n\n The literature, and humanities as a result, pushes reading exercises toward texts that cover different concepts in fiction and pushes a lot of primary source text that neither the teachers nor the students are able to properly handle or contextualize. Plus, much of the material is dry and uncompelling, which can turn kids off from reading entirely.\n\nThat is a state-specific implementation. Here is what common core actually says on literature and humanites:\n\nKey Ideas and Details:\n\nCCSS. ELA-LITERACY. RH. 9-10. 1\nCite specific textual evidence to support analysis of primary and secondary sources, attending to such features as the date and origin of the information.\n\nCCSS. ELA-LITERACY. RH. 9-10. 2\nDetermine the central ideas or information of a primary or secondary source; provide an accurate summary of how key events or ideas develop over the course of the text.\n\nCCSS. ELA-LITERACY. RH. 9-10. 3\nAnalyze in detail a series of events described in a text; determine whether earlier events caused later ones or simply preceded them.\n\nCraft and Structure:\n\nCCSS. ELA-LITERACY. RH. 9-10. 4\nDetermine the meaning of words and phrases as they are used in a text, including vocabulary describing political, social, or economic aspects of history/social_science.\n\nCCSS. ELA-LITERACY. RH. 9-10. 5\nAnalyze how a text uses structure to emphasize key points or advance an explanation or analysis.\n\nCCSS. ELA-LITERACY. RH. 9-10. 6\nCompare the point of view of two or more authors for how they treat the same or similar topics, including which details they include and emphasize in their respective accounts.\n\nIntegration of Knowledge and Ideas:\n\nCCSS. ELA-LITERACY. RH. 9-10. 7\nIntegrate quantitative or technical analysis (e. g., charts, research data) with qualitative analysis in print or digital text.\n\nCCSS. ELA-LITERACY. RH. 9-10. 8\nAssess the extent to which the reasoning and evidence in a text support the author[.] claims.\n\nCCSS. ELA-LITERACY. RH. 9-10. 9\nCompare and contrast treatments of the same topic in several primary and secondary sources.\n\nRange of Reading and Level of Text Complexity:\n\nCCSS. ELA-LITERACY. RH. 9-10. 10\nBy the end of grade 10, read and comprehend history/social_studies texts in the grades 9-10 text complexity band independently and proficiently.\n\n[SOURCE](http://www. corestandards. org/ELA-Literacy/RH/9-10/)\n\nWhere in there is a requirement for dry and un-compelling material, or for the usage of dubious primary sources? None of the complaints that you have mentioned in your opposition to common core have any foundation in the common core standards."}