{"doc_id": "1878", "name": "2016_08_humanities_student_major_373_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-08-humanities-student-major_373_AskReddit.txt", "pub_date": "2016-08-06T00:00:00Z", "Sentiment": "0.05", "Subjectivity": "0.391", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "368", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d66u68q", "Reddit_id": "d66v25u", "Subreddit_id": "t5_2qh1i", "Commenter": "BigBennP", "length": "2002", "content_scrubbed": "The one piece of advice I give to aspiring lawyers is find a job working in a law firm and find out what lawyers actually do all day.  Even in prosecutors offices it tends to be quite a bit different than you think. (take 30 files, review them, go to chambers day, and spend the whole day taking guilty pleas and haggling over sentencing).  \n\nFind out whether you can deal with the day to day of a law practice before you take out a bunch of loans to go to law school.   There[.] a lot of lawyers that hate what they do, and while any job certainly has an element of \"it[.] just a job,\" in law there[.] a big element of people who thought they'd do one thing, and end up doing something entirely different. \n\nIf you want the widest possible options, you want a highly ranked law school. The T14 law schools are the feeders for \"biglaw.\"  Large corporate law firms that have high dollar clients and pay the highest salaries, but that[.] a very unique difficult career choice. BUT, highly ranked law schools also run pretty steep tuition.  In this day and age you'll finish $100k in more in debt if you pay full sticker. \n\nIf you're serious about doing pure criminal work (like being a prosecutor or something similar) you can certainly shoot for T14, but \"Large State University Law School X\" (where X is your state) is probably going to be the best bang for your buck, and will help with connections. Keep in mind, lawyers that do that sort of thing usually do well, but rarely get rich.  Earning $60k as a prosecutor is a nice living, but much less nice if you're $160k in debt and banking on student loan forgiveness. \n\nAnd because you asked.  Small liberal_arts college in the south, History and International Relations Double Major, T14 law school, in the south. Biglaw for four years, again in the south, started at $145k,  moved to my home state after I got out, cut a deal to work at a prosecutors office until I could clear the few months for reciprocity, and took a job with a state govt. agency. "}