{"doc_id": "172", "name": "2016_06_humanities_student_major_1656_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2016-06-humanities-student-major_1656_canada.txt", "pub_date": "2016-06-23T00:00:00Z", "Sentiment": "0.053", "Subjectivity": "0.273", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "442", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4paw16", "Reddit_id": "d4lfrlk", "Subreddit_id": "t5_2qh68", "Commenter": "MapleHamwich", "length": "2715", "content_scrubbed": "Tax, regulation and other monetary policy is obviously huge, but the complexity of those issues are largely beyond the vast majority of the public.\n\nWhat I do feel impassioned and knowledgeable about is the root of innovation.  Canada needs to foster an environment that embraces basic science.   Not for the number of published papers or any other largely meaningless statistic.  But for the appreciation of the intrinsic value of inquisitive thought.  Without basic science, applied science stagnates.  There is nothing new to apply the science to, and the benefits of iterations on old ideas results in diminishing returns.  Basic science is behind all of the explosions of progress in human society.\n\nFurther, there needs to be a greater integration of the arts and the sciences.  This is where the truly inventive and innovative companies and economies are usually borne out of.  \n\nI believe the place that this all starts, is in post secondary institutions.  Creating independent institutions un-reliant on private sector funding, in which populations can freely pursue their passions and after which have an appreciation for the work of all of their peers is the road map to stable and progressive economies.  \n\nThe way things are in Canada right now, you get a mis-understanding of the value of education.  People go to school to \"get a job\" rather than to improve themselves and enrich society, which would result in invention and innovation.  People point to the success stories of Bill Gates and Steve Jobs as examples of people who \"dropped out\" and were still huge successes. But the real point of their stories is not that they dropped out.  But that they followed an educational path that they were impassioned by, and when it empowered them to a point that they thought they could tackle the challenge of being successful in their fields, they left to pursue that.  And that[.] the opposite of what our current society seems to think school is for.\n\n\nAnd on a last and completely different note, fix the digital future.  Right now our digital future is held back by a desire to protect the physical past.  Copyright favours the old school and suppresses the innovation that the digital world is trying to create.  Further, Telecommunications companies are suppressing the digital future by overcharging for and underdelivering the foundation of that digital future, internet connections.  If Canada wants to develop a digital economy, it needs to embrace the digital future and develop forward thinking laws and internet providers.  Let the physical past die and it[.] digital future replace it.  It may be messy, it may result in casualties, but the future opportunities will quickly replace the old."}