{"doc_id": "1901", "name": "2016_08_humanities_student_major_571_lawschool", "namespace": "we1sv2.0", "metapath": "", "pub": "LawSchool", "title": "2016-08-humanities-student-major_571_LawSchool.txt", "pub_date": "2016-08-09T00:00:00Z", "Sentiment": "-0.057", "Subjectivity": "0.314", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "319", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4wyp92", "Reddit_id": "d6b2m45", "Subreddit_id": "t5_2rb9g", "Commenter": "hbomb510", "length": "1696", "content_scrubbed": "I cried every week of my third semester because I do not belong in law school.  Everyone told me to just get through the first year, that you're supposed to be scared the first year, and that the second year is better. No. Third semester was brutal.  And I realized I was in the wrong place.  I did some Spanish and English writing work (my undergrad degrees) for an attorney and I was home.  It was that same quenching, fulfilling feeling of my undergrad life.  And then, I had to go back to brutal classes that I hate and am only taking so I can pass the bar.  \n\nWhat makes it worse is that all law students that feel this way are putting themselves through it for nothing.  If you don't have the \"I belong\" feeling, you're not going to be happy in any future career... not that anyone can find careers right now.  \n\nI threw myself into finding a job relating to humanities or people or anything other than this stuff.  I should not have gone to law school; I should have given myself more time.  Hindsight is 20/20.  I had too much in it to quit. But I'm telling anyone- anyone- who feels like this- quit now.  I'm serious.  There are so few legal jobs and you know what your passion is.  If you know you can't make money in that field, then get some corporate job that doesn't sap too much of your energy and pursue your passion in your off time.  It isn't worth it.  Even if you're halfway through.  I let other people convince me to stay.  I have to live with that choice, but I also know that I will not force myself to live with it forever.  It[.] still insanely discouraging, but I know that feeling.\n\nTL;DR- YES.  You know what you want to do; get out now before you're sucked further in."}