{"doc_id": "2022", "name": "2016_08_humanities_student_major_1727_gre", "namespace": "we1sv2.0", "metapath": "", "pub": "GRE", "title": "2016-08-humanities-student-major_1727_GRE.txt", "pub_date": "2016-08-24T00:00:00Z", "Sentiment": "-0.012", "Subjectivity": "0.441", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "390", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6uh1tf", "Reddit_id": "d6uh9nq", "Subreddit_id": "t5_2qy5d", "Commenter": "xultima", "length": "2251", "content_scrubbed": "Mostly did mathy subjects during undergrad, didn't really take any English or humanities courses. I work at a Fortune 100 company doing statistical programming and operational consulting. Before college I was in AP/honors/gifted programs across a handful of school districts. I didn't really try hard, slept a lot in class and had people consider me the \"smart kid\" in groups which were supposed to be among the top 2%(GATE) or 20%(AP/Honors) of students at admittedly mediocre schools. \n\n\nI did mediocre (90th percentile, high on math and English, low on everything else) on the ACT. I didn't study for it, was sick and was practically falling asleep. My writing percentile (might've been SAT-writing, I can't recall) was in the 38th percentile, likely because they couldn't read my handwriting and my thought process is somewhat disjoint while writing (doesn't matter if you're typing and can rearrange things). On state exams I usually scored in the 99th percentile on both the math and the vocabulary sections without studying and I had ample time left over(though most people, as I'm sure you're aware blow those off as there[.] nothing at stake). Other exam areas were all over the place but usually around the 90th percentile. I suspect that I lost most points due to careless errors/boredom. \n\n\nMy reading logs through middle school and HS were grossly exaggerated upwards. I get horribly bored reading novels, I feel that they could get to the meat of the point in a fiftieth of the words. Reading summaries is fairly enjoyable though. \n\n\nI've read **a lot** of short articles online. This was usually done in lieu of studying for class or while at work (I figured out how to automate about 60% of my job and a good chunk of several coworker[.] jobs, at this point I just need to be a high availability tech support guy and occasionally look for something BIG to work on which will have a profound impact)\nI also write a lot(easily 20-30,000) of short posts. \n\n\nFor what it[.] worth I studied pretty hard for the main part of the GRE for a few weeks. Some people on here complain that it[.] impossible to do so while working full time and it didn't seem so bad to me. I could, however, tell that I was more error prone if I wasn't well rested.\n\n\n"}