{"doc_id": "83", "name": "2016_06_humanities_student_major_880_videos", "namespace": "we1sv2.0", "metapath": "", "pub": "videos", "title": "2016-06-humanities-student-major_880_videos.txt", "pub_date": "2016-06-12T00:00:00Z", "Sentiment": "-0.042", "Subjectivity": "0.299", "Score": "23", "Upvotes": "23", "Downvotes": "0", "Wordcount": "332", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d45m9r1", "Reddit_id": "d45z2iv", "Subreddit_id": "t5_2qh1e", "Commenter": "hwillis", "length": "1913", "content_scrubbed": "I am Swiss.  Nine people died during the project.  The idea apparently was to have the ceremony thematically reflect that.  The first 14 minutes of the video are a chronological reenactment of the deaths.  First death was by falling boring bar (Dancing with the sticks), then rockfall/burial (the dust, although I am not sure why they stripped down), then train accidents and one person fell (train graphic, more people in aerials).  That is also why the music is silent and then discordant, to accent the tragedy.  \n\nHowever all these deaths were between four and sixteen years ago.  This part of the ceremony is not meant to be a tribute so much as a reminder and acknowledgement of them.  The next part is a celebration of Switzerland and is meant to inspire pride. \n\nThe whole thing is a very abstract reenactment of how people felt during construction, basically.  It[.] absolutely very weird.  It makes a lot more sense if you're European and watch Eurovision etc, where nearly every element of a performance is meant to be symbolic and tell a story.  In America our ceremonies are music, booming, and speeches.  Despite this the Swiss by and large also think this is weird as fuck though.  \n\nand then they finally finish it and get to watch these liberal_arts major interpretive dance assclowns wear their uniforms and basically act like they're taking credit for the whole thing. It must be infuriating.\n\nI suppose... but they are actors.  They reflect the pride your country takes in you.  WW2 movies do not detract from the pride we take in US veterans.  The ceremony is only meant to increase the respect we have for the workers by retelling their story.  Personally, I prefer this to the American way, which would be to line the workers up to stand there awkwardly while people stare and clap, and a man who is not very good with words tries to convey the emotions they felt and what they went through."}