{"doc_id": "2095", "name": "2016_03_humanities_student_major_148_wtf", "namespace": "we1sv2.0", "metapath": "", "pub": "WTF", "title": "2016-03-humanities-student-major_148_WTF.txt", "pub_date": "2016-03-02T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.322", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1367", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d0ktkpw", "Reddit_id": "d0kxbuc", "Subreddit_id": "t5_2qh61", "Commenter": "_ihatemyself", "length": "8287", "content_scrubbed": "**Note**: Reddit does not format quotes very well so I will place random periods in between them to trick it into working.\n\n Yeah, this is precisely what I'm talking about. You see one documentary series and you think you are an expert.\n\nI have done 6~ years of research on the subject. I link people to the documentary because in my experience people are not willing to read through academic journals, most of which are behind paywalls. The documentary is a nice summary of the current research around nature-vs-nurture.\n\n For example, are the feminine careers more feminine because woman are naturally predisposed for them or is it because of their upbringing, influence of the society, etc.?\n\nThe current research shows woman are naturally predisposed for them. Like all science, we may learn something new in the future. My opinion is based on research and science, not ideology.\n\n Look at this paper, which suggests that woman are less likely to go in STEM fields, which people think require more innate talent. Yet, there is no evidence (according to this paper at least) that woman actually have less talent for these fields.\n\nThis is correct and supported by research for the most part. While woman are just as capable as men, they do not make the same choices. Extensive research on American men & women about why they chose the jobs they had were told to list reasons in order of priority. Men prioritized money over everything else. If the job was more dangerous, further from home, and would mean less time spent with the family, but was for more money, the men would still take the job. Women[.] number one priority was who/what she would be working with (people and living things like animals). Priority 2 was distance from home. Men were also much more likely to take jobs where they worked alone, and women jobs where they worked in groups, specifically groups of other women (teaching, nursing, humanities, etc).\n\n Or look at this paper, which shows that people in academia (both woman and man!) when presented with identical CVs, are more likely to recommend hiring the person if they think the CV belongs to man rather than woman.\n\nI read this paper just now. I think this paper has a great deal of bias towards the conclusion, I will explain below:\n\n Both genders ranked \"ability to establish an independent research program\" as the most important quality. **Both genders** ranked \"collegiality/personality factors\" as the second most important quality, and \"collaboration prospects with you or other faculty members\" was ranked third. Interestingly, both genders ranked \"fulfilling afirmative action requirements\" last, with only five subjects in the entire pool ranking this quality as the most important.\n\n.\n\n There were **no significant main effects or interactions for the participants** responding to the questions about tenuring an applicant who only had a hire-able record, with the vast majority of the participants reporting that they would not vote to tenure them, and that they had not done enough teaching, research, and service.\n\n.\n\n As a further check on our hire-able versus tenurable CV manipulation, we analyzed the data to determine if the participants selected a higher starting salary for the tenure candidates compared to the job applicants... Thus, there was **no effect for gender** on the selection of starting salaries.\n\n.\n\n We were also interested in whether or not participants were infuenced by different factors when reviewing the job applicant versus tenure candidate CVs... There were **no significant gender differences** in the factors that influenced the participants when reviewing the CVs.\n\n.\n\n Participants were asked if they would vote to hire the person whose CV they were sent to review for a tenure track position in their department... There was a significant main effect for applicant gender, such that **participants were more likely to hire the male applicants than the female applicants**. There was not a significant main effect for the participant[.] gender, so **both males and females demonstrated the same gender bias in favor of male applicants**.\n\nI point out for the above (from Fig 5), males were more likely to hire in both cases. So this means, males were more likely to hire the females than females themselves, and both genders showed in this circumstance they would prefer to hire males over females.\n\n Participants were also asked if the applicant had adequate teaching and, separately, service experience... There was **no main effect for the gender** of the participant, for teaching and service, or the interaction between gender of the participant and gender of the applicant, for teaching and service.\n\n.\n\n With respect to voting to tenure the candidate, there were **no main effects for participant gender**, candidate gender, or the interaction between these two factors.\n\n.\n\n When participants were asked if the candidate had significant research experience, again there were **no main effects for participant gender**, candidate gender, or the interaction between these two factors.\n\n.\n\n There were **no main effects** for the gender of the participant candidate gender, or the interaction between these two factors with respect to their perception of the adequacy of the candidate[.] teaching experience.\n\n.\n\n There were also **no main effects** for the gender of the participant, candidate gender, or the interaction between these two factors with respect to their perception of the adequacy of the candidate[.] service contributions.\n\n.\n\n Given that the sample vitae belonged to a biopsychologist, we did look\nto see if participants who shared the applicant/candidate[.] subdiscipline\nwithin psychology were more or less likely to hire or tenure the applicant.\nWe found that the participant[.] subdiscipline made **no difference** in terms\nof whether or not they were likely to hire the job applicant, and the **same was true** of subdiscipline impact on the review\nof the tenure candidates. We did look to see if professional rank had an influence over whether or not participants were\nmore or less likely to vote to hire or tenure the applicant or candidate. An analysis of variance **failed to reveal significant differences** in votes\nbetween professors of different ranks in terms of their voting to hire, or voting to tenure. The\nimpact of program quality on likelihood to hire or tenure was also examined.\nAgain, **there was no effect** for participant rank on decision to hire the\napplicant, or tenure the candidate.\n\nOut of 11 gender tests, 10 showed no gender bias, and 1 test showed some gender bias. Their conclusion that this *proves* gender bias in the hiring practices of females is false. They also give no thought to other factors that may have caused this 1-in-11 difference. If there was gender bias in hiring, I would expect more than just 1 factor to lean towards a specific gender. I question the validity of this academic paper as well since the raw data is not provided. For example, they claim:\n\n There was a significant main effect for applicant gender, with participants being more likely to report that the male applicant had adequate research experience.\n\nBut provide no numbers or data for this claim, or how they even came to it. They consistently use un-academic words like *significant* all over the place, but without raw data, or even the definition of what they think the word *significant* means, I don't even know what to think.\n\nAre there gender biases in some aspects of life? Sure, we all know that. Are they nearly as dramatic as this paper makes them out to be? Nope. And how could this paper come to the conclusion it did when **10 out of 11 tests showed no gender bias at all**?\n\nI also point out the paper makes the claim:\n\n To our knowledge , this is the first study to determine the impact of the gender of the job applicant or tenure candidate on potential search committee member[.] and outside reviewer[.] decisions to hire or tenure.\n\nThis claims to be the first study, I cannot find a similar study, and this study has never been reproduced. I wouldn't put much thought into this study until it[.] reproduced **AND** they release the raw data. I don't even understand how a study gets published lacking raw data, I've never heard of that before."}