{"doc_id": "1834", "name": "2016_08_humanities_student_major_2_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2016-08-humanities-student-major_2_canada.txt", "pub_date": "2016-07-31T00:00:00Z", "Sentiment": "0.148", "Subjectivity": "0.454", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "405", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vjtxg", "Reddit_id": "d5yz14o", "Subreddit_id": "t5_2qh68", "Commenter": "xShaiGuyx", "length": "2264", "content_scrubbed": "As with any cross-border move, the biggest thing that should motivate you if you aren't in danger is a job in the new country. \"The grass is always greener on the other side\" is a very accurate adage - it[.] easy to hear about all of the positives of a country and decide you'd like to live there.\n\n\nFrom an American perspective, here are some Canadian differences:\n\n- Our political system is a multi-party system. That means we don't necessarily have one party with the majority of power in our house of government.\n\n- Except for eyecare and dentistry, healthcare here is paid for by tax dollars. It is free. Depending on where you live, it may also have absurd wait times - emergency entrance at a hospital can have a waiting time of up to a dozen hours. Waiting for surgery can take months.\n\n- The weather is generally colder here, but we also tend to have very hot summers. Depending on where you live, you may find that fall and spring almost don't exist in Canada in comparison.\n\n- Our media and news focuses somewhat less on violent crime. Our public broadcaster, CBC, generally has a fair number of feel-good stories on their local news casts.\n\n- Racism here is less out in the open in general. It still exists but many POC who have moved from the States to Canada mention that it feels liberating.\n\n- We have somewhat less of a military/athletic culture here, and in my experience are more interested in experiencing other cultures and the arts. This could be my own bias.\n\n- Food is, on the whole, saltier but less sugary in Canada (except for Quebec, where food has more sugar than the rest of Canada). My best guess is that this is because we had to heavily salt food to keep during the long winters before refrigeration.\n\n- Post-secondary education is reasonably cheap at most public Universities in Canada.\n\n- Almost everything else is more expensive here than in the U_S, on top of the dollar having less value.\n\n- There is a general stereotype that Canadians are very polite. I think overall that stereotype has some merit, but I would like to add that we are less hospitable if more polite than Americans. We're less interested in being warm and welcoming and more interested in being unoffensive.\n\n\nThese were just some quick thoughts on the fly."}