{"doc_id": "1883", "name": "2016_08_humanities_student_major_411_japan", "namespace": "we1sv2.0", "metapath": "", "pub": "japan", "title": "2016-08-humanities-student-major_411_japan.txt", "pub_date": "2016-08-07T00:00:00Z", "Sentiment": "0.059", "Subjectivity": "0.333", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "271", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d67n55y", "Reddit_id": "d67qbgi", "Subreddit_id": "t5_2qh2u", "Commenter": "dokool", "length": "1464", "content_scrubbed": "The first ALT company I worked for (JALSS, I'm 99% sure they're dead and buried) was a legit tax shelter and made any other dispatch company, Heart included (and full disclosure, Heart was the second company I worked for), look like goddamned UNICEF in comparison.\n\n- Instead of switching me over to an instructor visa from my student visa, had me do a run to Seoul to get a tourist waiver, then applied for my CoE (*while I was working at my school*). Others came in on tourist visa as well; while I got my CoE the day before my waiver was set to expire, others weren't so lucky.\n\n* All of us ALTs applied for Specialist in Humanities visas through a one-room eikaiwa they ran.\n\n* Almost no contract info, no employee handbook, no pay slips, no taxes withheld.\n\n* Two offices - one boiler room operation in Koshigaya, and the *actual* office all the way out in Atsugi, forcing any Koshigaya ALTs with issues to take 2+ hours each way to resolve them.\n\n* We were explicitly told at the orientation meeting to send in 40,000y of receipts along with our time sheets at the end of the month \"for tax purposes.\" Further told that if we didn't have enough receipts we should just go to the conbini and get a handful from the receipt bin.\n\nAnyway compared to all of that working for Heart wasn't that bad, they gave me everything I needed to switch to a correct visa the following year and even though I quit mid-contract they were cool w/ giving me a letter of leaving."}