{"doc_id": "10", "name": "2016_06_humanities_student_major_115_copenhagen", "namespace": "we1sv2.0", "metapath": "", "pub": "copenhagen", "title": "2016-06-humanities-student-major_115_copenhagen.txt", "pub_date": "2016-06-01T00:00:00Z", "Sentiment": "0.183", "Subjectivity": "0.516", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "519", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4m3m0d", "Reddit_id": "d3sfbpc", "Subreddit_id": "t5_2qtd1", "Commenter": "SupremeToast", "length": "2820", "content_scrubbed": "Hi, congrats on (almost) coming to Copenhagen! I live in a double in Østerbro Kellgiet now and it[.] been great. My roommate and I get along well and the folks in my kollegium are pretty social.\n\nTietgen is super cool but it[.] on the southern campus in Amager, so unless you're in the humanities it[.] a bit out of the way. Also, it[.] one of the kollegium that is in high demand and pretty much always gets filled by Danes (since full-time students who have already been enrolled get to pick early on) and is pretty unrealistic for exchange students. The only internationals I know there were in the unfinished building in the fall and got priority pick for this term.\n\nSignalhuset is an interesting place. It[.] a beautiful building and area, plus you live in a suite so you'll have ~3 roommates with a full kitchen between you. It[.] also huge so you'll have a lot of classmates and such who are living around you. But, it[.] way the hell out of Dodge. Biking in and out of town (you can't understand what biking to/from school is until you live here, people bike everywhere here and it[.] great) is a bit of a struggle which sort of forces you to rely on the metro. This isn't terrible as it is 24 hours, but that[.] extra money and the metro is always under construction late at night, so your trip home from the bars is ripe to get fucked with.\n\nIf I were to recommend anywhere, I'd say try to find a kollegium in Nørrobro. I spend a lot of my nights in the bodegas there and there[.] some of the cheapest food places. It[.] also the most diverse neighborhood, which is a nice distinction from the rather pale city. As an Østerbro resident, I would absolutely recommend it. It[.] one of the biggest residences so you'll meet a lot of people and it'll be quite easy to find a spot when signing up. The city center campus is only ~15 minutes bike away and the city center ~20 minutes. That makes drunk bike rides home (such as mine earlier tonight) rather reasonable even when it[.] cold.\n\nThere[.] also a couple nice places in Fredericksburg. The neighborhood is super nice and if you're in a physical or biological science then you're likely to have at least one class on the Fredericksburg campus. The only real downside is that there aren't many students in the area since it[.] such a wealthy area, but that[.] not always a bad thing.\n\nUltimately, I'd say that you'll be fine wherever you end up. I stressed over more than I should have and still didn't end up with any of the places I wanted. And yet I've been having an amazing time and couldn't have asked for better friends to share a dorm with. Breath deep, don't fret, and get ready for a wonderful term, no matter where you find yourself living.\n\nNinja edit: if you have any specific questions/concerns, feel free to drop me a pm. I'll always chat about my second home."}