{"doc_id": "94", "name": "2016_06_humanities_student_major_1030_asksocialscience", "namespace": "we1sv2.0", "metapath": "", "pub": "AskSocialScience", "title": "2016-06-humanities-student-major_1030_AskSocialScience.txt", "pub_date": "2016-06-14T00:00:00Z", "Sentiment": "0.098", "Subjectivity": "0.324", "Score": "49", "Upvotes": "49", "Downvotes": "0", "Wordcount": "1214", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4o2lfa", "Reddit_id": "d49flcz", "Subreddit_id": "t5_2sml9", "Commenter": "yodatsracist", "length": "7789", "content_scrubbed": "So, I will say in Turkey, there is a lot of academic study of religion (I mean serious study done by local Turks, not just Europeans and North_Americans). In sociology, there[.] too pretty different schools: there[.] the side done *mostly* by secular people which is done in sociology departments and focuses especially (today) on Islam and politics, and then there[.] the side done by (I think) mostly religious people that is done almost entirely in *ilahiyat fakulteleri* (divinity schools, mostly at public universities, that train all the imams and hatips (khatibs) in the country. There[.] plenty of study of contemporary religion, I'm saying. And this isn't unique to Turkey--the people at the Arab Barometer run a really excellent survey, many of whose questions deal with things related to religion. Some of the people who run the Arab Barometer are in the Arab World, often at the places you'd expect (American University of Cairo, American University of Beirut). \n\nThere[.] also really excellent ethnographic work on Islam still being done today: popular recent titles include Saba Mahmoud[.] *The Politics of Piety* (basically an argument with western feminists that many Salafi women are not subjegated and have agency), Charles Hirschkind[.] *Ethical Soundscapes* (about mostly Salafi preachers' taped sermons), Amira Mittermaier[.] *Dreams that Matter* (about dream interpretation in contemporary Islam, and how it involves really diverse sources--most of this uses Sufi, rather than Salafi, informants so it[.] an interesting contrast with Hirschkind and Mahmoud). All three of those are based on field work done in Cairo. \n\nLikewise, there is excellent historical work done on religion in the Ottoman period and earlier. Sufi orders and other ulema often leave written records (records intended as spiritual guides, but which historians use as a way to see what was important at the time) and provide one of the few non-state sources for many periods (though in Turkey, the ulema show up most forcefully as state kadi judges). I get the sense that intimate histories of Sufi orders in Egypt and other places are also being written. \n\nSo I get the sense you're talking about none of that. I get the sense you're thinking about histories of the Koran and very early Islam. You may not be, but that[.] my sense.\n\nThe secular study of the Bible as history was kicked off with [Wellhausen](https://en. wikipedia. org/wiki/Julius_Wellhausen). He studied theology. He became a Protestent professor of Old Testament history. He was not really the first (you can see some info on the [Documentary Hypothesis](https://en. wikipedia. org/wiki/Documentary_hypothesis) Wikipedia page), but is often taken symbolically as the first. In reality, this debate starts more than a century earlier, with (anonymously published) treatises at first. This sort of secular [source criticism](https://en. wikipedia. org/wiki/Source_criticism_%28biblical_studies%29) (often also called \"higher criticism\") was controversial at first, but it was mostly done by (mostly Protestant) theologians (plus a few agnostic gadflies here and there) genuinely interested in who wrote the Bible. \n\nThe Koran doesn't have the same sort of animating questions. Indeed, historians basically agree on its composition. There are a few outliers, like [Christoph Luxenburg](https://en. wikipedia. org/wiki/Christoph_Luxenberg), and secular historians will say Mohammad taught it rather than God spoke it though Mohammad, but there[.] not that much controversy about it. There some dating of specific Suras, not just Mecca and Medina but early and late within those periods (/u/shlin28 knows this better than I do, and I may as well ping /u/CptBuck as they're also more up to date on the recent scholarship).\n\nOne of the problems, though, is there aren't that many internal historical questions that need answering in the Koran. There are lots in the Bible, and early devout scholars with only internal evidence. To add history between the writing of the Quran and early Muslim historians, often requires using non-Muslim sources, which many on the theological side find inherently suspicious. This was the big revolution that Patricia Crone helped start (the best source book Hoyland[.] *Seeing Islam as Others Saw It*). There are several now very well respected histories that combine these foreign sources with Muslim sources; Hoyland[.] other very important book, *In God[.] Path* is one, Fred Donner[.] book, *Muhammad and the Believers*, is another. I don't quite know how their work is being taken in the Muslim world right now. \n\nBut as for Durkheim[.] (not Weber[.]) *Elementary Forms*, no, not really, as far as I know, this was written in the very secular French Third Republic (a decade or so after the [1905 law that strictly separated Church and State in France](https://en. wikipedia. org/wiki/1905_French_law_on_the_Separation_of_the_Churches_and_the_State), the culmination of tension going back to 1789). \n\nHowever, for example, with Frazer[.] the Golden Bough, written more than fifty years earlier in Victorian England, his inclusion of Christianity into his system had to wait until the Third Edition of 1905-1916 (first edition 1890). Even then, there was a popular single volume abridged edition that omitted all discussion of Christianity because it was so scandalous. Jonathan Z. Smith is the historian I know of Frazier, he[.] got a few articles here and there one with the clever title, \"When the *Bough* Breaks\", though I can't remember if the scandalous mentions of Christianity were in that article or elsewhere. \n\nReligious studies, though, has been an awkward mix and it took decades to sort out. In America, it wasn't really sorted out until a Supreme Court disallowed teaching *of* religion at public universities, while allowing teaching *about* religion. Critics argue that it *still* isn't sorted out, and that critical scholars are still a minority; [see here](https://bulletin. equinoxpub. com/2013/08/tilting-at-windmills/), for example (the title, \"tilting at windmills\", is sort of archaic language, so I'll just make it clear it[.] a reference to Don Quixote), which argues that no matter how many great critical works are written, the mainstream of religious studies is secretly too religious. \n\nA major driver of all humanities and social science research is, of course, state universities, and if state universities don't fund that kind of research in a country, it very often simply isn't done (it also leaves independent authors more open to attacks). \n\nBut one last point I'll leave you with (I'm not sure I answered your question, but I've talked a lot about it) is that in his very excellent book *A Secular Age* (hands down the most important book written on secularity and secularism in the past twenty years; arguably the most important about religion period, though I'll warn you it works very poorly in its details for the non-West), Charles Taylor argues that above all we need to remember that the secular is not a natural state, but rather specifically something *added*. That we should expect there to *naturally* be that division that you want, but that[.] a division that ultimately has to be created by people, well, like you. Taylor[.] book goes into how it happened in the West, but it[.] not exactly clear what lessons that has for the rest of the world. \n\nOn a very personal note, studying religious studies an undergraduate, I was also heavily encouraged to consider the rabbinate and very nearly went down that road, before ending up on the \"secular\" side of religious studies. \n\nEdit: it[.] old now (it[.] from 1985, the year I was born), but you might want to pick up Martin[.] edited volume *Approaches to Islam in Religious Studies*. There are a few chapters that might interest you. "}