{"doc_id": "202", "name": "2016_06_humanities_student_major_1992_pharmacy", "namespace": "we1sv2.0", "metapath": "", "pub": "pharmacy", "title": "2016-06-humanities-student-major_1992_pharmacy.txt", "pub_date": "2016-06-28T00:00:00Z", "Sentiment": "0.188", "Subjectivity": "0.431", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "337", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4q9rh0", "Reddit_id": "d4rdgot", "Subreddit_id": "t5_2qjl3", "Commenter": "RPhMackHere", "length": "1851", "content_scrubbed": "At risk of being royally shot down and having a pile-on about why nobody should ever go into pharmacy, I actually will offer a little advice from my experience getting into pharmacy school - it[.] super important that you know why you want to be a pharmacist. Yes, you want to help people. So do I! But that[.] why I volunteer in my free time. Do you like fast-paced, sometimes high pressure work environments where accuracy is still key? Do you like interacting with people, be they customers/patients or nurses and physicians? Are you okay with being on your feet and having sort of wacky shift work hours a lot of the time? How are you at having difficult conversations with customers who don't like what you have to tell them?\n\nAre you okay with most of those things? Then you're kind of getting there. The bottom line is that you need to work at a pharmacy as a technician before committing to school. I think schools literally need to require that. It helps so much in terms of learning material in school faster and just feeling confident that you want to work as a pharmacist when you're all done. \n\nGet your undergrad degree in whatever you like - I did a liberal_arts one that was completely unrelated to chemistry/biology/biochemistry and am still doing well in school now. Just get the prereqs done at some point and you're good on that front... It is unfortunately true that pharmacy school isn't the bear to get into that it once was, so I would think that with a decent GPA/PCAT/all that, you'll be fine (hell, I got into pharm school with a GPA that many people around these parts would probably say make me part of the \"too many pharm students\" problem). BUT WORK AT A PHARMACY. I'll hop off my (optimistic, naive student) soapbox now and let everyone else try to convince you out of pharmacy, but I'm happy to talk more if you PM me :)"}