{"doc_id": "196", "name": "2016_06_humanities_student_major_1941_sargonofakkad", "namespace": "we1sv2.0", "metapath": "", "pub": "SargonofAkkad", "title": "2016-06-humanities-student-major_1941_SargonofAkkad.txt", "pub_date": "2016-06-27T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.355", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "243", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4qazda", "Reddit_id": "d4qjlrh", "Subreddit_id": "t5_38l30", "Commenter": "BurkeTheYounger", "length": "1529", "content_scrubbed": "How so? He specifically called out certain parts of the remain camp; for example, being angry at ONE MAN who \"regretted his vote,\" wanting to disenfranchise the elderly and starting petitions for a second vote, the day after the first vote are all ridiculous, entitled acts. \n\nThe idea that Sargon is uninformed on this issue is ridiculous. He[.] been intensely interested in it for weeks. He[.] biased, by all means, but I don't believe he was uninformed.\n\nI thought his economic analysis was very reasonable and mild; he essentially said this initial instability was expected, and is not major. \n\nAs for English Lit degrees being useless liberal_arts degrees.. I got the impression he was specifically talking in terms of their utility to a professional career outside of academia, with the starbucks reference. Insight into culture may be interesting, but they generally aren't marketable on the job market.\n\nI don't see how reading the Koran is childish. Obviously it[.] not going to make you an expert, but you have to start with a basic readthrough, don't you?\n\nAs for Scotland.. Scotland may very well leave the UK, and benefit from it. It would be ironic, but unless the price of Oil goes up or Scotland has a major new role in the wake of brexit, I don't see anything major changing. I looked at your other post to the sub, and noticed a comparison to Singapore? Good luck with that one.\n\nhttps://en. wikipedia. org/wiki/List_of_busiest_ports_in_Europe\n\nhttps://en. wikipedia. org/wiki/List_of_world%27s_busiest_container_ports"}