{"doc_id": "1887", "name": "2016_08_humanities_student_major_477_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-08-humanities-student-major_477_AskReddit.txt", "pub_date": "2016-08-08T00:00:00Z", "Sentiment": "-0.015", "Subjectivity": "0.345", "Score": "64", "Upvotes": "64", "Downvotes": "0", "Wordcount": "463", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4wqnt3", "Reddit_id": "d69an9b", "Subreddit_id": "t5_2qh1i", "Commenter": "BeachBum09", "length": "2488", "content_scrubbed": "Philadelphia has the PPA (Philadelphia Parking Authority) which is essentially a cartel. It is just the shittiest group of people. Imagine that person in high school who was always a good student and involved in all activities. They were voted most likely to succeed in high school and had a very promising future. The people who work in the PPA main office are these people but their future never panned out. They likely went to college for some liberal_arts degree, art study, or gender studies and after graduation realized that they peaked in high school. All of their employment prospects in their degree are hard to find or painfully underpaying. So they resign themselves to getting a boring old job just to collect a paycheck. They live their miserable existence with their one joy of making someone else[.] day miserable. I mean what else do you have to look forward to when your job is essentially checking a clock and pushing buttons. \n\nSeriously though this group of people is the worst organization ever. Zero upkeep on signs or no parking/parking zone road paint. A spot could be open, no lines on the road or signs to indicate a no parking zone. Well, 3 years ago those lines were visible and only the PPA knows that isn't a spot you can park in. So you get a $60 ticket. \"Go take pictures and fight it!\" one might proclaim knowing they are in a democratic society and citizens have rights. Not with the PPA. You will NEVER win a case against the PPA. It[.] even been comically written about. The PPA doesn't give a shit and you will never win. They even had issues with their red light cameras. An inside shady deal between someone in the PPA and the red light camera company. The cameras had their timing advanced to incorrectly give out red light tickets. Try fighting it? See above, you won't win. They eventually caught on to this and got in trouble. Guess what? Nobody who got red light tickets had money refunded. \n\nI had to go to PPA court one day. My fault, I will admit that. I had a friend drive me. He sat outside while I waited way too long. He had a parking receipt. A lady working at the PPA came outside for a smoke break, saw his ticket had only 1 minute of time left, went up to him and said if that meter hit 1 minute later he would get a ticket. She started writing the ticket as he was paying for a new receipt. When he printed off a new one at the kiosk in time she said \"lucky you got that in time\" and put her ticket machine away. Like what the fuck? "}