{"doc_id": "116", "name": "2016_06_humanities_student_major_1167_uva", "namespace": "we1sv2.0", "metapath": "", "pub": "UVA", "title": "2016-06-humanities-student-major_1167_UVA.txt", "pub_date": "2016-06-16T00:00:00Z", "Sentiment": "0.095", "Subjectivity": "0.313", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "269", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4ofqu5", "Reddit_id": "d4cntjd", "Subreddit_id": "t5_2rcav", "Commenter": "uke-guitar-stuff", "length": "1830", "content_scrubbed": "So it[.] a little complicated, and there[.] probably someone who can answer this better than I can but it[.] been 7 hours and no one has helped you out yet. So here goes. \n\nGlobal Studies is more of an umbrella-department-type-of-thing where you have to pick between 4 different majors: global development, public health, the environment, or security and justice. I think that global development is the most popular one of the four. It[.] super liberal_arts-y in that it[.] very inter-disciplinary and is all about how countries advance themselves, create culture, stuff like that. It[.] also a competitive major so not everyone who applies will get in. \n\nThe politics department is also an umbrella-department-sort-of-thing and is divided into two majors: foreign affairs and government (we don't really have \"political science,\" but there is a pretty comprehensive politics honors major). Foreign affairs and government are pretty similar, you just take a few more classes related whichever one you pick. Both are \"non-competitive\" majors so you really just have to take the prerequisites and declare. \n\nPolitical and social thought (PST) is pretty liberal_artsy because it[.] all about creating your own focus. It[.] also a competitive major. \n\nIf you're really interested in IR and poli-sci, I think that the foreign affairs major would be the way to go. \n\n**Helpful links:**\n\n[Global Studies](http://globalstudies. virginia. edu/)\n\n[Politics](http://politics. virginia. edu/our-two-majors/)\n\n[PST](https://pages. shanti. virginia. edu/pst/)\n\nA really helpful thing to do would be to go to these websites and find out what classes are required for each major. Then go to [Lou[.] List](https://rabi. phys. virginia. edu/mySIS/CS2/), search for the classes, and read the descriptions. See if those are the sorts of classes that will interest you. "}