{"doc_id": "137", "name": "2016_06_humanities_student_major_1348_truegaming", "namespace": "we1sv2.0", "metapath": "", "pub": "truegaming", "title": "2016-06-humanities-student-major_1348_truegaming.txt", "pub_date": "2016-06-19T00:00:00Z", "Sentiment": "0.014", "Subjectivity": "0.351", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "436", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4g8p0v", "Reddit_id": "d4g9d1i", "Subreddit_id": "t5_2sgq6", "Commenter": "StarTrekMike", "length": "2449", "content_scrubbed": "I understand that you don't have a problem with violent media, the problem is that you want it to follow _your_ specific rules. This is not a satisfactory or realistic outcome for the large majority of us (as you have seen thus far with the rather expected response you have received from your blog post both here and in the progressive sub). \n\n  Again, even in this post, you seem to think that your way is the best way. \n\n I want media to portray violence in the correct way.\n\n  What is \"the correct way\"? You have presented no actual data to back up your assertion that there are indeed \"second-order effects\" on a scale that actually matches what you seem to think it does. As such, why should we subscribe to your (rather arrogant) notion of what the \"correct way\" is? \n\n  Here is the thing. I totally get that you have personally decided that you don't like how violence is handled in gaming, that is fine. I don't think anyone here has been so twisted by \"second-order effects\" that they would want to put a gun to your head and make you play the torture scene in GTA V or something. I respect that you have made a choice to not indulge in violent content that you find personally problematic. \n\n  The problem is that you have let your dislike of \"gross\" violent games (the kind that don't handle violence _exactly_ according to your \"correct\" way) make you arrogant. Your posts here, on the other subreddit, and even your blog itself are framed in a manner that tells us that you think you know best. That everything would be so much nicer if we just could follow your lead and aspire to your moral/ethical level in terms of game design and taste.\n\n  You very backbone of your argument is based on a assumption and nothing more. Even worse, it is a assumption that does not really work in practical terms. We know that one can play a game that handles violence \"wrong\" and still not experience these \"second-order effects\" that you speak of. \n\n  Like Joe Lieberman, Hillary Clinton, Tipper Gore, Frederick Wertham, and countless more who have stood against the perils of the arts/media. You have positioned yourself on some sort of moral soapbox where you think you can just apply your personal theories as facts. That is not how things work and nor is it how they should work.\n \n You may not advocate legislative censorship but this idea that you have found the \"correct way\" to portray violence in art/media is very much on the same level."}