{"doc_id": "63", "name": "2016_06_humanities_student_major_710_debatefascism", "namespace": "we1sv2.0", "metapath": "", "pub": "DebateFascism", "title": "2016-06-humanities-student-major_710_DebateFascism.txt", "pub_date": "2016-06-09T00:00:00Z", "Sentiment": "-0.002", "Subjectivity": "0.261", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "376", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d422thf", "Reddit_id": "d42e2hn", "Subreddit_id": "t5_2v642", "Commenter": "QXTZ", "length": "2174", "content_scrubbed": " Do you believe there is such a thing as \"white privilege\"? \n\nYes, I believe so, but there[.] a lot of exaggeration on both sides of the debate. You mention that the idea \"does not account for the outstanding individual,\" and I'm inclined to agree. The \"white privilege\" ideology that is being thrown around so often these days really *does* negate the individual, White and Black. At the same time, White people use arguments that *also* negate the individual. I'll give examples of both through personal experience:\n\nI grew up in the projects, without any real contact with White people (excluding teachers). I ended up going to a private liberal_arts college. My first few days there, I expected to see all the White kids driving Ferraris and Lamborghinis, wearing Prada, and generally showing off their white privilege. Imagine my surprise when not only did I not see a Ferrari, but seeing White people whose families struggled economically to put them through school. Turns out, White people *do* struggle in this society. \n\nA few years latter, I was hanging out with a White friend, and the topic of how expensive our school was came up (sounds like I'm bragging I know). He mentioned that, in the case of school costs, he wished he were Black. I asked him what he meant. He said that Blacks got extra scholarships for school on account of their race. More shocked than offended, I told him that while there certainly were scholarships (I think UNCF and NAACP give some out) that were given to academically outstanding Blacks, the majority of us (like me) received no such thing.\n\nSo, \"white privilege\" isn't the only ideology that disregards individual effort, it[.] just the loudest at the moment. Personally, I have not once looked at the success of a White friend and gone \"yeah well, he[.] white so of course.\" On a societal scale, I think it[.] undoubtedly more difficult to be Black than White, but this doesn't mean that White people are just handed success on a silver platter. Conversely, this doesn't mean that every Black person who lives and dies in the ghetto is being held back by the White man. The truth lies somewhere in the middle (these days at least)."}