{"doc_id": "58", "name": "2016_06_humanities_student_major_668_worldbuilding", "namespace": "we1sv2.0", "metapath": "", "pub": "worldbuilding", "title": "2016-06-humanities-student-major_668_worldbuilding.txt", "pub_date": "2016-06-08T00:00:00Z", "Sentiment": "0.051", "Subjectivity": "0.388", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "292", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4n8a3x", "Reddit_id": "d41rl65", "Subreddit_id": "t5_2rd6n", "Commenter": "Grine_", "length": "2028", "content_scrubbed": "I have difficulties giving a straight answer on this one. The best answer I can give is that Scatterverse is \"realistic social science fiction\". But I'll give a number for the sake of the thread: 4. My major \"lies\" are socio-informatics (a handwavium social science) and SPRINT (FTL travel and communication).\n\nThe idea of \"hard\" science fiction implies a lot more than just a concern with realism. For starters, that realism is not equally distributed. There[.] often a focus on physics and engineering over, for example, biology or chemistry. While my universe features realistic spaceflight (*let[.] just ignore FTL travel for a minute*), it[.] not the focus of the story. The technologies I've fixated on mostly have to do with computers and information technology: for example, \"gridbox\" computers are the crowning technological achievements of my world, capable of sifting through insane amounts of data and (with the assistance of gobs of academics and intelligence personnel) coming up with \"socio-informatic\" models of individual and group behaviour. Socio-informatics, a handwavium social science with significant influence from the humanities, also isn't a typical \"hard-SF\" invention.\n\nIt[.] also worth mentioning that my world has a different aesthetic than what I associate with \"hard-SF\". When I think of hard_science fiction, I think of worlds and stories that are cynical, hard-nosed, and gritty. It may not be a [Used Future](http://tvtropes. org/pmwiki/pmwiki. php/Main/UsedFuture), but it is definitely a harsher feel than what I go for in Scatterverse. My world is sleek, shiny, and colourful, though it falls short of the [iFuture](http://tvtropes. org/pmwiki/pmwiki. php/Main/EverythingIsAnIPodInTheFuture) aesthetic. Thematically speaking, there is some overlap with traditional hard_science fiction. Despite looking a lot more like [Mirror[.] Edge](http://www. newgamenetwork. com/images/uploads/gallery/MirrorsEdge/Screenshot1. jpg) than I want to admit, a lot of the stories set in it are going to be pretty dark."}