{"doc_id": "117", "name": "2016_06_humanities_student_major_1179_monsterhunter", "namespace": "we1sv2.0", "metapath": "", "pub": "MonsterHunter", "title": "2016-06-humanities-student-major_1179_MonsterHunter.txt", "pub_date": "2016-06-17T00:00:00Z", "Sentiment": "-0.005", "Subjectivity": "0.362", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "281", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4oizf2", "Reddit_id": "d4d3xjb", "Subreddit_id": "t5_2rron", "Commenter": "Kazuja", "length": "1527", "content_scrubbed": "Now now, you're exaggerating. The nerf is 10% damage decrease on stabs, and that only on Yellow Heat Gauge. Once you get to orange, the damage is about the same as 4U(+ a minor buff to the runnign stab I believe?). Red is a 5% damage increase, which is piss-poor and they really shoulda just made it 10%, but what can you do.\n\nShell damage in and for itself I don't remember receiving any change, however with the game not actually going up to G rank Level 5 shells aren't a thing in this game, and I believe Level 4 still exists but is only on gimmicky weapons that trade everything from good raw to good sharp for the better level.\n\nSo the weapon got nerfed a little in that regard, which is fucking stupid, but there[.] also been changes that actually benefit the weapon as a whole. Being able to backstep out of shotgun is a major QoL change that speeds up the flow of the weapon by a lot, and the arts, overall, tend to be pretty amazing for the weapon(most overall utility ones focus on increasing mobility or negating tripping by a bit, which will be really useful for the weapon. The weapon specific ones are amazing, with Wyvernbreath providing a flat damage bonus to every shell while locking the heat gauge to red, and the Rocket Boost presumably helping the weapon[.] mobility a lot. Only Fireball is kinda mediocre, and it makes up for it by looking and sounding fucking rad).\n\nFor what it[.] worth, the nerfs are still retarded, but they don't make the weapon unusable, and there[.] some good stuff to make up for it."}