{"doc_id": "173", "name": "2016_06_humanities_student_major_1659_mgtow", "namespace": "we1sv2.0", "metapath": "", "pub": "MGTOW", "title": "2016-06-humanities-student-major_1659_MGTOW.txt", "pub_date": "2016-06-23T00:00:00Z", "Sentiment": "0.103", "Subjectivity": "0.42", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "344", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4pga84", "Reddit_id": "d4lh9bq", "Subreddit_id": "t5_2sjgc", "Commenter": "Ovendice", "length": "1896", "content_scrubbed": "If by 'high value' she means extremely attractive, OF COURSE an extremely attractive female isn't going to fuck around in 2016! **PFFFFFT.** \n\nOr maybe 'high value' means being raised in a respected family? That means nothing. Or a family with $$? Means even LESS. Rich daddy[.] girls are the biggest sluts of all. \n\nAnd there[.] no danger of any female you meet today possibly being a 'good girl saving herself for marriage,' those went extinct back sometime in the 90s, around the same time fathers lost all of their power, control and legal rights in the home, who now if they say anything to their daughters about being a slut or try to shame them, they're told THEY'RE the ones with the problem and is now LEGALLY 'abuse.' \n\nAnd that[.] just the homes that even have a 'father' in the home, albeit a worthless one because he has ZERO power or rights and today right is wrong and wrong is right, upside down morals.\n\nJust saying that unless a female in the U_S is Amish, there is no possible way she can be 'high value' on ANY scale at all. Except MAYBE the extremely rare female who is going to college and is actually majoring in something other than a liberal_arts trash major; law, STEM, medicine. That[.] about 5% of the female population and $1000 says all of THEM fuck around too. So there is no such thing as a high value woman in the U_S today. \n\nThey're all sluts, whores, dumbed down, unaccountable and complete flakes. Women have to be RAISED to be good mothers and wives and today women/girls are raised to be the extreme opposite; a shitty version of a man. A FEMINIST: Spiteful, unaccountable, toxic and a STD infested whore who aborts all of her babies and couldn't be loyal to one man if her soul depended on it. And BUTCH, which is THE most repulsive thing of all to a heterosexual man. You would have to be a closet homosexual to be sexually attracted to these butchy women. "}