{"doc_id": "1881", "name": "2016_08_humanities_student_major_390_unitedkingdom", "namespace": "we1sv2.0", "metapath": "", "pub": "unitedkingdom", "title": "2016-08-humanities-student-major_390_unitedkingdom.txt", "pub_date": "2016-08-06T00:00:00Z", "Sentiment": "0.047", "Subjectivity": "0.322", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "330", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6732sl", "Reddit_id": "d674l0o", "Subreddit_id": "t5_2qhqb", "Commenter": "blueb0g", "length": "1860", "content_scrubbed": "Many science programs offer undergraduate masters, usually a 4 year course that ends in an M-something (usually not MSc, in order to distinguish them from postgraduate masters - might be called an MChem for Chemistry, MBiol for Biology etc), rather than a 3 year course ending in a BSc (Bachelor of Science). Usually you need to meet a minimum grade at the end of your second year, often 55 or 60 or so, in order to continue to the Masters. \n\nThese generally don't exist in the humanities, where all Masters degrees are postgraduate courses. \n\nIf you want to do a science degree, and you don't know if you want to do a 3 year or 4 year course, don't worry, there[.] usually scope to switch between the courses in your second year. \n\nAnd then above both of these types of degrees are doctorates, usually referred to as PhDs or DPhils. Normally a Masters level qualification is required to apply. \n\nAs for the process of applying, you should decide on your course first (main criterion is your enjoyment of the subject, which comes ahead of whatever crap people throw at you about employability etc... but do consider what field you might like to work in when you graduate), see where is best for that course, and go and visit some universities. You get to apply to 5 unis through UCAS, so pick a spread of courses with higher and lower entry requirements to keep your bases covered. Once you start getting responses to your applications, you select 2 of them to keep and reject the others; one of those is the 'firm' offer, the other is the 'insurance' - if you end up meeting the requirements for the firm offer, you go to that university. If you miss those requirements but meet the requirements for your insurance, you go there (so insurance should be lower requirements).\n\nIf you want more detail feel free to ask, but your school should deliver guidance. "}