{"doc_id": "129", "name": "2016_06_humanities_student_major_1248_reformed", "namespace": "we1sv2.0", "metapath": "", "pub": "Reformed", "title": "2016-06-humanities-student-major_1248_Reformed.txt", "pub_date": "2016-06-18T00:00:00Z", "Sentiment": "0.116", "Subjectivity": "0.312", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "457", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4ookkw", "Reddit_id": "d4eblbz", "Subreddit_id": "t5_2riuy", "Commenter": "c3rbutt", "length": "2727", "content_scrubbed": "**1.** Having attended a state university (Purdue) and now working at a Christian college (Geneva), I can say that I understand the value of a Christian education in a way I didn't before. While I was at Purdue, I assumed that bigger=better. More opportunities, more prestige, more money, better equipment, etc. But having worked, and taught (just a little) at Geneva for nine years now, and *especially* after attending and participating in two classes, the difference is *stark.* I didn't have a single class at Purdue that measured up to what I've experienced at Geneva. The courses at Geneva were more challenging, more was expected, more was given (by teacher and students); it[.] honestly a night and day difference.\n\nThat said: a Christian liberal_arts degree isn't for everyone right out of high school. You might need to go to a state school to study what God has gifted you in and lead you to through various providences. And we can't ignore the money issue. But if you go to a state school, you need to supplement your education somehow, I think.\n\n**2.** I think the environment is more important for K-12 students. In some ways, I would feel like I was throwing my child to the wolves by sending them to a state school. But, having been there myself, it[.] really not that bad. If they're ready for it and have a good support group, a Christian can grow and flourish at a state school.\n\n**3.** If the primary purpose of education is qualification, then just go to a community college and get that piece of paper. Every teacher I know at Geneva recoils at the suggestion that a purpose of an education is qualification/certification or, even worse, a job. \n\nBut if the purpose of an education, specifically a *Christian* education, is to teach you to *how* to think, then the activity of education is vastly different. I think Geneva[.] *[Foundational Concepts](https://www. geneva. edu/about-geneva/foundational_concepts)* states it well: \n\n Christian education seeks to develop the students' abilities to know God and to relate themselves and the created universe to God through the study of His Word and Works.\n\n**4.** I think that[.] a good inclination, but it requires some fairly significant sacrifices, especially economically. It[.] also not a law we can see in Scripture for all Christians. It would be radically counter-cultural for a Christian in Japan to live this way, for instance.\n\n**5.** Similarly, that[.] a decision every person is going to have to seek wisdom for. There are just too many variables to consider here, hypothetically. I'm sure no one in the church would suggest that anyone should neglect their family in favor of their job, but the location of that line is probably unique to every family."}