{"doc_id": "1916", "name": "2016_08_humanities_student_major_670_auslaw", "namespace": "we1sv2.0", "metapath": "", "pub": "auslaw", "title": "2016-08-humanities-student-major_670_auslaw.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.491", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "882", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4x5tf1", "Reddit_id": "d6cpv9z", "Subreddit_id": "t5_2stjv", "Commenter": "enigmasaurus-", "length": "5361", "content_scrubbed": "In case of paywall posted below (interesting rebuttal to the recent article on law degrees being a 'bait and switch'. Economically speaking the graduate glut extends far beyond law, and of those with degrees law grads are arguably still amongst the highest paid and most employable).\n\n___\n\nIn this paper on Tuesday, Frank Carrigan made a familiar argument denigrating legal education.\n\nAlong with numerous other commentators, Carrigan, who is a senior law lecturer at Macquarie University, argues that there are too many law schools and too many law graduates for the jobs available.\n\nHe called for a \"strong interventionist state willing to expose market imperfections\", which would presumably decide how many law schools or law graduates are required – with all the exceptional insight that governments tend to bring to predicting the future.\n\nWithout wanting to let the facts get in the way of one of the most oft-repeated stories about law school, lets imagine the minister in charge of this national workforce planning in discussions with her staff about limiting the number of law graduates.\n\nMinister: \"I keep hearing that there is a terrible over-supply of graduates from law and we need to do something to stem the flow.\"\n\nStaffer: \"Absolutely, Minister, there are stories about it in the papers almost every week.\"\n\nMinister: \"So the outcomes for recent law graduates are pretty terrible are they?\n\nStaffer: \"Well, not exactly terrible, Minister. According to Graduate Careers Australia, around 74 per cent of those who graduated from law school four months earlier and were available for employment were in fact employed. The national average for graduate employment is a bit under 69 per cent.\"\n\nMinister: \"But they must be much less employable than those people in science and maths – everyone is always telling me that we need so many more of those.\"\n\nStaffer: \"Actually, Minister, those with Bachelors degrees in Maths had an employment rate of 62 per cent, chemistry graduates a rate of 50 per cent and physics graduates a rate of 54 per cent.\"\n\nMinister: \"Well it[.] probably because all the law graduates are working in fast food joints making minimum wage having been hoaxed into doing a worthless degree.\"\n\nStaffer: \"Sorry, Minister, but the average starting salary for law graduates is above the average salary for graduates of all degrees and in the top ten degrees by salary for recent graduates.\"\n\nMinister: \"So you are saying that we should limit graduates from a degree with higher than average employment and salary outcomes – can you remind me why?\"\n\nOther than a particularly vocal and pessimistic constituency, it is difficult to understand why studying law is so often singled out as problematic when the comparative data does not support this position.\n\nThis is not to disrespect those law graduates who are struggling on the jobs market or have been unable to find employment suitable to their qualifications.\n\nIt is merely to say that we need a sense of perspective and a wider view than just that of law.\n\nThese are difficult times generally for young people seeking to enter the job market across many professions.\n\nDigital disruption and the rapid pace of change mean that today[.] secure and stable employer may have disappeared within a couple of years while some industries that look as though they are struggling, may reinvent themselves and thrive for decades to come.\n\nThat is why a flexible degree like law that teaches a range of transferable skills is still a good investment for many students.\n\nWhile Carrigan sneers that studying the law narrows the mind – citing an English judge without a law degree as evidence – and that it does not serve well to prepare student for degrees outside law, unfortunately the evidence again does not support this proposition.\n\nI speak weekly to alumni of Melbourne Law School who work in business, the arts, policy, diplomacy and consultancy who all say that their law degree and the rigorous, analytical skills that it developed in them have served them well for their whole careers.\n\nWhile Carrigan is right that studying the law does involve some complex analysis of cases and legislation, seeking to find and apply relevant principles, this training of the mind has numerous benefits.\n\nTo suggest that the law school of today does nothing more is simply false. Many law schools offer a range of opportunities – from practical clinics, to skills based classes, to writing research essays, to overseas study, to working with legal technology.\n\nThere are more exciting options to extend their knowledge and skills available to law students now than there have ever been in the past.\n\nCarrigan is right that we should be open and honest with students about the employment market out there.\n\nI think that there is an argument for law schools collecting and sharing information about job outcomes with students who are entering degrees. Transparency will help them make good decisions.\n\nBut don\"t let all the sound and fury deceive you. In a complex, difficult world in which graduates will not see the same stability in employment that previous generations have enjoyed, law graduates still have better prospects than most young people.\n\nProfessor Carolyn Evans is Dean and Harrison Moore Professor of Law, Melbourne Law School, and chair of the Council of Australian Law Deans \n\n\n\n"}