{"doc_id": "1914", "name": "2016_08_humanities_student_major_648_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2016-08-humanities-student-major_648_changemyview.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.028", "Subjectivity": "0.344", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "341", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4x4hgq", "Reddit_id": "d6ce933", "Subreddit_id": "t5_2w2s8", "Commenter": "matt2000224", "length": "2006", "content_scrubbed": "First, there are plenty of jobs you can get with a philosophy, or really any humanities, degree.  Just because there aren't as many of them and the ones that are available aren't as lucrative as STEM outcomes doesn't make the degree or career track worthless.\n\nSecond, philosophy is very applicable to everyday life.  Any time you think \"I wonder if I should...\" you are acting as an amateur philosopher.  Studying philosophy teaches you many valuable things.  Because I minored in philosophy, I have more sophisticated views and more well-articulated arguments on abortion, war, animal rights, etc.\n\nIn November I will cast my ballot in the US general election in no small part informed by education in philosophy.  One class I took on Hannah Arendt, for example, caused me to read her book Eichmann in Jerusalem which taught me about her theory on the banality of evil.  This in turn has given me a separate lens to view certain people in the Trump campaign, especially folks like Paul Ryan, and it has illuminated things more clearly.  This is but one philosophical idea that I was introduced to that has informed my political action.  Her writings on labor and modernity made me more receptive to concepts of European socialism, so that when Bernie Sanders became a major figure this past year, I actually could comprehend the nuances of what he was talking about.\n\nI could talk at length about other authors too.  Aristotle, Hume, Kant, Marx, etc.  All of these people have impacted my worldview.\n\nThird, you mentioned how it can be combined with things like law or political science.  I think that[.] correct.  I'm actually studying law right now, and having a background in philosophy has certainly helped me formulate my arguments in a logical manner.  It has also helped me when we discuss legal policy when it comes to topics like criminal or constitutional law.\n\nI hope I've helped you to understand at least some of the value of a philosophy degree.  If you have any questions, feel free to ask."}