{"doc_id": "1910", "name": "2016_08_humanities_student_major_642_writing", "namespace": "we1sv2.0", "metapath": "", "pub": "writing", "title": "2016-08-humanities-student-major_642_writing.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.163", "Subjectivity": "0.467", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "275", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4x3k9m", "Reddit_id": "d6cbxp5", "Subreddit_id": "t5_2qh2n", "Commenter": "ZetaInk", "length": "1562", "content_scrubbed": "I am in a similar situation as you are (heading into my sophomore year) so I wont even try to give you some sagely advice here or anything like that. Hell, I have as much anxiety about my future as you do. \n\nMore so, I would just suggest a bit of a change in perspective. You have an entire educational institution full of interesting subjects for you to make use of which you are already paying for anyway. You still have a couple semesters to figure out a major as well. Go ahead and take some electives, fill some of those gen-ed requirements with classes you wouldn't normally take. \n\nA lot of us don't actually know what we are doing here... especially in the humanities. Take a step back and explore some interests and I am sure you will find something that captures your creativity and maybe even spurs some writing beyond that.\n\nAs for your writer[.] apathy... I mean, I feel like everyone kind of hits that at some point with their preferred artistic outlet. Depression is incredibly draining as well as a super personal issue to tackle. However, I would suggest maybe trying to channel those feelings into an expressive outlet, like writing ;). You could start by just asking yourself if there is anything you want to communicate about the feelings you have and then try to build a short narrative around those messages. Just some ideas but more than that I hope you don't shy away from confronting those problems even outside writing. University health services tend to be pretty accommodating if you feel these issues are impacting your personal life."}