{"doc_id": "102", "name": "2016_06_humanities_student_major_1078_compsci", "namespace": "we1sv2.0", "metapath": "", "pub": "compsci", "title": "2016-06-humanities-student-major_1078_compsci.txt", "pub_date": "2016-06-15T00:00:00Z", "Sentiment": "0.134", "Subjectivity": "0.43", "Score": "23", "Upvotes": "23", "Downvotes": "0", "Wordcount": "480", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4o8ioh", "Reddit_id": "d4ajx83", "Subreddit_id": "t5_2qhmr", "Commenter": "Kambingx", "length": "3198", "content_scrubbed": "(Disclaimer: professor at a selective liberal_arts college (SLAC))\n\n My dream is to go get a PHD after undergrad, but I'm worried that if I go to a non-research school, I won't learn enough to be accepted into any serious PHD program.\n\nSLACs disproportionality send more undergraduates to graduate/PhD granting institutions than research universities, *e. g.*, read this article on computer science in liberal_arts institutions:\n\n* [Computer Science and the Liberal Arts: a Philosophical Examination](https://www. cs. swarthmore. edu/~cfk/cs-liberal_arts-accepted. pdf)\n\nStudents at liberal_arts colleges pursue research opportunities via REUs (research experiences for undergraduates) at research universities or do research with their professors at their institution–I'm currently advising a number of students this summer.\n\nComing from an entirely R1-based education (undergrad/grad) and moving to an academic position in a liberal_arts school, I'll point out these pros and cons of the liberal_arts experience as it pertains to CS education:\n\n* You are more likely to get a quality educational experience in the classroom at a SLAC than a research university.  Because of how the CS academic market currently works, faculty at liberal_arts colleges are composed mostly of folk that care deeply about undergraduate education.  Furthermore, their evaluation (*i. e.*, tenure cases) depend significantly on teaching quality, so they have incentives to work hard in the classroom.  In contrast, faculty at research universities are primarily evaluated on their research output–at top-tier places, teaching ability may not matter much, if at all–so you can expect some variability in course quality.\n* Because the liberal_arts environment is much smaller and community-oriented than a research university, you can expect to have close interactions with the faculty whereas you may only talk to your professors at a research university only to answer class-related questions.  These close interactions turn into research and job opportunities, personal steering and guidance, and letters of recommendations as the years progress.\n* While liberal_arts colleges are good at nurturing students, because they have a limited amount of faculty, the breadth of computer science they cover can be smaller.  This means that if you become interested in, *e. g.*, computer vision, there may not be a vision expert at your college.  It'll be up to you (with whatever guidance the faculty can give) to learn more about and pursue opportunities in that field.  In contrast, most R1s will feature research experts in almost all areas of computer science, so it'll be easier to work with those people (although if that one expert isn't interested in working with undergrads or is not sociable, you're also hosed).\n* Finally, liberal_arts colleges don't attract top-tier companies for job fairs like research universities do.  My undergraduate institution featured seasonal job fairs which attracted numerous software companies from the surrounding area.  In contrast, I have to do a bit more social wrangling to help my students find good internships opportunities (although here, they ultimately have no trouble doing so)."}