{"doc_id": "62", "name": "2016_06_humanities_student_major_693_singapore", "namespace": "we1sv2.0", "metapath": "", "pub": "singapore", "title": "2016-06-humanities-student-major_693_singapore.txt", "pub_date": "2016-06-09T00:00:00Z", "Sentiment": "0.16", "Subjectivity": "0.445", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "434", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4na5p8", "Reddit_id": "d424f2i", "Subreddit_id": "t5_2qh8c", "Commenter": "llosa", "length": "2369", "content_scrubbed": "I actually would prefer *potato* wizards and *kitten* astronauts. That is because wizard magic can animate potatoes, but sentient animals are needed to ensure safety in space. \n\nSerious answer as a late-stage millennial: \n\nLive abroad in all the continents (3/7 so far), learn different languages, zero kids, no concrete career ambitions - maybe I'll go into academia, maybe not - but I'd like to earn an OK amount of money. Enough to support myself. I certainly have a goal to get postgraduate education in the humanities though. Minimalist lifestyle, no car, maybe a motorbike but probably not given my love for living in major cities, and I prefer living in rented apartments. I can get by with just a master bedroom really. While others might save up for a car or a house downpayment, I'd like to get a chin implant. So that[.] my 'big ticket' item. If I had to collect a possession, it would be antique books, not Hermes Birkins or whatever.\n\nAs for **why** - this lifestyle makes me happy. I don't believe in an afterlife so I might as well do what I like in this world, hence I refuse to burden myself with extra family commitments (my parents are enough). I don't like being weighed down by lots of downpayments and instalments for washing machines and all that shit, I'd prefer to be able to move at short notice to go on new adventures. I'm interested in humanities so I study them. I like languages so I like traveling around to practice them. I like books so I would spend time hunting down editions I like to read. I hate my chin so I would invest in a better one. All this gallivanting is easier to accomplish overseas, hence the emphasis on living abroad. \n\nToo many people (in my opinion) spend life living for others. They live for their parents until they're 21. Then they live for their partner. Then they live for their kids. Then they live for their grandkids. Then they're dead. \n\nThat[.] not how I want to be remembered - someone who sacrificed her life to make others happy. I have to [.]acrifice' my life anyway - we all do, everyone dies - so I might as well be happy in the process. I used to want to be remembered after my death, but now I have realised... who really cares? Our lifetimes - even our legacies - are a tiny drop of time in the hourglass of eternity. Lame but it[.] true. I want to make sure that this is a very tasty drop for me. \n"}