{"doc_id": "2035", "name": "2016_08_humanities_student_major_1856_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2016-08-humanities-student-major_1856_news.txt", "pub_date": "2016-08-25T00:00:00Z", "Sentiment": "0.161", "Subjectivity": "0.455", "Score": "105", "Upvotes": "105", "Downvotes": "0", "Wordcount": "277", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4zh7k3", "Reddit_id": "d6w18ss", "Subreddit_id": "t5_2qh3l", "Commenter": "Argos_the_Dog", "length": "1613", "content_scrubbed": "Academic here (professor in STEM at a large, east-coast univeristy). Many of us academics don't care for this shit either. We just want to do our research, which is stressful enough as it is. I basically run a business, managing a good-sized chunk of grant funding, graduate students and post docs, field sites in Africa, frequent international travel, etc. This kind of workload isn't uncommon among faculty at R1 schools. We are busy people, despite the myth of the slacking professor. \"Safe spaces\" aren't high on our list of priorities. I know some people think it is faculty in the liberal_arts who advocate for this kind of stuff. I've never personally seen that, and some of my friends are in disciplines like English, Classics, etc. Any time this stuff has come up, everyone universally thinks it is goofy. Very likely if it is faculty advocating for this, it is an extreme fringe at select campuses.\n\nA metric ton of the kind of stuff that pops up as causes of angry debate on reddit (safe spaces, trigger warnings, protests over historic statues, etc.), at least at my campus, comes out of places like the Residential Life Office (they frequently sponsor \"open dialogue\" type things, coffee houses to discuss diversity, etc.). I think the folks who work there (mostly younger, earnest, full of optimism, as it is good to be when you are working directly with young people) honestly think they are doing good work by addressing this stuff. Maybe they are, I have no idea. But I can tell you it isn't the professors/academics (or at least most professors I have personal experience with) pushing for this."}