{"doc_id": "1919", "name": "2016_08_humanities_student_major_693_winstonsalem", "namespace": "we1sv2.0", "metapath": "", "pub": "winstonsalem", "title": "2016-08-humanities-student-major_693_winstonsalem.txt", "pub_date": "2016-08-11T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.373", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "428", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4x6inu", "Reddit_id": "d6d242a", "Subreddit_id": "t5_2rqrv", "Commenter": "bobellysosmelly", "length": "2678", "content_scrubbed": "My take... Winston is a classic post-industrial city (much like the rust belt) that bottomed out around 2000 and has been making positive strides ever since.  Progress is slow (relative to a person[.] lifespan) but I suspect Winston will continue to improve it[.] economy and amenities over the next 10-20 years.   \n\nA few bullet points to illustrate:\n\n* The downtown business district was pretty much vacant around 2000.  I forget the exact figure, but something like 65% of store fronts were empty per a WSJ article from a couple years ago.  Now it[.] hard to find a building downtown that isn't occupied or in the planning stages of redevelopment.  This means new buildings will have to be constructed to accommodate additional growth.\n* Population trends are positive, both downtown and in Forsyth County.  I think the long_term projection is ~2% per year, which is a nice sustainable rate of growth.   \n* Investments are being made in growth industries... biotech, financial services, medical, etc.  The IQ is the most visible evidence of this investment (and it does receive national recognition as one of the largest downtown innovation districts).  WFU[.] decision to relocate the med school + locate the new engineering school in the IQ should also provide some important intellectual capital (Forsyth Tech will play a key role as well in training skilled technical grads to complement/staff these emerging industries).  \n*  There is a strong arts culture including UNCSA, Art for Arts Sake (heavily involved in the Arts District and the new Arts Park on Liberty), Creative Corridors (providing input into the Business 40 redesign), and Sawtooth.  While we lost Ziggys as a permanent venue for music, the Garage + a bunch of downtown music festivals is a decent starting point to support local music.  I'm hoping for another larger (~500-1000 capacity) music venue to be built eventually.\n\nWinston still has major challenges with poverty and crime... some of these are due to the lack of a broad economic base to drive employment growth, although this is a national challenge to a certain degree.   Hopefully some of the investments in biotech will start to drive a faster pace of job growth soon (much like the Triangle in the 80s & 90s).\n\nTLDR; I think there is much room for optimism but there is still a long way to go...\n\n\n**edit**:  Here is a timely article that is apropos to this discussion and an example of the national attention that the IQ is starting to receive.  Winston is #4 in Entrepreneurship Leaders category, mostly due to some of the investments mentioned above.  http://businessfacilities. com/2016/08/business-facilities-12th-annual-metro-rankings/  "}