{"doc_id": "1894", "name": "2016_08_humanities_student_major_510_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2016-08-humanities-student-major_510_AskAcademia.txt", "pub_date": "2016-08-08T00:00:00Z", "Sentiment": "0.006", "Subjectivity": "0.344", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "283", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d69sweu", "Reddit_id": "d69zbmp", "Subreddit_id": "t5_2sakj", "Commenter": "khosikulu", "length": "1750", "content_scrubbed": "Teaching is still considered important here in our History Dept, but good research will overcome bad teaching, while even incredibly great teaching will not make up for weak scholarship.  Despite that focus on research, teaching actually does matter to us--we now pick and choose for that strength too, and increasingly must because we're now assigned our budgets entirely by how well our courses enroll and our numbers of majors.  I had three years of full-time teaching (of record) at three different highly-ranked institutions, plus four more years of TA experience, when I applied.  That level of experience is increasingly normal to see, although it doesn't always behoove an applicant without a current position to have so much experience that a committee suspects something might be dodgy.  Teaching now officially figures into our rankings even though it can't fail a search or prevent tenure by itself the way that research chops can.  Certain grants/fellowships are almost expected in your background when you apply--Fulbright or SSRC, etc--but beyond that they don't matter unless they're really huge.  It[.] the pubs that come first, teaching second, and grants/service a distant third, just as it is in practice for tenure review.\n\nIncreasingly an applicant in the humanities has to look like a full-spectrum superstar just to qualify, much less beat the competition.  There[.] still a bunch of the old-boy networking out there, but it[.] harder and harder for our senior faculty to justify letting any such \"favors\" get past the first cut now that our priorities have shifted so much.  That may be the only plus side to the current state of things, but I try to look for the silver linings.\n\n[edit: rearranged some things for readability.]"}