{"doc_id": "153", "name": "2016_06_humanities_student_major_1451_fatlogic", "namespace": "we1sv2.0", "metapath": "", "pub": "fatlogic", "title": "2016-06-humanities-student-major_1451_fatlogic.txt", "pub_date": "2016-06-21T00:00:00Z", "Sentiment": "0.03", "Subjectivity": "0.382", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "595", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4p1zb4", "Reddit_id": "d4ibsm0", "Subreddit_id": "t5_2wyxm", "Commenter": "woxihuan", "length": "3658", "content_scrubbed": "Yes. I am an academic, in graduate school in the Humanities. The climate there is chilling. Critical theorists have jumped on to the relativism, individual freedom, and victimhood bandwagon, and discourse around sensitive topics like weight and health are so interlocked with gender theory, philosophy, and political activism that it[.] almost impossible to defend against it head-on in a professional educational setting, which is where these conversations need to be happening. \n\nYou don't change minds on an individual basis through argument. You change social and cultural narratives alongside policy and education so that people live in an atmosphere of possibility, rather than an atmosphere of fear and helplessness. That sea change comes from academic research and public intellectuals communicating with the public in a reasonable way, and the story makers and policy writers influencing how people frame their lives day to day.\n\n When intellectuals and professional academics can't support conversations about evidence-based reality alongside emotional and cultural stories, then we get emotion-based movements that don't have any merit but have a lot of appeal. That[.] why these super emotional \"TITP\" vignettes get shared so much - we've all experienced shitty emotional situations around food and body image, so they resonate far more than a scientific article shared around. The data might be good, but without interpretation and emotional appeal, it only interests professionals who already agree with the methodology. We end up with these two separate narratives of science and emotional stories that exist in academia and culture, respectively.  The scientists and academics  don't help things by being bad writers and elitist, and the cultural revolution people don't help things by being rhetorically emotional and rejecting science.\n\nAnd that[.] the top of the problem from an academic point of view. I'm actually scared to write about it formally and attach my name to my views because I'll be honest: the majority of people in my program are overweight and activists and love fat activism. It would indeed hurt their feelings if I spoke about any of it, so I'm carefully learning how I can approach it from a compassionate point of view so I can put them at ease but still focus on the need for a better health narrative. It[.] a little frightening, but it[.] also something I feel strongly about.\n\nMy partner feels the same way. We're both teachers, but this year while I'm in graduate school he[.] working as a personal trainer, and really enjoys the field. However, we noticed that just the title and the idea of him being a trainer has made people defensive around him. He[.] worked hard to project a kinder, compassionate trainer persona, and while he[.] losing patience with people who are eating themselves into an early grave, he still tries to give people the inspiration they need to be emotionally comfortable around the idea of health and fitness. However, even in one years he[.] seen more failures than he[.] seen successes, and he[.] disappointed, and feels like he[.] fighting a losing battle.\n\nHowever, despite the negative climate, obviously, we know that people *can* and *do* change. On an individual level and on population levels. The most recent change has been bad, yes, but we can't reasonably expect it to swing around unless we're trying to make it. So while it feels like a losing battle, and yes, for some people, they've already lost, that[.] no reason to stop trying. It[.] the same as any mistake, any slip-up; just keep trying, and take the long view. Don't count short-term results and just stay in the_right track."}