{"doc_id": "165", "name": "2016_06_humanities_student_major_1560_iama", "namespace": "we1sv2.0", "metapath": "", "pub": "IAmA", "title": "2016-06-humanities-student-major_1560_IAmA.txt", "pub_date": "2016-06-22T00:00:00Z", "Sentiment": "0.113", "Subjectivity": "0.456", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "390", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4k1ebr", "Reddit_id": "d4k7k52", "Subreddit_id": "t5_2qzb6", "Commenter": "theangryintern", "length": "2084", "content_scrubbed": "I think you are completely missing the point of this whole discussion.  The problem we have in this country is because of the way society pressures everyone to go to college.  If you don't go to a good college and get a good degree you are a loser and will end up working a dead-end job the rest of your life.  Don't worry about how you'll pay for it, get student loans!!!!  They're super easy to get!!  \n\nI graduated HS over 20 years ago and that was the norm then and it[.] the same or worse now.  If you weren't planning on going to College after you graduated, people looked at you funny, almost like they felt sorry for you.  However, if you told them you were going to a \"good\" school, i. e. Private and Liberal Arts, everyone was so happy for you because you were going to succeed at life. \n\nSo people take on these huge student loan debts because they've been conditioned to believe that in order to be successful they have to get a worthless piece of paper that only proves you can learn some shit out of a book and pass some tests.  Your piece of paper is just as worthless as everyone else[.] because we're failing to see the big picture:  If EVERYONE has a degree, NOBODY does.  Meanwhile there are millions of skilled laborer jobs available right now that they can't fill because everyone looks down on blue collar jobs.  I wish I could go back sometimes and do things over knowing what I know now, because I certainly wouldn't have gone to the \"good\" college I went to and failed out of.  Thankfully I did, because I would have graduated with at least $40-50k in student loans and if I'd stayed with the stupid major program I was in (Communication Studies) I probably wouldn't have gotten a decent job, and this was 20 yrs ago when the job market was actually decent.  I would have definitely gone to a trade school and learned a valuable skill like welding.  Although, in the end it worked out OK for me:  I joined the military when I failed out of college and now I work in IT, one of the few career paths you can be fairly successful in even if you don't have a degree."}