{"doc_id": "159", "name": "2016_06_humanities_student_major_1494_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-06-humanities-student-major_1494_AskReddit.txt", "pub_date": "2016-06-21T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.224", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "299", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4irq4o", "Reddit_id": "d4izhby", "Subreddit_id": "t5_2qh1i", "Commenter": "forsleepssake", "length": "1777", "content_scrubbed": "I'm about as educated as they come, and even I agree with this. College is a self-fulfilling prophecy. College grads are more qualified for many jobs because college grads are the ones who did better in school (so they got into college). The benefits of college are minimal at best (deleterious at worst) when compared to what you'd learn in 4 years of loosely guided instruction combined with real world work experience.\n\nSociety as a whole has no need for college as it is today. It[.] just a societal phenomenon. You could get the same education for free at the public library, and honestly most people don't need that education. What we need is better K-12 schooling, a lesser emphasis on college (and a greater emphasis on skills) to acquire employment, and higher education that focuses on placing people in careers directly.\n\nCollege wouldn't be a waste if it filtered based on career choices. Look at medical school vs. law school. Medical schools only accept enough students so that nearly every graduate will place into a residency. This happens because training medical students is expensive, even with them paying tuition. Law school became a money maker because training law students was cheap. So every university in the country opened a law school. Now we've got too many lawyers and a bunch of low-level legal clerical workers with useless JDs that put them 100k+ in debt. College is the same thing. We're training philosophers with no practical outlet for their training. Universities cover this up by claiming that a liberal_arts education is widely applicable and that there is merit in becoming well-rounded, but I'd point anyone who wants to become \"well-rounded\" back to the public library. If it[.] going to be an investment, then there should be a return."}