{"doc_id": "182", "name": "2016_06_humanities_student_major_1730_adhd", "namespace": "we1sv2.0", "metapath": "", "pub": "ADHD", "title": "2016-06-humanities-student-major_1730_ADHD.txt", "pub_date": "2016-06-24T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.407", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1290", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4pnte6", "Reddit_id": "d4mkyvr", "Subreddit_id": "t5_2qnwb", "Commenter": "roland00", "length": "7387", "content_scrubbed": "2nd Post of mine, but more personal answers instead of looking at this analytically :)\n\nCan't do a TLDR But here is a breakdown like an index to help this all flow in your mind.\n\n**5 Parts**\n\n* 1) Yes I been on this combo of meds\n\n* 2) I think I know what you are talking about with how your thinking is different than it used to be.\n\n* 3) Explains what is happening on the brain, this section is a little long, but it helps you see the bigger picture and get a framework of what is happening in your mind.\n\n* 4) Explain how different meds impact part 3\n\n* 5) My advice what to do from here, and help you figure out what is happening prior to your next doctor appointment.\n\n----\n\n \n\n \n\n**Part 1**\n\nYes I tried this combo of meds Wellbutrin and then adding Vyvanse.  The combo helped treat my ADHD better when we added smaller doses of Vyvanse but my anxiety got too bad when we went too high with Vyvanse.\n\n----\n\n \n\n \n\n**Part 2**\n\nbut I'm feeling a little bit fuzzy. It[.] like I'm wicked zoned out and very zen, but like, too zen. I found myself staring at a wall for well over 30 minutes yesterday, just completely zoned out and daydreaming.\n\nBeen there done that but with a different combination of meds.  Which combo of meds does not really matter for even though I obtained this effect with different combo of meds, me and you are not built the same even if we both have ADHD.  Different genetics and stuff impact in which person these effects occur with what combo of meds\n\nWhat you are describing with this zen but not true enlingment, you are emotionally still but still have feelings. It is both an awesome thing **some of the time** if its productive, aka the mind wandering / day dreaming / not having the overly focused type of thinking is actually useful in your daily life.  That said as you can probably guess it can become a state where its not useful just as much.\n\nYou may find that what med dose of the various meds can shift if this state is productive or unproductive (but do not jump to conclusions read the rest of the post)\n\n\n----\n\n \n\n \n\n**Part 3**\n\nOne of the way Wellbutrin but also other ADHD meds work is by targeting a specific brain network called the Default Mode Network.  Now the Default Mode Network is sometimes known as the self attention network where you are not hyperfocusing on the environment but thinking inside your own head, now this can be thinking about yourself in the present, or what you should do in the future, but this network is also tied to creative thinking, and to mind wandering that is both productive and unproductive.  Think of this network as part of the imagination network.\n\nWell in ADHD the various parts of the default mode network that are supposed to work together as a team are not talking to each other as you should.  And thus you get unproductive versions of all I just said.  ***When these parts are working together as a team, ou get the productive form of the default mode network which is tied to Self Awareness*** \n\nFurthermore this self attention network when triggered can cause you to dump everything you were thinking about, so unsynchronized and unproductive activations by part of the default mode network when they are not talking as they should leads to you losing concentration on what you were focusing on and flushing that working memory leading to inattention and worse working memory.  The networks tied to extreme concentration and extreme focus are different networks than the default mode network and your brain can switch to an almost pure default mode network state where you are mind wandering, or a mix of default mode network + controlled concentration, to a concentrated state, to a hyper focused state where you are so hyper focused you miss stuff or you are not mentally flexible anymore.  Put another way the networks tied to concentration and focus are anticorrelated with default mode network.  Imagine you have a 100 units of attention, you can use X units on the default mode network (turning your attention away from the enviroment and instead thinking about thinking, creativity, mind wandering, self thinking, etc) or you can have Y units of concentration, control, focus, task postive engagement with the outside world, but X+Y must always equal 100 and when you increase X you must decrease Y and so on.\n\nSelf awareness happens when the default mode network and the concentration / focus attention network can talk back and forth and switch the ratios on the fly instead of getting \"stuck\" in one extreme or the other.  Or you are using the one of these networks and one of the other networks spike out of nowhere.  Like a little elementary school teacher is waving his hand saying ME ME ME , PAY ATTENTION TO ME, CALL ON ME TEACHER, and suddenly the teacher is trying her or his best to ignore the extreme nature of this child vs the other students but its really hard to do.\n\n\n----\n\n \n\n \n\n**Part 4**\n\nNow all the ADHD medicines change aspects of how the default mode networks and hopefully will promote a greater stabilization if you have ADHD.  That said they all work differently on how they achieve this stabilization and thus finding the_right ADHD medicine for you is trial and error.  You may find that some of your skills are improved in some way with working memory, attention, focus, mental flexibility, etc... but not in the way you actually need.  In other words not necessarily side effects but instead not the desired effects of the meds even if there is some good side.\n\n**Is this making sense to you?**\n\nEffectively how Strattera changes the Default Mode Network is different than Wellbutrin (though there is some similarities), and Wellbutrin is different than the ADHD Stimulants (though there is some similarities) and it is all about finding what you need.\n\n----\n\n \n\n \n\n**Part 5**\n\n\nAnyway, just wondering if this is normal and if this fuzziness should pass once I'm on it longer?\n\nWith you only being on these medicines for a week as the combination you need to give yourself more time.  Wellbutrin really starts working week 3 to week 6, even though it works a little faster than Strattera so you may see benefits prior to week 3 but understand these benefits are not necessarily what you will get at week 3 or week 6.  This is due to the med needing to build up in your blood and after awhile your body does some adjustments, plus you are now at a steady state of the drug where you get effectively the same dose of wellbutrin over a 24 hour period.\n\nAka you need to remember Wellbutrin is not a stimulant and you have different rules on whether when you should start making judgements is this med helping or not.\n\n----\n\n \n\n**Part 5b**\n\nI am about to link to a medical textbook which is a type of textbook called a prescriber[.] guide.  It is one of those things that teaches doctors the arts and nuances of each individual medicine for medicines may do a lot of similar things but also each med has its unique eccentricities / traits.\n\nNote since the textbook is something you buy this is only a free preview and is not even all of the stuff on Wellbutrin / Bupropion.  That said it is enough to give you a general idea\n\nhttp://stahlonline. cambridge. org/prescribers_drug. jsf?page=9781107675025c16. html. therapeutics&name=Bupropion&title=Therapeutics"}