{"doc_id": "204", "name": "2016_06_humanities_student_major_2004_intp", "namespace": "we1sv2.0", "metapath": "", "pub": "INTP", "title": "2016-06-humanities-student-major_2004_INTP.txt", "pub_date": "2016-06-28T00:00:00Z", "Sentiment": "0.16", "Subjectivity": "0.399", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "651", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4q97tv", "Reddit_id": "d4rju6m", "Subreddit_id": "t5_2qhvl", "Commenter": "grab_bag_2776", "length": "3744", "content_scrubbed": "The fact you're even raising the question means you'll probably end up going \"scholarly\" (although there[.] more overlap than the dichotomy admits). Fwiw, these days a lot students fool themselves into thinking particular majors automatically = $$$. Most workers change careers, let alone jobs, many times before retirement, and today[.] economy often makes yesterday[.] \"practical\" majors obsolete or dead ends career-wise. Plus, many of the truly stable jobs these days involve skilled trades (plumbing, electrical, etc.) that don't require college. \n\nThe problem with college these days is not specific majors but going into debt (which won't be a problem in your case). There[.] something to learn in every major, if you give a shit. And most of success in life, professional and personal, comes down to learning to give a shit. College is a crummy place for job training - that[.] not how it[.] set up or what it[.] for, despite all the hype - but it[.] a great place for learning to give a shit both about the things that interest you when you come in and those things you never knew about until you get there - that[.] what it[.] for. \n\nTo strike a balance between practical vs. scholarly, make a commitment to yourself to do the following, regardless of what major you pick (you can accomplish these things with any major, so you might as well pick something you find satisfying, which isn't necessarily the same as \"fun\" btw): \n\n* learn to write and use writing as a way to study and learn\n\n* get comfortable with public speaking, listening actively, and working in groups/collaboratively\n\n* make reading on your own a priority (not just what[.] assigned, and not just fiction, textbooks, or on line)\n\n* take some courses in statistics; maybe pick up a minor in it (most jobs depend on stats in some way, and most workers are pretty much ignorant or too scared to deal)\n\n* pay attention to the specific satisfactions you experience as you go about your business in college and daily life (activities that lead to the same satisfactions can happen in a variety of jobs/careers, whereas people who start with a major/career in mind absent actual experience often find later on all sorts of activities go with the job that no one mentioned and that they end up disliking)\n\n* during college reach out to people actually doing jobs that appeal to you, talk to them, observe them, maybe volunteer if you can (chances are you'll find most successful workers had a range of majors or other forms of job preparation)\n\n* study at least some subjects that *don't* appeal to you at first, and learn how to engage with them (guess what you end up doing in most jobs?)\n\n* push yourself academically (it[.] not that majors in humanities and social_sciences lack substance; it[.] that some students pick them because they want to skate by - that[.] a bad habit to develop)\n\n* regardless of what you study, think consciously (and be able to talk about) how each subject can help you *contribute* as a potential worker in a given job (your actual major matters less than how you can use what you learned to *help* your employer/co-workers, etc. - that[.] what you will emphasize eventually in your application materials and job interviews, not merely your major or gpa, etc.)\n\nAnd finally, don't get scared by the job market these days: yeah, it[.] challenging to find a good job, it takes time and patience, and you'll probably spend a while doing things you won't want to do forever. But fwiw, after decades of dealing with workers at all levels of the org chart, I still find pretty much the same proportion or more of lazy fuck-wits who can't/won't do the things listed above yet still have jobs. Whatever you choose about your education, don't end up one of them. "}