{"doc_id": "1980", "name": "2016_08_humanities_student_major_1288_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-08-humanities-student-major_1288_AskReddit.txt", "pub_date": "2016-08-18T00:00:00Z", "Sentiment": "0.004", "Subjectivity": "0.298", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "293", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6mkwcn", "Reddit_id": "d6mljt0", "Subreddit_id": "t5_2qh1i", "Commenter": "grammar_enima", "length": "1668", "content_scrubbed": "Even the B. A. you described is so exceedingly rare.\n\nI made up that degree. It was a joke made to give you an idea of how useless their degrees were without dropping any PII.\n\nThe issue is that in my (small) hometown there is a single private college populated mostly with professors with tenure who are basically hiding out in a small pond so nobody pressures them to publish. That particular college gets a lot of shit for exactly this problem. The only other college is a community/technical 2-year institution that offers AA and AS in technical fields that are always hiring in-town.\n\nAdding to the problem, the highschool I went to was this cakey college prep school that was full of teachers encouraging everyone to focus on arts and humanities and undermining any other path to success. \n\nThe problem is even worse when you understand that this town is not a town with academic jobs. All we are is a shipping hub that processes raw materials and assembles jets/wind turbines. I started a logistics company and a temp agency. My entire (un-incarcerated) class save myself and one other decided to: \n\n- get obscure BAs instead of AS and BSes\n\n- after graduating, stay in town instead of moving to a city\n\nEDIT: To be fair, I didn't move to a city either. But I probably would have if I was looking for jobs that needed an obscure humanities_major\n\nEDIT2: Also, despite me grousing about PII, I realize that the economic and educational situation is so incredibly specific, it[.] pretty much PII all by itself. Gonna call a mulligan on that.\n\nEDIT3: It[.] also probably worth pointing out that my class was 48 people. Again: cakey college prep school in small town."}