{"doc_id": "2009", "name": "2016_08_humanities_student_major_1594_askthe_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "AskThe_Donald", "title": "2016-08-humanities-student-major_1594_AskThe_Donald.txt", "pub_date": "2016-08-22T00:00:00Z", "Sentiment": "0.207", "Subjectivity": "0.464", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "254", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4z2eh9", "Reddit_id": "d6sa9er", "Subreddit_id": "t5_3fuwj", "Commenter": "The_Brutally_Honest", "length": "1439", "content_scrubbed": "I'd recommend AGAINST making enemies your freshman year. That doesn't mean you can't defend your ideals. You definitely should defend your ideals, but do it carefully.\n\nBe more of an educator rather than being combative. Accept that you won't be able to win everyone over. Be open to hearing them speak, but don't always expect to receive the same treatment back.\n\nPolitics is a very emotional topic that can get very heated very quickly. Don't pour too much fuel on the fire or else you'll get burned!\n\nIf you join a fraternity, most of the guys will be republican. Most of your teachers (except maybe business teachers) will be liberal. Most of the students will be liberal, but that[.] because they see things with rose colored glasses and think it[.] easy to fix things wrong with the world.\n\nJust stay away from the ridiculously religious, liberal_arts, hard_headed students. Those are the ones who not only can't think for themselves, but are also the ones that you're in a pointless conversation with.\n\nThe fun part though, is talking to all the older people trying to get students to come to their church, group, etc. They are trying to convince you and win you over, so ask them the challenging questions! Give them a run for their money while still being respectful. That[.] what I did and not only did I learn a lot by hearing opposing views, but it also made me a better person (I feel).\n\nSource: Graduated from University in 2014"}