{"doc_id": "1974", "name": "2016_08_humanities_student_major_1227_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2016-08-humanities-student-major_1227_ApplyingToCollege.txt", "pub_date": "2016-08-17T00:00:00Z", "Sentiment": "0.205", "Subjectivity": "0.347", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "437", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4y6wuq", "Reddit_id": "d6linc6", "Subreddit_id": "t5_2y2r8", "Commenter": "alexatd", "length": "2445", "content_scrubbed": "Are you based in the US or international? (sounds like your parents were international students?) That makes a big difference.\n\n1) You need to get a FIRM and REAL budget from your parents. How much will they contribute to your college education per year?\n\n2) If you are US-based, your income matters--if you are legit \"poor,\" you'll qualify for financial aid but fin-aid is a very complex thing that most people don't understand. High financial need does not equal free education. SOME schools will meet full need, but many do not. The answer to question #1 + your financial situation will determine how you build a school list. Once you have your parents' budget + your real financial details + your SAT score + home state, you can do another post here or on /r/ReverseChanceMe and people can help you with schools.\n\n3) If you are US-based, what[.] your home state? Here[.] hoping you live in a state where your state flagship is affordable/attainable/meets need (in some states, this is not the case)\n\n4) Plan on taking the SAT or ACT this fall. Pick one and start studying NOW. (my guess is SAT may be a better fit for you if you're at a liberal_arts heavy school. ACT tends to do well for people who are strong in science, in addition to critical reading/math). \n\n5) Good news is you have time! Focus on your grades this year: junior year is critical and if you can show a strong upward trend, especially in honors or AP classes, you might increase the \"caliber\" of school you can get into--some will give you credit for an upward trend/showing your academic potential.\n\n6) Keep doing the ECs you really care about... at this point, I would focus on depth, not breadth. \n\n7) Do you do anything CS-related in your spare time? (if so, you can find ways to put that on your app)\n\n8) Every school has a thing called an \"EFC\" calculator on their website: Expected Family Contribution calculator. You need your parents financial info, and it won't be accurate if they own their own business, but otherwise it[.] the best way to get a sense of whether you can afford schools.\n\n9) You'll need to think about recommendations--if you have good relationships with any teachers, continue to cultivate them. If none stand out, junior year is the year. You'll need two teachers to write recs for you and a stellar rec can sometimes make a difference.\n\nIt[.] not too late! In fact, now is the perfect time to think about this. And this sub is a great resource!"}