{"doc_id": "142", "name": "2016_06_humanities_student_major_1366_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2016-06-humanities-student-major_1366_AskAcademia.txt", "pub_date": "2016-06-20T00:00:00Z", "Sentiment": "0.044", "Subjectivity": "0.454", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "900", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4ovl5b", "Reddit_id": "d4gq8f3", "Subreddit_id": "t5_2sakj", "Commenter": "DunkeyKung", "length": "5386", "content_scrubbed": "This is not a complicated issue. You do your job correctly or you suffer professional and personal consequences. That knowledge should be more than enough to ensure you don't pursue these lines of thinking and actively discourage this sort of behavior in your students.\n\nI'm a 26 y/o university lecturer in the humanities, I'm a straight male, and I'm not a bad looking guy. Yet thinking about this stuff is not a problem for me because of two harsh practical considerations. Note that both of these are purely about *you* as a teacher through a lens of self-preservation. These don't consider the harm you would do to your students or the truckload of moral problems that accompany any student/teacher relationship.\n\n* By acting on a student[.] attraction to you, or vice versa, you compromise yourself. I'm not just talking about the possibility of disciplinary action either. Stuff like this can and *will* get around even if its just as whispers around the departmental water-cooler. If not on your end then it will be on the student[.]. Even if you don't end up getting actively penalized for this sort of relationship it will have repercussions for your standing with the administration and amongst your peers (who are often one and the same). I know of several instances of professors who have a reputation for sleeping with students that, while never fired outright, have been consistently passed over for promotion for decades. This is your job and you are expected to be professional in the same way millions of others are every day. There will be consequences to any sexual relationship with a student, even if you don't realize what they are. **Thus, if you value your career at all, there is no leeway to be had here: you simply cannot act on these feelings so there is no point dwelling on them.**\n\n* You are seeing your students in a very specific way that does not correspond to who they actually are. Mercuryglass [made a great comment](https://www. reddit. com/r/AskAcademia/comments/4ovl5b/how_do_attractive_young_professors_handle_longing/d4gk6mt) already about this. The age gap between you and your students, even if its only a few years, is a *profound* one in terms of your level of maturity, ability, and experience. They are not like you, and they would probably be terrible romantic partners for you and vice versa. The twenty year old girl with the big blue eyes and the clever thoughts on Jane Austen might seem appealing, but if you take her looks and classroom demeanour out of the equation and put some honest thought into the practical realities of a day-to-day romantic relationship between you and an undergraduate student I guarantee you she won't seem quite so attractive. In all probability you would have wildly different goals and be *terrible* for each other.\n\nSo, setting aside any moral objections (and holy crap, are there a **lot** of those), a relationship with a student *will* have a negative consequence to your career and is *likely* to hurt you on a personal level too. If you internalize this then you will realize these feelings are not even worth considering, and the less consideration you give them the more they should subside.\n\nHardline position on this aside, there is a lot you can do as a teacher to ensure your students don't violate the space you require to maintain your professional attitude. You should never feel like you are constantly besieged by students trying to initiate a romantic encounter. My biggest piece of practical advice to offer: **Your teaching style or demeanour might be too intimate if students are blatantly demonstrating their attraction to you, or you constantly feel the temptation to act on your own attraction.**\n\nMy speciality is in erotic novels and pornography of the Eighteenth Century, and consequently I *talk* about some very intimate themes with my students all the time. But I'm very careful to ensure the way I *teach* those subjects is highly professional. This is an important distinction to be made, especially within the humanities. I do not fraternize with my students outside of the classroom and office hours, I never present intimate personal anecdotes about myself, I never physically interact with my students beyond a handshake, and I offer only surface-level personal details in any small talk that might occur in office hours. Don't be a afraid to spell this out for students who want to be your friend or make an obvious pass. I have had students ask for my cell number or try to arrange to meet in casual settings and I've had to politely but firmly tell them why these things can't happen. Note that this doesn't mean I can't have a warm and friendly demeanour in the classroom, it just means that beneath that demeanour there are some hard lines that do **not** get crossed.\n\nThis might seem like you're putting up walls with your students, especially if you naturally lean towards a more intimate teaching style, but it is important to maintain a professional distance, *especially* as a young teacher. \n\nIntroducing and maintaining some distance between you and your students will ensure you're taken seriously in the classroom and should help to curtail any fanciful romantic notions going in either direction. Remember that this is what a lot of young female TA[.] and lecturers have to do just to be taken seriously and avoid the stuff you seem to ruminating over.\n\n"}