{"doc_id": "1942", "name": "2016_08_humanities_student_major_946_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2016-08-humanities-student-major_946_changemyview.txt", "pub_date": "2016-08-14T00:00:00Z", "Sentiment": "0.054", "Subjectivity": "0.211", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "490", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4xoc7j", "Reddit_id": "d6h8a4y", "Subreddit_id": "t5_2w2s8", "Commenter": "Bippzy", "length": "2983", "content_scrubbed": "As a future music educator, I'm tempted to just agree with you.\n\n\n\nBut, schools have a distinct role as the second parents of students. I say this in the sense that the people who kids grow up to be are shaped by their school and community.\n\n All of the classics throughout the Western Canon provide plenty of grey area situations to discuss in class, and portray worlds, moralities, and world views that students couldn't possibly have at their age in our society. If teaching is done well, this is communicated and learning occurs in the form of a widened perspective for students.\n\nThis \"widened perspective\" that liberal_arts/Jeffersonian proponents argue for can also be viewed as indoctrination. It is no secret that the deep ethnic values immigrants try to pass on to their children fade out in one or two generations of living in America and going through our public schooling. While science can run into this problem sometimes too(evolution and the galapagos islands can mess up creationist teachings pretty bad), literature class is one of the biggest offenders of getting students and their social values on the same page. I know this example doesn't argue my point logically, but it takes quite the teacher to enable people to have differing viewpoints from the majority and actually be considered. I know this to be true from limited teaching experience and my own schooling,\n\n\nLike literature, music nearly always has a subject. The largest body of good choral music tends to be christian, and as a result public schools perform Christian works at their concert in a much greater proportion. Essentially, there is a hidden curriculum(whether intentional or not) of Christian art and it[.] teachings. Luckily, music is not mandatory for students.\n\n\nLiterature and study of it is mandatory, for essentially every year of high school and all the schooling before it. Once kids can read and understand things at an acceptable level(make the acceptable level college level or something), why not let kids opt out of studying literature? Rather than force kids through a marathon of reading and understanding some selection of books, why not use them as a tool to get them where we want reading/understanding to be, and then take the college approach of letting students pick?\n\n\nBarring underprivileged schools, many students are where a public school education would want them to be as early as freshman or sophomore year. Why are they still in english classes then? Let[.] let them pick. \n\n\nMy argument is that studying literature should remain a major part of public education, but it needs to drop off in High school for those that don't need it and become an elective. It has clear benefits in reading, comprehension, and critical thinking. However, the downside of developing those skills is indoctrinating students to some extent. Therefore, studying literature needs to stop being mandatory for every year of school(high school years being the suggested stopping point)"}