{"doc_id": "1977", "name": "2016_08_humanities_student_major_1265_physicsstudents", "namespace": "we1sv2.0", "metapath": "", "pub": "PhysicsStudents", "title": "2016-08-humanities-student-major_1265_PhysicsStudents.txt", "pub_date": "2016-08-17T00:00:00Z", "Sentiment": "0.175", "Subjectivity": "0.422", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "434", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4y8ao0", "Reddit_id": "d6m2vty", "Subreddit_id": "t5_2wo7k", "Commenter": "kramer314", "length": "2663", "content_scrubbed": "First, congrats on getting into UW!\n\n How much more intensive is a program at a large university compared to a community college?\n\nIt depends on the community college, but state schools (and most private liberal_arts colleges that offer physics degrees) are more likely to have pretty significantly more rigorous entry-level math and physics courses than community colleges. This is certainly the case at the school (large state research university) I'm at right now compared to the community colleges in my region. There are a variety of potential reasons for this, but I think the few largest ones are departmental heritage, a larger number of dedicated STEM majors, and many more STEM undergraduate and post-graduate degree programs. It[.] not that the students at state universities are better students or individual teachers are better teachers, but my experience teaching STEM undergraduates is that a decent number of community college STEM programs don't seem to give their students the best preparation for upper-level undergraduate coursework, which would explain a GPA drop. That said, many of the community college STEM transfer students I've worked with seem to be better students overall than the average undergraduate student\n\n What is the average number of hours a full time physics student spends on homework at University to pull A[.]?\n\nDepends a lot on the class and style of homework. I think I averaged something like 4-5ish hours per class per week for my homework for my math and physics undergrad classes, although some of my upper-level courses took a lot more effort than that. From what I can tell, the undergrads at my current university have similar workloads. However, everyone[.] study habits are different, some people take longer to grasp concepts than others, etc. so things could vary for you.\n\n The student panel said that most of them receive about 5 hours of sleep per night on average.\n\nAs someone who procrastinated like crazy throughout all of undergrad, I think a pretty large majority of undergrad students who claim they don't have time to get everything done or enough time to get enough sleep simply aren't managing their time well, with a small minority who have truly over-committed themselves or who are taking classes that they frankly shouldn't be in. Even with massive procrastination, I somehow managed to get good grades in undergrad while doing research and having a part_time job that that involved traveling across the country on most weekends as well as various commitments throughout the week. I definitely didn't live a balanced lifestyle in undergrad, but it certainly should be possible for you to do so."}