{"doc_id": "1876", "name": "2016_08_humanities_student_major_358_intp", "namespace": "we1sv2.0", "metapath": "", "pub": "INTP", "title": "2016-08-humanities-student-major_358_INTP.txt", "pub_date": "2016-08-06T00:00:00Z", "Sentiment": "0.092", "Subjectivity": "0.323", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "354", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4weryn", "Reddit_id": "d66j3ah", "Subreddit_id": "t5_2qhvl", "Commenter": "Nate_Draws", "length": "2150", "content_scrubbed": "I'd imagine an MMORPG with 16 nations each based on the 16 MBTI types. Each nation has its own unique culture, environment, and element. You start out in the nation of your type, but you can travel to more nations as the game progresses.\n\nThe world:\n\n**The NT Tundra:** A continent dominated by tundra and forests, the majority of the land has a chilly climate, but the southern areas are known to be quite warm in the summer. Science and technology dominates these lands. NT characters gain a bonus towards intelligence.\n\n* INTP nation (Poison): A nation thriving on major breakthroughs in research and new inventions once every week. Things advance without planning. They have every idea imaginable, except not all ideas end up being used for their projects... yet. This nation is also known to be heavily populated by cats who can apparently shape-shift into humans.\n\n* ENTP nation (Electricity): The buildings and houses in this nation are... quite interestingly shaped. Some structures appear to be floating? Like the INTP nation, the ENTP nation is also highly developed, and excels in research and inventing new technology. Recent minor tensions prompted the ENTP nation to invade the INTP nation, but the INTPs were too busy in their thoughts to care.\n\n**The NF Woodlands:** A continent diverse in climate, the woodlands contains every type of flora and fauna imaginable not limited to unicorns, dragons, and new species of animals discovered at every minute. Wars are rare in these lands due to the peaceful nature of the people -- unless, you somehow anger them. In that case, there would be passive-aggressive warfare. NF characters gain a bonus towards magic.\n\n* INFP nation (Arcane): A nation diverse in what is socially accepted from different lifestyles to different religions. Nobody is shallow, and people don't have to hide from being a unique individual. The arts from philosophy to literature thrive in these lands. People take care of each other to genuinely make each other feel better. Animals freely roam the streets.\n\nThe SP characters would gain a bonus towards strength, while the SJ characters would gain a bonus in health. "}