{"doc_id": "21", "name": "2016_06_humanities_student_major_211_catholicism", "namespace": "we1sv2.0", "metapath": "", "pub": "Catholicism", "title": "2016-06-humanities-student-major_211_Catholicism.txt", "pub_date": "2016-06-02T00:00:00Z", "Sentiment": "-0.002", "Subjectivity": "0.309", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "564", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4m7pf4", "Reddit_id": "d3tpyym", "Subreddit_id": "t5_2qi4f", "Commenter": "dwolfy", "length": "3042", "content_scrubbed": "BECAUSE ITS NOT ABOUT YOU! I think the thing that drives me nuts about the majority of religious and ideologists (i love religion, born raised catholic, and still consider the church my home so dont worry i didnt stumble in here from /r/atheism) is their complete lack of understanding of art and culture and how it works. The reason it drives me nuts is because some of the best art to ever grace human history came from the church! I mean even today, Veggie Tales is DOPER THAN SOAP ON A ROPE.\n\nHowever, the absolute ignorance and entitlement to own and have your own specially catered piece of culture that makes you feel good is the most ignorant stance I have ever seen. The church paid those artists for those hymns and murals, they funded them and gave to the arts to get back art.\n\nIts not that hard, art is a mirror to society, a reflection of culture and society. That is its role and function in society. Of course there is art that doesnt fulfill that but that function is what makes art VALUABLE. so, if you're looking into that mirror and dont like what you see do you change the mirror or change who[.] looking into it?\n\nIt just angers me so much people think they can guilt trip and bully people into changing their gift, their vision, the thing they wanted to see in the mirror because they're too lazy to do something about it.\n\nYou wanna know why movies get made, and yes even \"Hollywood\" movies? Its because somebody saw this gap or this hole in art, they saw a truth going largely unnoticed or ignored and instead of whining about how culture was attacking them they picked up a guitar, paint brush, even wrote a program so that the world would be the place they wanted to see. They took the time to learn how to put their idea in the world and then they did it.\n\nTalent is just a word the lazy like to use so they don't have to admit they didn't put the time into it. Its not your movie. Its not your hollywood. Its not your music or video game. Somebody starved, sank themselves into debt, pulled all nighters for years, skipped school dances and sometimes meals, spent their weekends studying the craft and went through years and sometimes decades of tribulations to be able to write that script, or album, or code that video game. They worked hard and sunk money and time and then marketed and sold their skill ALL BY THEMSELVES before the creative industry or even a single fan outside their friend group would look at them. Its the price of entry into those fields. they worked so hard on and sacrificed everything for, just so they could make their movie or write their book. \n\nIf you think art and culture is not reflecting the part of society you think is going unnoticed or intentionally ignored it is not your right to have someone make it for you. You can learn anything you want FOR FREE with google and youtube. If you don't believe me tell me what you want to make and i'll personally link you tutorials and free open source software to put it together. Stop being a bum and make the change you want to see."}