{"doc_id": "1945", "name": "2016_08_humanities_student_major_992_ucsd", "namespace": "we1sv2.0", "metapath": "", "pub": "UCSD", "title": "2016-08-humanities-student-major_992_UCSD.txt", "pub_date": "2016-08-15T00:00:00Z", "Sentiment": "-0.001", "Subjectivity": "0.461", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "378", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6i1ca6", "Reddit_id": "d6i2oki", "Subreddit_id": "t5_2r6sq", "Commenter": "the1spaceman", "length": "2117", "content_scrubbed": "Look at my previous comment. Note that\n\n\\women can have their own group,\n\n\\black people can have their own group,\n\n\\Muslims can have their own group,\n\n\\LGBT can have their own group,\n\n\\Hispanics can have their own group,\n\nand it[.] all celebrated. And other people can join their groups also. But the moment a FUCKING WHITE PERSON decides to have their own group, and let others join, suddenly it[.] problematic and racist. Why is that? Also, how exactly does the following work? It[.] basically what humanities teaches these days.\n\nI'm proud to be black\n\nsaid the black man.\n\nI'm proud to be Asian,\n\nsaid the Asian man.\n\nI'm proud to be a woman\n\nsaid the woman.\n\nI'm proud to be white\n\nsaid the racist.\n\n \n\nThe club is literally for white people who are tired of not being racist. That[.] what it says on the flier\n\nCan you into reading comprehension? It[.] not \"I'm tired of being not racist, let[.] go oppress some minorities\" it[.] \"every humanities class I take says I'm personally to blame for every problem in society because of my skin color. Mass media blames everyone born like me for all evils, and minorities are all perfect angels who didn't do anything wrong ever according to them. I'm sick of it.\"\n\nTo help you understand this concept, try flipping the situation. Imagine I'm a black man in a majority black country. I take a humanities class, and the white professor tells me my people are responsible for every evil in society. How do you think I would feel?\n\nThen, if I try to bring up some of the bad things (e. g.) Asians did, I am told it was because of \"colonialist oppression\" or whatever and the Asians were pressured into doing it because of the \"evil black man\". Then I see women, whites, Asians, Muslims, etc all getting their own clubs. I try to start one up for my fellow black men who are sick of being blamed for everything, but I'm told it[.] racist to do that. How would I feel about that, as a black man?\n\n \n\nTL;DR If you blame white people for everything wrong in society, especially things they didn't do, don't be surprised when groups like the alt-right become popular."}