{"doc_id": "1966", "name": "2016_08_humanities_student_major_1166_femradebates", "namespace": "we1sv2.0", "metapath": "", "pub": "FeMRADebates", "title": "2016-08-humanities-student-major_1166_FeMRADebates.txt", "pub_date": "2016-08-16T00:00:00Z", "Sentiment": "0.043", "Subjectivity": "0.282", "Score": "28", "Upvotes": "28", "Downvotes": "0", "Wordcount": "1638", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4y2aey", "Reddit_id": "d6kmxpd", "Subreddit_id": "t5_2y44v", "Commenter": "MrPoochPants", "length": "9964", "content_scrubbed": "Ya know, I hadn't read the article first... and now... uhg... so here we go!\n\nMen feel they are losing control within their homes, communities and nations. They are the unloved, unwanted, sad underclass. None of this is true – except perhaps the sad bit.\n\nSo, no argument to say why men feeling that way isn't valid? Oh, but wait, there[.] another sentence. Surely there[.] something to address this statement of irrefutable fact...\n\nCountless western males are indeed suffering from internal traumas that remain unarticulated. Tragically, too many become drink or drug addicts or commit suicide.\n\n...\n\nYou know, its like people lack self-awareness.\n\nBut many more seem to be avenging themselves on females.\n\nYes, because a single case of domestic abuse clearly trumps someone completely ending their life. Yea, can't abuse someone, including yourself, if you're fuckin' dead.\n\nTory Philip Davies, MP for Shipley, recently attacked \"feminist zealots\" and claimed the courts favoured women while at an international conference organised by the hideously sexist Justice for Men and Boys (J4MB).\n\nStep one: point to your enemy. Step two: Tar away, Meryl, Tar away.\n\nHe has consistently voted against equality legislation and wants to repeal the Sex Discrimination Act of 2002. Poor Mr Davies. He must look back enviously at the Stone Age when real, hairy, hunter-gatherer men were well served by submissive females and the natural order prevailed.\n\nStrawman and insulting generalization about his views, which are almost certainly not accurate.\n\nBack in the real world, trolls relentlessly punish women and girls who are seen and heard in public.\n\nYet men die more and are the prime victims of violence almost across the board. Yea, those poor women. (And, to be clear here, yes, ALSO those poor women because that does still suck, but... uhg, this fuckin' article)\n\nIn the last decade violent crime has fallen, yet violence against women has risen. This is according to professor Sylvia Walby of Lancaster University, who **analysed and challenged official figures earlier this year.**\n\nLook at this analysis done by one professor! Maybe she[.] right, but stating that violent crime has fallen, yet violence against women has risen, as a fact, when also contradicted by official figures?\n\nA-G-E-N-D-A!\n\nWomen[.] organizations warn there is a resurgence of sexism including hard and violent porn\n\n[Hey, you know what hasn't actually contributed to sexism? Porn.](http://www. feministcurrent. com/2015/09/22/new-study-says-porn-users-have-egalitarian-attitudes-so-what/) Oh, and that[.] an article by 'Feminist Current' by the way.\n\nharassment, discrimination, rape, assault and murder.\n\nAlarm! Alarm! Fear! Be scared! The world is out to get you! Er, wait, I mean men... men are out to get you, and not just out to get you some ice cream (yay ice cream! :D).\n\nUp to two women per week in the UK are killed by a partner or ex-partner.\n\n[But why approach a topic like domestic violence deaths with any nuance when you have an agenda?](http://www. washingtoncitypaper. com/columns/the-sexist/blog/13118670/why-do-so-many-men-die-as-a-result-of-domestic-violence)\n\nThese deaths are barely reported.\n\nReally? Because I feel like they're nearly the only ones we ever talk about. I mean, most of us don't ever talk about deaths that occur in a car accident or due to substance abuse. But women dying to men in domestic violence situations, and ONLY women, now THAT'S a special case of being 'barely' reported... versus not reported at all, and in some cases completely swept under the rug.... Like men and THIS article! (*finger point!* *finger point!* *finger point!*)\n\nAva Freebody from Sussex, who stayed with her cruel husband for 27 years before finally escaping, thinks we should call the abuse 'domestic terrorism', which is exactly what it is.\n\nYes, let us please water down more words. Yes, terrorism will now also mean going to the grocery store and the store being out of plastic bags. Fuckin' grocery store terrorists withholding and making me use paper!!\n\nAdd to this benefits cuts that disproportionately affect females, along with the closure of refuges and women[.] centers, and you get the grim picture.\n\nOh, you mean like all those male-specific benefits, like getting preferential loans to start a small business, that women get?\n\nOh fuckin' hell, its like they have no idea what they're talking about.\n\nOh noes! A *women[.]* center closed! Where ever will the all those men go n... oh... right, there[.] no men[.] shelters at all - save for like... one. (And, yes, closing down women[.] shelters does suck, sure, but we also don't know why. Maybe because its sexist?)\n\nThat picture gets grimmer when you turn your gaze on many Asian, African and Arab countries and some minority communities in the West.\n\nUhh... yea... so go over there and bitch and whine. Like, seriously, its needed over there. I'm with you on that one. I will happily pay for your plane ticket.\n\nNo, scratch that, I don't want your inevitable stoning on my conscience.\n\nIn the 60s leaders of post-colonial nations pushed women[.] rights, banning backward practices such as child marriages, female genital mutilation and veiling. They have all returned with a vengeance. Go read The War on Women, by BBC reporter Sue Lloyd-Roberts, and weep.\n\nNot. The. West.\n\nLike, its not even hard to point out ways in which EVERYONE, but maybe the wealthy, is getting fucked over in countries that AREN'T THE WEST.\n\nThe late Lloyd Roberts, a dear friend, was fearless and morally driven. She wrote the book while in hospital undergoing treatment for cancer.\n\nOk, well... was the book of any value? I mean, its a bummer that she, apparently, died of cancer, but I don't see how we're going to turn fuckin' *cancer* into some sort of gendered abuse too.\n\nBut hey, we have a female PM don't we? And so many women in cabinet? And Hillary may become the first president of the USA. In business more women are at the top than ever before. Girls are doing brilliantly in higher education. Aid agencies now focus on mothers and their children and that is leading to societal shifts.\n\nUhhh... yea. Yea, those are important wins for women.\n\nI mean, if you just don't give a shit about boys in school, or men in general, then yea, all those things aren't really worth a shit, but... you know, I kinda do so... women doing well in school strikes me as a win for women and something we now also need to address for boys.\n\nBut look closely.\n\nOk, I'll go get my glasses.\n\nOur cabinet still has a majority of men.\n\nAnd? Having mostly men in the cabinet doesn't automatically mean they just make all the rules to specifically fuck over women. In fact, because of the wide spread of feminism, they have less incentive, but no such incentive to not fuck over men - oh, look! No paternity leave? Men suck 'cause that wage gap though, amirite?!\n\nLabour has not selected a single women to stand for mayor.\n\nThose sexist pigs, not electing someone based upon gender. Er... wait... fuck.\n\nDonald Trump is a hero to millions.\n\nYea, because he speaks to the disenfranchised. People want him in office because hes NOT a career politician. They have this, false, idea that he might actually be a good candidate because of the ways in which he[.] NOT a normal politician - like having tact, or shutting his damn mouth.\n\nSuccessful women endure misogyny every single day, from colleagues, constituents, the press and, at times, their own male partners.\n\nYea, but men can't endure misandry, because misandry isn't real, because we redefine sexism as we so choose to exclude men as victims.\n\nFive such women I know from the arts, science and business have divorced their husbands because living with them became unbearable.\n\nMaybe they should have killed their husbands and evened out those domestic violence stats.\n\nOh, and how much are they getting in alimony and/or how much did they get of their husbands money versus their own? Child custody? I'm betting more than half ended up on the positive side of things with their decision.\n\n'When I was just a small-time academic, he loved me. Then I became a professor, had books published, got on to the media. He was also an academic, but was not promoted. He stopped talking to me, badmouthed me to the kids and forced himself on me. The night before I threw him out, he raped me. We were best friends, he was a feminist – until words turned to action.'\n\nYea, look at this one completely unverifiable and one-sided story of how horrible this one guy is because he couldn't BEAR to have a more successful partner. The woman, though, she couldn't have possibly done anything - totally innocent. \\#WomenAreWonderful\n\nShe encapsulates all the complexities of where we are now. There is no point in denying that globally, women and girls are more confident and ambitious than ever before.\n\nAnd yet they're constantly upset about what people say about them on the fuckin' internet?\n\nThey are breaking through various barriers.\n\nGood!\n\nDiscrimination continues to block them, but this is often overcome.\n\nCitation needed. Prove, first, that they're even being discriminated against, and even if so, that said reason isn't valid.\n\nMen of all classes, in contrast, are going through various crises of manhood and relationships, experiencing feelings of disempowerment. Millions of them blame feminism for their pain and **want to hurt females.**\n\nI just love how they bunch all this together. They basically equated men who feel disenfranchised as woman beaters.\n\nSexist-ass dribble.\n\nOne chap used to send me abusive racist and sexist emails every single day.\n\nBLOCK HIM.\n\nFeminists are faced with an unprecedented challenge.\n\nLike narrative crafting against ever increasing evidence to the contrary.\n\nThis sex war is different from previous ones.\n\nBecause now we can't just tell the truth.\n\nWithout that, neither men not women can flourish in this tumultuous age.\n\nThey want men to flourish? Really? No."}