{"doc_id": "1882", "name": "2016_08_humanities_student_major_391_britishsuccess", "namespace": "we1sv2.0", "metapath": "", "pub": "BritishSuccess", "title": "2016-08-humanities-student-major_391_BritishSuccess.txt", "pub_date": "2016-08-06T00:00:00Z", "Sentiment": "0.086", "Subjectivity": "0.309", "Score": "36", "Upvotes": "36", "Downvotes": "0", "Wordcount": "298", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d66wuvx", "Reddit_id": "d6761ci", "Subreddit_id": "t5_2vlyo", "Commenter": "youandmeandyouandyou", "length": "1631", "content_scrubbed": "\"much else on the BBC\" - so you do watch some of it? And I would imagine you use the BBC News site and listen to BBC radio every now and then?\n\nSo your main complaint is cost - £12/mo per household is too much? Do you have Sky, or Netflix, or Spotify, or any of those services that charge similar amounts or in Sky[.] case triple or more.\n\nThe BBC does a lot more for the UK than just provide entertainment - they make world-beating unbiased news content and essentially part-fund various parts of the arts.\n\nYou'd be amazed how many of the news stories you read elsewhere start from BBC investigations and worldwide network of reporters.\n\nSimilarly, the UK punching way above its weight in music is very much helped by the Beeb. The new music shows on Radio 1 and 6 Music give a huge swathe if bands and artists their first major break.\n\nAnd who would do the public broadcasting of Parliament and things like that to keep our democracy in check? A public broadcaster is in the national benefit.\n\nIt is essentially a tax, and I know that makes it unpopular with some - but it provides a massive amount of services for that fee.\n\nAnd adding to something like income tax would be very shitty, as it would mean that it would come under direct government influence - so constantly reorganised and fiddled with by politicians. It would be the end of the impartiality and actually investing in expensive long_term things like new technologies (hello iPlayer) or new music.\n\nI say all this as someone that runs a company that competes directly with the BBC, which is very hard as they don't have the commercial side of things to deal with."}