{"doc_id": "1862", "name": "2016_08_humanities_student_major_244_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2016-08-humanities-student-major_244_ApplyingToCollege.txt", "pub_date": "2016-08-04T00:00:00Z", "Sentiment": "0.216", "Subjectivity": "0.329", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "467", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4w44is", "Reddit_id": "d646920", "Subreddit_id": "t5_2y2r8", "Commenter": "alexatd", "length": "2617", "content_scrubbed": "Go to the school that[.] ranked highly for journalism, 100%. Most of the top JO programs are at very good schools, so you won't suffer in the event you decide to change. What[.] on your list? This would be my list:\n\nMizzou\n\nSyracuse\n\nNorthwestern\n\nBU\n\nUMD\n\nUSC\n\nEmerson\n\nFWIW, I went to BU for Magazine Journalism and have ZERO REGRETS. (I didn't change my major, but if I had, BU is top notch for most disciplines, as I'd say most of the schools on this list are--the only one that might limit you if you decide not to do anything related to media is Emerson) And I'm not even a journalist! I ended up in TV marketing, but I use elements of my degree all the time--plus that[.] the point of a broad liberal_arts education; I picked up other pieces via my non-major course requirements (and my minor; German) that have been useful to me post college in all sorts of interesting ways. If you really want a practical journalism education, a well-regarded JO school is the way to go, IMO.\n\nBut I'll also contradict myself: you can also go to any of the super elites and end up in journalism, due in large part to their strong alumni networks/reputations, as well as a few other factors. It wasn't what I wanted--I wanted the \"vocational,\" hands-on education--but I know plenty of successful journalists from Harvard, UPenn, Yale, etc... if you CAN get into those and you actually want to attend, you'll be fine. \n\nTechnically you can also go to any non-super elite that doesn't have a ranked journalism program and end up in journalism, it'll just be a lot harder. If you're not going to an Ivy or other top 30 school, at that point, I'd go with the highest ranked journalism program you can get into over another school that doesn't have a journalism program or major--so much of breaking into journalism is networking and where you go to school does matter. \n\nThe person who said go to the highest ranked school, period, isn't 100% correct: while going to an overall top ranked school CAN be a boon to getting a good JO gig (see: attending an Ivy League, any Ivy League; they all have well-placed alumni in media), in journalism specifically, having attended a highly regarded program can matter more than going to a top 15 school. In the industry, you'll get WAY more credit having attended Mizzou or Syracuse or BU than having attended Duke or JHU, etc. You'll still get the \"great school\" nod, but if someone wants a guarantee of hiring a well-trained journalist, they'll give more credit to the person who graduated from the well-regarded JO program. So if you really think it[.] journalism for you, bear that in mind."}