{"doc_id": "1851", "name": "2016_08_humanities_student_major_131_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-08-humanities-student-major_131_AskReddit.txt", "pub_date": "2016-08-02T00:00:00Z", "Sentiment": "0.006", "Subjectivity": "0.464", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "392", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d61mo41", "Reddit_id": "d61p32o", "Subreddit_id": "t5_2qh1i", "Commenter": "celkali", "length": "2010", "content_scrubbed": "It means that I thought having a job, even part_time, would not let me have enough time in a day (or week) to do school work, and not allow me to focus on getting good grades.\n\nTurns out it didn't make a difference, because I dropped out anyways, due to bad grades and not keeping up on school work.\n\nI'm in way more debt than I should be because of a second loan I took out to pay for an apartment in the city to go to school. When, if I had just grown up and gotten a job, I'd have been able to pay rent and only worry about the one student loan.\n\nThe job would have also given me more self discipline and motivate me to keep working at school, instead of slacking off, playing video games, watching movies (I called it research), and doing other things besides school work, because I 'had nothing else to do'.\n\nI've only learned this after getting a 25-30/h a week job. I'm much more productive when I have more things going on. But I hate my job, despise it, and because of the horrible work environment I have, I'm now joining the military so I 1) don't have to work in a job like the one I have now, ever again, and 2) to pay off loans.\n\nIt sucks when your motivation to join the military isn't to [.]erve your country', but to pay off loans you should never have had in the first place. But at least now I'm finally getting a full time (and lifetime, in or out) career out of it. And my college credits bumped me up a rank.\n\nAlso, I went to school for screenwriting. That was another mistake. Don't go to school for the arts. Get a degree in something you know will give you a job with a guaranteed monthly paycheck (such as a nurse, or a welder), and when you're living comfortably, *then* go to school for whatever your dream is; and pay cash for your classes. Dreams shouldn't be your first and only stop in a career goal, and I resent anyone who tells their kid they can grow up to be whatever they want. That may be true, but having a dream and actually working for it are two very different things."}