{"doc_id": "1975", "name": "2016_08_humanities_student_major_1234_casualiama", "namespace": "we1sv2.0", "metapath": "", "pub": "casualiama", "title": "2016-08-humanities-student-major_1234_casualiama.txt", "pub_date": "2016-08-17T00:00:00Z", "Sentiment": "0.032", "Subjectivity": "0.296", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "422", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6l17xt", "Reddit_id": "d6lltbw", "Subreddit_id": "t5_2sxwp", "Commenter": "coffeeandsolitude", "length": "2281", "content_scrubbed": "Too many to name but here[.] two that kind of give you the gist -\n\nMinor Rebelling Act: They'd heavily dictate my clothing choices when I was a teen. In my dad[.] eyes, even [this](http://www. orvis. co. uk/orvis_assets/prodimg/1T3R3LVblu. jpg) would be categorized as inappropriate for me to wear. I was often expected to wear a jacket and this would be living hell during the summer because I'd sweat so much under all these appropriate layers of clothing. At one point, I secretly started buying myself short skirts and transparent shirts and I'd hide them in my backpack. So I'd leave the house all covered up, go to the mall, and then change into the more exposed apparel in the bathroom and go about my day.\n\nMajor Rebelling Act: My parents almost forced me into a degree/job/life I hated. Dad wanted me to get a degree in science and become an engineer or doctor like a lot of people in our family. Mom expected me to take part in an arranged marriage in my early 20s and have kids a few years later. I fought with them for 3-4 years because I wanted a degree in an Artsy Humanities subject, didn't want to get married (and DEFINITELY not an arranged one at that) or have kids. As if that didn't piss them off enough, I also expressed my desire to study abroad since many India colleges don't offer high end, well developed art courses like they do for science. They flat out refused and said I'm out of control and there[.] no way they'd let my 18 year old self out of the area code, let alone out of the continent. I'm surprised when I look back on my own persistence at this point because I really felt like the life I wanted was just inches away from my fingertips, so I just had these weekly arguments with my family until my dad compromised and said \"Okay. You want this really bad, so earn it. Get a first class mark in your finals and raise your overall grade to an A+. Get a scholarship offer to help fund your dreams. Do this, and I'll know that you really want this and you've really earned this, and I'll support you with your decision...\" And I don't know how but I did it. I got that 99/100 in my finals, I won that scholarship, I set off and studied at one of my dream universities. Dad[.] totally come around now and he[.] super glad to see me living independently.\n\n"}