{"doc_id": "203", "name": "2016_06_humanities_student_major_1998_politicaldiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "PoliticalDiscussion", "title": "2016-06-humanities-student-major_1998_PoliticalDiscussion.txt", "pub_date": "2016-06-28T00:00:00Z", "Sentiment": "0.105", "Subjectivity": "0.376", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "227", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4rfoxj", "Reddit_id": "d4rgqlk", "Subreddit_id": "t5_2sfmf", "Commenter": "xdrtb", "length": "1424", "content_scrubbed": " I don't really know the demographics of startup founders, but I usually think engineers\n\nWell there are many degree fields that can go into a start up.  Designers, marketing, financial, engineers, and any combination of degree fields could fill any of those roles (i. e. you don't need to be an engineer major to know how to code or a marketing major to know how to market).\n\n a job that generally doesn't require huge student loans\n\nExplain how an engineer doesn't require 'huge student loans' while, say, a humanities degree does require 'huge student loans'?  Assume they are at the same university and from the same economic background.\n\n a job that generally can pay them off quickly\n\nIf they get a steady salaried position, not a start up without guarantee of 'high pay' or any pay during the start up period.  And even still, depending on area, that doesn't necessarily guarantee they can 'pay them off quickly'.\n\n To me this seems about as useful as offering debt forgiveness to hedge fund managers.\n\nDepending on the source, [93% of startups will fail in the first 3 years](https://s3. amazonaws. com/startupcompass-public/StartupGenomeReport2_Why_Startups_Fail_v2. pdf) which means that 90% of startup founders wouldn't get to use the first layer of debt forgiveness.  Seems like an extremely risky strategy to look for loan forgiveness, especially given the other forms of debt one can take on founding a startup.  \n"}