{"doc_id": "175", "name": "2016_06_humanities_student_major_1672_worldnews", "namespace": "we1sv2.0", "metapath": "", "pub": "worldnews", "title": "2016-06-humanities-student-major_1672_worldnews.txt", "pub_date": "2016-06-23T00:00:00Z", "Sentiment": "0.083", "Subjectivity": "0.276", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "596", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4loi3s", "Reddit_id": "d4lozqy", "Subreddit_id": "t5_2qh13", "Commenter": "Fiendish_Doctor_Woo", "length": "3360", "content_scrubbed": " There are literally endless stories about automation replacing jobs\n\nAnd a dearth of them with actual statistics showing job losses.  \n\nOh, and I have dealt with automation, given I built my consultancy on providing devops automation frameworks.  Which coincidentally just lets the existing sysadmins get better productivity and increase their pay as a result.  \n\nBut go on.\n\nOh look, a bunch of speculative articles about what *might* happen.\n\n But I'm sure those 60,000 jobs in china that disappeared overnight certainly isn't an indication of what[.] to come here.\n\nNo, it isn't.  Because those were low skilled tasks.  You might as well have gone back to the early 2000s for some articles, where chinese factories were laying off workers who physically moved refrigerators along an assembly line -- because paying a peasant to move a box up to that point was cheaper than adding an actual conveyer belt.  **dear god, the conveyor belts will take all our jobs**.  \n\nIn reality that freed those men to move up to actually working on the assembly line - e. g. upgrade their skills, upgrade their pay.  This latest change is no different.\n\nGive me a call when you have an AI that can pick a part out of a parts bin successfully.  Amazon[.] spent over a billion trying to get around that one.  Let alone drive a truck through a city, build a house, treat a patient, or even act as a bookkeeper.  Automation[.] great for tasks.  But jobs aren't just isolated tasks.  \n\n You're right the roughly 8 million American[.] without a job all just need to innovate their way to greatness.\n\nAll because the fucking robots.  That don't exist yet.\n\nAnd yes.  Maybe they need to move to where work is, or realize that what they're doing isn't succeeding for them.  Or accept that their precious liberal_arts degree didn't actually give them the ticket to riches they thought, swallow their pride and start an entry level gig at something that might.  \n\n 16K when you started your career was ~2. 5 times minimum wage. \n\nA little less than twice ($8/hour vs $4. 25).  After a BA and a MS (with 75k in loans).  In what even then was one of the most expensive areas in the US.  In other words, yeah, I was every bit as edgy little shit as you appear to be.\n\n Now people starting in IT can make as little as 10 an hour starting out, about as little as 1. 4 time minimum wage.\n\nNot in any major US city, even at entry level.  Unless maybe you're classifying walmart retail electronic department workers as IT workers.  And if you're not near a major market, your cost of living is such that you're probably ok at that price point for an entry gig. Lets see... oh yes, looks like according to indeed. com, entry level salaries for people with just good typing skills in office is ~30k.  or $15k.  In a minor city.\n\nSo those starting out in your career field need to figure out how to market themselves better than the other 40 - 60 K people a year graduating with similar degrees as well as better than H1-Bs\n\nUm, yeah.  Take responsibility for your own success.  No one is holding your hand any more.  Figure out your market and invest in yourself to get what you want.  As for H1-Bs, I guess you could just go the route of lying on your resume, like the majority of H1B bodyshops do.\n\n So what, they do that or they're just lazy bastards?\n\nNot all.  But some whiny ones just stick out.\n\n"}