{"doc_id": "1897", "name": "2016_08_humanities_student_major_535_foreveralone", "namespace": "we1sv2.0", "metapath": "", "pub": "ForeverAlone", "title": "2016-08-humanities-student-major_535_ForeverAlone.txt", "pub_date": "2016-08-09T00:00:00Z", "Sentiment": "0.058", "Subjectivity": "0.337", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "586", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4wwdkw", "Reddit_id": "d6ak3qp", "Subreddit_id": "t5_2s3yz", "Commenter": "vcardthrow1", "length": "3207", "content_scrubbed": "Honestly, if I could live my life over again, I would have done a lot differently.\n\nI still probably would have ended up in a similar position due to lack of socialization--but I didn't even try. I couldn't. I was miserable and ashamed of my very existence during college, had no idea how to make friends, and was so miserable in my own skin I mostly thought about suicide 24/7. \n\nBut I could have interned and learned how to write a first resume in my university[.] career center, asked all those questions I was afraid to about how to get a freaking job. I could have chosen a smarter major. I fixed some of the stamina issues when I got a blood test, and I could have gotten better grades and made better impression on my professors, would I would need to recommend me in the future. I could have asked for help and then followed through when it was offered. \n\nI would have gotten a different major in the hopes of getting a career in an environment I was happier, could make more friends, and afford plastic surgery and independence. I would have looked at career boards and seen what was being asked for in my city in something that sounded like a job I'd like, who I'd like the work for. \n\n... Schools don't teach it. They just bankrupt students with liberal_arts bullshit and never connect young people to how to survive as adults who need to pay rent. \n\nI wouldn't travel, but I'd still use that money to develop myself, invest in my appearance, develop hobbies, or at least, knowledge of stuff other people like--music, film,culture in my own city. Stuff I couldn't have imagined at 21. \n\nThe sick joke of modern life is that if you work like you're hoping to get rich some day and make choices you can live with (e. g. choosing a career path you're good at but that[.] also in demand), you'll probably just come up even, able to pay your taxes and rent, and save for a rainy day. I don't know anyone \"rich\". I know millennials who don't live in terror of whether or not they have to choose between eating that month or paying rent. That[.] the dream now. \n\nBut there are rewards. \n\nWhere do you meet people or attempt to socialize? \n\nWhat holds you back from enjoying life now?\n\nI'm all over the place but this is my point--who you are in college doesn't have to be the person you stay forever, if you at least attempt to make good choices.\n\nI made bad ones. So it doesn't matter if the acne cleared up some. It doesn't matter that at one magical point I could have afforded to find a roommate and move away from family (long gone opportunity now). It doesn't matter I could have gotten a little more self respect. \n\nIt doesn't matter I actually did gain some decent acquintances and rekindled some tentative (but better than nothing!) friendships from high school after five years of being alone due to depression. \n\nIf you work like you have a future, there might be one. If *I* had done that, I know I wouldn't be like other women or have the same wiring or life experiences, but things weren't be as hopeless and exhausting as they are now. \n\nAnd at the risk of being morbid, it[.] a lot easier to purchase less-painful suicide methods if you're financially solvent, if it actually comes to that. \n\n"}