{"doc_id": "146", "name": "2016_06_humanities_student_major_1414_utaustin", "namespace": "we1sv2.0", "metapath": "", "pub": "UTAustin", "title": "2016-06-humanities-student-major_1414_UTAustin.txt", "pub_date": "2016-06-20T00:00:00Z", "Sentiment": "0.07", "Subjectivity": "0.358", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "475", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4p2anp", "Reddit_id": "d4hnxz5", "Subreddit_id": "t5_2qy08", "Commenter": "pabloe168", "length": "2689", "content_scrubbed": "I think Bio is one of the largest and least competitive departments. Transferring in from external or internal transfer shouldn't be too bad.\n\nNow I think you kind of made a bad choice not taking at least some of your Sciences at a CC. First is that UT doesn't care about lower division Math and science. Top tier professors aren't those teaching basic fundamentals. The best professors are those in Upper Division courses and Graduate courses who have been nominated and have won multiple academic awards, they have given speeches, worked in industry... etc. Lower division courses most likely mean someone paraphrasing a textbook, or going over slides. Not very different from a CC,its that minus the 1 on 1 attention and harder tests.\n\n You need to follow the TRANSFER GUIDE. It is there for a reason, and people who follow it have better chances at getting in the program they want. Included in there is Calculus, BIO 1 / Bio 2  (whatever the fuck they are called). Some humanities, and chem...\n\n\nThe second reason you should've taken some sciences is that lower division science courses at Universities are (Calculus - Biology -Chemistry - Physics)  are irregularly difficult here. So you need some serious dedication to do well in these courses. If you want to survive with As you BETTER get some free tutoring, study groups and use literally all resources you can, because your learning will be handed 100% to you. No more teachers\n\nThe problem with Universities and weed out classes is that teachers have so many students that its a very big disconnect from anyone who comes from community colleges. It happened to me.\nLower division Sciences tend to be weed out classes because people either learn to take their learning on their own hands or they fail.\n\nMany UT students do the smart thing, and go and take these classes at ACC over the Summer and get a pass grade which if its even a C- it doesn't show in your transcript. IMO community colleges are better environments for weed out classes. It[.] just less stress. So just beware that you will be challenged in ways you are probably not used to.\n\nYour options :\n\n1) Apply next semester having taking more classes and get in the program that you want. Have better chances of getting good grades. Cheaper tuition.\n\n2) Get in as undeclared making zero assumptions that you will automatically get in Biology. You may have great chances, but you are yet to test yourself taking University Science courses. This will also be a lot more expensive. If you were CS I'd strongly encourage you not to do it, since its a lot of effort for not a great chance of getting in. But if you try really hard I think you can do it. Keep up your GPA."}