{"doc_id": "1948", "name": "2016_08_humanities_student_major_1015_nostupidquestions", "namespace": "we1sv2.0", "metapath": "", "pub": "NoStupidQuestions", "title": "2016-08-humanities-student-major_1015_NoStupidQuestions.txt", "pub_date": "2016-08-15T00:00:00Z", "Sentiment": "0.013", "Subjectivity": "0.293", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "419", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4xtb52", "Reddit_id": "d6ifa40", "Subreddit_id": "t5_2w844", "Commenter": "IIy333o", "length": "2429", "content_scrubbed": "All by yourself? And you also want it to be good? Strap in, we are here for an adventure.\n\nFirst start with some basic colledge math. You need to know how to make math models, but before that you need to at least understand the language those models use. Also i'd highly recommend to throw Probability Theory, Math Logic, Math Statistics and Linear Algebra, as all of those are requred for you to be able to do the technical part of game designing (at least this is what they asked for at the interviews).\n\nWhen you'va mastered math you should go for the arts history, gaming history, literature. Considering you are also playing games, watching movies and generally proficient with current culture. If not - also throw those into the mix. Those are vital for you to understand how basic storytelling works, how should a character or scene should and/or might be introduced. And yeah, you keep practicing math in the meantime.\n\nAfter that, you should do two things. First you dive into theory behind codind: things like algorithms 101 (where you are going to heavily rely on your math knowledge) and the whole idea behind Object Oriented Programming. Second: you should start producing some art like short stories or pictures, or, which is even better - both.\n\nAfter that you should  go into some game designing materials - there are plenty of online courses, i'd recommend to start with the ones which are less about making games and more about the game theory. And, yeah, start doing some coding at this point (do C++ or C#, those are pretty popular, or Objective C or Java if you want to focus on games for phones). And do not forget about writing short stories, producing pictures. You'd also want to consider checking out 3D modeling software (like Blender).\n\nWhen you made a decision on what platform you want to focus learn some SQL basics and dive into the actual game producing.\n\n**TL;DR:** making games all by yourself is pretty hard, almost impossible if you have not previous trained in one of the relevant areas. Jumping into engines, like Unity, even though they oversimplify the gamemaking process, is useless unless you know programming. And it is useless to learn programming unless you know theory behind it (math and algorithms, although algorithms can be learned alongside with programming). Also there is a lot to do in the art department so it would be awesome to have some relevant training in those areas."}