{"doc_id": "154", "name": "2016_06_humanities_student_major_1456_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2016-06-humanities-student-major_1456_politics.txt", "pub_date": "2016-06-21T00:00:00Z", "Sentiment": "0.073", "Subjectivity": "0.37", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "625", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4i4yh5", "Reddit_id": "d4igs1t", "Subreddit_id": "t5_2cneq", "Commenter": "RightwingIsRight", "length": "3954", "content_scrubbed": "Heaven forbid someone on reddit point out that there are likely multiple causes for some sort of social development. However, your first, fourth, and fifth are really the same thing at their root: the anti-intellectualism and world-views of evangelical Christians, who happen to make up the largest segment of the Republican coalition, put the Republican party at odds with the empirically sound disciplines at universities, and so this is an extremely intuitive explanation of self-selecting out of disciplines where their beliefs may not be expressed. Of course, one need not be a registered Republican and believe that the world was made in six days by sky-daddy. Indeed, a good deal of contemporary academic economists are center or center-right, and I'd say it[.] about a wash if you get into the people who are classical or legal historians-- not to omit law professors and doctors; furthermore, historically speaking, physicists, chemists, and engineers tended to vote Republican, at least regionally.\n\nThe real rupture begins in the late 60s, and has a good deal to do with Vietnam, as well as the political realignments that turned the Republican party into the demonstrably stupid party. As you pointed out, the Vietnam protest movement, with the SDS among them, along with the free speech movement and the sexual revolution, radically altered the administrative character of universities, and that generation of academics, as well as subsequent ones, really did lean to the_left in a profoundly different way than what came before. In turn, this generation of academics gave rise to such epistemically unsound disciplines like Post-colonialist studies or Gender studies, where the vacuous bullshit of post-modernist Continental philosophers  was used as a launching pad for jargon-rich and content empty scholarship that all but the_left_leaning dismissed rightly. That these disciplines found institutional support, and once attached to the university system, had some hand in hiring and further calcifying the ideological rigidity of their departments and administrations at large, coupled with effectively miseducating generations of naive and trusting students, does go some way in terms of explaining why within humanities departments, one often finds this ideological conformity.  So your second explanation would take causal priority over your third one, although the third one coupled with the self-selection of conservatives out of those disciplines can be registered as the most compelling account for how this ideological sorting happened.\n\nA good little anecdote on this would be the story of some one like Charles Murray and his book The Bell Curve. I've personally yet to read any liberal sociologist who has made a compelling case for why it[.] wrong, other than to bleat that the statistics are racist, or to misrepresent the arguments made therein as if the man were John C Calhoun. Of course, that book itself can be properly criticized on the inadequacy of socio-cultural statistics and the naive mathematical assumptions made by those who wield them, or for some of the profound omissions made in terms of what IQ tests actually tend to measure, and while I'm sure some on the_left have made that argument, the general criticism from sociologists was not rooted in the formal inadequacies of their discipline, but in an ad hominem rich invective against the author, demonstrating to any neutral observer at the time that their academic commitments were to virtue signaling their anti-racism more than to an honest assessment of empirically gathered datum that contradicted their narrative.\n\nOf course, those on the_right are just as practiced in this form of self-deception, and there is, I must confess, a disconcertingly grotesque parody of this form of academic theatre on the_right which I feel has done a profound disservice to the Republic by making one political party utterly incapable of actually devising policies. "}