{"doc_id": "2034", "name": "2016_08_humanities_student_major_1854_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-08-humanities-student-major_1854_AskReddit.txt", "pub_date": "2016-08-25T00:00:00Z", "Sentiment": "0.004", "Subjectivity": "0.426", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "555", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6vngt4", "Reddit_id": "d6w0sug", "Subreddit_id": "t5_2qh1i", "Commenter": "PaleAsDeath", "length": "3153", "content_scrubbed": "It advertised itself as a kind of elite liberal_arts college prep school. It didn't have much money but still tried to present itself on par with ones that did. If we complained or didn't like the school we were treated poorly and told it was a character flaw in ourselves and we were what was wrong with the world. \n\nIn short, the school hired a lot of people who had zero training/education and sometimes sketchy backgrounds to teach.\n\n There was also no formal system for filing/recording complaints (which is in violation of state law for independent schools), and the school controlled their own internal email (so they could remove emails from any one[.] account at will) which made it impossible as a student to prove you made the staff aware of something but that they didn't act on it as they are required to.\n\nIt was extremely cult like and they controlled basically 100% of students' schedules, and there was this belief like \"hard_work makes character, regardless of what kind of work that is\". They used us for most of the work they would have had to pay maitenence people or janitors for, and had us do dangerous manual labor (while saying it was part of their \"work program\" that gives us experience). They sold our labor to the community too.\n\nThey sleep deprived us to do activities/attend meetings. The guy in charge of the kitchen believed raw fruit and vegetables were dangerous, and the kitchen was cheap, so we were fed a diet of basically purely sugar, eggs, apples, and wheat. \n\nThey had like a 98 percent acceptance rate, so some of the kids had serious problems and had been kicked out of other schools, and since the staff had zero training and the dean of students was an actual sociopath (seriously, it was disturbing and creepy how much pleasure he took in punishing kids for anything), they had a huge emphasis on punishment for everything. \n\nThe staff was also overworked, so even though there weren't a ton of students per staffer, the staff neglected them and ignored their problems/concerns unless they really liked you in particular. \n\nFinally, the school lied about what was going on to the parents on an everyday basis. As a parent, who are you going to believe? Your sullen kid who is doing shit in this school you pay ~$50,000 to send them to, or the teachers?\n\nSo a bunch of fucked up shit happened, even if you only account for negligence and not actual abuse, for example the head of PR slipped on the main path between the dining hall and assembly building because it was not being maintained and was coated in ice. He broke his leg and it was shortened two inches. Also the kitchen made a peanut dish as the main meal even though a student was deathly allergic to peanuts and served it without labeling it, the student ate it and went into anaphylactic shock. \n\nSorry, /rant. I'm writing a letter to get it investigated and the accredidation rescinded. I had a lot on my chest. \n\nTL;DR: There was no way of holding the school accountable or making complaints, they had very little supervision, no training, and they kind of gaslighted/coerced the students into telling everyone how much they loved it there. \n"}