{"doc_id": "4", "name": "2016_06_humanities_student_major_59_facepalm", "namespace": "we1sv2.0", "metapath": "", "pub": "facepalm", "title": "2016-06-humanities-student-major_59_facepalm.txt", "pub_date": "2016-06-01T00:00:00Z", "Sentiment": "-0.001", "Subjectivity": "0.326", "Score": "64", "Upvotes": "64", "Downvotes": "0", "Wordcount": "588", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3rr0ob", "Reddit_id": "d3rr3f5", "Subreddit_id": "t5_2r5rp", "Commenter": "LewsTherinT", "length": "3339", "content_scrubbed": "IIRC they didn't win a contest but actually paid him to come visit and talk to them and he was super rude and condescending \n\nEdit: found it. And they paid 85k\nhttps://m. reddit. com/r/bestof/comments/4byrrc/redditor_tells_tells_a_story_of_raising_85k_over/\n\nEdit 2: for the lazy\nSure. I'll leave out info that could identify myself or others in my club. \n\nWe were a small college club with around 10 members and on a whim one of our members emailed tyson[.] agent to see if we could book him. We found out it would cost 40k (it raised to 50k in December of that year where I think it still might be) for his speaking fee plus expenses to have him come to our college for 1 day where he'd host a small lecture, a press meeting, dinner with up to 6 people, and the main lecture and a book signing time permitting. We decided to go for it, and spent a year where our club exclusively worked on bringing him in. \n\nWhen he arrived, myself and others introduced ourselves and our fields of study. He went after first of us in humanities or soft sciences pretty much relentlessly from the get go. We're all used to the philosophy major working at McDonald[.] joke, but he wasn't trying to be funny, and spent the ride from the airport making repeated comments about the uselessness of our majors. Additionally he spent about 5 minutes trying to show that logic was stupid but he was citing logical rules and Occam[.] razor. \n\nThe small lecture was him bragging about how famous he was, and how easy it is to pull yourself out of poverty or etc. The dinner was for leaders of other clubs so helped us raise money. He took the piss out of how one student held her fork, and was impossibly smug when giving advice to physics students. \n\nThe main event was a terribly boring lecture consisting of fart jokes and fan service; teasing the upcoming TV series he was in and not much else. He spent a quarter of the time reading Sagan[.] blue dot, which is nice but shouldn't have cost us because it wasn't his material.\n\n\nHe left at about 2am, and we were all exhausted because we had spent the day busy setting up and tearing down. The whole affair cost nearly 85k. The additional money being for locations, personnel, air fare, Tyson[.] hotel, catering, etc.\n\nWe all decided he was an ass hole. I'd never want to spend 16 hours with a celebrity again. \n\n\nEdit: I'm on mobile so this is as good as it gets. \nGold edit: Wait what? I got gold for this? Holy crap. Thanks much. I'll go through and answer any questions anybody has. \n\nFront page edit: Whoa, this is nuts. I posted this in what I thought would be a dead thread for me to share my experience, and things would end there.\n\n I want to take a minute to thank the members of the club who pulled of the fundraising and logistics to bring Tyson in to our school, and also to thank members of the administration who were absolutely crucial to the event happening, and very lovely in dealing with a bunch of kids who were way in over their heads. Also thank you to members of other student orgs who helped. You know who you are. \n\nSo many edits. Apparently a story was posted a year ago by a different club member who was there, /u/Toothskin. [Here[.] their take on Tyson[.] visit to our university.](https://www. reddit. com/r/AskReddit/comments/2sqd3h/have_you_ever_met_a_celebrity_who_turned_out_to/cnrzdiu)"}