{"doc_id": "1953", "name": "2016_08_humanities_student_major_1065_academiceconomics", "namespace": "we1sv2.0", "metapath": "", "pub": "academiceconomics", "title": "2016-08-humanities-student-major_1065_academiceconomics.txt", "pub_date": "2016-08-15T00:00:00Z", "Sentiment": "0.12", "Subjectivity": "0.356", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "906", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6j7zqi", "Reddit_id": "d6j98te", "Subreddit_id": "t5_2r6jd", "Commenter": "alandbeforetime", "length": "5205", "content_scrubbed": "Why indeed? And, pardon me, how the heck can we say whether one government system (let along a given policy) is good or bad or right or wrong or harmful or beneficial; if we haven't even agreed upon what governments are even for? This gets right into the heart of what I want to study.\n\nPolitical philosophy is discussing this right now, and has been for millennia. This is not an economic question.\n\nAnd it[.] not that the questions are unanswered, it[.] that they're works in progress, and the broad fields of moral and political philosophy are working on them. But it[.] not my contention that you can't study them, or shouldn't study them -- my point is that you cannot come to scientifically verifiable, empirical solutions to these questions. \n\n Unless we know why they were formed and what they are supposed to do? Positive is anything that does that. Negative is anything that does the opposite.\n\nThis isn't clear to me at all. Societies might have originally been formed to protect people from the elements and each other. That doesn't mean that it[.] necessarily \"right\", unless you fully back evolutionary morality at the expense of every other view (unwise). And then you run into problems like, how do you discuss if funding for the arts is good or bad if you only have \"good = protection of society\" as your benchmark? I think you're seriously failing to see the complexity of the questions you're asking, as well as the highly contentious axioms that underlie them.\n\n\nMaybe I won't get to the answer in my lifetime. That[.] not a prerequisite for me. But if what I am working on has value, and if I can show a few people why it has value and what can be achieved by carrying on with it, then isn't there potential?\n\nYes, and I encourage you to pursue what you find meaningful.\n\n Did the first scientists unlock the genome? Did the first doctors cure polio? Did the first astronomers put a man on the moon? Were they \"not successful\"?\n\nI stressed (several times, I might add) that you should pursue what you wish to pursue, and that I think that it[.] a fantastic idea to study something you're passionate about, regardless of subject.\n\nBut again, I think you don't understand the philosophical foundation of your own goals. You can't empirically verify the meaning of life. You're not going to find the answer to the optimal construction of the state in a dataset somewhere. Any attempts to do so will already be assuming a number of things, which will cause your work to be sorely misguided.\n\nReturning to your post, you stated:\n\nWhat I'd like to eventually be able to do is **to determine by scientific means how a good society and a good government are structured**... to be able to say empirically whether a given policy or political philosophy is \"correct\" or not.\n\nAgain: If you want to study public policy and economics in an attempt to contribute valuable research to academia and make the world a better place, I *strongly encourage* you to do so. \n\nBut I would like to say, once more, that *your motivating end goal is impossible*. I'm not trying to shit on your goals or turn you away from worthwhile academic pursuits -- I'm just advising you not to have this as your exact motivation for pursuing higher education, because you will quickly realise after taking a few philosophy courses that what you wish to do is literally impossible.\n\nIf you were telling me \"I want to study physics because I want to discover how to build a perpetual motion machine\", I would similarly tell you, \"Yes, you should absolutely study physics if you are passionate about physics, but please don't have a perpetual motion machine as your end goal\".\n\nScience does not, and cannot solve moral problems or problems of governance without presupposing what the Good is already, and then working toward those. Science and empirical observation are tools that can be used in any number of wonderful and terrible ways, but they cannot, will not, and will never, by definition, answer questions of if a political philosophy is correct without relying on fundamental moral axioms, which you seem to (falsely) deride as \"matters of opinion\".\n\nAs another example: What you are saying is tantamount to, \"I wish to study math so that I may use it to answer what the best colour is. I think that all the discussion on colour are too focused on art and subjective aesthetics, and are approaching the question from a non-scientific, non-empirical point of view. What I'd like to eventually be able to do is to determine by scientific means what a good colour is.. to be able to say empirically whether a given colour or colour spectrum is \"good\" or not.\"\n\nDo you see how that doesn't make any sense? The example is slightly off, as discussions of morality have in some forms converged on what is \"wrong\" more so than what is \"right\", but have made substantial progress, whereas colour preference could be argued to be something that is entirely subjective. Although even in colour, artists have thought about colours and colour combinations that are better at evoking certain emotions and ideas compared to others, and in that sense it is something that is worth discussing -- just not from a mathematical point of view."}