{"doc_id": "85", "name": "2016_06_humanities_student_major_886_godhoodwb", "namespace": "we1sv2.0", "metapath": "", "pub": "GodhoodWB", "title": "2016-06-humanities-student-major_886_GodhoodWB.txt", "pub_date": "2016-06-12T00:00:00Z", "Sentiment": "0.171", "Subjectivity": "0.416", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "1455", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nq6ea", "Reddit_id": "d462c5k", "Subreddit_id": "t5_38qfi", "Commenter": "AltMakator", "length": "8787", "content_scrubbed": "[maximum ten turns left]\n\n[WAT]\n\n___\n\n#The Kilimararo Dominion\n\nIn Kilimararo, a blossoming city, growing ever more powerful since the foundation of the Dominion, Carnardya found she had many followers, and she could hear their prayers every season. In the city, both the students of the Kilimereiza Academy and the researchers of the Carlaeum found in her their main source of inspiration and motivation to strive forward.\n\nShe decided to reward them, and blessed the more brilliant of them with a knowledge of Golemancy, a power that combined technology with magic. Their golems weren't as... magnificent as the ones Fremgang made, but they were certainly useful in automating many tasks, mainly manufacturing.\n\nThe Golemancers traveled to Nik and Lak, where they built their first two workshops. Their golems couldn't stray far from the golemancers without breaking apart, but, together with them, they could operate forges and machinery much faster than a single man normally could, and thus, the two workshops could manufacture goods much faster. Initially, the two workshops rivaled each other, to who could build the best golem, the best tools, and of course, who could seel their products faster, but soon, The Ruler stopped this rivalry, and gave them a joint task: manufacturing weapons.\n\nIn fact, while the Golemancers experimented with their new magic, in the Carlaeum, studies moved forward, especially after a Joyic traveler from the New Technocracy brought explosive powder, and shrugged it off as a \"toy for pretty lights\", which he promptly demonstrated by lighting up a firework. The researcher were amazed by this, and studied the powder avidly. As people often do when they are given a new technology, they found a way to weaponize it. They invented guns that used the powder[.] explosive properties to propel bullets forward. Muskets, and their big brothers, cannons, were invented, now they just needed to be produced in great quantity to supply the army, and that[.]  where the workshops came in. They built guns for the Dominion, to fuel its war machine. The Temple of the Fletching slowly lost its purpose of training ground for the finest archers in the world, as the age of bow and arrow was over. Some Paladins of the Ordo Speculo still stuck to the tradition, but it was simply ceremonial by now. The Temple itself became a point of pilgrimage, where travelers and paladins marveled at the history of one of the oldest Temples in the world, and many went there to pray to Pleida.\n\nAt the same time, in Urudas, people started dreaming of flying machines, that could take to the skies and travel far and wide for days and days. Ships that could move above the clouds. Ships that could rule battlefields from up above, in a way flying archers never could. They begun experimenting on it.\n\nMeanwhile, the Dominion continued expaning, conquering the land south, and found themselves at a halt once they reached the Dustgrin. *Not Razholar...*, they thought. They demanded from the Trade Lords to be given land on the Dustgrin, both because of its strategic value, and because then they could expand further east. They had no interest in dealing with the Trade Lords again, so their demands were brought along with muskets and cannons, and the Gods' good will.\n\n[/u/Plintstorm they have demands. Mind that they don't want the whole river, just a a piece of your holdings around it]\n\n[-4 Journeyman Golemancy. Charcoal powered (or many many candles). Now available to more than just Fremgang, but still very very exclusive. Should be noted, while they have the magic to connect the golem with Carrie, they don't have the ability to build them as well as Fremgang does, so they are still pretty limited as machines. They are far from proper \"robots\"]\n\n[-1 gunpowder again (paid less because it[.] not a new tech, tell me if I have to pay  more)]\n\n[-2 muskets and bayonets]\n\n[-2 Cannons]\n\n[-4 AIRSHIPS (I'm paying in advance for whatever turn they'll be able to achieve this. Prototypes start now though, whether they work or not)]\n\n___\n\n#The New Joyic Technocracy\n\nWith the gunpowder offered by the Undalos Authority, the Joyic developed some new weapons, as requested by the Goddess Kalina.\n\nOne was possibly the simplest application of explosive powder: bombs. Sure, a barrel of gunpowder was already explosive by itself, it didn't take a genious to make it blow up, but the Joyic went a step further, and invented granades full of gunpowder with *a fuse*, which could be lit up and then thrown at the enemy. They eagerly shared this technology with the Authority.\n\nother inventions was definetly more complex. Their explorers saw what the Kilimararo Dominion managed to do with the powder, and they were inspired by it. They did not copy the musket directly, that would be stealing, but instead, they invented a similar weapon, only more... compact. The joyic pistols were easy to handle and faster to reload, only not as powerful as the rifles. They proudly demonstrated their power to Kalina herself.\n\nAt the same time, they continued improving their ships, design after design, and came up with boats that could sail further and faster, along with ships for Undalos which mounted gunpowder weapons and heavy plating.\n\n[/u/gorok1089 I know the Authority is falling, or at least weakening, but the NJT is with you till the end!]\n\n[-2 bombs]\n\n[-1 flintlock pistols from muskets]\n\n[-1 better ships (caravel level, obviously) (armored versions too)]\n___\n\n#Orophos\n\nIn the Citadel of the Arts culture boomed throughout the years, as advancements in technology often brought along advancements in artistic expression. They built museums and galleries, and wrote many incredible pieces of literature.\n\nIdeas of the flying ships from Urudas reached Orophos as well, as every idea reaches the Citadel of the Arts, and the people started dreaming as well. They had no intention of travelling though, the Citadel had everything they could want, a magnificent city, it was. Instead, they dreamt of buildings high up in the sky, from which they could gaze upon their beautiful Citadel.\n\nLike in Urudas, they begun developing prototypes for these.\n\n[-3 floating buildings (basically houses on airships) (again, I'm paying in advance for when they'll achieve it)]\n\n[The city will have multiple of these floating around it, truly majestic ~~(and even harder to siege properly)~~]\n___\n\n#Joyic\n\nIn the Joyic Metropolis, many inventors and intellectuals made advancements in their theories. Mathematics and Physics made giant steps forward, giving the Joyic an unprecedented understanding of the world and universe around them. Science moved forward in all fields, now with more rationality and method.\n\nThis rationality was reflected in their culture as well, where reason was looked up as a virtue at least as great as creativity and curiosity.\n\nA notable result of their advancements in physics and their understanding of pressure was the invention of underwater ships. It was easy for the Joyic, as they could breath underwater, so they just needed a way to properly propel themselves forward, which, for now, was oars. The Joyic submarines had multiple large, heavy oars, inspired by the fins of the Levinekkas.\n\nWatertight versions of these ships were being prototyped, but with no valuable results yet.\n\n[-1 Calculus. Maths. Physics. Scientific method. Enlightenment stuff]\n\n[-1 submarines (watertight versions in the future) (the reason they can do this so early is that they don't need to make it watertight. In any case, they can't go very deep with it, MAX forty meters, and motion is very slow and hard to handle. They mostly do it for fun, for now)]\n___\n\n#Dainar Kingdom\n\nIn Dainar, a more efficient, faster loom was invented, which they used to weave beautiful dresses and carpets. In this textile boom, some mages found a way to use magic to extrude copper and aluminum into impossibly thin strings, which were useful as a new material for weaving. Metalweaved dressed were extremely expensive and hard to make, but they were very beautiful and luxurious.\n\n[-1 cool looms and metalweaving. Looms not industrial revolution level, of course, but they're slowly getting close. Metalweaving is a bonus, it[.] something only Ellion used to do. It[.] basically like making armor mail, but much much thinner, through the use of magic, which makes it light enough to be worn, and it[.] pretty and shiny. It[.] just fluff really. I can retcon if it can't be done]\n\n___\n\n[/u/keytium please tell me what the problems with these are (if there are any) and also if I paid anything more/less than I should]\n\n[EDIT: to make it clear, the Dominion spread all the way south to the desert before attacking Razholar. There should be no (or very little) unclaimed land left near the Dominion]"}