{"doc_id": "221", "name": "2016_06_humanities_student_major_2170_kotakuinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "KotakuInAction", "title": "2016-06-humanities-student-major_2170_KotakuInAction.txt", "pub_date": "2016-06-30T00:00:00Z", "Sentiment": "0.018", "Subjectivity": "0.37", "Score": "10", "Upvotes": "10", "Downvotes": "0", "Wordcount": "1333", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4qm1k2", "Reddit_id": "d4uhju5", "Subreddit_id": "t5_33726", "Commenter": "boommicfucker", "length": "7924", "content_scrubbed": " We have been working for years to make games a legitimate tool for education and for study, and we were making progress. People were starting to take games seriously.\n\nWhen things like this come from a social_scientist, I'm not thinking KSP, I'm thinking Sunset. Dreadfully boring, moralizing, barely-a-game rubbish.\n\n And then came GamerGate. I have seen the careful progress of a decade come crashing down, and now, when I go to talk about games to industry groups or fellow academics, GamerGate always comes up as an example of how terrible and immature people who play games are.\n\nWell, \"gamers don't have to be your audience\". Literally. Gamers generally don't want those \"games\". It kinda sucks if this is true, but it[.] collateral damage at best. I doubt anyone would react this way if GG wasn't misrepresented so much.\n\n For many years, people have been fighting for games to be recognized seriously as an art form.\n\nThe person quoted above didn't really seem to see it as an art form...\n\n Social scientists have been studying the influence of games, not just because of their negative effects, but because of the potential positive effects as well. Games could potentially be a powerful tool to help teach empathy, and increase satisfaction and happiness.\n\nPotentially? Games like Papers, Please for example literally put you in the shoes of a border guard, and it works because it tells a story through gameplay mechanics. It[.] been out for years, and, as far as I'm aware, didn't come out of academia. Meanwhile, certain people are focusing exclusively on the perceived negative aspects, and their huge influence in the media, backed by their academic background, is genuinely threatening the freedom of developers. New laws might be made, new restrictions put in place. The video game scare is already back, and it[.] not GG who started it. We are trying to stop it.\n\nMaybe social_scientists should just shut up, sit on the sidelines and watch a bit more before trying to assert what games should and shouldn't be.\n\n To put it bluntly, video games will have no future. If we do not take care to study the cultural history of games, it may forever disappear to us when cartridges and CDs inevitably die, emulators become obsolete, servers shut down, manuals are lost, and the publisher history fades into obscurity.\n\nNonsense, most emulators are open source. You will be able to update them if they stop working for some reason, or just make a new one. It[.] all documented. Enthusiasts are already doing what academia, apparently, can't.\n\n This should make any gamer uncomfortable, but unfortunately, this is not the case. GamerGate has not been shy about their disdain for academia in video games, as evidenced by the popularity of anti-academic figures such as the Youtuber known as \"Sargon of Akkad\", who is one of the most widely-praised supporters of GamerGate.\n\nI doubt that anyone on KiA would object to an effort to catalogue and preserve old games. What we take issue with is a very specific branch of academia that, in my opinion, is deliberately doing more damage than GG ever could by accident. They are the ones who warmed the \"violent video games\" debate back up, not with conclusive evidence but vague theories about gender and \"the patriarchy\". They are to blame at least as much as GG is.\n\n In this context, GamerGate[.] reaction to the news that academia is no longer taking games seriously is depressingly predictable. [Various images of people being happy about social_sciences not getting funding for researching video games] GamerGate is killing video games. And that[.] exactly what they want.\n\nI see what you're doing there. You can't just act like people are happy about archivists being denied funding when GG isn't about that, and when people are directly mentioning \"humanities\" in the images. Even if your assertions about games being doomed without academic archival efforts, and GG being to blame for the lack of funding for them were true, your conclusion is still bollocks.\n\n I don't think it[.] any coincidence at all that that last screenshot specifically mentions humanities; I strongly suspect that there[.] a lot of overlap between the sorts of people who support GamerGate and the sorts of people who believe that anything besides a STEM degree is fake, lazy academia, and literary critique of games of any kind (including, of course, feminist critique) falls under the umbrella of the humanities. if we start hearing news about schools choosing to drop support for game development in computer science programs as a result of GamerGate, then there'll probably be a huge uproar, because ultimately, according to GamerGate, videogame development should be little more than a skilled trade that only requires proper execution of precisely honed talents, rather than an artform that requires an understanding of the process of creating meaningful art.\n\nPartially right, I'd say. STEM (and related) fields are, obviously, the most useful, but it[.] silly to just lump everything else together. All those feminist courses seem to have very little basis to stand on. They don't seem to follow the usual format of humanities, even, where you are supposed to be exposed to a wild variety of viewpoints. Philosophy, for example, will give you anything from \"fuck yeah, humanity\" to \"there is no free will and I'm alone in here with an evil god\". Feminism, on the other hand, seems to be an ideology, something to base activism on, not something that is discussed and analysed from a good distance.\n\nAnd art-related degrees? Nothing wrong with them per say, and if you want to write for a game then having one should be useful. If someone wants a degree in theatre, modernist sculpturing or ballet then go for it, I'd say.\n\nMaybe video games can be added to that list some day, but feminism and people who primarily view games as tools won't open that door any more than computer sciences.\n\n My strong impression of GamerGate is that it[.] built on the foundational belief that games should be treated as existing only of, by, and for an incredibly narrow demographic and set of intentions; and that the appropriate response to engagement with games from anywhere outside that demographic and those intentions is \"slash and burn indiscriminately.\"\n\nCompletely wrong. GG is built on the foundation that the games enthusiast press should not blatantly insult their readership by lying or name-calling. GG is built on the foundation that criticism like \"games make you sexist\" is wrong and detrimental, unless you can actually prove it. Which hasn't happened. So we tell those people to kindly fuck off, as is tradition.\n\n Which is to say: I'm really not sure why anyone was expecting them to be anything but overjoyed at the revelation that they'd driven someone else away. Legitimacy was never part of the agenda. Progress was definitely never part of the agenda.\n\nProgress towards what? Legitimacy for whom? Sarkeesian et all seem to be given a lot of legitimacy, and large parts of the press seem eager to force the community to progress towards the goals those people set. I'm pretty sure that that emperor has no clothes on, which is why we are being vilified as violent, misogynist hate mob.\n\n And yet, these are the same folks who also lambasted Roger Ebert for not considering video games an art medium (which they definitely are)\n\nGames are art. They can also be tools. You can do amazing things with the medium, some of which no other can do. Nobody is denying that here. The people in that Tumblr post talk like they love video games, and I'm willing to believe them. Well, so do I. That[.] why I don't want to see them curtailed over unproven, vague-as-fuck bullshit. It[.] almost like there is a big misunderstanding here: We see Jack Thompsons where they see critics and scholars. They see scum where we see the last line of defence against agenda-driven liars and control freaks."}