{"doc_id": "1918", "name": "2016_08_humanities_student_major_680_japancirclejerk", "namespace": "we1sv2.0", "metapath": "", "pub": "japancirclejerk", "title": "2016-08-humanities-student-major_680_japancirclejerk.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.004", "Subjectivity": "0.162", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "454", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4x6d87", "Reddit_id": "d6cv2iv", "Subreddit_id": "t5_2sttb", "Commenter": "copy-kun", "length": "2366", "content_scrubbed": "Should I be worried about radioactive toner from Fukushima?\n\n----\nBachelor in Japanese. Can't find a job.\n\n Thing is, I decided my major when I was 17. It was dumb, but now I have this degree. I can't undo that. I graduated in 2009 and at that time I couldn't find a job either. I had the option to teach English in Japan but I thought that was a dead end so I chose instead to try to just work in the US. I thought maybe having a liberal_arts degree could get me a regular office job and I could work my way up in a company. I started out at temp agencies but it was too unstable. You could go months without income. Eventually I gave in and just started going to every company I could find and just asking if they're hiring. One company finally called me back, and gave me a warehouse job. I realized pretty quickly that there was no room for growth in this company so at first I decided to try going to school at night for IT. After failing intro to comp sci twice I gave up deciding it was really just too hard. Eventually I found Japanese recruiters and did get a job at a Japanese company in the US, however after a year of abuse and power harassment, I had what you could call a meltdown and walked out of the company. At this point I am 7 years removed from college. I have no useful skills, and my Japanese has only gotten worse. I've applied to Japanese recruiters in Japan but the consensus seems to be that bilingual is not considered a skill anymore and you need to couple it with something else. I don't understand why I can't get some kind of entry level office job in Japan, but I guess I can't. Friends have suggested getting an MBA but that seems like a waste of money and time. One thought I've had was going to language school for Japanese with what I have left of my savings so that at least I can take the JLPT and have that on my resume, but like I said, without another career oriented skill I think that might be a waste of time and money. I'm almost 30, and I have no job, no career, no career field, and my Japanese level is slipping. I'm still working with Japanese recruiters in the US, but to be honest, the impression I get is that they see that I quit my last job, and they don't want to hire me because of it. Do you have any advice? Any suggestions? \n\n\n----\n^(Check out copy-kun on) ^[github](https://github. com/JaredHays/copy-kun)!"}