{"doc_id": "118", "name": "2016_06_humanities_student_major_1198_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2016-06-humanities-student-major_1198_AskHistorians.txt", "pub_date": "2016-06-17T00:00:00Z", "Sentiment": "0.107", "Subjectivity": "0.342", "Score": "11", "Upvotes": "11", "Downvotes": "0", "Wordcount": "650", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4okjsv", "Reddit_id": "d4diyea", "Subreddit_id": "t5_2ssp3", "Commenter": "Chamboz", "length": "3979", "content_scrubbed": "It[.] true that many of Suleyman[.] achievements are largely invisible in the older historical narrative of Ottoman history. This now outdated framework for Ottoman history that you find in books like *The Ottoman Centuries*, often called the \"Rise and Decline\" paradigm, portrayed the Ottomans as constantly and gradually gaining in strength until the time of Suleyman I and thereafter constantly and gradually weakening. The period from Mehmed II (r. 1451-1481) to Suleyman I (r. 1520-1566) was portrayed as a sort of \"Classical Age\" in which the Ottoman Empire functioned in perfect harmony, until the \"decline\" afterwards. This makes it seem as though the real architect of Ottoman success was Mehmed II, and Suleyman just effortlessly ruled over the empire which his great-grandfather had created. In fact, the system created by Mehmed II was under a great deal of strain by the time Suleyman came to the throne, however because mentioning that would violate the principle of \"before Suleyman the Ottomans were constantly getting stronger,\" this fact didn't get much recognition in the older histories.\n\nBasically, by the time of Selim I (r. 1512-1520), the Ottoman state was ruled by an old guard of men who had risen to power in the time of Mehmed II and Bayezid II. While their positions had originally been designed with total subservience to the sultan in mind, as the decades passed they increasingly came to think of themselves as privileged members of (something resembling) a noble elite. Selim I was a forceful ruler, but his death put Suleyman in a terrible position in relation to the Ottoman elite: all of his viziers were experienced men, while Suleyman was young and was the first Ottoman sultan to take the throne without having had any prior military experience whatsoever - his father had left him behind to govern Istanbul during his various eastern campaigns. So Suleyman started with a very weak position and few avenues with which to utilize his power. He managed to flip this situation on its head by winning crucial military campaigns in Belgrade and Rhodes while playing the major viziers against one another. Over the course of the 1520s he removed the entire old guard from the top ranks and replaced them with men of his own making, most famously Pargalı Ibrahim Pasha, a friend from his teenage years who he made into Grand Vizier. Thus Suleyman was responsible for reversing the change in the ethos of the Ottoman elite and placing himself firmly in a position of ultimate power.\n\n \n\nBut leaving that particular issue aside, Suleyman[.] reign was praiseworthy for a variety of reasons. I'll list some below:\n\n* 1. Major conquests, such as that of Hungary and Iraq.\n* 2. Legal reforms carried out alongside the *seyhulislam* Ebussuud Efendi (in office 1545-1574) which harmonized Ottoman dynastic law (*kanun*) with religious law (*seriat*).\n* 3. Expansion of the Ottoman bureaucracy, particularly under the guidance of the *nisancı* Celalzade Efendi (in office 1534-1557).\n* 4. Full integration into the empire of the regions hastily conquered by Selim I.\n* 5. Extensive patronage of the arts, architecture, and literature.\n* 6. Development of a more fully articulated imperial ideology and of a commitment to Sunni Islam.\n\nAnd much more which I'm probably forgetting.\n\nI should also note that things like this:\n\nHe was also quite vain, killed the most capable son he had, and was controlled by his lover Roxelana. \n\nAre a direct result of reading old orientalist books like that written by Lord Kinross. Mustafa as the \"capable son,\" Roxelana (Hurrem Sultan) as the \"scheming harem woman.\" They're historical stereotypes, not real history. Of course it[.] not your fault for picking a bad book, but now you know - avoid Kinross at all costs.\n\nFor the latest analysis of Suleyman[.] reign:\n\nSahin, Kaya. *Empire and Power in the Reign of Suleyman: Narrating the Sixteenth-Century Ottoman World.* Cambridge: Cambridge University Press, 2013."}