{"doc_id": "71", "name": "2016_06_humanities_student_major_788_architecture", "namespace": "we1sv2.0", "metapath": "", "pub": "architecture", "title": "2016-06-humanities-student-major_788_architecture.txt", "pub_date": "2016-06-10T00:00:00Z", "Sentiment": "0.124", "Subjectivity": "0.347", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "643", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nh0t5", "Reddit_id": "d43tdle", "Subreddit_id": "t5_2qhae", "Commenter": "neverman25rl", "length": "3707", "content_scrubbed": "I would strongly advise going to open days at the universities you are interested in. This gives you an opportunity to speak to staff and students, which I found really helpful as it turned out that every course runs slightly differently, particularly in the structuring of first year. If you go during the summer, then most of the Architecture Schools will still have their degree show exhibitions up, which is an absolutely fantastic opportunity to see the sort of work produced. Look into facilities; workshops, studio spaces, resources like 3d printers, laser cutters etc. The biggest turn off for many of the schools I looked at was hot desking and limited time in the studio per year; two days a week, something like that. Whereas currently we get a desk, and it[.] your desk for the year - which suits me fine, as I near enough live in the studio. Although there still isn't quite enough room.\n\nAt the same time, I wasted a lot of these visits, as I underperformed at AS Level and had to ignore a lot of the ones I had previously been interested in.\n\nOn the question of your A-Levels, it[.] definitely a good idea to think it through. In my experience, a lot of people (read: not architects) seem to think that you should automatically do an Arts subject (Fine Art, Graphic Design etc), Mathematics and one of the core sciences. Do that if you want to, of course, but it doesn't have to be the case; for instance, my university (Northumbria University in Newcastle) really only expressed an Art and Design type A-level as necessary, and the others were more broadly defined as 'core mathematics, sciences and humanities' (so stuff like Geography, Physics, English Lit/Lang). But again, this is a major case of varying between universities. I'd recommend playing to your strengths and what you enjoy above all, without being silly with it.\n\nHave the idea that you may be required to build a portfolio and take it to interviews at some of the universities. Think about the presentation if you can, and the order you'll talk them through it. It might want twisting depending on the focus of the university you're applying to, depending on whether they're particularly tech/art skill focused. Again, Open Days can help with finding this sort of thing out. Maybe start little sketch books; A5 or smaller, just little landscapes and building features that you like, pencil and pen, maybe a bit of watercolour. Keep it simple, show your skill at quick drawings and the sort of thing you're interested in. \n\nI wouldn't say you'd have to start it now, just think about it is all.\n\nMaybe look into finding some work experience somewhere. Just email around if you like, be polite and professional; remember that you're asking for their time. I used more to find out if I actually wanted to pursue architecture as a career more than anything else.\n\nAnd finally, on a more personal note; don't ignore the ex-polytechnique or [.]econd tier' universities. If you can go somewhere like Bath or UCL, then fantastic. But if you find yourself looking further down rankings and such, don't ignore places like Oxford Brookes, UWE, Manchester Metropolitan (a joint program run with University of Manchester), and Northumbria. I am biased though.\n\nI'd say there[.] definitely a whole lot more to consider further down the line, but right now as an AS-Level student, these are maybe the sort of things to think through now. Besides, that was enough of an essay as it is.\n\n**This has all been written with the limited knowledge of a soon to be third year architecture student; odds are others can be much more helpful. If you think I can help you more though, by all means feel free to message me with any questions you've got.**"}