{"doc_id": "1971", "name": "2016_08_humanities_student_major_1214_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-08-humanities-student-major_1214_AskReddit.txt", "pub_date": "2016-08-17T00:00:00Z", "Sentiment": "0.131", "Subjectivity": "0.333", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "384", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6l6myj", "Reddit_id": "d6lcz1i", "Subreddit_id": "t5_2qh1i", "Commenter": "BtmnDetroitDeserves", "length": "2421", "content_scrubbed": "What is also hilarious is that most of the people who mock non-STEM degrees have done zero research on the reality for people who carry those degrees.\n\nLet[.] take the much-maligned humanities degree. The median income for a humanities major is [$47,000](https://cew. georgetown. edu/wp-content/uploads/2014/11/whatsitworth-select. pdf). \n\nThe median income for a person who only has their high school diploma? [$35,000](http://www. bls. gov/emp/ep_chart_001. htm). \n\nBut what about all those student loans the humanities major has to pay off? The average student loan debt for a graduate is [$35,000](http://blogs. wsj. com/economics/2015/05/08/congratulations-class-of-2015-youre-the-most-indebted-ever-for-now/)\n\nSo, let[.] do the math. Tony and David graduate from high school in the same year. Tony immediately starts working full time at $35,000/year after graduating high school. David takes his time in college, graduating in five years and not working at all during those five years. David also took a bit more than average out in student loans: $50,000.\n\nFederal student loan interest is currently [3. 76%](https://studentaid. ed. gov/sa/types/loans/interest-rates). David is going to pay his loans off in twenty years, so we throw that in an amortization calculator and find that David is going to pay back a total of $71,209. A good investment has a good *return on investment* or ROI. We have how much David will have invested, so let[.] find out if he earned enough in comparison to Tony to make a good ROI.\n\nBoth Tony and David retire at the age of 65. Since Tony started work at 18, he worked for 47 years. 47 * $35,000 = $1,645,000. That[.] a lot of dough! David was out of the job force for five years while he got his degree, so he only worked 42 years. However, he made $47,000/year. 42 * $46,000 = $1,974,000. Take out the $71,209 he paid for his degree, and you have $1,902,791.\n\nDavid has earned $257,000 more than Tony over the course of his life. That is a 361% ROI, which is about as good an ROI as you can expect in life.\n\nNow, engineers have a higher median income than the humanities_major do, obviously, but the point is that, if you are not inclined to engineering, either your skills aren't in that area or it just doesn't interest you, you should consider a humanities degree because you will (typically, there are exceptions) earn more than a person without a degree. \n\ntl;dr soft skills are important"}