{"doc_id": "1967", "name": "2016_08_humanities_student_major_1170_physics", "namespace": "we1sv2.0", "metapath": "", "pub": "Physics", "title": "2016-08-humanities-student-major_1170_Physics.txt", "pub_date": "2016-08-16T00:00:00Z", "Sentiment": "0.031", "Subjectivity": "0.375", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "290", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4y1hhn", "Reddit_id": "d6kotr1", "Subreddit_id": "t5_2qhi6", "Commenter": "hybris12", "length": "1686", "content_scrubbed": "I went to a small liberal_arts college (~10 physics majors in my graduating class).  About 4 went to graduate school in physics.  One is a private school teacher, one is in vet school, one is an analyst at Goldman, one is working for an engineering firm, and one is currently hiking around America.  I ended up working in software in a hybrid role, where I split my time between implementation, software development, and support.  Overall, all of us are doing pretty well from what I hear, with 3 of the 5 who didn't enter graduate school making an above average salary for entry level bachelors.\n\nThe key thing that the classmates who ended up in high paying jobs did so by pairing their physics major with supplemental courses in the field they were interested in, as well as having a clear direction for what they wanted to do.  Once they decided they didn't want to enter graduate school they adjusted their courses so that they could take courses in things which they were interested in pursuing as a career later on.  The most drastic example of this was the one who went to vet school.  She ended up finishing an astrophysics BS while also doing prevet, which was completely absurd.  \n\nThe only exception to that is probably me, who ended up shotgunning my resume to everywhere, got interviews in tech consulting, energy consulting/GIS, and software, and ultimately ended up at a large tech company.\n\nThe main issue with physics is that the degree doesn't have direction.  It[.] a \"I can solve technical problems\" degree.  If you want to study physics while not going into teaching/PhD, you should probably try to have some courses/minor/major in the field you're interested in.  "}