{"doc_id": "121", "name": "2016_06_humanities_student_major_1217_askwomen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskWomen", "title": "2016-06-humanities-student-major_1217_AskWomen.txt", "pub_date": "2016-06-17T00:00:00Z", "Sentiment": "0.118", "Subjectivity": "0.366", "Score": "17", "Upvotes": "17", "Downvotes": "0", "Wordcount": "262", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4dn8il", "Reddit_id": "d4dshoj", "Subreddit_id": "t5_2rxrw", "Commenter": "AGVann", "length": "1478", "content_scrubbed": "The reason why it[.] commonly held belief that Liberal Arts are worthless is because it[.] not a job based degree. There[.] probably a more accurate term for it, but what I mean is that with a degree in Engineering or Medicine, you know exactly what kind of job you will get because you essentially trained 4+ years for it.\n\nA Liberal Arts degree does not function like that, with the exception of a few like Film Studies which naturally lends itself towards working in film. The 'continuity' for something like Math or Sociology would be to work in research or teaching, as you have mentioned.\n\nHowever, a degree based around critical thinking such as Philosophy and History have great ancillary value, because it[.] an indicator to your potential employer that you have good writing and critical thinking skills - you don't just understand *what* to think, but *how* to think. As you said, it[.] a good way to get noticed. It[.] a foot into the door for internships with big companies of all kinds. \n\nFor example, in my city, the local branches of the Big Four accountancy firms offer scholarships to history_major. Our professors do regularly pass on the message that the Big Four encourage us to apply for internships with them, as they weigh the value of a history degree highly. I know History graduates that have gone on to work there, which is basically a dream job if you're after the $$$\n\nTL;DR - It[.] a good way to get noticed, and you have to make your own opportunities."}