{"doc_id": "109", "name": "2016_06_humanities_student_major_1116_lostgeneration", "namespace": "we1sv2.0", "metapath": "", "pub": "lostgeneration", "title": "2016-06-humanities-student-major_1116_lostgeneration.txt", "pub_date": "2016-06-15T00:00:00Z", "Sentiment": "0.026", "Subjectivity": "0.283", "Score": "13", "Upvotes": "13", "Downvotes": "0", "Wordcount": "327", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4b7noy", "Reddit_id": "d4b8zrr", "Subreddit_id": "t5_2r40j", "Commenter": "usesunblock", "length": "1750", "content_scrubbed": "Man, that shit is just harsh.  I'm the oldest kid in my family.  My parents told me they'd pay for my college only if I went directly after high school.  I asked them if I could just work for 2 years and go to college after because I didn't know what I wanted to do.\n\nThey flat out refused.  They called me a spoiled, worthless brat and said that if I didn't go immediately, they wouldn't pay a dime.  (Looking back, it was probably a status thing or something... like keeping up appearances for the Joneses)  But I didn't see many options, so I applied to 3 colleges, picked the one I liked the most, picked a major I was somewhat interested in, and just cranked out 4 years of book learning.\n\nI didn't ever stop to check job boards.  Or really look past what my professors were telling me.  A fun fact is that at liberal_arts colleges, there[.] a sort of echo chamber where it makes it seem like everyone[.] going to be getting a great job post-college.  Anyways, I chose Communications and Business.  Recession started the year before I finished.  Graduated.\n\nI work customer service stints now on a yearly basis.  They're contracts that last a year, and then end so that I don't become permanent or get benefits.  I then go on UI for 6 months or until I find the next 1 year contract.  I've tried everything to get an office assistant, marketing manager, or advertising job.  I guess just a degree isn't good enough for those jobs.\n\nI haven't spoken with my parents since I graduated college.  I moved out and I support myself completely on my own.  It[.] a struggle when you can only afford $5 worth of food a day.  Shit sucks and I wish I had made better career choices in college.  But the fact is that I did a lot of dumb stuff when I was 18-22."}