{"doc_id": "1957", "name": "2016_08_humanities_student_major_1114_stoicism", "namespace": "we1sv2.0", "metapath": "", "pub": "Stoicism", "title": "2016-08-humanities-student-major_1114_Stoicism.txt", "pub_date": "2016-08-16T00:00:00Z", "Sentiment": "0.033", "Subjectivity": "0.226", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "461", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4xxaz2", "Reddit_id": "d6jw3j6", "Subreddit_id": "t5_2r4kq", "Commenter": "pineappletrauma", "length": "2827", "content_scrubbed": "Stoic philosophy was a major strain of classical education, through the Middle Ages and into the 19th Century. If you had a latin-based education in the 1800s, even in the US, you would've had a healthy dose of stoic ideas--from Seneca, Cicero, Boethius, Thomas a Kempis' Imitation of Christ, Shakespeare, etc.\n\nEducation (at the least in the US) underwent major modernization in the 20th Century and the latin based, classical text, Great Books tradition was traded in for study of modern science, sociology, psychology, etc. Philosophy worked on trying to figure out its relationship to science. The big questions of academia were related to science, technology, and the application of their concepts to all other disciplines.\n\nClassical Aristotelianism died out for the same reason.\n\nIs it coming back? I'm not sure. But I think there are basically three kinds of people who are into stoicism:\n\n**Classical lovers** - The Tolkien, C. S. Lewis crowd. People who dream of spending their days in Oxford, nose stuck in a book. People who want philosophy to be about Plato, Aristotle. Humanities folks. People who want to live according to the broad humanist tradition, pre-20th Century. William Irvine[.] audience is clearly here. \n\nThe main criticism of others towards these people is that they are often too strict in their definitions and that they don't adapt enough to modern sensibilities. They are stereotypically the pedantic people who think you can't be a stoic unless you accept the traditional stoic metaphysics.\n\n**Life hackers** - It used to be called \"self help\" - now it[.] called \"life hacking.\" Fitbit, quantifiable self People who take a pseudo-scientific, hyper-pragmatic approach to life. 5-Hour Workweek folks who want to achieve success. Type B people trying to be Type A. Type A people trying to be Type A+. Ryan Holiday[.] core audience is clearly here. \n\nThe main criticism towards these people from others is that they use the tools of stoicism but they disregard the ends/aims/objectives of stoicism. Based on the way they talk about stoicism, Hitler could be a stoic, since ultimate virtues are secondary to success (which is defined however you want it).\n\n**New Atheists** - There[.] a very small but high visible group of people who have \"come out\" as atheists and are looking for a kind of positive vision of atheism (rather than just being non-theist) that has some kind of values and prescriptive ethics without appeal to religion. \n\nThere[.] not a lot of criticism of these folks. However, there[.] a long tradition of stoic influence on Christianity, and stoicism is compatible with a variety of religions, it seems like. It[.] not an atheistic philosophy *per se*, and in my opinion you have to strain to read Marcus Aurelius' Meditations as atheistic. It seems pretty devotional and spiritual to me."}