{"doc_id": "1990", "name": "2016_08_humanities_student_major_1382_cfb", "namespace": "we1sv2.0", "metapath": "", "pub": "CFB", "title": "2016-08-humanities-student-major_1382_CFB.txt", "pub_date": "2016-08-19T00:00:00Z", "Sentiment": "0.021", "Subjectivity": "0.192", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "242", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4yjmyi", "Reddit_id": "d6o75yv", "Subreddit_id": "t5_2qm9d", "Commenter": "MrTheSpork", "length": "1788", "content_scrubbed": "The entirety of campus. [Nippert[.] kinda embedded in the middle of everything.](http://www. aashe. org/files/resources/campus_awards/UC%20aerial_0. jpg)\n\n[Second view (looking north).](http://magazine. uc. edu/issues/0310/thenandnow/_jcr_content/MainContent/textimage_9/image. img. jpg/1291129856959. jpg)\n\nTo the south/east of the stadium are the various other athletic facilities: the Lindner Center with the triangular windows houses the athletic offices and its design has been incorporated into the football uniform recently; Fifth Third Arena, our basketball arena, is directly to the east of the Lindner Center; just south of Fifth Third is Marge Schott Stadium (yes, *that* Marge Schott) for baseball and softball. Further south are the Trabert-Talbert Tennis Center, Sheakley Lawn (between the tennis courts and the baseball stadium), and Cincy soccer[.] Gettler Stadium.\n\nNorthwards are two dining facilities and the gym/rec center, creatively called the Campus Recreation Center, in the curved building that[.] not quite over Nippert. Slightly further north from that is Steger Student Life Center, which houses mostly club and organization offices, plus some study areas (it also has one of the cooler views of campus that[.] always deserted for some reason). North from there are Baldwin, Rhodes, Old Chemistry, and Swift Halls, which collectively house math, science, engineering, and some humanities. \n\nEast is mostly taken up the the student union Tangeman University Center, which is a slightly small but fairly typical student union. It houses Catskeller, our on-campus pub and beer bar.\n\nSouthwest is the majority of the buildings for the College-Conservatory of Music, Cincy[.] performing arts college, which includes various dance studios, stages, performance areas, and similar."}