{"doc_id": "130", "name": "2016_06_humanities_student_major_1258_socialism", "namespace": "we1sv2.0", "metapath": "", "pub": "socialism", "title": "2016-06-humanities-student-major_1258_socialism.txt", "pub_date": "2016-06-18T00:00:00Z", "Sentiment": "0.11", "Subjectivity": "0.369", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "298", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4e8o3x", "Reddit_id": "d4eh7ar", "Subreddit_id": "t5_2qjii", "Commenter": "arjun101", "length": "2115", "content_scrubbed": "I am pretty sure the author agrees with you on the point that identity politics is rooted in the fact that capitalism is at the root of the racial and gender divisions, and that different groups experience this division and its associated oppressions on different levels and on different ways.  He is very clearly against a *specific* kind of identity politics, what he sees as a repetition of the kind of reactionary cultural nationalism that gained some prominence during the '50s and '60s, in opposition to the Marxian \"revolutionary intercommunalism\" of the Black Panther Party.\n\nIn the unusual context of Santa Cruz, where the black power movement is invoked as part of a historical pantheon, the comparison to reactionary, cultural nationalism was surprisingly effective. For all the postmodern glitter of identity politics, its on-the-ground organizational effect had amounted to separatism and depoliticization, the defense of conservative politics in the name of racial unity. The line of demarcation that the Black Panthers drew between reactionary cultural nationalism and their own \"revolutionary nationalism\" seemed useful to recall. I wrote many angry emails to the activist listservs, and commented in one: \"I am addressing fellow activists of color: we cannot let reactionary nationalists speak for us, and we need to start reclaiming the legacy of revolutionary anti-racist movements.\"\n \nNow, how prominent the actual \"opportunistic\" and \"class collaborationist\" elements of identity politics are today is of course up for debate; the author seems to be writing on things specific to UC Santa Cruz[.] student politics, in conjunction with [other radical students of color](https://educationshouldbefree. wordpress. com/2014/11/26/a-letter-from-students-and-workers-of-color-in-the-takeover-of-humanities-2/) who are observing similar reactionary dynamics--specifically, one where identitarian critiques of a radical autonomist occupation of a building, coming from people linked with the University administration, silenced and erased the organizing of radical POC activists who lead the occupation.  "}