{"doc_id": "1932", "name": "2016_08_humanities_student_major_846_scotland", "namespace": "we1sv2.0", "metapath": "", "pub": "Scotland", "title": "2016-08-humanities-student-major_846_Scotland.txt", "pub_date": "2016-08-13T00:00:00Z", "Sentiment": "0.205", "Subjectivity": "0.469", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "306", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4xh44z", "Reddit_id": "d6fq97q", "Subreddit_id": "t5_2qkli", "Commenter": "cruachanmor", "length": "1737", "content_scrubbed": "I must admit I'm impressed by this.\n\nThere is a gender issue, as an older IT person who remembers how development teams used to be more like 30% female back in the 80s and are nowadays a female is a rarity and that[.] wrong and rather boring, I do agree with the SJWs that there is a gender issue in STEM.  However addressing this goes hand in hand with addressing the considerable female over-representation in the humanities and the teaching profession, and the fact that you hardly ever hear the vast majority of feminists or politicians complaining about this as opposed to female under representation in STEM just confirms my suspicions that that sort of feminism is deeply sexist.\n\nWe need to encourage more women into STEM, encourage more boys into the humanities, encourage more women to consider other career paths then university, encourage more boys to consider university, and generally adopt a gender neutral attitude to *all* professions, careers and courses where physicality doesn't matter (that is your deep sea fishing and the like). \n\nI think the jury is still out as to if there is an inbuilt natural gender bias for certain areas - coding for example - but the fact that 25 years ago I worked with many women coders who were every bit as good as the men and nowadays that[.] an extreme rarity says there is a societal problem.  Similarly with the fact that when I was at school a third of my primary teachers were men and about half at secondary, whereas my children were taught wholly by women at primary and 80% by women at secondary is also an issue that can't be separated.  At least this article indicates a more holistic thinking rather than the frankly sexist emphasis on women and STEM we see most of the time."}