{"doc_id": "1949", "name": "2016_08_humanities_student_major_1027_mcat", "namespace": "we1sv2.0", "metapath": "", "pub": "Mcat", "title": "2016-08-humanities-student-major_1027_Mcat.txt", "pub_date": "2016-08-15T00:00:00Z", "Sentiment": "0.087", "Subjectivity": "0.281", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "533", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4xv34w", "Reddit_id": "d6imsfp", "Subreddit_id": "t5_2saxp", "Commenter": "Aceboogieie", "length": "3350", "content_scrubbed": "We must first make a distinction between literature and literary study. The two are distinct activities: One is creative, an art; the other, if not precisely a science, is a species of knowledge or of learning. There have been attempts, of course, to obliterate this distinction. For instance, it has been argued that one cannot understand literature unless one writes it, that one cannot and should not study Pope without trying one[.] own hand at heroic couplets or an Elizabethan drama without writing a drama in blank verse.\n \nYet useful as the experience of literary creation is, the task of the student is completely distinct. The student must translate the experience of literature into intellectual terms, assimilate it to a coherent scheme which must be rational if it is to be knowledge. It may be true that the subject matter is irrational, or at least contains strongly unrational elements; but the student of literature will not be therefore in any other position than the historian of painting or the musicologist or, for that matter, the sociologist or the anatomist. . . . \n \nThe problem is one of how intellectually to deal with art, and with literary art specifically. Can it be done? And how can it be done? One answer has been: It can be done with the methods developed by the natural sciences, which need only be transferred to the study of literature. Several kinds of such transfer can be distinguished. One is the attempt to emulate the general scientific ideals of objectivity, impersonality, and certainty, an attempt which on the whole supports the collecting of neutral facts. Another is the effort to imitate the methods of natural science through the study of causal antecedents and origins. . . . Scientific causality is used to explain literary phenomena by the assignment of determining causes to economic, social, and political conditions. Again, there is the introduction of the quantitative methods appropriately used in some sciences—i. e., statistics, charts, and graphs. And finally there is the attempt to use biological concepts in the tracing of the evolution of literature. \n \nToday there would be almost general recognition that this transfer has not fulfilled the expectations with which it was made originally. . . . There is, no doubt, a large field in which the methodologies of science and literary study contact or even overlap. Such fundamental methods as induction and deduction, analysis, synthesis, and comparison are common to all types of systematic knowledge. But patently the other solution commends itself: Literary scholarship has its own valid methods, which are not always those of the natural sciences but are nevertheless intellectual methods. \n \nOnly a very narrow conception of truth can exclude the achievements of the humanities from the realm of knowledge. Long before modern scientific development, philosophy, history, jurisprudence, theology, and even philology had worked out valid methods of knowing. Their achievements may have become obscured by the theoretical and practical triumphs of the modern physical sciences, but they are nevertheless real and permanent and can, sometimes with some modifications, easily be resuscitated or renovated. It should be simply recognized that there is this difference between the methods and aims of the natural sciences and the humanities"}