{"doc_id": "186", "name": "2016_06_humanities_student_major_1753_fullcommunism", "namespace": "we1sv2.0", "metapath": "", "pub": "FULLCOMMUNISM", "title": "2016-06-humanities-student-major_1753_FULLCOMMUNISM.txt", "pub_date": "2016-06-24T00:00:00Z", "Sentiment": "0.004", "Subjectivity": "0.235", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "904", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4mqrde", "Reddit_id": "d4mxpak", "Subreddit_id": "t5_2w5yw", "Commenter": "Chicomoztoc", "length": "5876", "content_scrubbed": "Are you out of your god damn mind??? you think the education provided by the SEP and SNTE is going to be one of class consciousness?? I think you're mixing the CNTE and the SNTE here... if there[.] a union that[.] class conscious is the fucking CNTE along with the Normal Rural schools, both of which are the main victims of the reforms... not to mention the neoliberal aspects of the reforms, CNTE it[.] fighting the further privatization of our educational system. I can't honestly comprehend what the hell are you doing on this sub. You're basically vomiting what the SNTE and the mexican neoliberal government has said about the CNTE and the protests to undermine them.\n\n[The Zapatistas fully support this protests and the CNTE, that should tell you enough.](http://enlacezapatista. ezln. org. mx/2016/06/21/from-within-the-storm-joint-communique-from-the-national-indigenous-congress-and-the-ezln-on-the-cowardly-police-attack-against-the-national-coordinating-committee-of-education-workers-and-the-indige/)\n\nThe resistance movement against the education reform has become a mirror for more and more people-people (meaning, not social and political organizations, but ordinary people). It is as if the resistance has awoken a collective sense of urgency in the face of the coming tragedy. It is as if every swing of a police baton, every canister of tear gas, every rubber bullet, and every arrest warrant were eloquent slogans: \"today I attack her, him; tomorrow I'm coming for you.\" Perhaps that is why, behind every teacher there are entire families that sympathize with their cause and their struggle.\n\n[source](http://enlacezapatista. ezln. org. mx/2016/06/20/notes-on-the-war-against-the-teachers-in-resistance-the-hour-of-the-police-3/)\n\nBut it turns out that it is Chiapas. And in Chiapas, we see...\n\nTuxtla Gutierrez, the capital city. May, 2016. Average temperature: 37 degrees [Celsius] in the shade. Altitude: 522 meters above sea level. Date: May of the teachers in resistance and rebellion. But before we go further, allow me a few corrections:\n\n1. The poorly named \"education reform\" is not about education but rather about labor. If it were about education it would have taken into consideration the perspective of teachers and families. When the government refuses to dialogue about the reform with teachers and families, it is acknowledging that this is not about improving education, but about \"payroll adjustment\" (which is how capital refers to firings).\n\n2. The law isn't being applied, it is being violated. Those who say they are defending the constitution (through the educational reform) are violating the constitution (the laws that guarantee basic rights such as gathering, petition, and free movement).\n\n3. What the paid mass media are doing is useless. They declare back and forth: \"everything running normally,\" \"the majority of schools are still functioning,\" \"over 90 percent of teachers are working.\" But there is no referent in reality for these declarations, because the teachers are in the streets. In the villages the families already said clearly that they will not accept substitute teachers, that they won't let them in or will run them off.\n\n4. The teachers aren't defending their privileges, they are fighting in the last trench any human being has: for the minimal life conditions for them and their families. Are you surprised that someone is willing to defend the little they have left? A despicable salary, a few classrooms that look like they have been bombed (and they have been, but by economic bombs), not one but multiple work shifts, excessively large classes? In sum: little pay, bad working conditions, and a shitload of work. Sound familiar? And yet, the teachers show up at their schools and teach the little boys and girls the ways of the arts and sciences.\n\n5. The objective of the supposed education reform is to destroy those teachers who prepared for years and dedicated practically their whole lives to this profession. Of course, due to the perseverance of the media, which gets bonuses for their trouble, the teachers' movement has been given the image of corrupt leaders. But this image is just a decoy, an attempt to get people to take the bait. The objective [of the reform] is not the leaders, but all of the teachers, including the servile National Education Workers Union [SNTE]. Now, if you want a model of corrupt leaders, you have the leadership of the SNTE.\n\n6. Yes, the objective of the education reform is to privatize education. In fact, this privatization is already in process. The attempt to abandon and defund the schools didn't finish off public education in Mexico for one reason: the teachers. So now the teachers must be destroyed. They [the government] are trying to provoke a catastrophe in the education system such that families turn to private schools, working double shifts to pay for tuition, or resort to raising their daughters and sons on television, radio, and digital media, or in the street, or not even that. The teaching profession is not improvisational, nor is it a question of intuition. It requires study, preparation. Not just anyone has the capacity and the knowledge to educate. Because in school students are educated, not just taught. Not just anyone can successfully take on a group of school-age or preschool-age children. That is why the Escuelas Normales [Teachers' Colleges] are necessary.\n\n7. Have you been told that what[.] going on is that the teachers are lazy and don't want to study? That[.] a lie, any teacher wants to be better, better prepared and better trained. Do yourself what the government hasn't done: talk to a teacher. Even better, listen to them. You will see that when they talk about their situation, it will seem like they are describing yours.\n\n[source](http://enlacezapatista. ezln. org. mx/2016/06/01/may-between-authoritarianism-and-resistance/)"}