{"doc_id": "1933", "name": "2016_08_humanities_student_major_848_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2016-08-humanities-student-major_848_politics.txt", "pub_date": "2016-08-13T00:00:00Z", "Sentiment": "-0.011", "Subjectivity": "0.374", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "769", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6frqgf", "Reddit_id": "d6fucpr", "Subreddit_id": "t5_2cneq", "Commenter": "mrducky78", "length": "5237", "content_scrubbed": "https://ratical. org/ratville/CAH/fasci14chars. html\n\nThis is from Dr. Lawrence Britt who wrote out the hallmarks of fascism in 2003.\n\nThere are other definitions as can be read [here on the wikipage](https://en. wikipedia. org/wiki/Definitions_of_fascism). Full disclosure, I just went with the first google result and copy pasted it, but you will find most \"definitions\" and hallmarks of fascism are very similar. While Trump doesnt fit some of them, he just ticks many of them so fucking hard. Harder than any other US politician. Shit like emphasis on national security, scapegoating muslims/hispanics, strong nationalism, erosion of human rights through shit like trying civilians in military courts in gitmo or the fact he is so pro waterboarding/targetting families of terrorists, he will be attending a christian conference with known extreme anti LGBT trend so he is trying to court that christian block hard, deregulation of wall street, disdain for the expert opinion in exchange for gut feeling and \"common sense\" (anti intellectualism), obsession with crime and punishment. The sad part is that some of it cant be applicable simply because no one has been dumb enough to give him a governing position before now.\n\n**Powerful and Continuing Nationalism**   \nFascist regimes tend to make constant use of patriotic mottos, slogans, symbols, songs, and other paraphernalia. Flags are seen everywhere, as are flag symbols on clothing and in public displays. \n\n**Disdain for the Recognition of Human Rights**    \nBecause of fear of enemies and the need for security, the people in fascist regimes are persuaded that human rights can be ignored in certain cases because of \"need.\" The people tend to look the other way or even approve of torture, summary executions, assassinations, long incarcerations of prisoners, etc. \n\n**Identification of Enemies/Scapegoats as a Unifying Cause**   \nThe people are rallied into a unifying patriotic frenzy over the need to eliminate a perceived common threat or foe: racial , ethnic or religious minorities; liberals; communists; socialists, terrorists, etc. \n\n**Supremacy of the Military**  \nEven when there are widespread domestic problems, the military is given a disproportionate amount of government funding, and the domestic agenda is neglected. Soldiers and military service are glamorized. \n\n**Rampant Sexism**  \nThe governments of fascist nations tend to be almost exclusively male-dominated. Under fascist regimes, traditional gender roles are made more rigid. Opposition to abortion is high, as is homophobia and anti-gay legislation and national policy. \n\n**Controlled Mass Media**  \nSometimes to media is directly controlled by the government, but in other cases, the media is indirectly controlled by government regulation, or sympathetic media spokespeople and executives. Censorship, especially in war time, is very common. \n\n**Obsession with National Security**  \nFear is used as a motivational tool by the government over the masses. \n\n**Religion and Government are Intertwined**   \nGovernments in fascist nations tend to use the most common religion in the nation as a tool to manipulate public opinion. Religious rhetoric and terminology is common from government leaders, even when the major tenets of the religion are diametrically opposed to the government[.] policies or actions. \n\n**Corporate Power is Protected**   \nThe industrial and business aristocracy of a fascist nation often are the ones who put the government leaders into power, creating a mutually beneficial business/government relationship and power elite. \n\n**Labor Power is Suppressed**  \nBecause the organizing power of labor is the only real threat to a fascist government, labor unions are either eliminated entirely, or are severely suppressed . \n\n**Disdain for Intellectuals and the Arts**  \nFascist nations tend to promote and tolerate open hostility to higher education, and academia. It is not uncommon for professors and other academics to be censored or even arrested. Free expression in the arts is openly attacked, and governments often refuse to fund the arts. \n\n**Obsession with Crime and Punishment**  \nUnder fascist regimes, the police are given almost limitless power to enforce laws. The people are often willing to overlook police abuses and even forego civil liberties in the name of patriotism. There is often a national police force with virtually unlimited power in fascist nations. \n\n**Rampant Cronyism and Corruption**  \nFascist regimes almost always are governed by groups of friends and associates who appoint each other to government positions and use governmental power and authority to protect their friends from accountability. It is not uncommon in fascist regimes for national resources and even treasures to be appropriated or even outright stolen by government leaders. \n\n**Fraudulent Elections**    \nSometimes elections in fascist nations are a complete sham. Other times elections are manipulated by smear campaigns against or even assassination of opposition candidates, use of legislation to control voting numbers or political district boundaries, and manipulation of the media. Fascist nations also typically use their judiciaries to manipulate or control elections.\n"}