{"doc_id": "61", "name": "2016_06_humanities_student_major_684_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2016-06-humanities-student-major_684_college.txt", "pub_date": "2016-06-08T00:00:00Z", "Sentiment": "0.131", "Subjectivity": "0.344", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "272", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4n72zc", "Reddit_id": "d41zpnv", "Subreddit_id": "t5_2qh3z", "Commenter": "FunkyFrenziedFresh", "length": "1574", "content_scrubbed": "I get your point, but there are some majors that almost require you to go to grad school to get a decent degree. Some of the posters below were saying how some STEM degrees don't necessarily promise you a job, like math/physics and all that theoretical stuff that is basically concrete, numerical philosophy.  If you go to grad school, you can do research. Some jobs it[.] just expected that to go anywhere, you have to do the investment and get a PhD. Another poster said below that this was the case with Environmental Science. This sounds bad, but college isn't what it used to be worth. If you're a pure science major, you need to go to grad school if you ever want to be close to guaranteeing a job. You have good prospects now, but they can be better, especially if you're not top of your class or have no internship experience because you didn't go out of your way to search for it.\n\nThose liberal_arts that can't be immediately applied after your bachelors, like political science of philosophy, need to understand that grad school or law school is the best route for them for career prospects.\n\nIt[.] not that they're worth less. I just think that the people studying them aren't as aware of grad school opportunities as much as science majors because we always hear about \"research universities\" in regards to scientific research. Especially large liberal_arts schools, there[.] research for anthropology, economics, philosophy. Not as much as STEM. But graduate school immediately add significant value to your degree. You got yourself the diploma, now invest in it."}