{"doc_id": "65", "name": "2016_06_humanities_student_major_719_videos", "namespace": "we1sv2.0", "metapath": "", "pub": "videos", "title": "2016-06-humanities-student-major_719_videos.txt", "pub_date": "2016-06-09T00:00:00Z", "Sentiment": "0.058", "Subjectivity": "0.366", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "326", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d42fs5k", "Reddit_id": "d42gvwa", "Subreddit_id": "t5_2qh1e", "Commenter": "MeineMeinungen", "length": "1844", "content_scrubbed": "Sure, I can't argue with that logic at all. I think an issue is assuming that one career is better than the other. Trade careers are not inherently better than careers in the arts. One may make more money, but money is not a measuring stick for every single person. Not everybody uses that specifically as the sign for success. Some of the greatest works of art came from people that were destitute and penniless when they were completed. At the time, people said the same things about them. \n\n\nMy problem with Rowe is that he uses arguments like these to drive anti-workers rights logic into people. He very much speaks about how you should force yourself into doing things you don't like or make you uncomfortable for the prospect of financial security. And who[.] to say that unfavorable jobs=vegetables? What if you never want a life that involves a shitty job? Is that person worse than somebody else? And how do we define a degree as worthless? Does it have to do with how much money people can make or what kind of education people get? Is that the purpose for college, simply job training? Is everything regarding your life supposed to connected to the economy? Is your worth decided simply by how many dollars you make somebody? Is living outside of the economy deemed as undesirable?\n\n\nAnd as a side note, I've known many, many people with \"useless\" and \"useful\" degrees get great jobs and careers, some that pay a lot some that don't. The secret? They typically were the better students that got more involved and went above and beyond. Vice versa. I've known just as many people with \"useless\" and \"useful\" degrees that have no prospects or awful careers they hate (including ones that pay them a shit-ton). Their secret? They typically did what it took to get by and had no interest in exploring outside of their main area of study."}