{"doc_id": "1924", "name": "2016_08_humanities_student_major_738_trueanime", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueAnime", "title": "2016-08-humanities-student-major_738_TrueAnime.txt", "pub_date": "2016-08-11T00:00:00Z", "Sentiment": "0.142", "Subjectivity": "0.423", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "592", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4x8zpk", "Reddit_id": "d6dqz3r", "Subreddit_id": "t5_2swc7", "Commenter": "NightWalpurgis", "length": "3370", "content_scrubbed": "**Gatchaman Crowd**\n\nI really like this show. I'm 8 episodes in at this point and will most likely finish it in short. Though, I won't continue on with Insights right of the bat.\n\nGatchaman, a term derived from the anime *Science Ninja Team Gatchaman*, typically refers to a five member-team of super heroes. I'm not especially familiar with that show, nor was I with its legacy, but I think that even without the prior knowledge, *Gatchaman Crowds* stands on its own legs.\n\nAt first glance it[.] about super heroes. Again, it[.] five heroes, with the newest member being Hajime, who[.] extremely fun to watch. Instead of relying on the simple format of introducing a new villain for them to defeat in each new episodes, much of the conflicts come from elsewhere. The world of *Gatchaman Crowds* inhabits the phone app Galaxy. Galaxy keeps problems from happening or getting worse by signalizing people in proximety to come and assist, essentially making even the most mundane of people heroes if their skills become necessary. [Spoilers Ep 1 - 8](/s \"even the main characters rely on it, making the show less about fighting aliens and more about prevent students from drinking bad milk. Yet, the show is able to pertain greater entertainment than what most other series could accomplish with grandeur action scnes of their own.\") I think one of the most admiring qualities of the show is a scenario brought up by one of the characters. [Rui[.] thought on the Gatchamen, and the Heroes of the show](/s Rui visualizes a world where everyone helps anyone; their skills are put into use for the exact moment, exactly what the objective of Galaxy is. But introducing the Gatchamen into the mix would mean that people could possibly start to rely on them instead of accomplishing things of their. It was a possibility I never thought of before, and even though I think Rui[.] beliefs aren't exactly flawless, he still brings up a good point. It feels like such a scenario isn't impossible in the world of the show. Even some of the main characters appear lethargic in terms of being heroic. Hajime is glad and cheerfull, but can't take things seriously enough and is therefor not the most reliable. The leader of the group, Paiman, is a coward, who at one point escaped from a battle.\")\n\nTo keep things short, *Gatchaman Crowd* isn't the typical show about super heroes.\n\n**Ping Pong: The Animation**\n\nThis show was a treat. It really felt way shorter than what it was.\n\nIt[.] less about ping pong and instead uses the sport as a backdrop for the characters to be displayed at. Each character has their own motives for competing, why they want to win, and why they're playing in the first place. I think Kong was my favorite of the cast, and I would have love to see more of him interacting with his team and the rest of the characters.\n\nI have my gripes with the show, however. While I don't mind the artstyle too much (it is expressive and a breath of fresh air in comparison to most common animes) but the animation felt sluggish at times. I know it[.] an unfair comparison, but *Tekkonkinkreet* adapted the same artstyle and refined it. But that was a movie, however; and I don't think anyone can doubt the difference in budget. But that was one small flaw of a great series. Seriously, it[.] difficult for me to think of anything else that rubbed me the wrong way with the show."}