{"doc_id": "1982", "name": "2016_08_humanities_student_major_1312_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2016-08-humanities-student-major_1312_AskHistorians.txt", "pub_date": "2016-08-18T00:00:00Z", "Sentiment": "0.11", "Subjectivity": "0.411", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "855", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4ycy6t", "Reddit_id": "d6muhjx", "Subreddit_id": "t5_2ssp3", "Commenter": "alriclofgar", "length": "5239", "content_scrubbed": "My brother just got his CPA. I've almost completed my PhD in history. As you suspect: very different career paths! If you like filing your taxes, and want to do it 500 more times every spring than you currently get to, and really enjoy counting and making things add up, accounting is a great choice. If you go corporate, you might work with one company[.] books, and some folks manage to land a job where they get to do audits. But it all boils down to 1) lots of adding up numbers, 2) knowing the rules and regulations specific to whatever you specialize in, and 3) interacting with clients.\n\nI personally think teaching and researching history is far more fun - you get to talk tk students, read until your eyes go bad, grade papers and suggest ways for students to inprove (and if you design your courses well, some of them actually will listen), and share your enthusiasm. You also get to find something you love and study it until you know it better than you know your own partner/spouse.\n\nBut history PhDs (and this goes for anthro and other similar disciplines in the humanities as well) have a lot of shit piled on, too. The job market is hideous - about half of PhDs get full time jobs in academia (the rest usually get good jobs, but not necessarily teaching or doing research). And getting that university job is a soul-crushing process: you're usually up against 150+ applicants for the same position, probably at least 20-30 of whom are perfect fits. Half the available jobs go to ivy league graduates, and the other hundreds of grad programs across the country fight for the other 50% of positions. It[.] common to bounce from poorly paid short-term contract to contract for several years before you land anything permanent. And half of people never get anything permanent. Do a google search for 'adjunct crisis' and read the articles that come up - it[.] bad.\n\nGrad school isn't a cakewalk, either. You work long hours (50-60 hours / week often), are paid near poverty wages (some of us, though not myself personally, make little enough to qualify for food stamps), are more likely to be diagnosed with mental health problems, will struggle to find time for a family, and will watch all your friends from college have kids and buy houses and save for retirement while you live paycheck to paycheck. And you'll do this for the first decade of your post-college life - grad degrees in history, anthro, etc take about 10 years to complete on average.\n\nDuring these years, you'll be competing for funding - usually, your department will cover the first five years +/- a few, but you'll need to travel for archives, which means spending weeks or months writing grant applications. It[.] good preparation for the heartbreak of going onto the job market.\n\nThat[.] the negatives.\n\nIn the end, I am happy with my choice despite all this. My work is satisfying, and as long as I don't think about the fact that my brother[.] net worth is twice mine and rapidly growing (he graduated from college 1. 5 years ago, and I'm married and have been out for six!), I don't have regrets. I've gotten some big grants and fellowships, and that[.] allowed me to make three trips to the UK to do my research (one of which lasted 10 months). I've taught some amazing students. I've published research that I'm proud of, and read a lot of really cool books and seen some awesome archaeological artefacts at the museums where I've conducted my research. And I've managed to stay married and, for the most part, found enough time to stay human and stay friends with my spouse. But I might be unemployed this time next year, as I'm currently entering the job market - my tune may change then. (That said: 3/3 of the PhDs who just finished at my department are now professors, two of them tenure track and one on a three-year stint, ie good jobs.)\n\nDon't set your heart on being a professor - those jobs are hard for the best of us to land. But it is possible to enjoy graduate-level work in history, and if you keep your options open, there are a lot of jobs outside academia that will employ trained history researchers.\n\n---\n\nEdit: I should add, getting a history *BA* is a pretty good choice, in terms of career prospects. history_major - and graduates with humanities degrees in general (history, anthropology, english, etc) - tend to do well in the longterm, in part because the humanities teaches you to be flexible and creative in the way a vocation-focused major like accounting doesn't necessarily. Forbes [has](http://www. forbes. com/sites/georgeanders/2015/07/29/liberal_arts-degree-tech/#536c23b75a75) had [a few](http://www. forbes. com/forbes/welcome/?toURL=http://www. forbes. com/sites/jeffreydorfman/2014/11/20/surprise-humanities-degrees-provide-great-return-on-investment/&refURL=https://www. google. com/&referrer=https://www. google. com/) articles [on this](http://www. forbes. com/sites/susanadams/2015/11/25/top-degrees-for-getting-hired-in-2016/#4f9f09686d48) over the past few years that you might want to read as a jumping off point to learn more about why 'getting a job' and doing someting you love aren't necessarily at odds with one another. (Accounting, of course, is the safest choice - but a humanities BA isn't a bad option.)"}