{"doc_id": "2020", "name": "2016_08_humanities_student_major_1698_sjwhate", "namespace": "we1sv2.0", "metapath": "", "pub": "sjwhate", "title": "2016-08-humanities-student-major_1698_sjwhate.txt", "pub_date": "2016-08-23T00:00:00Z", "Sentiment": "0.129", "Subjectivity": "0.482", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "280", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4z75k6", "Reddit_id": "d6u386d", "Subreddit_id": "t5_33qxt", "Commenter": "TFWnoLTR", "length": "1665", "content_scrubbed": "The reason you don't find many right-leaning culture commentaries is mostly because most liberal_arts students, who would end up in a line of work where they discuss culture professionally, lean to the_left.  Those who have the time of day to pick apart and study culture to the point of being considered an expert usually fit the same demographic as an SJW: economically privileged, self-entitled, and of a collectivist mindset.  \n\nThose of us with an individualist point of view are more likely to give up or change majors when pursuing a liberal_arts degrees (this happened to me) because of the overbearing collectivism and leftist slant in that branch of academia.  \n\nOn top of all that the kind of demographics who are most likely to have an interest in cultural commentary are the same demographics likely to lean left.  Younger single women, ugly/fat women without children, hipsters, young ignorant rich kids angry with their parents, snooty sexual deviants, and pretty much any non-religious adult dependant who can afford to travel. \n\nThose of us interested in culture but of an individualist mindset are more likely to express that interest by trying to experience and/or participate in culture directly, rather than just read or write about it.  As someone who grew up with a lot of Mexican friends and having visited Mexico several times, I feel more compelled to make recommendations to people on how to experience the culture themselves, rather than try to describe it to them.\n\nI'm a bit drunk and on mobile so I hope thus makes some sense.\n\nEdit: just adding that you'll find more commentary with a slant to the_right in books, rather than online."}