{"doc_id": "1965", "name": "2016_08_humanities_student_major_1165_futurology", "namespace": "we1sv2.0", "metapath": "", "pub": "Futurology", "title": "2016-08-humanities-student-major_1165_Futurology.txt", "pub_date": "2016-08-16T00:00:00Z", "Sentiment": "0.005", "Subjectivity": "0.3", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "311", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4y35dx", "Reddit_id": "d6km2uf", "Subreddit_id": "t5_2t7no", "Commenter": "Brru", "length": "1746", "content_scrubbed": "1.) You assume every other being in the Universe capable of gaining societal status and singularity are divided like we are. Nationalism, Racism, Sexism, etc. could all be completely human ideas. We have no real idea why they exist.\n\n2.) We are a consumption based capitalist society, today. We may not be in the future. We may need a world war to get out of this or something worse, but all hope is not entirely lost. I, personally, believe it is our greed that causes what you've explained. Yes it is likely billionaires will attempt to horde any reference of singularity, but I doubt they will get away with it. Because...\n\n3.) Billionaires don't know shit. They understand money and the financial system presented to us as far as they need to for their businesses or investments to work, but they hire out for everything else. There would have to be a very large group of people suppressing information to make singularity a problem in the way you describe. 10 System Admins could seriously mess up some billionaires god like powers with a simple rm -rf / command.\n\n4.) I feel it would be more likely they would force all the plebes into the singularity (think concentration camps) so they could inherit the earth for their own needs. This, however, is assuming the earth is what they desire. Which is the last problem. We are both assuming we know the desires of individuals we've never met.\n\n\nThere are a lot of potential \"events\" on humanities horizon that we can see. One of those might be total annihilation or maybe harmony with A. I. or maybe singularity. No matter what it is going to be a struggle and people will fight over it, but humans have a tendency to suddenly realize they are a majority and rise up at the damnedest of times."}