{"doc_id": "55", "name": "2016_06_humanities_student_major_627_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2016-06-humanities-student-major_627_changemyview.txt", "pub_date": "2016-06-08T00:00:00Z", "Sentiment": "0.134", "Subjectivity": "0.399", "Score": "30", "Upvotes": "30", "Downvotes": "0", "Wordcount": "631", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4n56if", "Reddit_id": "d413m9k", "Subreddit_id": "t5_2w2s8", "Commenter": "Salanmander", "length": "3760", "content_scrubbed": "Hi, I'm a high school teacher. I definitely agree with some of your points (like, for example, that the long hours and the long breaks roughly wash out to be similar to other salaried full-time jobs). There are a couple things I would like to speak to. I'm going to talk about it as it relates to secondary school teachers, since that[.] what I'm familiar with. I can't say too much about primary school teachers, other than that those people have *extraordinarily* difficult and important jobs.\n\n They make a lot less than other people with college degrees.\n\nYou talk about education degrees and humanities degrees being on the easy side. Most teachers have a degree in their field of expertise *and also* 1-2 years of education beyond college that is specifically about education. This doesn't just mean we should be comparing them to people with college degrees, we should be comparing them to people with masters degrees. Furthermore, for teachers in technical fields, comparing them to engineer salaries is *absolutely* appropriate. Many math/science/technology teachers actually literally spend part of their career as teachers and part of their career as professional engineers. Now, the fact that it[.] typical for teachers to be paid the same regardless of their field makes this a weird place to argue from, but don't forget that many many teachers are sacrificing a *lot* of earning potential for their level of education. This is especially true for math and science teachers, which is (not entirely coincidentally) where the biggest demand for teachers is right now. For example, I have a master[.] degree in robotics and an equivalent in units of another master[.] degree (albeit an easier one) to get my teaching certification. If I'd gone into industry I have no doubt that I would be earning literally double my current salary. (My partner, who spent a similar amount of time in school and is a working engineer now, *is* earning literally double my current salary, so I'm not just throwing ideas around.)\n\n If we paid more, we'd get better teachers. \n\nYou bring up a really good point that we might get *more* teachers but not *better* teachers. I think that[.] probably true short term. When I was working on my teaching credential I asked one of my instructors if people had tried taking the influxes of cash that get used for overhauling under-performing schools, and simply using it to reduce classroom sizes by hiring more teachers. She said that yes, it has been tried, and it didn't work particularly well because when they hired more teachers, the average quality of the teachers dropped. (Basically, they had to scrape the bottom of the barrel.)\n\nHowever, there[.] a deeper thing to consider here, and that is the general culture surrounding teaching in this country. Often times teaching is viewed as a backup profession. Teacher training in many places is hit-or-miss, and the certifications can be gotten by showing significant effort and any level of competence above \"abysmal\". I get asked at least once a year by my students \"why are you teaching when you could be doing something else?\" Basically, there[.] not a lot of respect for teaching as a profession. Sure, we get the respect of \"oh, you're so good for contributing to society\", like you would get for joining the peace corps, but we don't get the respect of \"wow, that[.] an impressive job\", like you would get for being a lawyer or a roboticist or a fighter pilot.\n\nIncreasing the professional respect for teachers in our society would definitely, gradually, lead to an increase in the quality of teachers, as more people start to consider it seriously as a primary choice. And increasing pay for teachers would be a significant step in increasing respect for the profession."}