{"doc_id": "1895", "name": "2016_08_humanities_student_major_519_kotakuinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "KotakuInAction", "title": "2016-08-humanities-student-major_519_KotakuInAction.txt", "pub_date": "2016-08-09T00:00:00Z", "Sentiment": "0.079", "Subjectivity": "0.38", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "316", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d69x2wc", "Reddit_id": "d6a86ol", "Subreddit_id": "t5_33726", "Commenter": "YetAnotherCommenter", "length": "1875", "content_scrubbed": "All you have to do is say something about how you were discouraged because misogyny when you were young from taking an interest in the early developmental things that make STEM easier when you are older(thinking math is cool at 10 and reading calculus books for fun will make pretty much all STEM fields easier when you're in college). Since you didn't feel you had the opportunity to gain competence in the field starting this late in life you want to prevent that from happening to anyone else.\n\nThis has actually been shown to generally be the case (except for the \"misogyny\" part, at least to some extent). To get STEM degrees requires a STEM focus in high school education, and most female students take arts/humanities/social_sciences. \n\nAnd let us face it; our society generally does encourage women to go for that kind of study (or at the very least, does not discourage women away from those fields). For one, due to the whole \"socially acceptable to be a dependent partner\" thing, they don't *need* to study a massively profitable field. For two, our society generally does see STEM as unfeminine, which pushes at least some women away from the field. \n\nThat said, women play a part in this too. A recent study showed that when surrounded by 'nerd' paraphernalia (Star Trek posters etc), women are likely to demonstrate less of an interest in STEM than when they are placed in a more neutral classroom environment. A plausible interpretation of this is that nerdiness repels most women away from things associated with it. \n\nIn addition, there are parts of STEM (particularly in the biological fields) that are female-dominated. \n\nBasically, if you want more women in STEM you need to start by promoting STEM to high school girls. By the time they're in college and studying English Lit or (even worse) Communications/Oppression Studies/etc, its generally too late."}