{"doc_id": "1880", "name": "2016_08_humanities_student_major_384_debateachristian", "namespace": "we1sv2.0", "metapath": "", "pub": "DebateAChristian", "title": "2016-08-humanities-student-major_384_DebateAChristian.txt", "pub_date": "2016-08-06T00:00:00Z", "Sentiment": "0.164", "Subjectivity": "0.434", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "226", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6680wu", "Reddit_id": "d671y1d", "Subreddit_id": "t5_2ryd5", "Commenter": "frijoles_refritos", "length": "1742", "content_scrubbed": " could you elaborate on the \"surprisingly intelligent\" point? \n\nSure, at least I'll try.  I guess, its philosophical deep rootedness.  Also its conception of God as the non-contingent ground and source of all being.  (As opposed to the modern conception of God as some kind of Zeuss×10 sky-daddy) \nIts historical patronage of both natural science and the arts.  Its continuing emphasis on learning, philosophy, and asking and answering questions, and its continuing comfortable and amicable relationship with science. Its many rather major ethical/moral contributions to our cultural landscape.  Its continuing emphasis on charity, beauty, and self-sacrificing love.  Its profound hermitic and monastic traditions.   And its surprising coherence and logical consistency as a worldview.  \n\n\nBut I admit, I wasn't always aware of above mentioned aspects of Christianity .\n\nIf you are (like I was) doubtful, or just genuinely curious,  about the possibility that  intelligence and Christianity could be compatible, you might want to read some of (Orthodox) theologian David Bentley Hart[.] writings.  (Here is an [article by him](http://www. firstthings. com/article/2003/10/christ-and-nothing), though I was thinking more about his books, particularly *Atheist Delusions*, the crappy title of which he is not responsible for.) Also, consider reading some of (former atheist Catholic) philosopher Edward Feser[.] writings.  (Here is an [article by him](http://edwardfeser. blogspot. com/2011/07/so-you-think-you-understand. html), though I was thinking more about his books, such as *The Last Superstition*).\n\nPhilosopher [Elizabeth Anscombe](https://www. theguardian. com/news/2001/jan/11/guardianobituaries. highereducation) might be of interest, also.\n"}