{"doc_id": "22", "name": "2016_06_humanities_student_major_233_futurology", "namespace": "we1sv2.0", "metapath": "", "pub": "Futurology", "title": "2016-06-humanities-student-major_233_Futurology.txt", "pub_date": "2016-06-02T00:00:00Z", "Sentiment": "0.056", "Subjectivity": "0.308", "Score": "18", "Upvotes": "18", "Downvotes": "0", "Wordcount": "395", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3tz7h4", "Reddit_id": "d3u3p2e", "Subreddit_id": "t5_2t7no", "Commenter": "IllTellThrowaway", "length": "2371", "content_scrubbed": "The questions most people have but are too afraid to ask is \"Who cares?\" The problem isn't the discussion of ethics, but rather the opinion of ethics. What people deem to be ethical varies from culture to culture as well as the time period. People that do not have any bio-molecular knowledge are the ones pushing their own logic-less agenda based on what they believe is ethical. We are at the precipice of a 400 year change in group dynamics where big chunks of the general population are being able to distinguish traits that are considered important for humanities advancement. Stereotypically those traits have been 'Rich, Strong bloodlines, Owner of several local businesses, holding a position in politics.' But now people of varying levels of intelligence are very very very slowly coming to terms that [.]mart' is more than just the ability to be culturally successful. None of us here will likely be alive to see a point in humanities history where politicians are free to believe whatever they want, but those believes are what define their personalities not their policies. The hope is that activities like the exploration of space and the subsequent enterprises that develop will force people to realize that they are fucking insignificant in the grand scheme of the Universe, and as such the path to ones enlightenment becomes what you can do for yourself, not how far you can push your personal beliefs on others.  We sure as fuck aren't ready for that now, since this theoretical democratic enlightenment would sway progress humanities development to the ignorance of the governing party. Do that now, I dare you. Replace the presidents of the world, the congresses, the educational institutions with leaders that are less impartial. You would have a world wide synchronized mutiny. Earth is a very small ship, where most of us have to pretend to have a limp in order to not be thrown overboard. Logic in this world is dependent on context, and ignorant people (the majority) are unable to distinguish between logical statements and personal ones. Like this one. Considering much of it is ambiguous and relatively based on generalized assumptions, I won't use it as a foundation to launch my career in politics. . . . . Or wait... actually... \n\nHumans are ignorant by nature, and if not challenged early on, ignorance seeks ignorance which breeds ignorance."}