{"doc_id": "1853", "name": "2016_08_humanities_student_major_143_writingprompts", "namespace": "we1sv2.0", "metapath": "", "pub": "WritingPrompts", "title": "2016-08-humanities-student-major_143_WritingPrompts.txt", "pub_date": "2016-08-02T00:00:00Z", "Sentiment": "0.071", "Subjectivity": "0.334", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1856", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vt530", "Reddit_id": "d61v3om", "Subreddit_id": "t5_2s3nb", "Commenter": "PyrosNine", "length": "9986", "content_scrubbed": "The trick of anything you buy from one of the \"spooky\" shops, y'know, the kind that show up in a random street corner you've never seen before, is that magic is a mixed bag. As in, trail mixed, where you enjoy the taste of knock-off M&M[.] along with stale not-Cheetos. \n\nFor example, my friend Eric got lucky with a shampoo that changes his hair into whatever style he wants whenever he sprays a bit of water on it.  But quicker than you can say \"Nyannichuan\" he found that on a planet mostly covered in water he has to constantly think of his preferred hairstyle or suddenly he[.] Cousin It.\n\nMe, I think I found a good one. Even the creepy old shop owner couldn't think of a proper warning for this one, other than \"You should be careful then, for what other people wish for.\"\n\nWhich was sound, I might add, because with this glove of fortune taking, I can steal people[.] wishes.  And they'll come true! \n\nFor me at least. \n\nIf you consider how many wasted wishes go into a wishing well, and the sort of things people wish for, this was an easy bargain for $60 plus helping him move inventory to high shelves. \n\nBut as for the warning, yeah, people wish for weird things. It[.] not like the glove has some sort of pop up window to tell me what people wished for, and I doubted I could just ask. Probably against some sort of arbitrary magic rule.  And not every wish would be right up my alley- perhaps some goth chick wanted to be a vampire and suddenly I'd light up like a sparkler in the summer sun. I can't feed a pony either.\n\nSo Eric and I, we went scouting. We had to find a wishing well of some sort that was only moderately visited, where we could observe people dropping coins without looking suspicious. Also, where we could then loot coins without also looking like tramps. Even Eric was giving me cold stares about stealing wishes, but I never thought much of The Goonies anyway.\n\nThe ideal spot it turned out, was a small fountain in an upscale condo village. The village itself was poshly scenic and connected to a local greenway, so they didn't mind weirdos like us walking through with cameras.\n\nWe set up with a small picnic of bottled water, bacon jerky, and a 4G hotspot, and began a vigil. From our initial survey the day  before, the fountain had only a few smatterings of change, but the coins themselves were fairly new. This meant the survey sample would be fairly controlled and finding out who threw what wouldn't be as hard.  Just to be safe, I stored away the glove in a rosewood box and had Eric scrape the coins off to the sides to ensure I didn't mix observed wishes with the mess of unobserved ones.\n\nWe spent most of our watch checking out Reddit and brainstorming the entire concept of stealing wishes. \n\n\"So like, what happens if you grab more than one coin at once?\" Eric pondered whilst idly swiping at his phone.\n\n\"Depends on what kind of wishes they were, likely.\" I guessed. \"Like, two variations of \"I want to be rich\" or \"I want a million dollars\" would just combine. And conflicting wishes would probably just cancel themselves out since they're mutually exclusive.\" \n\n\"Or you know, maybe they'd work themselves out. Like if one person wanted a Fiat, and the other a Tesla, there'd magically be a Fiat sponsored Tesla car on the market and you'd have the first one. Or if a dude wished to be come president and another dude wished to die-\"\n\n\"I hope to god no one decides they need suicide via wishing well.\" I interjected. \n\n\"Yeah, well, at least you'd probably have plenty of time to get elected president before you died.\"\n\n\"Mm, yeah.\"\n\nMy rule to avoid some of these shenanigans was that we weren't going to pick up any wishes made by any chick. Not that they wouldn't make the good wishes like \"I wanna be rich and famous,\" but in my mind there was just a greater chance that they'd ask for something more girl specific on top of the riches and fame. Like, if the wishes warped reality to fit when there were \"incompatibilities,\" I would be the pudgiest, scruffiest male teen pop star imaginable or I would lose my wang as the next Taylor Swift.\n\nSure as hell, that was not something that I was ever going to let happen. I need my wang.  It and I go way back and I have fond memories of our times together. \n\nMy second rule was to make sure not to take any wishes by someone who looked either too desperate or too happy- Didn't want the wish to show up in the obituaries. Especially if they only looked happy, and I find myself a dictator for life of the fourth Reich or something. Or without my wang.\n\nIt took a while before we started seeing visitors- around midday or so, as I guess some people have day jobs.  But soon enough we were seeing joggers, small families, and the local residents walk  on by towards wherever people go who have actual lives. \n\nA few wishes were made, here or there. A classic nuclear family of three stopped to each make a wish out of pocket change. Mom[.] wish was naturally right out, and their son was loudly exclaiming his wish for a dinosaur. The dad was too old for wishes, he said.\n\nThere were some choice options- an old man made a wish a bit later. Knowing what I'd wish for when my spine starts making a C shape and I look a bit like Cranky Kong, it was either eternal youth, a chance to start all over with all the things I knew now, and a near zero percent chance of wang loss. At that age, the bond between a man and himself was unbreakable.\n\nThere was also an older businessman, or at least some guy dressing as a businessman for a job interview, his outfit looked hand-me down or well worn. He would likely wish for wealth and comfort, a beautiful wife to share his average life, and or to follow his dream and become a successful liberal_arts major-type career.\n\nThe only other non-teenage girl not too cynical to toss a coin was some balding d-bag who did nothing but hit on girls. He perpetually sported the sleaziest, greasiest grin that not even the threat of the MMA Dad giving him a straight up death glare could erase. His wish was obviously either for a bigger junk, to be irresistible to women, his father[.] respect, and or something that'd get me put in jail and possibly shivved.\n\nWhen it got dark, and everyone else went off to do something less shady and magical, I had already made up my mind which coins to grab. I opened up the rosewood box, and slipped on the glove.\n\nThe fountain had lights in the base of the fountain, so seeing the coins was easy.  As luck would have it most of the coins fell into neat isolated spots. But  after consulting our notes and probable positions, the old man coin had fallen directly into the pile of scraped coins along the sides, and was as good as lost.\n\nI ended up choosing the D-bag[.] coin first- as at the very least I would probably use his wish much more maturely than some balding manchild. My previous experiments with magical items had taught me how to avoid the long arm of the law and of course I wasn't going to do anything nefarious if I got back to my car and found some poor soul tied up in my trunk. Eric at least would vouch for me at any rate.\n\nWith shaking hands, I carefully, carefully reached into the fountain. I wasn't sure if the glove gave me the wishes from just grabbing a coin or just touching one- and the threat of becoming Taylor Swift loomed in the back of my mind as great as the dinosaur I could possibly own.\n\nWith great care I dug my fingernails through the glove and around the coin in question. With one steady motion, I pulled the coin out of the water.\n\nI waited for a few seconds, hand dripping with cold water, to see if anything had happened. I felt no magical transformation, no flash of light, and worried if I'd wasted $60.\n\nBut then Eric piped up with a snigger. \"Yeah, I figured that was gonna be it.\"\n\nAt first I thought Eric meant he knew it wasn't going to work, which was crazy,  as he had magic hair and a bicycle he kept chained up because it had commitment issues and thus Eric couldn't really afford to be skeptical.\n\nBut then I looked at his eyes, and where they were looking, and I knew I'd guessed well that the D-bag had been overcompensating for something. My wang was well accounted for, and then some.\n\nI breathed a sigh of relief, at things not lost and the relatively minor life change that proved the glove worked.\n\n\"Oh hell yeah, this was the best $60 ever spent!\" I punched the air with the now soggy glove and sent a spray of water that Eric took care to avoid, clutching his hair protectively. \"Do you think I should try the other one?\"\n\nEric shrugged. \n\n\"I dunno man, from experience I've learned that it[.] easy to go overboard with these things, but considering it[.] you, you'll probably not even going wait to finish listening to what I -\"\n\n\"Too late, already grabbing another coin.\" I said as I punched my fist back into the pond.\n\nI grabbed the second coin quickly and pulled it out of the water with a mighty splash. I envisioned wealth, success, and maybe someone to share my previous stolen wish with.\n\nI think I may have gotten two of those things, and probably the third if I looked hard enough on dating sites, but when Eric suddenly exploded in a giant mane of hair, I knew I had something to post on /rTIFU with magic.\n\nEric parted his sea of hair and looked me over. \n\n\"Um, I think that old business guy was a hardcore fan of Alisen \"Ame\" Shakaku.\"\n\nWell, blast. I was JPop Taylor Swift. \n\n\"Oh wait!  Oh god!\" I thought.\n\nI reached down to checked my miniskirt. \n\nTo my relief, it was still there, all several inches of it, I wasn't sure what I have done if I had -\n\n\"Oh wait!  Oh god!\" I thought.\n\nI grabbed Eric by his shirt pulled him close in a manner that was uncomfortable on so many levels as there were suddenly new developments between us. But that wasn't important right now, what was important was that he listened very carefully and didn't get any ideas.\n\n\"Eric.\" I intoned with the intensity of a thousand suns. \"I need you to make a wish.\""}