{"doc_id": "1962", "name": "2016_08_humanities_student_major_1149_socialism", "namespace": "we1sv2.0", "metapath": "", "pub": "socialism", "title": "2016-08-humanities-student-major_1149_socialism.txt", "pub_date": "2016-08-16T00:00:00Z", "Sentiment": "0.052", "Subjectivity": "0.34", "Score": "29", "Upvotes": "29", "Downvotes": "0", "Wordcount": "455", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6kc7vp", "Reddit_id": "d6kdixt", "Subreddit_id": "t5_2qjii", "Commenter": "[deleted]", "length": "2845", "content_scrubbed": "I hate this pseudo egalitarian anti-intellectual pandering\n\nI have a bachelor[.] and master[.] degree from a respected flagship state university and am going to be going to be starting doctoral studies soon. I assure you, I am not anti-intellectual. My criticism is that socialist spaces are perpetuating the same hierarchies as bourgeois spaces where wealth and prestige of education determines who gets a platform.\n\nAll you're doing is falling into the trap of assuming elite universities = more intelligent. As someone who was accepted into two Ivies and couldn't attend due to finances, the difference between one of my friends who did go on to attend an Ivy and myself is that I don't have hundreds of thousands of dollars of student debt. We are both just as capable and intelligent, however, because she attended an institution of greater prestige, her work and opinions are automatically given a greater platform and greater respect than mine. \n\nthose who have the privilege to be educated have a responsibility to teach those who otherwise can't afford or otherwise access this education themselves.\n\nThis is incredibly patronizing and assumes that, somehow, your fancy education makes you a greater moral authority than anyone else. Additionally, my problem isn't in education itself, my problem is that the people who are doing the educating all belong to the same small cadre. If we believe in real meritocracy, and, as socialists, we should, then if someone is able to contribute to the body of knowledge, it shouldn't matter if they studied at Harvard or if they studied at a \"lower-tier\" public state university. The problem is this isn't happening, and conversations in socialist spaces are dominated by a handful of individuals from the same privileged backgrounds.\n\nWhat[.] wrong with this?\n\nWhen we equate prestige of education with one[.] intelligence and capabilities, we create a situation where we close out the perspectives of other people, and treat them like they're too stupid to contribute. We need more perspectives than just those of privileged academics at Ivies/private liberal_arts colleges. A poor kid from the inner city is fully capable of reading socialist literature, analyzing it, and writing about it, but his perspective is ignored in the current hierarchy. It goes against everything socialists should stand for.\n\nif not those who are educated in Marxism and socialism then who else should be given a platform to speak about Marxism and socialism?\n\nPeople other than mostly white, upper middle-class academics who have benefited from expensive educations and other advantages? Anyone can educate themselves and speak about socialism, a college degree from Stanford doesn't give you greater authority to educate people on socialism than a degree from Florida State, a community college, or no degree at all.\n"}