{"doc_id": "1848", "name": "2016_08_humanities_student_major_83_nostupidquestions", "namespace": "we1sv2.0", "metapath": "", "pub": "NoStupidQuestions", "title": "2016-08-humanities-student-major_83_NoStupidQuestions.txt", "pub_date": "2016-08-02T00:00:00Z", "Sentiment": "0.09", "Subjectivity": "0.384", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "1207", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vqyle", "Reddit_id": "d60qxt8", "Subreddit_id": "t5_2w844", "Commenter": "patrickeg", "length": "6949", "content_scrubbed": "I'm currently a college student. So I think I can speak about this with some degree of accuracy. And Ill start with this; My loans will be forgiven after 10 years of regular payments because I'm going into public service. If that wasn't an option I would strongly advise against going to college on the governments dollar.\nThere[.] a few problems with Federal Financial Aid. Firstly, the interest rates are high and loan amounts are large. Second, often FinAid isn't offered to people on the basis of need, but instead on the basis of performance in primary and secondary education, this favors those from a more privileged background to begin with. Thirdly, Because the loans are so large, choosing a career that will be able to pay them off often means choosing a career against what you actually want to do. And finally, FinAid loans are often used simply as a means to survival or taken without realizing the repercussions or terms by those who are either not briefed fully or are too young to realize how much money that really is.\n\n**a.** High interest rates and large loan amounts are symptoms of the same problem, namely that the institutions involved (the federal government and colleges and universities) are in it to make a profit. Universities used to be affordable for a college student working part_time on minimum wage, sure you'd have to save up and be careful with your money, but it was possible. This often leads to a disconnect between those who went to college in the 60[.]-80[.] and those who are going today. The costs really are insane. The reason for this is Federal Aid. Much like insurance companies have allowed Hospitals and Pharmaceutical companies to price gouge because the insurance company in the end foots the bill, Universities have started doing the same thing because the Government foots the bill, at least initially.\n\nUniversities have over time raised tuition prices without seeing a significant decrease in attendance because the government is footing the bill, and not individuals anymore. The problem arises when the loans need to be payed back. People find themselves in 60-80k worth of debt at the end of a 4 year program, and then they're trying to repay that on a teachers salary or a nurses salary. The numbers just don't work, especially since the cost of living has risen in so many places. That too is a double edged sword because places with lots of jobs tend to have larger populations and correspondingly a higher cost of living. This leads to more and more people defaulting on student loan debt.\n\nSince more people default on the loans or are otherwise unable to pay them, the interest rates must be higher so the government can recover its investment as well as still make a profit. In short, it can seem like the governments main goal with student loans at this point is to make an immediate profit instead of invest in long_term economic stimulation resulting from a stronger specialized workforce.\n\n**b.** Financial aid is also more and more being used as an advertisement for enrollment by Universities. The base idea is that those who have higher grades will be awarded better financial aid packages. People with higher grades in secondary education are more likely to finish a college education and therefore make the college or university in question look better as the ratio between enrollment and graduation will be closer to 1:1 which in turn allows them more advertising leverage for new enrollments. While not all Universities use strategies like this, enough of them do that it serves as a severe dissuasion to those from lower socioeconomic backgrounds to attend college and sometime makes it financially infeasible to do so because the financial aid package they have been awarded disappears with fees and in the end they don't have enough money to subsist.\n\n**c.** Another thing to look at is the choices people make for area of study in college and universities. Often prospective students are forced to major in a discipline that will \"make bank\" instead of something they're actually interested in. For instance I know many people who have chosen to major in fields such as business, pharmacy, and STEM instead of say Music or History simply because being a musician in a orchestra or a history teacher/professor will not let them pay off the loan and live comfortably as well. Essentially being stuck doing a job you dislike or at the least aren't very interested in has numerous psychological impacts on happiness and quality of life, for some people the trade off just isn't worth it. Especially once you add the stress of a mountain of student debt on top of it.\n\n**d.** Finally, Often student loans are taken as a means of subsistence, especially by those who don't fully understand the ramifications of taking a loan of that amount and frankly have no plan as to what they're actually going to do with that degree in underwater basket weaving. Picture this; You're eighteen years old, you come from a disadvantaged family, you were an average student. And suddenly you're informed you qualify for a loan of 20,000 dollars a year to attend college. Its better than what you can make working as a grocery stocker at your local Safeway and all you have to do is show up to class every now and then. Sounds like a sweet deal, if you don't understand how loans work. And it especially sounds like a sweet deal if you don't really have a concept of how much money 20,000 dollars is. Often the people taking out these loans, and especially the people taking out large loans are not financially literate. Because their background is disadvantaged enough that interest rates and monthly payments aren't something they really have experience with. These aren't people who pay off a BWM over six years and live in a 4 bedroom three bathroom house with a pair of 401ks and health insurance provided by a company with a strong presence in the stock market.\nThese are people who bought a PT Cruiser for 3 grand which they scraped together somehow, people who live paycheck to paycheck and take out payday loans and sometimes have to pawn their DVD collection and an Xbox to make it through to the first of the month. And the only barrier to them getting a 20,000 dollar loan for one year of college. That[.] 80,000 dollars by the end of a four year program, is a wall of text on the FAFSA website which says something about interest rates. A few might take the extra step to really understand what they're getting into. But most of them just click accept, because its what they think they should do, because everyones been telling them for years that to be comfortable in life and to make something of yourself you have to have a college education and a career.\n\nFour years later they're stuck with a metric fuckton of debt and a liberal_arts degree.\nThe entire system is nowhere near as black and white as you're question assumes it is I'm afraid.\n\n***Sorry for the wall of text.*** "}