{"doc_id": "190", "name": "2016_06_humanities_student_major_1821_pitt", "namespace": "we1sv2.0", "metapath": "", "pub": "Pitt", "title": "2016-06-humanities-student-major_1821_Pitt.txt", "pub_date": "2016-06-25T00:00:00Z", "Sentiment": "0.121", "Subjectivity": "0.341", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "836", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4ozpkh", "Reddit_id": "d4o00j3", "Subreddit_id": "t5_2rhsl", "Commenter": "dicerollingprogram", "length": "4570", "content_scrubbed": "Graduated with Bioinformatics a few years ago.\n\nSince /u/illysm described my own experiences pretty accurately, I figure I would comment how I see it all \"looking back,\" rather the \"while I was a student\" viewpoint... Keep in mind this is really just my real world experience, oponions, and outside looking in views of me and my compadres who have all graduated and entered the working world/grad school/medical school.\n\n1. Bioinformatics got me a lot of job offers, and I wasn't even that great of a student (I was not the top of my class by any means). Many of my friends who were full on CS could not say the same and many of whom are much better programrs than me. I can't say I'm speaking specifically here, but once upon a time someone from UPMC told Pitt, \"Hey, we need CS nerds who know about biology and chemistry as well,\" Pitt got their expensive gears turning, and Bioinformatics was formed (it[.] still a relatively new major). UPMC, along with many biomedical companies, are looking for people who not only understand the mechanisms of research and the data that research presents, but also how to *apply* such research with software; that[.] where you come in. There is a very big market demand for not only programrs, but specialized programrs even more so. If you're looking for a well paying job right out of school and you want to stick with science, Bioinformatics is a good way to go.\n\n2. If you want to become a practicing doctor, I'm going to say no: Bioinformatics is not a sensible course of action. If your interest is in medical research rather than practice than holy shit my fellow panther you're about to hit the mother lode. This is really just my opinion, but if you want your premed track to lead you to practice rather research, than I'd choose something else and not worry about the Computer Science. I was premed like you, but later realized that I just didn't want to be a practicing doctor (nor was I too excited at the idea of more school) so I dropped it... I also preferred the idea of R&D.\n\n3. Excuse my generalizations, but the way I see it, you're going to be doing two thirds of a Computer Science major and one third of a Biology major. I strongly recommending checking out the Pitt website, they have a pretty good \"track.\" I took Bio, Chem, Organic, etc, and I did the labs for each. At the time the labs were required (Bioinformatics was like a brand new program when I did it, I guess they've taken the labs out?), but if they haven't, I need to stress how difficult the labs can be simply because they are such a time sink. Computer Science in and of itself is already a \"time intensive major,\" simply because your projects can take a whole lot of time to create. The \"hard_science\" classes, they can be tough. I'm not sure if Pitt still has a reputation for using the General Sciences to weed out the PreMed kids, but just keep in mind that science at Pitt is not a walk in the park. You're going to be working and studying quite a lot, on par with the engineering students. I guess what I'm getting at is if you plan on doing Bioinformatics (or even just premed), **accept now that you're taking on an intensive program.**\n\n4. Pitt is pretty much all Java (they do offer classes for other languages, but trust me, get cozy with Java now if you have the time and patience). Windows or Apple will both be just fine. Personally, I'm a Windows guy. Any software you need will be provided by Pitt at no cost to you.\n\nI worked in the field for two years and realized as much as I love science it just wasn't for me; I didn't like the real life work involved in the field, I'm sure if I could do strictly research I'd be in heaven but that[.] a gig I failed to get. So be it. I took my actuarial know how and have been doing pretty well working Insurance, and I actually really enjoy it.\n\nAt the end of the day/tl;dr, Bioinformatics is great for research inclined students and the jobs are very marketable, you won't be surprised to be getting job offers before you even graduate from UPMC or other Biomedical firms in the area. The degree is incredibly marketable. Be prepared to work your ass off. Would not recommend pre-med track if you plan to become a practicing physician, you'll get a more rounded education focusing on a science specific course (I think near 50% of medical students majored in biology, but actually a fair bit majored in the humanities which IMO is bullshit but I'm a crass guy with too many oponions). Have fun, and take discrete logic with the bald italian from Philly if he[.] still there."}