{"doc_id": "1908", "name": "2016_08_humanities_student_major_628_ireland", "namespace": "we1sv2.0", "metapath": "", "pub": "ireland", "title": "2016-08-humanities-student-major_628_ireland.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.048", "Subjectivity": "0.318", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "686", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6c30bz", "Reddit_id": "d6c548a", "Subreddit_id": "t5_2qhb9", "Commenter": "theoldkitbag", "length": "3930", "content_scrubbed": "Well, I think the comparison valid, as you are questioning why Irish (like Maths) is compulsory. It would be foolish to not look at other subjects through the same lens for comparison. You should also note that you *can* continue to study the language in third-level, and you can certainly get a job out of it - in fact, some jobs require it!\n\nMaths is used, certainly, in most STEM fields - but not all, and hardly ever to the degree I was referring to. I work in IT, technically a STEM field, and if I'm doing manual Maths I'm doing it wrong. I also seriously hope that my Bank is not using some lad with a pen and paper to work out my mortgage interest over x years. In fact, you could say that practically *no* student, who does not continue in a specifically Mathematics-related field in third-level (i. e. a statistically irrelevant portion), will *ever* use leaving-certificate mathematics in a practical way. Given the profligacy of computers, most of use don't even add and subtract manually any more. Yet no-one really questions why all teenagers have to learn trigonometry, calculus, and algebra on the basis of utility. Why then apply that particular filter to Irish - a Humanities subject like Art or History? \n\nAs a side note, it is worth noting that the world is moving towards AI and wholesale automation of jobs. Employment may soon be least of the driving forces behind mass-education.\n\nAnd cultural awareness isn't a reason. You need to justify as to why that[.] important enough to override an individual student[.] wishes on what they want to do themselves while considering the immence opportunity cost that learning Irish entails.\n\nCultural awareness is certainly a reason for teaching a subject - why should it not be? As for over-riding an individual student[.] wishes, that hardly seems appropriate to argue. Hardly anything within the walls of a school is according to an individual student[.] wishes. Your 'wishes' as a student in Irish schools, unless they chime with the school[.], are irrelevant. You may argue the_rights and wrongs of that, but that[.] a separate issue. Choice is limited to what the school offers and will allow. Furthermore, the national curriculum is not about Individual wants. It[.] about the large scale education of the populace in a manner that meets the needs of the State. That sounds a little Orwellian, but it is still fundamentally true. That[.] why you now get bonus points for STEM subjects in the Leaving Cert, and you get to learn languages that benefit to the State to have speakers for - English, French / German / Spanish, and Irish. Irish speakers are useful to the State in ways that go beyond utility. They point to a cultural uniqueness to Ireland, and help preserve and develop the national language for the future. It[.] not about getting a job in Centra because you got flying colours in your aurals.\n\nAs for the 'immense opportunity cost' that learning Irish entails - I assume you are implying that the time spent learning Irish would otherwise be so gainfully employed by leaving-cert students that the subsequent economic and societal gains would be 'immense'. I doubt that. I doubt that very, very, *very* much. I know I would have spent all that free time trying to find pictures of boobs in a red-top newspaper, which is the best you could hope for back then. You may, however, know some students that you find particularly driven and are railing against the oppression of their potentiality by the State. We'd be on the Moon by now, if it weren't for damnable *Irish*. Well, our school term is but 183 days long. That leaves (and yes, I used a calculator) 182 days for them to fill their heads as they wish - almost an entire school year of free time. I studied History on my own for the leaving cert (not enough students for the school to offer it) and got a B in Higher Level. I'm sure there[.] nothing stopping your pubescent Newtons from doing the same."}