{"doc_id": "40", "name": "2016_06_humanities_student_major_388_modelcentralstate", "namespace": "we1sv2.0", "metapath": "", "pub": "ModelCentralState", "title": "2016-06-humanities-student-major_388_ModelCentralState.txt", "pub_date": "2016-06-05T00:00:00Z", "Sentiment": "0.094", "Subjectivity": "0.36", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "447", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3wnli3", "Reddit_id": "d3ww1ka", "Subreddit_id": "t5_37x1t", "Commenter": "gossiemar", "length": "2733", "content_scrubbed": "My personal goals as the Secretary of Education would be to improve access to and the quality of education in rural schools across Jefferson state.\n\nAs a fairly rural part of the country, we have over a million students statewide attending rural public schools, and these schools face issues unique only to them, especially the ones in remote locations. However, instead of giving these schools more resources to combat these issues, rural schools on average receive less than 20% funding per pupil than schools in urban areas.\n\nDue to how distant rural schools can be from a child[.] home, encouraging and cultivating parental involvement in a student[.] education can be a difficult task, and rural schools inherently have less resources to combat this issue. As Secretary of Education, I would work towards integrating technology in order to combat this issue, making it much easier for parents to keep track of their student[.] performance in school and encouraging the usage of video chat as a substitute for face-to-face parent-teacher meetings.\n\nAttracting new teachers to rural school districts can be a difficult task, and as Secretary of Education, I would like to work towards implementing an incentive program to \"sweeten the deal\" for new teachers just graduating from university. Possible options could include mortgage incentives, tax credits, and scholarships for education students committing to a rural school district before graduation. Of course, these are all options I would have to discuss with the other branches of the government, and I would welcome their input with open ears.\n\nI would also gather my focus onto inner city schools, especially in cities like Chicago and Detroit. I would like to take steps to use schools as community hubs, places where classes for cooking, yoga, and other various activities could be taught for a low-cost price. Fostering a sense of community can do wonders for lowering crime, and creating safer environments for children would go a long way in improving education long_term for the state.\n\nPost-secondary education would also be a priority for me, and I would emphasize trade schools as a practical option over liberal_arts colleges. As Secretary of Education, I would do my best to keep tuition affordable for state universities, community colleges, and trade schools. I would also look into the feasibility of rewarding yearly grants for students with a good academic standing in state universities in certain majors or field of studies, in order to reduce drop-out rates in our major universities.\n\nI am sorry if I wrote too much regarding my plans, but this is a brief outline of what I would want to accomplish if I were to be confirmed as the Secretary of Education."}