{"doc_id": "132", "name": "2016_06_humanities_student_major_1284_hfy", "namespace": "we1sv2.0", "metapath": "", "pub": "HFY", "title": "2016-06-humanities-student-major_1284_HFY.txt", "pub_date": "2016-06-18T00:00:00Z", "Sentiment": "0.162", "Subjectivity": "0.384", "Score": "31", "Upvotes": "31", "Downvotes": "0", "Wordcount": "1367", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4oq2io", "Reddit_id": "d4evja3", "Subreddit_id": "t5_2y95n", "Commenter": "theUub", "length": "7602", "content_scrubbed": "I've been debating on whether or not to even read this post, as the title gives a pretty succinct clue as to what is inside, and what it[.] about.\n\nNow that I have read it, I am actually not afraid of us as a community as I assumed I would have reason to be. \n\nI have two reasons to feel that way; First, the mod team and major community contributors (authors and popular commenters alike) responded with reason, tact, recherche, and finesse to what could lead to a delicate subject with varying degrees of importance to a lot of people. I was happily encouraged that the conversation did not devolve into a bash-fest or that most, if not all comments were relegated to responding to a position stated by the OP, whether in support or in opposition to their stance, rather than ad-hominem attacks.\n\nOnce again /r/HFY, you have made me proud to be part of your legions. The intelligent discourse in the face of subjects that are prone to elicit emotional outbursts restores a measure of my faith in humanity, even as other parts of our society disappoint.\n\nThe second reason that I am proud to be a member of this online community is that I agree with the majority of comments to the post in that the support of free speech, especially in regards to the authors who contribute here, in not limiting their topic choice. While genocide is easy to write, and certainly someone can choose a situation where genocide would be a justifiable, or even theoretically a response, to a crime that was committed against humanity as a whole is a topic that is found here and almost no other places on the internet I can think of, I certainly don't think genocideFY is the best HFY.\n\nPersonally, if genocide is used as a means to continue humanities existence against an uncompromising foe, after all other options are explored and rejected, and the story is well written and engaging, I will up-vote it. My issue with the OP[.] post is, I don't see those posts that often, and even when I do, they're usually so poorly written they almost never break 50 up-votes.\n\nIf the OP really wants to discuss the \"META\" here, let[.] have the discussion.\n\nI'm going to open up three tabs, and the reader is invited to join me.\n\nThe first two tabs can be found in the sidebar to your right, under the heading \"Beginners Guide.\" Right-click \"classics\" and open a new tab, then right-click \"Must Read\" and open a second new tab. Now open a new tab, and put in the URL for this sub: https://www/reddit/com/r/HFY or open the link I've just provided in the new tab. Now, at the top, you can sort the stories by different criteria. The default sort when you come to the page is \"Hot,\" as in, this is what the most people have read recently. You can also choose \"New\" which gets me my HFY in chronological release order, but what I want you to choose is labeled \"Top.\" These are the top rated stories of all time rated by the users. Now, some stories that some feel should have higher ratings don't because this sub wasn't always as large as it is now, and therefore there were less people to press the up-vote button before a Story was archived. To give you a bit of background on how long I've been a fan of HFY, I've read some of thne original posts from /tg in 2008, am part of an old FB group called Humanity Fuck Yeah, and even though I didn't creast a user account for quite a while, I have been lurking this sun since it had about 3K subscribers.\n\nBut I digress. The first tab is Classics, is self descriptive, and has 8 series listed. These authors started this sub, and some actually started before this sub, and helped mold it into what it is today. If you'll notice, 1 genocide/xenocide story on this page. Please read those stories. As far as the Xeno/Genocide story goes, It[.] called \"No Graves for the Forgotten,\" and not to spoil the story, if you read that story, and the context in which the xenocide happens, and still don't agree that stories like that should be allowed here, PM me, and I will personally send you $20. 00 USD via paypal or in an Amazon giftcard for the recompense of your time.\n\nThe next category is what has been listed as Must Read, and that page has been divided up into a list of stories for greatest of all time on this sub, (the top 59 entries) and the top 5 each month over a 2 year interval (p. s. mods or wiki contributors can this be updated or can I volunteer to help with the wiki part of this in my spare time?)\n\nOf the top 59, I'll give you a sampling of my favorites in the order they are displayed on screen, not my personal ranking order, with a brief description of the contents.\n\nBilly-Bob Space Trucker by regallegaleagle\nA redneck trucker in space gets caught up in a conspiracy of galactic proportions. Hilarity ensues. Genocides - 0\n\nFirst Contact by CaptainChewbacca\nThe seemingly unimportant actions of an early space ship Captain, marooned on a planet, has consequences for Earth in the future. (links to continuations in comments, hard to find, must have ability to pull up youtube in second tab for musical accompaniment while reading per story instructions) Genocides - 0\n\nHumans Don't Make Good Pets by guidosbestfriend\nA human is rescued and thought of as a lower life form for the first part of this series, gets serious, still ongoing. (set in same universe as Kevin Jenkins by Hambone3110) Genocides - 0\n\nThe Fourth Wave by semiloki\nA saga about humans triumphing through multiple adversities through means including more than martial prowess. Genocides - 1 Attempted\n\nWe do not want to fight by snjoi\nHumans diplomacy through martial prowess. Genocides - 0\n\nEve Of AI by TheMafi\nHumanities legacy lives on through its creations. Very introspective. Genocides - 1 (not committed by humanity)\n\nThe Bleating Assassin by Goatcination and Beefy_Bull\nI have no description for this story. I invite you to read it and for your own opinion. Genocides - 0\n\nFresh Meat by matrixdestiny\nA shakespherian tale of vengeance and pursuit predation. Genocides - 0\n\nThe Human Race by Sacamato\nA delightful tale about the results of evolution and pursuit predation. Genocides - 0\n\nPrey by paradigmblue\nThe galaxy is ruled by a conclave of species descended from prey, humanity is evolved from pursuit predators. Very well written. Genocides - 0\n\nIn the monthly listing you'll find the top 5 voted or nominated for the sidebar by the community stories. Of the 120 stories listed. I'll be surprised if you find 10 with a genocidal element. There are literally more african-americans per capita in the US than there are genocidal subjects in the top rated stories on this site.\n\nThe last tab you should have opened was \"Top.\" As in the top rated stories of all time on this site. On the first page, out of 25 stories, only 2 stories have genocide in them. One, we have already dealt with in \"No Graves for the Forgotten,\" and the other, \"The Last Humans,\" clearly falls under the same category as mentioned above. I'll even give you the same terms to read it as I did Graves.\n\nIt is my opinion, and I produced empirical fact to back this assertion up, that /r/HFY isn't nearly as focused on genocide as you claim it to be. I found your post on the same page as two other stories where humans are awesome because they care. One story has our heroine performing first-aid on an enemy combatant, and the other, speaks of the xeno scum alien thanking us for freeing it from the hive-mind even in death, because we have freed its children by our actions.\n\nPlease don't try to use a small minority of unpopular story themes as an excuse to be offended or to advocate censorship, not on my /r/HFY"}