{"doc_id": "1988", "name": "2016_08_humanities_student_major_1361_subredditdrama", "namespace": "we1sv2.0", "metapath": "", "pub": "SubredditDrama", "title": "2016-08-humanities-student-major_1361_SubredditDrama.txt", "pub_date": "2016-08-19T00:00:00Z", "Sentiment": "0.023", "Subjectivity": "0.264", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "467", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6n9lp6", "Reddit_id": "d6nru45", "Subreddit_id": "t5_2ss5b", "Commenter": "zanotam", "length": "2715", "content_scrubbed": "I'm sorry, but almost anyone under 40 who thinks they're middle class but doesn't have at least a Bachelor[.]... fails to pass one of the few 'purity tests' possible for determining at least the modern lower bound of the middle class. As someone who might as well be 2nd generation so to speak (my Mom very much being a high achieving 1st generation college graduate and my Dad is.... someone who *should* be staunchly upper middle class yet he mostly just ends up playing rich person games and winning poor person prizes, so to speak, and I can honestly say that I've received pitifully little from that side), my life so far, as a 20 something millenial, has involved mostly having to abandon the fun but impractical liberal_arts and establishing an undoubtedly firm base from which to make financial decisions, but one which was only available to me because I won the genetic lottery (math skills and at least reluctant tendencies towards leadership? I feel it[.] a bit over rated, but.... my friends who already left academia seem to almost universally have started in the 6 figures somehow) and even then I would almost certainly be in a *much* better position in life right now if I hadn't made so many faux pas up until this point because my parent[.] either didn't pick up or simply never got the chance to both learn and pass on a more 'complete' copy of the beliefs and behaviors which define my peer group (which I have to admit is mostly upper middle class even if I'm personally uncomfortable with the label).\n\nWhere was I.... oh yeah! So, while I'm playing with fire with such generalizations, I would say that, if anything, the 'middle class liberal_arts students' are mostly upwards mobile students while engineering is mostly downwards (STEM master race my foot) and the largely stable (so at worst lower upper to upper middle or middle to upper middle for changes) mobility students are in mostly Science and Mathematics (the more advanced 'engineering' students who might be upwards mobile seem to usually fall under the math umbrella IMO)  and the invectives against the relatively privileged white cishet male poor comes from the fact that those `liberal_arts students' often come from backgrounds which are a lot rougher and actually quite honestly have a better, more honest understanding of the position of many of those poor, white cishet males than said whites have of their own.... but there[.] a lot of bitterness that can develop there, especially when (from my anecdotal experience) it seems like those very poor, white cishet males are often the ones who reject the help of those who were once disadvantaged and are now trying to give back through social work type positions and the like."}