{"doc_id": "149", "name": "2016_06_humanities_student_major_1426_asheville", "namespace": "we1sv2.0", "metapath": "", "pub": "asheville", "title": "2016-06-humanities-student-major_1426_asheville.txt", "pub_date": "2016-06-21T00:00:00Z", "Sentiment": "0.075", "Subjectivity": "0.486", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "274", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4p3ama", "Reddit_id": "d4hx4ph", "Subreddit_id": "t5_2rf3h", "Commenter": "PantsBonanza", "length": "1545", "content_scrubbed": "You mentioned this in your other post, but I don't really get what you mean about the posts about moving here all being old. It[.] a pretty common topic around here.\n\nBut anyways, /u/PlantyHamchuk answers all your questions pretty thoroughly.  Sure, some folks are totally downplaying the town as a tactic to convince people not to move here, and that[.] largely because this city has a massive amounts of transplants and people who move here and only create problems or exacerbate problems the city already faces. /u/PlantyHamchuk mentions the high cost of living, as well as wealthy folks buying up land and commercial space for homes and businesses that increasingly cater to wealthier folks and tourists.\n\nOnly in the last 25ish years has Asheville largely been making a comeback in any way. The 70s, 80s, and early 90s were times of major decline for the town, and the folks that stuck around through all that are often resentful of the folks that came from out of town only once Asheville got back on its feet, and then started acting like they had full run of the city because they came from Raleigh or Charlotte or New_York or Florida. Appalachia in general has also been culturally insular for the majority of its history, so those sentiments these days translate into we don't tourists, and we don't want newcomers. \n\nThat doesn't mean we don't like it here. We like it just fine, we just don't want you to like it.\n\nThat being said, move here if you want, just don't expect it to be the artsy hippy mecca people always talk it up to be."}