{"doc_id": "222", "name": "2016_06_humanities_student_major_2172_ukpolitics", "namespace": "we1sv2.0", "metapath": "", "pub": "ukpolitics", "title": "2016-06-humanities-student-major_2172_ukpolitics.txt", "pub_date": "2016-06-30T00:00:00Z", "Sentiment": "0.159", "Subjectivity": "0.342", "Score": "12", "Upvotes": "12", "Downvotes": "0", "Wordcount": "522", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4qnt7c", "Reddit_id": "d4uj77j", "Subreddit_id": "t5_2qhcv", "Commenter": "iainabc", "length": "3107", "content_scrubbed": "I wouldn't say he succeeded in much, personally. One thing he did do was introducing real computer science at primary school level. Kids learn to program rather than dicking about with MS Office. I liked that.\n\nHis reforms for GCSE I liked rather less, especially as many subject curriculums weren't decided until a couple of months ago, giving schools little time to prepare before they have to start teaching them.\n\nGove[.] \"legacy\" is Progress 8/ Attainment 8. The idea behind it is you measure how much value schools add to students' education.  Up to now, school league tables are decided on exam results, but what happens is the best schools have their pick of the best students. In the future, students will be assessed on their level of competency in different subject areas on leaving primary school. Those students are then predicted grades at GCSE level based on those scores and the schools have to try and beat the targets. This makes top students less attractive, since there[.] no place to go but down if they are predicted a top grade. Failing students who can be brought up to a passing standard will make the school look good. That all sounds laudable enough! The way it is implemented, though, is very complicated and subject to various agendas. Primary schools want to look good, too, so they are incentivised to show high scores when students leave. Secondary schools want students to start as low as possible so they can be raised up. This causes arguments. The \"8\" comes from the eight subjects that are counted towards the score that the school achieves for a student, but you can't just take the students' eight best subjects. There are certain \"buckets\" that subjects can go in. Maths always counts as double (two subjects) and goes in the maths bucket. English lang and lit count as one each, or three if you are taking both together, and they go in the English bucket. There are three buckets for \"English Baccalaureate\" qualifications, which include sciences, languages and humanities. It doesn't leave much room for creative subjects such as art, music or physical education, so it has garnered some criticism for that. On the other hand, the country needs more people skilled in science and speaking foreign languages.\n\nFiguring out scores for one student is complicated enough, but this has to be done for all students in order to calculate a school[.] score and its league table position. If a school scores below a threshold it triggers an automatic OFSTED inspection.\n\nSo I suppose if his aims were to increase skills in computer science, traditional science, maths and English but to decrease participation in creative subjects he[.] almost certainly achieved that. Asking the whole education system to restructure its curriculums and exams while simultaneously introducing a really complicated system of judging school success has put an enormous strain on teachers and others involved in education.\n\nWell, that[.] my take on it, but I'm not a teacher, so you may get more informed replies, but I hope goes some way to explaining why I have reservations about his competency."}