{"doc_id": "1912", "name": "2016_08_humanities_student_major_644_writing", "namespace": "we1sv2.0", "metapath": "", "pub": "writing", "title": "2016-08-humanities-student-major_644_writing.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.11", "Subjectivity": "0.398", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "1175", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4x3k9m", "Reddit_id": "d6ccgwb", "Subreddit_id": "t5_2qh2n", "Commenter": "NeviniTambay", "length": "6737", "content_scrubbed": "First, take a deep breath. Stop your brain from thinking so hard about all of this and just breathe for a minute. Good.\n\nNow, forget about the stereotypes and forget about job prospects and forget about privilege and forget about writer[.] block and forget about whatever other people think. College is for you, in the end. It is for you to better yourself, to find the knowledge or experience you lack coming out of high school. You pay for it and work for it, so follow the path that you want to.\n\nWriting is hard. People who are even paid to write full time get writer[.] block or produce work that is less than stellar. Writers get depressed. Writers worry about where their income is going to come from. Writers underestimate their own abilities and perceive their writing as utter crap. Your experiences so far do not mean that you will be a terrible writer, if that is what you choose to do. Do the work and you will flourish.\n\nAlright. It[.] advice time. When I started college, I was a Business major. Then, I was a history_major Then, I was an Engineering major. Then, I was an english_major I graduated with a degree in English with minors in creative writing and drawing. My dream is to write an animated series, several graphic novels, lots of regular novels, and several video games, and to build an empire based off of those works.\n\nWhen I chose Business and Engineering, I was only concerned with the job prospects. I could do the work and the calculus and the memorization, but both just made me feel dead inside. All of my\npeers in both majors had ethics and morals that made me incredibly jaded to the point that I became anti-social and hateful (not gun-toting, just angry). The bright prospects in my mind and in the brochures accentuated the fact that the realities were dingy and dirty and slimy and soul-crushing.\n\nI chose History, because I was lost. I knew I liked mythology and I knew I needed something far away from Business (liberal_arts is the opposite of business, in my opinion), so I just went with it. Unlike the business degree, I had to take calculus for the history degree. When I found out I took to calculus like a duck to water, I talked with the professor about possible future careers, and he suggested I try out Engineering.\n\nThe first two years in Engineering were great. I loved the equations. I loved planning-out structures. I loved solving problems with multiple, variable parameters. I loved creating the perfect solution and knowing exactly how that solution would function. When I started doing upper-level coursework, things took a turn for the worse. All of the beautiful ideas and perfection of the first two years turned into cost-engineering, questionable ethics, and the lazy perpetuation of the status quo. I wanted to be the inventor that helped make household robotics a thing. They wanted to get the most oil out of the ground in the cheapest way possible.\n\nA semester of F[.] and depression later, I did some soul-searching to try to find something I used to do that still had some spark so that the thousands of dollars I spent on college so far wouldn't be a waste. Lo and behold, I stumbled across a 9 page story I wrote in the fifth grade about a little spider who fought to get home. It was horrible and cliched, and the writing was scrawled and faded, but fifth grade me believed in it. The next day, I changed my major to English.\n\nI can tell you right now that getting a degree in English is hard_work. People assume it is for the lazy, because they assume you can excel at it because it is your native language, and because all they know is what they see in English classes geared for everyone. I pretty much slept through the intro to lit and intro to writing classes that people had to take for their own degrees and didn't require English prereqs. I even breezed through the intro writing workshops that people from any major could take. All A[.], no work.\n\nHowever, upper coursework handed me my ass. In the course of two years, I've had to read around 200 books, some several times, while also collecting evidence to write a paper on each (varying from 500 to 15000 words in length). Additionally, I participated in upper level writer[.] workshops that required writing 10 pages (2500 words) and reviewing 10 other people[.] writing each week. On top of all that, I had to also learn a new language to fulfill degree requirements. (I chose Latin. Don't choose Latin.)\n\nPeople don't like admitting that they need someone with a liberal_arts degree. They don't like admitting that they don't perfectly speak and write in the language they've used their entire lives. They don't like admitting that their judgement and morals may be fallacious. They don't like admitting that their interpretation of history may be misguided or flawed. They don't like admitting that they can't communicate with other humans very well. They don't like admitting that the stories they tell aren't innately interesting.\n\nBut they still need us. They need us to make sure their manuals can be read and understood so that they don't get products returned and so that they don't have to pay as much for customer support. They need us to write grants so that they can have their research funded for another year. They need us to make sure that their letters of congratulations sound sincere. They need us to make sure that employees don't leave because their unconscious needs as a worker aren't being met. They need us to entertain them and distract them from the horrors of their secure jobs. They need us to provide ideas and drive society, as a whole, forward.\n\nIf you are terribly concerned about job prospects, liberal_arts majors are frequently hired for the following jobs: Management, Public Relations, Technical Writer, Copy Writer, Scriptwriter, Journalist, Editor, Administration Assistant, Legal Assistant, Human Resources, Teaching, Real Estate Agent, Literary Agent, Sales, Web Developer, Director, and Community Manager.\n\nNow you can remember the stereotypes and your concerns about job prospects and your concerns about how lucky you are to have supportive parents. Use the stereotypes to your advantage; be the fun friend that people seek out (i. e. network with people). Tailor your electives to fulfill the job requirements of a day job you can live with doing for several years while still having the drive to write when you aren't at work, or tailor them to gain you the knowledge you need for your writing. Thank your parents, let them know your plan, and see if they would be willing to support you in the first year or so after graduation. Your writing peers here and at university can help you through your writer[.] block. Good luck in your endeavor! Happy writing!\n"}