{"doc_id": "185", "name": "2016_06_humanities_student_major_1750_the_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "The_Donald", "title": "2016-06-humanities-student-major_1750_The_Donald.txt", "pub_date": "2016-06-24T00:00:00Z", "Sentiment": "0.041", "Subjectivity": "0.367", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "241", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4mvump", "Reddit_id": "d4mwszj", "Subreddit_id": "t5_38unr", "Commenter": "BlueAndOrange92", "length": "1485", "content_scrubbed": "Universities nowadays might as well be called marxist indoctrination centers. You've gotta keep your wits about you and realize that your professors are absolutely capable of lying or telling you half truths to push their agenda. I was fed so many lies in college, and they actively tried to silence opposing viewpoints so they could create an echo chamber. The same thing happened to the universities in maoist china. We have went past the point where the university exists to educate and reached a point where most professors in \"liberal_arts\" (really should be called marxist arts) studies are just people there to manipulate you and deceive you using emotions in order to create \"useful idiots\" for their movement.\n\n\nYoung people that have little real world experience and that don't understand that their teachers can lie fall victim to this onslaught all the time. Their real world experience is lacking so they don't have personal experience to realize that the concepts being pushed on them are bullshit.\n\nIt has gotten bad, very bad. It has infected higher \"education\" like a cancer. What[.] even worse is in many universities you can't avoid it. If you go for a STEM degree some universities will force you to take certain liberal_arts courses or \"diversity\" credits in order to graduate. That[.] where the real evangelists to the cult of literalism reside.\n\n\n[ex KGB agent Yuri Bezmenov interview](https://youtu. be/RS8LA-5fmrs). Always relevant, everyone here should watch it."}