{"doc_id": "1856", "name": "2016_08_humanities_student_major_182_fresno", "namespace": "we1sv2.0", "metapath": "", "pub": "fresno", "title": "2016-08-humanities-student-major_182_fresno.txt", "pub_date": "2016-08-03T00:00:00Z", "Sentiment": "0.078", "Subjectivity": "0.479", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "358", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d62m35r", "Reddit_id": "d62nri3", "Subreddit_id": "t5_2r5of", "Commenter": "No1ExpectsThrowAway", "length": "2103", "content_scrubbed": "Apparently you're not very good at math, and have neither compassion for your fellow human beings, nor a basic understanding of psychology.\n\nTell me, do you really think that the 25% of the residents of Fresno that are impoverished, are in that economic conditiion because they would sooner people hand them things than, you know, **not freaking starve?** Than not have their children starve (more than 15% of children live in households with food insecurity, concentrated in - you guessed it - poor areas, like the Valley)?. Minimum wage work, which is what most people can get (especially when the educational system is shit), will land them below the poverty line, no matter how hard they work. There simply isn't enough hiring going on, for too few jobs, for people that lack qualifications mostly through no fault of their own (hard to perform well in school in eg gang-ridden neighborhoods while malnourished and mostly hungry).\n\n Stop shit majors in Liberal Arts and look into the trades or stem. \n\nHey, you managed another erroneous assumption-- good job. I'm going to go out on a limb here: the reason you responded to a position based on the available data with your own *personal experience* is that you are neither sufficiently competent to be intellectually honest, nor are sufficiently humble to think that just because you have it well does not mean that most people have the same opportunities as you.\n\nAs long as we're trying to take a piss on people (and since we've already addressed that your argument is invalid): have you taken even a basic Phil course? You honestly expect me to think that you're in STEM and no one taught you the first thing about critical thought, or how to have a meaningful discourse? Your personal experience and desire to pretend that you're so much more hard-working than the average person don't supercede the data.\n\nGet off your narcissistic high-horse and come down to earth for a minute: you don't work that much harder than the average person. You're not that special. Stop pretending that the only people that aren't well off are those that are lazy."}