{"doc_id": "1978", "name": "2016_08_humanities_student_major_1269_canadapolitics", "namespace": "we1sv2.0", "metapath": "", "pub": "CanadaPolitics", "title": "2016-08-humanities-student-major_1269_CanadaPolitics.txt", "pub_date": "2016-08-17T00:00:00Z", "Sentiment": "-0.003", "Subjectivity": "0.288", "Score": "9", "Upvotes": "9", "Downvotes": "0", "Wordcount": "283", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6m3txr", "Reddit_id": "d6m4fqo", "Subreddit_id": "t5_2s4gt", "Commenter": "Kira0802", "length": "1613", "content_scrubbed": "What is it about post secondary education that it requires foreign students paying higher rates to make it sustainable? Imagine if we had an educational system that required the same foreign participation to make K-12 sustainable. That would be absurd.\n\nInfrastructure. K-12 doesn't need to buy those million-dollar medical machines to understand how they work. They don't need the latest technology to analyze every particle of dust. You throw some textbooks, a few teachers and some basic stuff at them to get the job done. No need to pay for a room of computers with Bloomberg Terminal and other expensive stuff. \n\nIf we need to encourage a bunch of Chinese people to come to Canada to get a degree just so we can subsidize our post secondary educational system there[.] something horribly wrong with how we're doing things.\n\nWe probably can afford to look at other universities around the world get funding to step it up to the next level while we sit around doing nothing. But then, we should not be surprised if in a decade or two, we lose talents to emerging countries because they are able and willing to make the investment. \n\nI cannot believe that the economic output that this class produces is worth $30,000. I mean what do we have at the end to show for it? A bunch of shitty papers about Hamlet.\n\nI don't want to get into the STEM+Business  Liberal Arts argument. I believe that understanding literature and going forward in the domain of fine arts is worth the cost, but I get it if others don't want that. In any case, I would rather add to what[.] being taught than remove them.\n\n(Edit: formatting)"}