{"doc_id": "1857", "name": "2016_08_humanities_student_major_201_anime", "namespace": "we1sv2.0", "metapath": "", "pub": "anime", "title": "2016-08-humanities-student-major_201_anime.txt", "pub_date": "2016-08-03T00:00:00Z", "Sentiment": "0.305", "Subjectivity": "0.482", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "238", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4w0hi6", "Reddit_id": "d636df0", "Subreddit_id": "t5_2qh22", "Commenter": "pittman66", "length": "1585", "content_scrubbed": "Majority of Non-Airing Sports anime:\n\n* [Cross Game](http://myanimelist. net/anime/5941/Cross_Game): Simplistic and pretty light drama (excluding the beginning and end), but that[.] what really makes it quite remarkable. Characters are very likable, how it includes baseball and growing the characters, and just so much it makes everything stand out. \n* [Kaleido Star](http://myanimelist. net/anime/427): Not necessarily sports but a very sports feeling anime, Sora and Layla are stand out leads showing determination and how far it can take them or hurt them, extraordinary choreography matching the setting (Circus), and showing pretty dark moments when one thinks about it but how to really come out of it.\n* [Ping Pong The Animation](http://myanimelist. net/anime/22135/Ping_Pong_The_Animation): #1 thing I love about Ping Pong? The artstyle. I think it[.] perfect for the show and gives so much great style to it, the series is easily my favorite Yuasa show, psychological thinking that doesn't really go into mind-fucking, and great all around characters for protagonist and antagonist. \n* [Chihayafuru](http://myanimelist. net/anime/10800): Still watching this, but it[.] probably going to end up in my top 5 of all time. After some alright beginning episodes, it suddenly just got so amazing with themes or jealousy, passion, and love, lovable characters especially coming from Chihaya, great comedy, incrdibly tense matches, I could really go on about this, and I still got 35 more episodes to go. But loving this series and hope it keeps up with how high it is setting its own bar. "}