{"doc_id": "97", "name": "2016_06_humanities_student_major_1039_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-06-humanities-student-major_1039_AskReddit.txt", "pub_date": "2016-06-14T00:00:00Z", "Sentiment": "0.045", "Subjectivity": "0.25", "Score": "15", "Upvotes": "15", "Downvotes": "0", "Wordcount": "1484", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4935ku", "Reddit_id": "d49q5s5", "Subreddit_id": "t5_2qh1i", "Commenter": "NicotineGumAddict", "length": "8232", "content_scrubbed": "Jesus Christ that[.] a lotta ice. Have you had any dental problems due to this?\n\n*one tiny invisible chip, but I buy British toothpaste that has some repairing ingredient American toothpastes do not have, google it, I'm busy!*\n\nDo you ever flavor your ice?\n\n*nope! I like ice flavored ice!*\n\nHave you ever considered blending it/just letting it melt?\n\n*i used a hand crank ice crusher for a while but that got old so I ended up finding \"softer\" ice to everyone[.] happiness since I was using up all the ice maker ice*\n\nDo you take ice with you everywhere you go? \n\n*not at all!*\n\nHow do you get your ice? \n\n*so, a year ago I moved into my parents house with my boyfriend, living there was also my sister and her family. 7 of us under one roof with 5 dogs! it was a rough 6 months! my ice consumption was emptying the ice maker bucket which annoyed my dad especially who\nlikes ice with his coffee and tea. I found bags of ice easier on everyone and liked it much better than the crescent shape from the maker anyway! so now I buy 2 8lb bags about every 3 days, sometimes more*\n\nPreferred shape/size of ice?\n\n*ice is more complex than one might realize. yes water turns to ice at 32F/0C. however temperature determines hardness too. I like my ice a little warmer than cold, therefore not as hard. I consider myself a connoisseur of ice! statistically 2/3rds of people like the tube formed ice - also called \"nugget\" ice. but these tube makers are expensive and so usually for commercial use - bars/restaurants. however GE has opens a division that is crowdfunded research and development that also helps lowers the cost to consumers of various innovative electrics. they have crowdfunded the development of a nugget ice machine for countertops for the average consumer and brought the cost to an affordable level. here is some info on that:*\n\n*about the new division*\nhttps://go. indiegogo. com/blog/2016/03/ge-firstbuild-cold-brew-challenge. html\n\n*with a foto of the machine!*\nhttp://www. pddnet. com/news/2015/07/crowdsourcing-accelerates-development-countertop-ice-nugget-maker\n\n*so I PREFER nugget ice to all other ice! but I'm fond of the ice from my local gas station Sheetz. I like the temperature it is kept at and I like the squares it comes in. they are bite size, never hard, and break easily without hurting my teeth*\n\nHow does ice pair with nicotine gum? \n\n*i have oral fixation issues. I enjoy giving bj[.]! (lucky for my boyfriend! haha!) and I go back and forth: 2-4 cups of ice, couple hours of gum, back to ice. all day*\n\nCan't you treat anemia? How long have you  been this way? Why are you extremely anemic?\n\n*this really is a long story. I have hereditary uterine fibroids - these are benign tumors that do not develop into cancer. however they tend to bleed. I did not know I had them. I began bleeding daily for a few months. one bad morning i woke suddenly from the bleeding and was covered in blood soaked clothes from my chest to my knees. dr did some tests and I was missing 25% blood volume. I developed a heart murmur from the low blood volume, extreme anemia. dr wanted to waste time by running other tests, all came back negative, he wouldn't schedule an internal sonogram, so bleeding badly I went to the ER where they did the sonogram and found the fibroids.*\n\n*i didn't have 1 or 2 or even 10. I had more than 40... inside the uterus, outside the uterus, and embedded in the walls of the uterus. next came a DNC - they put u under and scrape out the inside of the uterus. nothing could be done about those on the outside of the uterus nor to the ones embedded in the uterine walls. the OB who did the DNC said if I want kids to try immediately bc it was my best chance. I opted to not have children. a hysterectomy is definitely in my future but for now Im OK. I do still have the heart murmur which means my blood volume has not recovered (DNC was 2yrs ago), still anemic, but my body is just slow to recover the blood lost.*\n\nFavorite drink, and how much do you actually drink throughout the day?\n\n*2 monsters (blue, no sugar) upon waking (equivalent of about 4 cups of coffee), a half a cup of Diet Coke w lunch, some Sprite Zero at dinner, maybe a little more Sprite w pills at bed. the rest is ice. I am WELL hydrated! pee is clear! and I pee at least twice/hr!*\n\nWhen did you lose your virginity?\n\n*another long story....... I was raised fundamentalist baptist as eldest of 3 girls, parents were missionaries in Italy, dad is still a pastor in the US now. I was extremely religious growing up, trying to save myself for marriage and all that bullshit. my bf and I gave into the Devils temptation of sexual lust at the age of 24! didn't marry him. instead a few years later I married a scientologist who works still in the porn industry... married him the day I met him after being friends online for 6months. and moved to Hollywood a month later where he lived. mostly I wanted out of the fundamentalist environment I was in. we had a decent marriage for about 5yrs, then it sucked for 5yrs: then I cheated on him with two different guys, he never found out, so I decided if I'm cheating i obvs don't want to be with him so I divorced him and moved in with one of the guys I cheated with, we're still together. not married to my parents great embarrassment!* \n\nIf you have ice right now, can you show a pic please?\n*find at the end*\n\nIs this the weirdest thing about you? What is? \n\n*I'm a freakin weird person all around. personally I tend to think 10yrs married into the porn industry was most bizarre. I'm nocturnal... usually falling asleep after dawn. when I worked full time I only ever got sleep wkends and summers (I taught french 6yrs at a private catholic school in LA while attending porn events evenings and weekends oh and I never had a degree in french, I picked it up in high school and a few college courses).*\n\n*never attended school very often except for high school. I was \"homeschooled\" in Italy but my parents didn't make me actually do much school work. my dad did force me to read one summer, after that he couldn't keep me stocked with enough English books.\nAmerican law requires \"proof\" of schooling even if you're being homeschooled in a different country via end of year testing. in the 80s the official test was the California Achievement Test. I always placed 12th grade level in everything except math. in math I placed at or below grade. found out many years later I have discalculia - Google it, it[.] dislexia but only with numbers.*\n\n*currently I'm about 1 wk from finishing my master[.] thesis. in humanities. my thesis is on the influence Madame Blavatsky held for Lewis Carroll in his writing of Alice in Wonderland. through this study I've become an amateur historian of Egyptology, hermeticism, and theosophy, not to mention Lewis Carroll and the Alice saga. my undergrad is from a southern baptist seminary double major in philosophy and theology - they hated me by the end bc I was a hippie punk liberal who had abandoned orthodox baptist teaching. they weren't wrong. and now I'm an an atheist, medium level pill(drug) addict (I get them in bulk from overseas!), who is over educated, bored, and looking for my next adventure which may turn out to be 2 wks in China this summer to teach billionaires' kids reading and writing in English. I hope!*\n\n*so I dunno... is ice my weirdest trait? probably.*\n\nWhat kind of strain does eating so much ice put on your interpersonal relationships? \n\n*my bf likes a bj post ice. he says it[.] a pleasant sensation of hot/cold all at once! and as for tongue, he minds the gum more bc it gives him a nicotine buzz he doesn't like!*\n\non brain freeze \n\n*never bothered me much. every now and then I get it. but here[.] a tip. the pain comes from sudden constriction of the blood vessels on the room of your mouth. press your tongue against the roof of your mouth and it[.] gone in like 2-5seconds - heat from tongue dilates vessels back to normal!*\n\n*Photo of my addictions, plus 2 bonus drawings by me! *\nhttp://imgur. com/a/kcQMO\n\nedit: a word here and there\nedit 2: I GOT THE TEACHING JOB IN CHINA!!!! went through a few rounds of sample lesson plans, dialogue over text, and my CV sent. I was told in leaving in less than 2wks! "}