{"doc_id": "1943", "name": "2016_08_humanities_student_major_947_education", "namespace": "we1sv2.0", "metapath": "", "pub": "education", "title": "2016-08-humanities-student-major_947_education.txt", "pub_date": "2016-08-14T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.372", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "1147", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4xogz7", "Reddit_id": "d6h8dko", "Subreddit_id": "t5_2qhlm", "Commenter": "therealdannyking", "length": "7606", "content_scrubbed": "Today[.] guest post is written by Lisa Westman. Lisa is an instructional coach specializing in differentiation for Skokie School District 73. 5 in suburban Chicago. She taught middle school gifted humanities, ELA, and SS for twelve years before becoming a coach.\n\nI must admit, I love a good challenge. I love the learning that comes from trial and error. I love hitting roadblocks and finding detours. This probably explains why I also I love differentiating instruction. I equate differentiation to a giant jigsaw puzzle with student needs being the pieces. Once I fit the first pieces together, the next few pieces fall into place. There are moments of frustration as mistakes I inevitably make mistakes and completing the puzzle may take a while, but the result is always worth the effort.\n\nLike puzzles, differentiating instruction can be a complicated endeavor. In fact, a 2008 report by the Fordham Institute found that 83% of teachers nationwide believe that differentiation is \"somewhat\" or \"very\" difficult to implement. Subsequent differentiation statistics support the 2008 finding; educators continue to consider differentiating instruction as strenuous. These results are not surprising. As one of differentiation[.] foremost experts, Carol Ann Tomlinson explains,\"I absolutely understand that differentiating instruction well is not easy. But then, I've never felt that teaching should be easy.\"\n\nTeaching is not easy. Teaching is a career that requires a physical, emotional, and mental commitment. Teachers are used to things being \"hard\". So, why should differentiating instruction be the exception? This leads me to wonder: \"Is watching students struggle because their needs are not being met easier than differentiating?\"\n\nIn January of 2015, educational expert Rick Wormeli tweeted, \"far from being a detriment to student learning [differentiated instruction] is the only way we can teach all students, not just the easy ones.\"\n\nWormeli[.] tweet is a call to action. Differentiation is our puzzle and as dedicated educators, we certainly can solve it... one piece at a time. We just need the_right pieces. Ironically, I have found this is precisely the issue with many educators' perception of differentiation. They have the wrong pieces of information. Teachers operating under a set a fallacies will often disregard differentiation entirely or ineffectively implement with no clear benefit to students.\n\nTo avoid exerting coveted time, energy, and resources for naught, I would like to clarify some common misinterpretations of differentiation.\n\n#1: \"Differentiation means I have to plan something different for every student.\"\n\nClarification: Differentiation means that your students are engaged in learning that is appropriate for their readiness level, and they can learn at their pace. Differentiation also considers student interest and preferred learning style. These criteria can be addressed without planning for each student individually.\n\nNow, what?  Pre-assess students. Look for patterns of performance to initially group students. Then, formatively assess students and regroup them as their needs change. To incorporate student interest, look at The Common_Core Standards, Next Generation Science Standards, and the C3 framework as a gift. The majority of these standards are concept or skills-based rather than rooted in specific content. Use standards as a springboard for planning relevant, skills-based learning experiences. Allow students to have an influence on the content by asking them targeted questions to determine their interests relative to standards being assessed.\n\n#2: \"I differentiate by grouping students by reading ability and giving them leveled readings.\"\n\nClarification: This may seem like differentiation, but in actuality this is tracking within the classroom setting. Leveled texts don't necessarily address the specific needs of students which are often unrelated to reading ability. All students deserve access to challenging and interesting material. Differentiation comes into play with how students interact with the text.\n\nNow, what? Differentiate the process (task) and product (how learning is demonstrated) for students. Consider the level at which students will engage with the text and how they can best show their understanding. The same text can be used by most students by compacting the curriculum for high-achievers and scaffolding for students who need more support. Refer to Webb[.] Depth of Knowledge and Bloom[.] Taxonomy in conjunction with student conferencing to co-evaluate student progress and co-design their learning process. Not only is conferencing a type of formative assessment, but it is an opportunity to model effective questioning, gain insight into students' thought processes, and offer students ownership of their learning.\n\n#3: \"I can differentiate effectively using one data point.\"\n\nClarification: Impossible. First of all, there is quantitative data (think numbers) and qualitative data (think observations). To differentiate most effectively a combination of data types should be used. Additionally, multiple formative assessment results need to be examined to allow for flexible pacing and grouping which are the hallmarks of differentiation.\n\nNow, what? Think about the data you are currently using. Is this data giving you information about the whole child on a day-day basis? What does this information tell you? What other information do you need? Work to eliminate meaningless data points, offer a multitude of formative assessment types, and use academic data as well as affective data to get a clear picture of each student.\n\n#4: \"Differentiation is easy, just give the high students more and the low students less.\"\n\nClarification: Differentiation is not more or less. Differentiation is challenging a student just enough so that it neither impedes learning if too hard or causes apathy if too easy or redundant. (Cash, Richard).\n\nNow, what?  Think quality over quantity. It is quite possible that one high-level question is more challenging than twenty low-level questions. Plus, being asked to show mastery of a concept or skill twenty times builds frustration for high-achieving students because they don't need the practice and similarly produces frustration for struggling students because they are practicing the skill incorrectly 20 times.\n\n#5: \"I don't need to change anything about my instructional practices to effectively differentiate.\"\n\nClarification: Frankly, the factory model of teaching is not appropriate for today[.] learners. If at any point while reading this blog post you thought, \"Well, I can't do that because what would the rest of the students be doing...?\" this misinterpretation may be subconsciously preventing you from truly differentiating for your students.\n\nNow, what? Don't beat yourself up; you are not alone. The first step in change is recognizing the issue. Take small steps and allow yourself time to learn and practice. If your district employs instructional coaches, partner a coach in an authentic coaching cycle.  If your school district does not have instructional coaches, partner with a colleague. Engage in a book study and try something together. Lastly, I encourage everyone to build a global PLN (professional learning network) by connecting with other educators on social media.\n\nAs you begin the school year, try to reconcile these misconceptions by attempting to implement one of the clarifications. Be patient and if a piece isn't fitting, reflect and try another piece. Differentiation may never be easy, but it will always be worth the effort."}