{"doc_id": "1841", "name": "2016_08_humanities_student_major_37_uiuc", "namespace": "we1sv2.0", "metapath": "", "pub": "UIUC", "title": "2016-08-humanities-student-major_37_UIUC.txt", "pub_date": "2016-08-01T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.404", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "326", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d5zuoee", "Reddit_id": "d5zw5j1", "Subreddit_id": "t5_2qkxs", "Commenter": "curiosityshop", "length": "2077", "content_scrubbed": "Absolutely, yes -- this kind of ideological discrimination is active and openly discussed in the humanities because those in power (both in position and numbers) believe fervently that it is justified. But what also troubled me along the way was overhearing other teaching assistants, back when I was in grad school (now over a decade ago), discussing undergraduate work on controversies (such as abortion rights) negatively because of its ideological factors. The idea wasn't that the paper in question wasn't strategic in addressing its probable audience (as left-leaning), but assuming that left arguments were the only ones that were _a priori_ valid. This was not by any means all teaching assistants, but those I considered to be strident or immature. \n\nMy own view is that all students (staff, faculty, etc.) are entitled to their opinions and that the job of faculty is to help students to learn to express them persuasively, not to reshape student opinions to those with which a particular faculty member or discipline tend to agree (even if it[.] to ensure students are more accepting of diversity in the particular way the_left defines it currently -- although for my part, I am also very much in favor of broad inclusiveness and tolerance). Political persuasion and social opinion need to be carefully separated from professional training and socialization into the discourse, accepted behaviors / practices, and formation of knowledge in a field. \n\nIn other words, I believe that students are entitled to academic / intellectual freedom and it[.] the ethical responsibility of the university to ensure that this right is protected and of individual faculty members to respect it. It[.] also my opinion that departmental hiring committees should not only value identity diversities, but also diversities of perspective. I do not believe that the_left entirely agrees with this, any more than a dominant right would be likely to do. This is a rather radical orientation anymore. See, for example, this article: http://chronicle. com/article/Academe-Is-Overrun-by/235898."}