{"doc_id": "1955", "name": "2016_08_humanities_student_major_1110_iceland", "namespace": "we1sv2.0", "metapath": "", "pub": "Iceland", "title": "2016-08-humanities-student-major_1110_Iceland.txt", "pub_date": "2016-08-16T00:00:00Z", "Sentiment": "0.15", "Subjectivity": "0.297", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "424", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6j402z", "Reddit_id": "d6judl5", "Subreddit_id": "t5_2qigc", "Commenter": "KotturinnNjall", "length": "2278", "content_scrubbed": "(Numerin fokkuðust upp)\n\n1. I can, if I wish, arrange to be in the company of people of my race **most of the time**. \n3. If I should need to move, **I can be pretty sure** of renting or purchasing housing in an area which I can afford and in which I would want to live. \n4. **I can be reasonably sure** that my neighbors in such a location will be neutral or pleasant to me.\n5. I can go shopping alone most of the time, **fairly well assured** that I will not be followed or harassed by store detectives. \n8. **I can be sure** that my children will be given curricular materials that testify to the existence of their race.\n9. If I want to, **I can be pretty sure** of finding a publisher for this piece on white privilege.\n10. **I can be fairly sure** of having my voice heard in a group in which I am the only member of my race. \n16.** I can be pretty sure** that my children[.] teachers and employers will tolerate them if they fit school and workplace norms; my chief worries about them do not concern others' attitudes toward their race.\n24. **I can be reasonably sure** that if I ask to talk to \"the person in charge,\" I will be facing a person of my race.\n27. **I can go home from most** meetings of organizations I belong to feeling somewhat tied in, rather than isolated, out of place, outnumbered, unheard, held at a distance, or feared. \n28.** I can be pretty sure** that an argument with a colleague of another race is more likely to jeopardize her chances for advancement than to jeopardize mine.\n29. **I can be fairly sure** that if I argue for the promotion of a person of another race, or a program centering on race, this is not likely to cost me heavily within my present setting, even if my colleagues disagree with me.\n41. **I can be sure** that if I need legal or medical help, my race will not work against me.\n44. **I can easily** find academic courses and institutions that give attention only to people of my race.\n45. **I can expect** figurative language and imagery in all of the arts to testify to experiences of my race.\n\nÆtlaði bara að benda a hversu mikið af hreysikattaorðum (misleiðandi, innihaldslaus orð sem ekki er hægt að afsanna) er i textanum þinum. Eg ætla afnvel að leyfa mer að skella einu \"citation needed\" a textann i heild. \n\n\n\n\n\n\n\n\n"}