{"doc_id": "68", "name": "2016_06_humanities_student_major_745_purplepilldebate", "namespace": "we1sv2.0", "metapath": "", "pub": "PurplePillDebate", "title": "2016-06-humanities-student-major_745_PurplePillDebate.txt", "pub_date": "2016-06-09T00:00:00Z", "Sentiment": "0.141", "Subjectivity": "0.423", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "329", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4n7emc", "Reddit_id": "d42vtdx", "Subreddit_id": "t5_2ya42", "Commenter": "hakosua", "length": "2083", "content_scrubbed": "Toxic masculinity, as feminists define it, and a lack of masculinity, as the RP defines it, are not mutually exclusive phenomena. The term \"toxic masculity\" has been misapplied (or misinterpreted) to mean that masculinity is toxic, as if men carry some kind of terrible communicable disease. It[.] really intended to refer to the societal assumptions about men that, at times, prove harmful to men: \"real men don't express feelings,\" \"a real man is never a victim,\" \"real men *always* love surprise sex,\" \"real men don't ask for help.\" Imagine it more like air pollution, rather than a disease. In this metaphor, men are the asthmatics, trying to live healthy lives. Maybe they contribute to air pollution themselves but that[.] not the point -- everyone, environmentalists included, contribute to the air pollution. Likewise, I'd argue everyone, including myself and my fellow feminist liberal_arts majors, contribute to toxic masculinity at times, just like we all have moments of racism and homophobia. I think the term \"toxic masculinity\" is unfortunate; if I were a guy, having never heard the term defined, I'd absolutely get offended by it.\n\nJust because a virtue is \"masculine\" doesn't mean it[.] toxic. Stoicism is the positive flip-side of emotional suppression. Some guys get really stuck on emotional suppression, like feelings don't serve a purpose. Other guys respect their own feelings but like choosing when and how to express them. That[.] healthy stoicism: acting calmly and intentionally without getting stuck on how to not feel feelings. At its best, the RP teaches healthy masculinity: stop crying, hit the gym, and find a girl who likes you without fastening yourself to her like a scared molusc. Stoicism, athleticism, and independence are healthy, traditionally \"masculin\" values.\n\nI suspect the men who get hit the hardest by toxic masculinity also benefit the most from exposure to its healthy counterpart. Therefore, I think we need a two-pronged approach to the problem: dispelling harmful assumptions about men while promoting traditionally masculine values."}