{"doc_id": "113", "name": "2016_06_humanities_student_major_1129_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2016-06-humanities-student-major_1129_AskAcademia.txt", "pub_date": "2016-06-16T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.496", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "516", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4o8ksj", "Reddit_id": "d4bn3kh", "Subreddit_id": "t5_2sakj", "Commenter": "yattoyatto", "length": "3156", "content_scrubbed": "Japanese lit Ph. D. candidate here! \n\nI totally sympathize with this, living in Japan and being in the weeds of dissertation-writing myself write now. \n\nBut:\n1) You are never expected to read everything relevant, since that[.] impossible—not for a book, not for a Ph. D. dissertation, and certainly not for a Master[.] thesis. Read recently published books and unpublished dissertations and theses, and you'll see this firsthand—people use what they need to for the arguments they're making, and have read enough to make sense of what people are saying in the contexts they're dealing with, and that[.] just fine for good research. \n\n2) Japanese academic work on just about every Japan-related topic is, as you note, overwhelmingly prolific; but even people in the same subfield don't read everything in it because, again, that[.] impossible. Also, if you're aiming towards English-language academia, the vast majority of Japanese-language scholarship isn't looked at as crucial. A lot of this is due to different expectations of what academic work is and what an original contributions entail—so much of Japanese humanities work in English is taking advantage of the vast efforts of Japanese scholars to collect, organize, and notate materials, but putting it into a framework (methodological/theoretical) that makes it more appealing and significant-seeming to Western academia. There[.] nothing wrong with doing this too, and it doesn't have to be superficial. \n\n3) Japanese theory and intellectual history is of course super difficult. But so is French theory, and German theory, etc., and certain thinkers are still used all the time by people in every humanities field, and this certainly doesn't mean that people who use, say, Deleuze, have both read and understood every philosopher that Deleuze is talking about and responding to in order to do so (because that would entail reading most of Western philosophy, canonical and obscure, on top of everything in one[.] own field. Unrealistic and not necessary). With any theory (Japanese or \"Western\"), it[.] okay to use it as a tool, it[.] okay to just use certain concepts with the_right framing, and it doesn't have to be superficial. Everyone[.] figuring this shit out as they go along (and hey, that[.] what masters and Ph. D. degrees are for! Think of them as driver[.] licences—in fact, the M_A degree is more like a learner[.] permit!). \n\nSo if your question is, \"at what point can you feel content?\", my answer is that even if you'll never feel like you've read everything (because you can't), you can still certainly get to a point where you feel like you're making a solid argument about interesting materials and bringing in certain bits of theory and history in a way that furthers what you're saying. That[.] the goal; not being an expert on all of the humanities disciplines that might possibly be relevant, but just making good, solid, interesting arguments with enough evidence to make them compelling and enough theory and history to give context to your reader and reach out to them. I think that[.] very doable, even if it seems overwhelming at this stage. \n\nGood luck, and feel free to PM me too!"}