{"doc_id": "1850", "name": "2016_08_humanities_student_major_98_utaustin", "namespace": "we1sv2.0", "metapath": "", "pub": "UTAustin", "title": "2016-08-humanities-student-major_98_UTAustin.txt", "pub_date": "2016-08-02T00:00:00Z", "Sentiment": "0.135", "Subjectivity": "0.39", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "287", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vqkwx", "Reddit_id": "d60y5le", "Subreddit_id": "t5_2qy08", "Commenter": "Terror_of_Texas", "length": "1478", "content_scrubbed": "I'm going through something similar, and I will give you the advice that was given to me.\n\nTo start off, I graduated from UT as a liberal_arts major, and after a year and a half I realized I wasn't happy with the opportunities I had earned for myself. I had originally been an engineering major, but I went and got myself kicked out of Cockrell and since then it[.] been eating at my core. Anyways, I was discussing this with a friend who is about 6 years older than me (he was 30 and I was 24) and he told me to go back to school because I had the greatest advantage, that I was still young enough to change my career.\n\nBut I already have a degree. You're still young.\n\nBut I will have to start over. You're still young.\n\nBut what about the extra money? You're still young.\n\nI'm sure you get the point. You sound like you recognize that you're not entirely happy, and that you're willing to make the sacrifices to be successful. What I would do if I was you would be to talk to the computer science school counsellors and be prepared to hear that you won't get in right away, UT[.] CS school is a top ten, then I would go to ACC and take a couple basic CS courses while starting to earn the CS basics you will need. CS involves a LOT of math, and if you're an advertising major I am willing to bet you do not have credit for differential equations and beyond.\n\nTL;DR If you're asking these questions and you really want change, go for it cause you're still young enough to do it."}