{"doc_id": "1947", "name": "2016_08_humanities_student_major_1005_uniuk", "namespace": "we1sv2.0", "metapath": "", "pub": "UniUK", "title": "2016-08-humanities-student-major_1005_UniUK.txt", "pub_date": "2016-08-15T00:00:00Z", "Sentiment": "0.119", "Subjectivity": "0.287", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "373", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6i7sj3", "Reddit_id": "d6iao74", "Subreddit_id": "t5_3cw2d", "Commenter": "Kr4d105s2_3", "length": "2030", "content_scrubbed": "Thanks! Yeah, it is a case of being proactive. If - like me - you are doing a humanities subject, you need to know what you want to do with it. Finishing third year and still saying 'I have no idea what I want to do' is understandable, but not a good place to be in. \n\nI've organised work in my industry during every holiday I've had since beginning my course. In terms of placements - they certainly exist. The term 'fields' is nowhere near as applicable as it is to engineers or even most sciences. A mechanical engineer will most likely become an engineer, or if not, go into something like finance which has positions for all skills sets and academic backgrounds. Very few history students become historians - it isn't a commercial field like many STEM and vocational degrees are. \n\nIf you pick an industry and get the degree to increase your knowledge and general employability, and then plan, plan, plan, you'll probably be fine. \n\n\nI also think people worry a bit too much about starting salaries. An engineer[.] starting salary may be 30k - but then they might plateau at 50-60 mod career depending on location and industry. A PR assistant may start on 18k in London, but be on 50-60k mid career - so the gap closes. The real jump comes with management positions and they are more decided by your career history and personality than by your academic career. \n\nRegardless, I recently had a wobbly about my career, and have certainly decided that money shouldn't be the primary motivator - it is certainly an unpopular opinion on reddit these days - but you should go for what you love. You have to he prepared to adopt the lifestyle, and you have to actually put in the work to secure a steady cash flow in your chosen field - but the way you spend the majority of the next 40 years is going to have a major impact on your happiness and self worth. \n\nAs long as there is steady cash flow waiting for you upon graduation - it doesn't matter so much how much it is. Just live within your means and make sure to save early on. "}