{"doc_id": "124", "name": "2016_06_humanities_student_major_1221_askuk", "namespace": "we1sv2.0", "metapath": "", "pub": "AskUK", "title": "2016-06-humanities-student-major_1221_AskUK.txt", "pub_date": "2016-06-17T00:00:00Z", "Sentiment": "0.165", "Subjectivity": "0.433", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "264", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4dp0wb", "Reddit_id": "d4dwu6q", "Subreddit_id": "t5_2t4s3", "Commenter": "Tundur", "length": "1638", "content_scrubbed": "That[.]... not really true. It much more depends on networking, demonstrable learning, and the student[.] actual commitment. Funnily enough many \"poor\" universities excel in these areas as a conscious reaction to their reputations. \n\nOne thing in particular is that lower-tiered Universities often have lecturers with, shock-horror, industry backgrounds rather than academic. While research is great for the tiny minority of students who want to go into academia after graduation, for many students the focus on the academic over practical is a complete waste of time. A lecturer with industry links and knowledge of what a professional career in the subject will look like is a boon, and a better fit for the ambitions of the majority of the student body *especially* in a STEM program which I believe accounting would qualify as.\n\nThe sad reality is that most people are going to Uni to get, and most are going to receive, a college-esque education wrapped up in a faux-academic veneer. In an attempt to get everyone the prestige of a university degree, we've ended up deprecating perfectly suitable college degrees and creating a whole bunch of programs that could be much better suited to colleges. These lower-quality Universities usually have perfectly good STEM programs, and dismal humanities programs which are usually best avoided- that[.] one area where the prestige of the University and academic background/output of the professor is much more vital.\n\nMy point is, it[.] best to look at the program, background of the key faculty, and industry links of the departments. Looking at the University as a whole tells you very little."}