{"doc_id": "189", "name": "2016_06_humanities_student_major_1812_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-06-humanities-student-major_1812_AskReddit.txt", "pub_date": "2016-06-25T00:00:00Z", "Sentiment": "0.009", "Subjectivity": "0.43", "Score": "8", "Upvotes": "8", "Downvotes": "0", "Wordcount": "357", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4nsukj", "Reddit_id": "d4nukrk", "Subreddit_id": "t5_2qh1i", "Commenter": "thwy1618", "length": "2284", "content_scrubbed": "My interpretation: People who obtain liberal_arts degrees saddle themselves with superfluous debt and proceed to complain about how they have few job opportunities, often blaming this phenomenon on generational issues and the \"system.\" Due to their complaining, these individuals can expect to hear from others who have had different experiences due to a different choice in degree or field. \n\n\nI feel your comment illustrates an important point - good communication is a useful skill. While your comment is understandable, it is difficult to read without proper punctuation; therefore, readers lacking patience or readers struggling with English may choose to overlook your comment. Consequently, your point would be lost. Naturally, perfect grammar and an amazing vocabulary aren't necessities for good communication, but novice knowledge of both improve it. \n\n\nWhat that little tangent was supposed to show was that there is value to liberal_arts. Additionally, even if a liberal_arts degree is a mistake, it seems entirely arrogant to belittle and demean people for making a mistake. Everyone makes mistakes. Some people make bigger mistakes than others. Also, it is extremely presumptive and dismissive to state that all liberal_arts students will be in debt, will complain about the system, or bemoan generational gaps. It is also dismissive to suggest that all their complaints are baseless. It would be hopelessly dreary to live in a world with only engineers or physicists or mathematicians. So maybe artists are right to complain about the negation of their work and about societal hypocrisy. Furthermore, going back to my previous point, even if complaining liberal_arts students are wrong and have no basis for their complaints, why *insult* them for it and attribute that whinging attitude to their degree and not, for example, immaturity? From the insults I've seen delivered to liberal_arts majors, regardless of whether they are complaining or not or whether they are employed or not, the motivation behind delivering an alternate opinion to them is not pure. I think people simply like to insult them, and what I'm saying is that insulting individuals and insulting artistic expression only fosters unnecessary hatred and detrimental Balkanization in global society. "}