{"doc_id": "201", "name": "2016_06_humanities_student_major_1989_tampa", "namespace": "we1sv2.0", "metapath": "", "pub": "tampa", "title": "2016-06-humanities-student-major_1989_tampa.txt", "pub_date": "2016-06-28T00:00:00Z", "Sentiment": "0.194", "Subjectivity": "0.384", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "587", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4q7vqt", "Reddit_id": "d4rb536", "Subreddit_id": "t5_2r7ih", "Commenter": "RuskiesInTheWarRoom", "length": "3369", "content_scrubbed": "Since nobody has jumped in yet, I may as well. I'm on the \"film & performance\" side of the arts scene in Tampa. We moved down from NYC about 5 or 6 years ago.\n\nIt it *no* NYC. Just... gotta be clear on that.\n\nThat said, I've been relatively impressed with Tampa[.] performance arts possibilities. There are a good number of community theaters on both sides of the bay - more than I had anticipated by a good degree. Much of what the theaters do is quite good quality, as well. I've been impressed with it. There are good acting courses taught throughout. The most notable regional theater we have here is Jobsite, and they are *exceptional.* They're the high-water mark, but the number and quality of community theater in the area is quite decent.\n\nThere are a handful of dance opportunities and performances - the Straz center routinely has shows and invites national and international troupes, and through the Patel Conservatory they offer courses for the public. Both UTampa and USF have dance programs of various quality, so there are regular performances. I don't know about open auditions, but I know that both schools have student-run troupes that might work with outside dancers. \n\nOne exciting area of the arts right now in Tampa is the growth of public art in the Bay - specifically in murals, led by some of the more enjoyable neighborhoods in St. Pete. That[.] spreading more widely in Tampa as well.\n\nThere are a handful of underground studios - I follow Venture Compound in St Pete - and some decent galleries that house arts events. It has taken me a longer time to get to know material artists here than performing artists. Quite frankly, the larger \"museums\" in Tampa Bay are underwhelming, though both the St. Pete museum and the Tampa museum attract good traveling exhibitions regularly. \n\nOkay. This segues into a cultural critique I have of this region:\n\nPeople will point to the Dali museum - and it is a great museum - but it also points to what I consider to be a cultural blind spot in Tampa Bay that I've noticed over the years. Tampa Bay generally attempts to attract \"big name\" headliners to just about everything they do. This is a common thing everywhere, and I get it. If you can get a big visitor to come give a lecture, or perform, or anchor a museum (Dali, say), then you have a \"draw.\" \n\nThe weakness of this as an overriding guideline is that it requires huge amounts of money and doesn't foster the *development* of an arts culture. It just attracts headliners. The Dali museum - absolutely worth seeing - is a beautiful example of architecture and exhibition of... a generally over-rated artist that doesn't have any cultural significance to Tampa Bay *other* than a private collector of Dali lived here. And, because the resources have gone to creating and maintaining those spaces there aren't resources put into fostering more gritty development and community actions, or building up and supporting local and regional artists. I'm using the Dali museum as a single example - and a successful one - of what I see across virtually *all* segments of the cultural landscape in Tampa. We generally prioritize these \"big deal\" events, and shirk or ignore the smaller ones - both in terms of programming them *and* in terms of showing up to support them. tl;dr: get out of the house and go support smaller stuff every once in awhile."}