{"doc_id": "38", "name": "2016_06_humanities_student_major_365_socialism", "namespace": "we1sv2.0", "metapath": "", "pub": "socialism", "title": "2016-06-humanities-student-major_365_socialism.txt", "pub_date": "2016-06-04T00:00:00Z", "Sentiment": "0.13", "Subjectivity": "0.36", "Score": "50", "Upvotes": "50", "Downvotes": "0", "Wordcount": "752", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4mkd01", "Reddit_id": "d3we6ma", "Subreddit_id": "t5_2qjii", "Commenter": "DeLaProle", "length": "4354", "content_scrubbed": "One of the things that turned me onto socialism was reading about the experiences of people like Claude McKay, a Harlem Renaissance era poet, who visited the USSR at a time when black Americans were being systematically terrorized in the west:  \n  \nWhen an American writer introduced me as a poet to a very cultured German, a lover of all the arts, he could not believe it, and I don't think he does yet. An American student tells his middle class landlady that he is having a black friend to lunch: \"But are you sure that he is not a cannibal?\" she asks without a flicker of a humorous smile!\n\nBut in Petrograd and Moscow, I could not detect a trace of this ignorant snobbishness among the educated classes, and the attitude of the common workers, the soldiers and sailors was still more remarkable. It was so beautifully naive; for them I was only a black member of the world of humanity.\n\nDuring the first days of my visit I felt that the great demonstration of friendliness was somehow expressive of the enthusiastic spirit of the glad anniversary days, that after the month was ended I could calmly settle down to finish the book about the American Negro that the State Publishing Department of Moscow had commissioned me to write, and in the meantime quietly go about making interesting contacts. But my days in Russia were a progression of affectionate enthusiasm of the peopl towards me. Among the factory workers, the red-starred and chevroned soldiers and sailors, the proletarian students and children, I could not get off as lightly as I did with the intelligentsia. At every meeting I was received with boisterous acclaim, mobbed with friendly demonstration. The women workers of the great bank in Moscow insisted on hearing about the working conditions of the colored women of America and after a brief outline I was asked the most exacting questions concerning the positions that were most available to colored women, their wages and general relationship with the white women workers. The details I could not give; but when I got through, the Russian women passed a resolution sending greetings to the colored women workers of America, exhorting them to organize their forces and send a woman representative to Russia.\n  \nEdit: I also might as well add an anecdote he shares in the above essay, as it is humorously sad but reveals the silliness of conceptions of race/whiteness.\n  \nChukovsky was quite incredulous when I gave him the facts of the Negro[.] status in American civilization.\n\n\"The Americans are a people of such great energy and ability,\" he said, \"how could they act so petty towards a racial minority?\" And then he related an experience of his in London that bore a strong smell of cracker breath. However, I record it here in the belief that it is authentic for Chukovsky is a man of integrity: About the beginning of the century, he was sent to England as correspondent of a newspaper in Odessa, but in London he was more given to poetic dreaming and studying English literature in the British museum and rarely sent any news home. So he lost his job and had to find cheap, furnished rooms. A few weeks later, after he had taken up his residence in new quarters, a black guest arrived, an American gentleman of the cloth. The preacher procured a room on the top floor and used the dining and sitting room with the other guests, among whom was a white American family. The latter protested the presence of the Negro in the house and especially in the guest room. The landlady was in a dilemma, she could not lose her American boarders and the clergyman[.] money was not to be despised. At last she compromised by getting the white Americans to agree to the Negro[.] staying without being allowed the privilege of the guest room, and Chukovsky was asked to tell the Negro the truth. Chukovsky strode upstairs to give the unpleasant facts to the preacher and to offer a little consolation, but the black man was not unduly offended:\n\n\"The white guests have the_right to object to me,\" he explained, anticipating Garvey, \"they belong to a superior race.\"\n\n\"But,\" said Chukovsky, \"I do not object to you, I don't feel any difference; we don't understand color prejudice in Russia.\"\n\n\"Well,\" philosophized the preacher, \"you are very kind, but taking the scriptures as authority, I don't consider the Russians to be white people.\""}