{"doc_id": "1907", "name": "2016_08_humanities_student_major_624_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2016-08-humanities-student-major_624_GradSchool.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.077", "Subjectivity": "0.45", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "643", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6c2eth", "Reddit_id": "d6c3se2", "Subreddit_id": "t5_2r4r8", "Commenter": "Truant_Muse", "length": "3487", "content_scrubbed": "It[.] complicated, but I'll try.\n\nI should start by saying that I did my first masters degree in English, so if you're in STEM or something outside the humanities your experience may be very different.  The areas that I tried to consider as I started looking into Ph. D programs were overall quality of life questions.  I wasn't jaded, but I'd been close enough with my academic adviser/thesis supervisor in undergrad to begin to get a sense of the politics of academia, and thus with a less idealized view of what it is to be a professor and this became even clearer after finishing my first graduate degree.  Again I wasn't jaded, but I was at a point in my life where either because I was ready to or because of the experiences I had had I was really trying to consider the full scope of what my future career might look like.  \n\nFor example, I loved and still do love research in my area of study, but I began to question how much I wanted to have to spend my career chasing tenure via publications.  Whether I wanted a career with the constant weight of \"I should be doing research\" hanging over my head.  It wasn't the worst thing in the world, but it was something to consider.\n\nAnother aspect was that I knew a fair number of people in academia by the time I finished my first graduate degree who were in varying stages in their careers as academics, so I had a fuller view of the struggles faced early on.  Some people overcome those struggles, some don't for any number of reasons.  I'm not afraid of working hard or struggling, but again it[.] the question of what you personally want to do.   I also knew that in my area of study a Ph. D from start to truly being finished would take a minimum of 5 years, but could take up to 7 or more.  So that[.] another 5-7 years of living like a student and then maybe a postdoc, and maybe adjudicating, so basically unless you're lucky that[.] another 5-10 years of of uncertainty even after you finish your Ph. D. If you're lucky you'll get a tenure track position, but those can be very hard to come by for humanities people.  So basically I realized that going the Ph. D route would mean that I couldn't really expect to settle down or start living like an adult until maybe my mid, or even late 30s. And to clarify by \"settle down\" I don't mean get married and have kids, I just not move every 3 years, not have to adjunct at 3-4 different schools, have health insurance, and a reliable income. \n\n\nThis is also about the time I started considering a library degree for all the reasons stated in my original post, but also because it was another two year masters degree and then I'd be able to start working and start building my adult life.  I also considered the fact that going back for my Ph. D would always be an option especially since as an academic librarian I would presumably be working at a university where I could potentially do that work if I ever chose to. \n\n\n\nHonestly the hardest part about deciding to go the route I ended up going was letting go of my pride a bit.  I'd been planning to be a professor for years, I'd told people that was what I wanted to do.  So I worried it would look like I'd given up because I couldn't cut it, or because I wasn't good enough etc.  When really it came down to a quality of life (the kind of life I wanted anyway) kind of choice. \n\n\n\n\ntl;dr Things that were turn offs for academia/being a professor- publish or perish mentality, politics of tenure, job uncertainty/stability, and time."}