{"doc_id": "1873", "name": "2016_08_humanities_student_major_333_seattle", "namespace": "we1sv2.0", "metapath": "", "pub": "Seattle", "title": "2016-08-humanities-student-major_333_Seattle.txt", "pub_date": "2016-08-05T00:00:00Z", "Sentiment": "0.144", "Subjectivity": "0.402", "Score": "14", "Upvotes": "14", "Downvotes": "0", "Wordcount": "533", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d662wbp", "Reddit_id": "d664bt9", "Subreddit_id": "t5_2qhad", "Commenter": "online-alterego", "length": "3010", "content_scrubbed": "How many people attended the class?\n\n* In my class (I went in April, this isn't new) there were probably 20-25 people, not all of whom were white. Many of my co-workers went as well to the class on different days and experienced similar sized groups, and when I got the confirmation email it was noted that all of the classes were full and that they had a waiting list, which indicates to me that there is demand for this.\n\nHow much did it cost?\n\n* My employer bought a block of tickets so I don't know what mine was, but looking at the current course page it says $60 (though they are all sold out, again indicating demand)\n\nWhat is one policy or perception this class changed your mind?\n\n* There were a lot of things that were powerful in the class. Much of it had to do with putting definitions on concepts that are thrown around a lot but not deeply explored. People who are immersed in equity issues might find the class pretty 101 but you could tell that it was broadening the perceptions of a lot of people in the room (myself included), which was a powerful experience in itself. One specific definition that stuck with me was a culminating definition of white privilege as something to the effect of \"to have gone your whole life without having had a deep relationship with a POC and not having felt like anything was lost.\" The implication being that white culture is so dominant, and our society so racially and socioeconomically stratified, that you can exist within your own bubble as a white person and feel complete. I'm not sure this changed my mind about anything necessarily, but has led me to re-examine my own life and relationships and try to form more diverse friendships. I'm aware this might sound like tokenism, but i'm already spending too much time on this reply for a Friday afternoon and am not sure I can examine the nuance here right now.\n\nCould you think of better ways of spending the money to help minorities?\n\n* I'm not really sure how to answer this. Can we optimize for every dollar spent on any issue? No. Since the city is just hosting these classes and especially since people are buying tickets (pretty expensive ones too) and thus offsetting most of the cost, this program is a minor percentage of a percentage of the city budget, and even probably (no data to support this) a sliver of the arts and culture budget, I think its worthwhile. In the context of city budget that also provides basic human services, education, health, police, arts programs (some of which include grants for specific cultural heritage events/institutions), and all other sorts of things that \"help minorities\" (and other people too), do I believe it worthwhile to spend a modicum of funding on promoting intercultural understanding and learning (of which these are not the only courses and programs by the way)? Yes I do. Are they the most essential aspects of the city budget? No.\n\nAnyway, thanks for the real questions, sorry for the long response. Have a good weekend. [edit: formatting]"}