{"doc_id": "2021", "name": "2016_08_humanities_student_major_1715_occupationaltherapy", "namespace": "we1sv2.0", "metapath": "", "pub": "OccupationalTherapy", "title": "2016-08-humanities-student-major_1715_OccupationalTherapy.txt", "pub_date": "2016-08-23T00:00:00Z", "Sentiment": "0.08", "Subjectivity": "0.415", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "446", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6uaaft", "Reddit_id": "d6ubgy8", "Subreddit_id": "t5_2s8kc", "Commenter": "k20a", "length": "2868", "content_scrubbed": " etc and will be required to develop clinical reasoning and critical thinking using this information as a foundation.\n\nMy original argument was that your quoted statement above is actually somewhat of an opposite of what OT requires at its core. OT[.] foundation is NOT found in anatomy and physiology. It is found at the very complex intersection of social, cultural, and environmental contexts with anatomy and physiology being components not foci. Critical thinking and clinical reasoning are concepts that aren't common sense and are highly reliant on individual situations. \n\nFor example, mastering the insertion points of the biceps brachii will do next to nothing when trying to understand the complex relationship between a child with autism, his/her parents, and the dynamic routines that have blossomed within the family through social, cultural, and individual pressures. Degree tracks like anthropology and psychology offer a historical wealth of theory, evidence, and various epistemologies/ontologies for understanding human nature and development that can't be reduced to a simple formula.\n\nDepending on how deep of a philosophical discussion you'd like to travel down, I'll start by saying that it[.] my opinion that you're also inherently affording more social stature/capital/preference to a background in the hard_sciences because *you* found general elective, (and most likely) introductory courses a breeze. You're right that it is a comparison of apples to oranges, but in you're argument you're automatically assuming apples are the far superior choice. And that[.] just not true nor accurate. And this also doesn't then assume that oranges must be superior. Rather both can contribute beneficial knowledge necessary for practicing OT depending on the setting and context.\n\nOT, in its contemporary form, can trace its roots back to the moral treatment and Arts and Crafts movements of the late 1800s. These movements were born within the humanities and sought a way to treat humans as people rather than objects when it came to healing one[.] ailments. Then, after WWII, discourse shifted to deem medical, objective knowledge king; asserting that mental illness must originate from physiology rather than society - Re: the renaissance.\n\nFinally, I don't - in any way - mean to take away from your personal experiences. Diversity in our profession is extremely important as it helps to inform the potential for any client we may come across as I'm sure your life experiences has. But studying anthropology, sociology, etc is no less an experience to be lived. Most often, they require extensive fieldwork with people to research and learn how to walk a path of life different than their own. These majors offer structured guidance in these experiences coupled with historical exposure to philosophical and theoretical thought on society and culture. "}