{"doc_id": "1958", "name": "2016_08_humanities_student_major_1122_atheism", "namespace": "we1sv2.0", "metapath": "", "pub": "atheism", "title": "2016-08-humanities-student-major_1122_atheism.txt", "pub_date": "2016-08-16T00:00:00Z", "Sentiment": "0.086", "Subjectivity": "0.32", "Score": "53", "Upvotes": "53", "Downvotes": "0", "Wordcount": "315", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6jmrrm", "Reddit_id": "d6jzqxj", "Subreddit_id": "t5_2qh2p", "Commenter": "tucker_sitties", "length": "1763", "content_scrubbed": "So interesting point -- I took theology in college, it was a catholic college but liberal_arts not private, no uniforms, etc, just founded and based on a monastery. Great place, i have no regrets.  However. took 2 different courses on theology, much like history breaks up the beginning of time to something like 1650, then the next class is 1650 to present -- the Theo classes were old testament, then new testament.  These classes literally laid the foundation for my later decision to become Atheistic/Agnostic.   The very nature of the history, the creation of the bible, the bloodlines, etc all highlighted the not only what I still consider its amazing construction over ages -- I mean, regardless if I believe it or not, the history of it all is still impressive as a creation of a book -- but also the fragility of the book itself and its meaning. \n\nIt[.] been so highly impacted by basic secular world events and changes that it[.] amazing it even holds any of the original words and meanings.  It was really a benefit to me in the long run.  The history of it[.] creation helped me to understand a great deal of the personal and political impacts on the book, the sources of many of the stories (which no doubt lend heavily from other religions, pagan beliefs and basic every day societal customs), and the somewhat horrifying effect with which this book has been used. \n\nI think I started down my current path early on in life, but i had to go to school and learn about the bible[.] history to seriously \"release the yoke\" and clear my head and keep myself open to the possibility of Atheism without crazy internal struggle or fear.\n\nSo, TLDR --- Just do your research, you'll find out all the answers you need. And no, they are certainly NOT in that book."}