{"doc_id": "88", "name": "2016_06_humanities_student_major_932_calpolypomona", "namespace": "we1sv2.0", "metapath": "", "pub": "CalPolyPomona", "title": "2016-06-humanities-student-major_932_CalPolyPomona.txt", "pub_date": "2016-06-13T00:00:00Z", "Sentiment": "0.072", "Subjectivity": "0.361", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "1041", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4n9i7n", "Reddit_id": "d474eky", "Subreddit_id": "t5_2sdae", "Commenter": "Glengar", "length": "5391", "content_scrubbed": "Hi friendo, here[.] my advice and some math :]\n\nOkay, let[.] say that you somehow found a full time and part_time job by the time you start school. Let[.] also assume you take the minimum required units to take to be considered a \"full time student.\" I'm assuming full time because i know some financial aid requires the student to be full time. Anyways....\n1 week has 168 hrs (sun-sat) with a full time job being at least 8 hr days (40 hrs a week) and a part_time being under (lets assume 6 hrs a day so that[.] 30 hrs a week for 5 days) that means your jobs have already taken up 70 hrs of your 168. As for classes if you take the minimum units required (12) to be a full time student, and estimating that each unit = 1 hr that[.] 12 hrs out of your total week hours. \n\nSo far you have 168 - 40 (full time work) - 30 (part_time) and - 12 (class time) giving you a total of 86 left for other things. \nFor sleep, it can vary but lets say you sleep 6 hrs a day, so that[.] 42 hrs of sleep giving you 44 hrs of other stuff. Lets also assume you take about an hr to eat each meal (cook, get the food, etc), and you skip breakfast. This has a cost of 14 hrs a day. Now you have a total of 30 hrs for other things. That 30 hrs is for, travel, using the bathroom, finding parking, studying, socializing, relaxing etc. Also keep in mind that this is IF you take 12 units, and each unit = 1 hr.\n\nSo here[.] my advice. Don't do it. It seems like paying of school with no debt is a big piece of your decision of going to college, but doing all this will cause you to be tired in class, which will probably lead to sleeping in class which == waste of money. Keep in mind that your going to have to do this for all 4 years. (well maybe 5 if you only take the minimum required). Also, depending on your major (STEM and art specifically) your foundation classes are very important as pieces of what your learn there will carry over to your more advance classes later on. If you fall behind in the beginning, you may have a difficult time catching up!\n\nHere[.] what I think you should do. Assuming that your parents don't plan on ditching you on the street, I suggest forgoing CPP and going to community college and re-applying later. The reasoning for this is all (i think) community colleges have BOG fee waivers which waives the tuition cost, but if you don't qualify for that, tuition for CCs (community colleges) are much cheaper. And while you take classes there which will allow you to save money by taking cheaper classes, you can grab a part_time job and work and collect money that way. Also (you should check with college financial aid person) while your at the community college you can collect CAL grants, and PELL. \n\nHeres the thing with those two grants. If your are going to a CC you will get less from the CAL grant, PELL on the other hand remains 5k per year. CAL only gives you 4 years, after that point the money stops coming. I think PELL is 6 years. Make sure you check all this with a college financial aid person. Anyways, while your at the CC collect the money and put it straight into a savings account. That way after, lets say 2 years, the money you saved increased a little (it wont be much, but its maybe a few dollars more?) Also the amount CAL gives your will vary on the type of CAL grant you get (A or B) and the cost of the school you are going to (you get more for more expensive schools) So wasting it all on a CC wouldn't be the best idea. Also once you start getting cal grants, you only have a 2 semester break periods (cant be consecutive) when you get the money, this mean you can halt the income you get from CAL. This is important because if you don't pause it, even if you don't get any money, it will still count as a \"amount spent.\" this means if you spent 1 years worth of CAL, and you take a year off without pausing, then you only have 2 years left of CAL grants total. There[.] a few other things with CAL grants, but you should ask a financial aid officer about that. \nAside from CAL, PELL only restriction is no BA/BS there[.] an unlimited wait time (or its like 6 years wait?) Anyways this path will allow you to...\nSave money while going to school while not working\nGo to work and save more money for school\nSave money by taking cheaper GE and foundational classes\nNo loans! (probably?)\nAND just in case, IF you decide you don't like your major, and want to try something new, changing major at a CC is much easier than changing at a college or university.\n\nAs a few extra side notes, i think its best if you don't withdraw from CAL, it should only be a few hundred for a CC, and CPP should give substantially more. You could also take out loans, but ill only suggest that depending on your major. If you picked a STEM major, accounting (i think that falls under math?) or something similar then that[.] fine, but if your majoring in the ARTS or \"studies\" then no. Also, really? studies?!? If you don't like loans, or my suggestion, then i suggest only doing 1. (full or part_time) as you will need the extra time for other things. You can always try work study, but i haven't done that so i can't really give you my two cents on that option. \n\nAnyways good luck on your choice, and your future prospects. And sorry for my super long post, and any grammatical errors (probably spelling errors) in my post... i was too lazy to read though and correct anything! \n\n"}