{"doc_id": "24", "name": "2016_06_humanities_student_major_246_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2016-06-humanities-student-major_246_politics.txt", "pub_date": "2016-06-03T00:00:00Z", "Sentiment": "0.04", "Subjectivity": "0.384", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "869", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d3u98tm", "Reddit_id": "d3u9il3", "Subreddit_id": "t5_2cneq", "Commenter": "gamechanger55", "length": "5698", "content_scrubbed": "http://rense. com/general37/fascism. htm\n\nPowerful and Continuing Nationalism - Fascist regimes tend to make constant use of patriotic mottos, slogans, symbols, songs, and other paraphernalia. Flags are seen everywhere, as are flag symbols on clothing and in public displays.\n\nTrumps complete disdain for anything other than american. His entire campaign is run on American exceptional-ism.\n\nDisdain for the Recognition of Human Rights - Because of fear of enemies and the need for security, the people in fascist regimes are persuaded that human rights can be ignored in certain cases because of \"need.\" The people tend to look the other way or even approve of torture, summary executions, assassinations, long incarcerations of prisoners, etc.\n\n\"We should torture even if it doesn't work\" and \"we should kill the families of terrorist\". Brilliant quotes of Donald Trump with great regard for human rights.\n\n Identification of Enemies/Scapegoats as a Unifying Cause - The people are rallied into a unifying patriotic frenzy over the need to eliminate a perceived common threat or foe: racial , ethnic or religious minorities; liberals; communists; socialists, terrorists, etc.\n\nMuslims, mexicans, blacks, minorites...... anyone non white\n\nSupremacy of the Military - Even when there are widespread domestic problems, the military is given a disproportionate amount of government funding, and the domestic agenda is neglected. Soldiers and military service are glamorized.\n\nLargest most powerful military in the world just keeps needing more and more money. \n\nRampant Sexism - The governments of fascist nations tend to be almost exclusively male-dominated. Under fascist regimes, traditional gender roles are made more rigid. Divorce, abortion and homosexuality are suppressed and the state is represented as the ultimate guardian of the family institution.\n\n\"Blood coming out of her whatever\" Donald Trump\n\nControlled Mass Media - Sometimes to media is directly controlled by the government, but in other cases, the media is indirectly controlled by government regulation, or sympathetic media spokespeople and executives. Censorship, especially in war time, is very common.\n\nUnfortunately for Trump and his gang he doesn't have this ticked yet. I'm sure he will though cause he[.] promised to go after media for nonsense... First amendment not important at all.\n\nObsession with National Security - Fear is used as a motivational tool by the government over the masses.\n\n\"Ban all Muslims from america\" Donald trump. Constant bickering from his gang that isis is taking over american when it is factually true than isis is in syria.... half way around the globe.... and is at the moment loosing ground.\n\nReligion and Government are Intertwined - Governments in fascist nations tend to use the most common religion in the nation as a tool to manipulate public opinion. Religious rhetoric and terminology is common from government leaders, even when the major tenets of the religion are diametrically opposed\nto the government[.] policies or actions.\n\nFortunately for Trump i doubt he[.] ever even read a word of the bible. Right has shown that given the chance they'ed cross out the first amendment again and enforce Christianity on america.\n\nCorporate Power is Protected - The industrial and business aristocracy of a fascist nation often are the ones who put the government leaders into power, creating a mutually beneficial business/government relationship and power elite.\n\nFortunately for trump his rhetoric doesn't fit this narrative. Unfortunately for him he is the embodiment of corporate corrupting power over the american middle class. \n\nLabor Power is Suppressed - Because the organizing power of labor is the only real threat to a fascist government, labor unions are either eliminated entirely, or are severely suppressed.\n\nLabor power = communism in his supporters minds. Clear lack of understanding of the influence of labor and unions in protecting the american middle class.\n\nDisdain for Intellectuals and the Arts - Fascist nations tend to promote and tolerate open hostility to higher education, and academia. It is not uncommon for professors and other academics to be censored or even arrested. Free expression in the arts and letters is openly attacked.\n\nDismissal of climate change in the face of all the evidence. \n\nObsession with Crime and Punishment - Under fascist regimes, the police are given almost limitless power to enforce laws. The people are often willing to overlook police abuses and even forego civil liberties in the name of patriotism. There is often a national police force with virtually unlimited power in fascist nations.\n\nAbsolute love of police. Dismissal of police abuse against African American.\n\nRampant Cronyism and Corruption - Fascist regimes almost always are governed by groups of friends and associates who appoint each other to government positions and use governmental power and authority to protect their friends from accountability. It is not uncommon in fascist regimes for national resources and even treasures to be appropriated or even outright stolen by government leaders.\n\nFortunately for trump he[.] never held power to fulfill this mark\n\nFraudulent Elections - Sometimes elections in fascist nations are a complete sham. Other times elections are manipulated by smear campaigns against or even assassination of opposition candidates, use of legislation to control voting numbers or political district boundaries, and manipulation of the media. Fascist nations also typically use their judiciaries to manipulate or control elections.\n\nFortunately for trump he[.] never held office to tick of this mark.\n\n\n\n10/14-71%.... i'd say that[.] a pass. "}