{"doc_id": "1836", "name": "2016_08_humanities_student_major_14_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2016-08-humanities-student-major_14_politics.txt", "pub_date": "2016-07-31T00:00:00Z", "Sentiment": "0.023", "Subjectivity": "0.314", "Score": "24", "Upvotes": "24", "Downvotes": "0", "Wordcount": "953", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4vknoi", "Reddit_id": "d5z681h", "Subreddit_id": "t5_2cneq", "Commenter": "jingooftherex", "length": "5735", "content_scrubbed": "**For those hitting the article limit...**\n\nHouse Speaker Paul D. Ryan (R-Wis.), Senate Majority Leader Mitch McConnell (R-Ky.) and vice-presidential nominee Gov. Mike Pence of Indiana (R) knew what they were getting into when they climbed aboard the Donald Trump bandwagon. They had watched him insult minorities, POWs, the disabled and women. They had seen for themselves how utterly ignorant he was about basic policy concepts. They knew he lied about big and small things (e. g., falsely saying he opposed the Iraq War, reneging on charity pledges until shamed by The Post). They knew he'd stiffed and swindled Trump U students. They never should have backed him; they were abetting a vile individual attaining the country[.] most powerful office, for which he was patently unfit. Pence went a step further in agreeing to be his running mate, and now travels around the country cheerleading for Trump.\n\nNow Trump demeans two Gold Star parents. When slammed, he does not apologize or retract the remarks. He insists he has read the Constitution but then claims Gold Star father Khizr Khan has \"no right\" to criticize him. In a pathetic statement trying to paper over his egregious remarks, he does not apologize to the Khans nor retract his insults. The world-class narcissist claims to be worthy of the same sympathy (I sacrificed too!) as the parents who lost their son. (As an aside, it would a spectacular instance of political karma if after smearing all Muslims and attacking their patriotism, Trump would see two patriotic Muslim parents hammer the final nails in his campaign coffin.)\n\nWhat does Pence, father of  Marine 2nd Lt. Michael J. Pence, do? He directs the press wanting comment to Trump. Really, that[.] it? One wonders how 2nd Lt. Pence — and all the other Americans risking their lives — feel about that. Pence[.] silence and continued presence on the ticket suggest he considers Trump within the bounds of normal political discourse. If Pence had a modicum of dignity or decency, he would tell the American people, \"I made a terrible mistake. Mr Trump is so morally bankrupt and of such shabby character that I could not possibly serve with him.\" Failing to do so, the same should be said of Pence.\n\nIn his interview on ABC[.] \"This Week,\" Trump also revealed he did not know Russia had invaded Ukraine. (Putin[.] \"not gonna go into Ukraine, all right? You can mark it down.\") When George Stephanopoulos told him it already had, he repeated the Kremlin[.] talking point that the people of Crimea wanted Russia to invade.\nThe offices of Ryan and McConnell wouldn't comment on Trump[.] slur against Ghazala Khan or ludicrous claim he[.] \"sacrificed\" just as the Khans have. Their spokesmen would only repeat the bosses' prior remarks on Trump[.] Muslim stances. That[.] not the point. They know this but they are abdicating moral leadership because they cannot possibly justify their support of Trump. In their silence, they condone Trump and stand with him. They should be standing with the Khans. Do these congressional \"leaders\" actually have nothing to say about the cruel attack on two parents who now go to other military funerals to honor their son? Republicans' refusal to un-endorse Trump puts their own character and judgment in doubt. It is fair to say that the Republicans who cheer him on — not Sen. Ted Cruz (Tex.), who refused to — are signing their own political death warrants.\n\nIt[.] not just cruelty toward the Khans — although this alone should be grounds for banishment from public life. Just this week Trump said he wanted to do violence to former New_York mayor Michael Bloomberg and lied that he turned down a meeting with the Koch brothers (two real billionaires whose wealth and charitable generosity dwarf Trump[.] and who have refused to back him). In fact, the Koch brothers should get brownie points for refusing to meet with Trump.\n\nTrump continues to insist he[.] been a business success and charitable marvel, but he won't release his tax returns, strongly suggesting he is lying about both. The Koch brothers, \"the owners of Koch Industries, one of the world[.] biggest conglomerates, have kicked in an estimated $1. 5 billion or so to an array of causes and institutions most liberals love: public television, medical research, higher education, environmental stewardship, criminal justice reform and the arts.\" Where is the evidence Trump has done even a fraction of that? Where are the hospitals, the civic institutions, the science labs, the schools, the homeless shelters and soup kitchens he[.] paid for? He either doesn't have substantial sums to give or he[.] a selfish cheapskate.\n\nTrump[.] penchant for lying (e. g., that he had a \"relationship with Putin\" which on Sunday he denied; that the NFL sent him a letter begging him to change the debate schedule), his abject lack of human empathy and his stunning ignorance now put his protectors, such as Republican National Committee Chairman Reince Priebus, and his endorsers, such as Sens. Tom Cotton (Ark.) and Marco Rubio (Fla.), in a tough spot entirely of their own making. Republicans who fell in line behind Trump cannot escape the moral stench he emits. He disrespects parents of a fallen warrior; they do as well with their silence. He attacks other Americans, lies habitually and embodies none of the qualities we expect of elected leaders; they demonstrate moral and political cowardice in refusing to condemn him.\n\nIt[.] no longer sufficient for Republicans to rebuke Trump[.] loony positions or foul statements. There are too many of both. The problem is not one of policy but of the nominee himself. Republicans must rebuke Trump himself and cease supporting him. Silence is consent. And consent is disqualifying for high office."}