{"doc_id": "169", "name": "2016_06_humanities_student_major_1650_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2016-06-humanities-student-major_1650_changemyview.txt", "pub_date": "2016-06-23T00:00:00Z", "Sentiment": "0.128", "Subjectivity": "0.417", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "419", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d4la4n4", "Reddit_id": "d4lbjsi", "Subreddit_id": "t5_2w2s8", "Commenter": "PossumMan93", "length": "2275", "content_scrubbed": "What if the hobby that interests you is General Relativity, or Botany, or Africana Studies? Many of these things people can and do study on your own. But I'll give you a personal case for why I believe my four-year educational experience was invaluable, regardless of what my major was. For four years, my full time job was to learn how to think critically and to engage with others in discourse about those thoughts. I went to a liberal_arts college, which meant I was exposed not only to two classes or more per semester that were requirements for my major, but also at least one class a semester that had nothing to do with it. My major was Physics with a minor in Mathematics, and I had world-class teachers in every one of those subjects that provided me *far*, **far** deeper understanding than I could have ever gotten on my own. As far as my career is concerned, I will obviously be better off as an academic for the time I spent there. But I was also forced to take a Poetry class, a class on Islam and gender, a class on American Suburbia (a class by the way, which to those jaded against the system probably sounds like classic liberal_arts woo, but in which I leaned probably the most per day than I ever had before), a class on abstract mathematics (which will most likely never be used in my career, but provided a spring board for me to discover a true passion of mine for abstract math), a class on Film and Literature, etc., etc. you get the idea. Each of these classes required a different style of self-study, a different perspective on the individual as critic and student -- each offered a glimpse at a different facet of the jewel of intellectual enrichment and the dialectic (the idea that knowledge is only gained through discourse with ideas and opinions different than your own). In my opinion, it didn't matter if the person next to me was majoring in Business or Gender and Queer studies. Who am I to say what is a better choice for their future? It may be harder to get a good paying job with those more \"liberal_arts-y\" majors, but who cares. It[.] hard to get a job for almost everybody. I respect people more when they follow their passions than when they choose a path that their heart is not really in just to make their monetary life easier."}