{"doc_id": "1961", "name": "2016_08_humanities_student_major_1146_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2016-08-humanities-student-major_1146_college.txt", "pub_date": "2016-08-16T00:00:00Z", "Sentiment": "0.035", "Subjectivity": "0.298", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "303", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4y0er0", "Reddit_id": "d6kamtt", "Subreddit_id": "t5_2qh3z", "Commenter": "OrangeBluejedi", "length": "1639", "content_scrubbed": "In my state, community college makes sense.  about 20 years ago (around 2000) the state dept of education got together with all the trade schools and community colleges and 4 year public and private colleges and created a direct transfer degree.\n\nMeaning if you go to trade school/earn an Associate of Arts and Applied Science in say welding or automotive studies  later want to transfer to a 4 year in state college, about 45% of the college credits you took with a C or higher numbered 102 or higher WILL follow you.\n\nIf you earn a direct transfer degree in Science (math and science majors get lumped into Science) Music, humanities or nursing (DTA-S, DTA-AS, a DTA or AS-Nursing) then switch to a 4 year in state school, 100% of the credits will follow you.  Example-you are torn between majoring in the preforming arts or English and you go for the DTA-AS (direct transfer arts and science) and then you decide you being an English major and/or a music Major is not for you and you want to switch to criminal justice when you enter your junior year of college-bam!  super easy to do, and at least 90% of your credits will follow.  \n\nno idea what the hell you want to do, let alone why you are college other than you don't want to be there to begin with and just want to get something to make your parents shut the hell up?  DTA degree is just for you.  It[.] basically a 2 year liberal_arts/general studies degree and if you want to return to college in 15 years because you finally figure out what you want you want to become when you grow up, 100% of the credits numbered 102 or higher will follow you as long as you get that degree."}