{"doc_id": "76", "name": "2016_06_humanities_student_major_843_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-06-humanities-student-major_843_AskReddit.txt", "pub_date": "2016-06-11T00:00:00Z", "Sentiment": "0.191", "Subjectivity": "0.435", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "410", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4nmz8b", "Reddit_id": "d458i8k", "Subreddit_id": "t5_2qh1i", "Commenter": "beanfiddler", "length": "2396", "content_scrubbed": "Don't make costly decisions -- and that goes for both time and money -- until you're certain it[.] what you want. Expecting to have a lucrative career and stuff is not \"knowing what you want.\" You will burn out that way. I stayed in my less-than-ideal industry for nine years, and I'm about ready to burn the place down. You can't reasonably be expected to suffer through that your entire life, but you also don't want to constantly change careers and have to start at the bottom all over again.\n\nSo, take off whatever time you need. Ideally, work while you do so, to save up money and build your resume. There[.] a lot of raises and promotions you can get in industries like retail, food, and hospitality that don't require a college degree.\n\nYour first year of college, take a very wide variety of electives and general study courses. Go to your professors' office hours, make friends with people with declared majors in certain departments. Really \"shop around\" for your degree, and make sure that that course of study is not only enjoyable, but that the career opportunities it leads to are things you would enjoy doing. Go to a sufficiently large college or university, so you can utilize their resources to go to job fairs and connect yourself with people in the career(s) you want to explore. Boutique liberal_arts colleges are wonderful, but they don't usually have the best community outreach. You need the large state research universities if you want that. Look for universities in large cities and towns, where you can reasonably expect to find professionals in any field that are connected to the university. Ask them about what their daily lives look like, what they like about their careers, and what they hate.\n\nJust because you're \"good\" at something doesn't mean that you enjoy being good at it. You need to chose something, ideally, that you're sufficiently motivated to perform well above average in. That way, even if it[.] something competitive, you can count on being successful. It[.] way better to be an extremely enthusiastic history major who really enjoys academics and that career path than it is to be a totally bored engineering major who could really care less about what they're studying.\n\nYou can pretty much turn anything into money or a career, provided you're motivated and good at it. So don't go with something doesn't motivate you. You'll absolutely regret it."}