{"doc_id": "1898", "name": "2016_08_humanities_student_major_542_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2016-08-humanities-student-major_542_college.txt", "pub_date": "2016-08-09T00:00:00Z", "Sentiment": "0.174", "Subjectivity": "0.389", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "458", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4wt69f", "Reddit_id": "d6ao1jg", "Subreddit_id": "t5_2qh3z", "Commenter": "MyRedditAccount--", "length": "2637", "content_scrubbed": "In my opinion, as non-Greek student who was admitted to Vanderbilt as a transfer several years ago and as someone who had a very close non-Greek friend attend Vanderbilt as a transfer, I would choose Rice over Vanderbilt in a heartbeat. Rice has a location you like, a superior housing system, no Greek life, and from what I've read a better process for transitioning transfers. According to my friend, Vanderbilt did have a process, but it was pretty bad. He ended up in a university-owned apartment building (not out of his choice) and found it very isolating. He also found Greek life overbearing as a non-Greek student. You're going to get a great education at both, but I'd argue that the education at Rice will better. Rice for the most part has the the liberal_arts intimacy that a school the size of Vanderbilt cannot pull off, and I think that intimacy sets liberal_arts colleges and institutions like Rice, Dartmouth, and to some extent Yale and Princeton above all other similarly ranked institutions.\n\nI transferred from a liberal_arts college to Northwestern, a school with the same student body quality (in regard to ACT/SAT, GPA, etc.) as all the other top 20 schools. However, I found my education, while high quality, to be inferior to that of my liberal_arts school (which was also a top 20 LAC). While their student faculty ratios are identical, Northwestern had an absolute disadvantage in its size. At my old school, maybe 30-60 kids took Organic Chemistry a semester, which was easily divided into 1-3 classes of 20-30 kids. At Northwestern, 100+ kids wanted to take Organic Chemistry a quarter, which often lead to a 70-90 person class for pre-med students and a 20-40 person class for chemistry majors. I remember taking a 300 person class (although it was quite popular) during my first quarter. That[.] 50-75% of my entire cohort at the LAC I attended. At Northwestern, I've had classes with as few as 3 kids and with as many as 300. At my old school, I had classes from 7-25 students (and these were intro level courses that should be much more populous than advanced courses).\n\nI love Northwestern and am absolutely proud to call it my alma mater, but every year I was there I definitely missed a lot of that academic intimacy that was found at my previous school. I say all of this, because I think Northwestern and Vanderbilt are relatively analogous, and I think Rice is that happy middle-ground between those bigger institutions and LACs. You'll get most of the intimacy (i. e. smaller classes) that an LAC has without as few majors and course offerings. \n\nOverall, I'd choose Rice if I were in your shoes. "}