{"doc_id": "199", "name": "2016_06_humanities_student_major_1958_premed", "namespace": "we1sv2.0", "metapath": "", "pub": "premed", "title": "2016-06-humanities-student-major_1958_premed.txt", "pub_date": "2016-06-27T00:00:00Z", "Sentiment": "0.086", "Subjectivity": "0.298", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "310", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4q71ki", "Reddit_id": "d4qsg7e", "Subreddit_id": "t5_2rlp9", "Commenter": "deadpear", "length": "1641", "content_scrubbed": "For number 1, that sounds like a sunk cost fallacy - your student loan debt is already there, might as well get the degree you enjoy.  If you are fearful of doing poorly in those classes how do you think you would perform in med school?  You will need to overcome that fear.\n\nFor number 2, it[.] not uncommon for people go to school full time and work full time.  Myself and at least a handful of others in my classes were all doing this.  Half of us were taking 3 sciences classes (bio, chem, physics) with labs and a liberal_arts every semester.\n\nFor number 3, I did all my shadowing on weekends in 12hour shifts with the doctors I shadowed.  I volunteer on Sundays for four hours.  No research for me, I don't think it[.] valued as highly as other things in your application outside of a few select schools.\n\nFor 4, make as much money as you can - they want smart people applying.  Work as an EMT if you like doing it.  Personally, I earn too much to quit and take a job that pays 1/3 my current salary.  I get plenty clinical experience in my hospital volunteer position.\n\nLastly, number 5, PA and doctor are different.  Research them both and decide on a path you would be happy with.  For me, part of the appeal of doctor over PA and nurse was the autonomy and control over patient outcomes.  I want to be where the buck stops.\n\nFor timeline, you will need to complete all your prereqs and take the MCAT.  I would not take the MCAT until you have taken your prereqs unless you are good at self-study.  Depending how many of these you need to take, you could apply in a couple years.  Next year if you have most of your prereqs completed."}