{"doc_id": "127", "name": "2016_06_humanities_student_major_1231_financialcareers", "namespace": "we1sv2.0", "metapath": "", "pub": "FinancialCareers", "title": "2016-06-humanities-student-major_1231_FinancialCareers.txt", "pub_date": "2016-06-17T00:00:00Z", "Sentiment": "-0.022", "Subjectivity": "0.457", "Score": "51", "Upvotes": "51", "Downvotes": "0", "Wordcount": "251", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4onbpf", "Reddit_id": "d4e1imq", "Subreddit_id": "t5_2scvl", "Commenter": "ComradeBrosefStalin", "length": "1418", "content_scrubbed": "If you want an honest opinion, you're almost certainly not gonna.\n\nInvestment banking is an incredibly selective field to break in with most spots going to top students (high GPAs and past internships) at top universities (Ivies and Ivy-level). Saying that \"your parents pushed me into medicine\" is not an excuse. You don't need a finance/econ major to break into banking. I know plenty of people with a STEM or liberal_arts background currently working in investment banking, but again they pretty much all had high GPAs from top universities with relevant prior internships. Anyone looking at your resume and seeing the bio major with your GPA can instantly tell that you're a med school reject looking for an alternative.\n\nAnd don't say that your \"passion is in investment banking\" when its clearly not; I doubt you even know what an investment banker actually does. Looking at your post history, literally all of your posts in the past 2 weeks are about how to break into CS and IT so its pretty clear thats not true. If I can smell your insincerity through an anonymous internet post, its not gonna be hard for someone to do so during an in-person interview.\n\nI hate to be so blunt, but this is the reality of your situation. I think you really need to just sit down and think long and hard about what you really want to do with your life instead of just wistfully trying to chase jobs with the biggest paychecks."}