{"doc_id": "92", "name": "2016_06_humanities_student_major_997_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2016-06-humanities-student-major_997_explainlikeimfive.txt", "pub_date": "2016-06-14T00:00:00Z", "Sentiment": "0.192", "Subjectivity": "0.378", "Score": "3", "Upvotes": "3", "Downvotes": "0", "Wordcount": "437", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4o0o3e", "Reddit_id": "d48n40s", "Subreddit_id": "t5_2sokd", "Commenter": "albnite", "length": "2617", "content_scrubbed": "The LNP policy is based on providing an economy that suits the average to exceptional owner and operator classes. Their aims are to reduce business red tape for the greatest number of businesses that can profit the greatest number of people that can affect votes. In the current economy they have created a problem by transitioning to the greatest number of sales on farmland and homeownership to foreign investors. The move included an ability to provide milk and meat to Asia. At the same time foreign owners were renting back houses gained via loans at our banks. It[.] a practice bereft of Australian values and the LNP are aligned to run off to mansions to sit out a disgrace period after the election.\nDie hard electorates like Maranoa refuse to give them up and be done with their budget robbing cuts that gaslight Left leaning policy departments. You can see the style of budget robbing most easily by asking why the CSIRO had cuts in climate change science?\n\nLabor are targeting the economy at the middle class and workers' unions. They attempt to stimulate the greatest number of policies that suit the greatest number of votes. They'll support nearly any policy that seems to get votes. They'll block any popular party that they can. Their supporters fill the internet topics with mass trolling on any sensational piece of information to deny other parties readership. They also like to support businesses and organizations that can affect the greatest number of voters. A negative campaign style is not uncommon. However, despite having so many balls in the air, they do try to cover the needs of the average Australian with a decent economy.\n\nThe Greens have never had a majority government, so they field possibilities on various parts of the economy. Each election they may present a new set of policies to suit voters. This election they, by state of the world, have the best policies on offer for Australians. They were meaning to save the GBR before Greg Hunt[.] UNESCO blunder. They were planning to bring in batteries for renewables before Labor got on the bandwagon. They are pitched to undo the damage created by the LNP budget robbing. Their policies are so far reaching that they actually cover more Australians than any other party. They will support the arts, unemployed, parents, trades, professionals, scientists, tourism operators, farmers, medical practices, businesses, ...\nBut, they are the least likely to get in, and so therefore, are quite ready to work with other parties. 2016 should be the election that Australia thinks/votes Green and divests fossil fuel subsidy and investments."}