{"doc_id": "2000", "name": "2016_08_humanities_student_major_1491_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2016-08-humanities-student-major_1491_AskReddit.txt", "pub_date": "2016-08-21T00:00:00Z", "Sentiment": "0.184", "Subjectivity": "0.447", "Score": "24", "Upvotes": "24", "Downvotes": "0", "Wordcount": "287", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4ytnvs", "Reddit_id": "d6qe1ip", "Subreddit_id": "t5_2qh1i", "Commenter": "JaneCaulfeild", "length": "1552", "content_scrubbed": "Mental illness, for one. \n\nI also realized I didn't have to try to get As (seriously, I skipped more of my senior year than I attended and my lowest grade was a B) so I never really developed a decent work ethic until half way through college. \n\nI wasn't challenged in school either. Like. Obviously I learned new stuff in the 13 years (including kindergarten) of school but for the most part it was the same shit every year and most of the curriculum taught in high school I learned by the time I was like, six. If you dont keep challenging yourself, you kinda let everyone else catch up. \n\nAlso, I put a lot of effort into music, and I was barely better than average at it, but definitely not gifted and any classical musician will tell you that perfect isn't ever perfect enough so I let other things go by the wayside. (I recently kind of put music back to hobby status for other pursuits) \n\nAnd lastly, (and this is the one that makes me the most angry) I think I'm still pretty fucking smart. Probably still a little above average. And when I'm healthy and happy and really passionate about something, I can do really cool things. However, nobody thinks of you as \"gifted\" or even really all that intelligent I've noticed unless you're in STEM. STEM just isn't what I'm interested in, even though I'm willing to bet I could be good if I put in the work because I kicked ass at science as a kid. Like, real science not kid science. But I'm into the arts and unless you're Michelangelo, nobody is going to think you're intelligent as an art major. "}