{"doc_id": "1889", "name": "2016_08_humanities_student_major_484_videos", "namespace": "we1sv2.0", "metapath": "", "pub": "videos", "title": "2016-08-humanities-student-major_484_videos.txt", "pub_date": "2016-08-08T00:00:00Z", "Sentiment": "0.01", "Subjectivity": "0.36", "Score": "48", "Upvotes": "48", "Downvotes": "0", "Wordcount": "401", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d69hd8b", "Reddit_id": "d69jioi", "Subreddit_id": "t5_2qh1e", "Commenter": "Abe_Vigoda", "length": "2300", "content_scrubbed": "BET started off as kind of a black version of PBS. It was originally to promote the arts and academics and all that stuff.\n\nThen it got bought by National Amusements inc who owns Viacom which is a media conglomerate that owns a bunch of other channels. They own BET, MTV, Comedy Central, Nickelodeon, the majority of CBS, Paramount, and a bunch of other shit.\n\nIn the late 80s, hip hop was actually really positive. Lots of rappers were telling kids to get educated and go to school, stay out of trouble and don't fall into the poverty to prison trap.\n\nOnly like 13% of the US is black yet with the rise of the gangster rap genre, the prime target audience switched from poor black kids to suburban white kids, so like 72% of the music was bought by white people who thought the whole thug life thing was awesome.\n\nSince Viacom also owned MTV, they started dumbing down BET and ditched the PBS type of image and started replacing it with shitty image based hip hop, lots of chicks with fat asses, and dumbing down the content to stuff like Soul Plane.\n\nA lot of older black people complained about it, but they were pretty much ignored while Viacom was putting out shows like Cribs, Pimp my Ride, etc...\n\nAaron Mcgruder is like 42 so he grew up when hip hop was still underground/community driven and the Boondocks is largely based on that sort of transitional oldschool to newschool attitude.\n\nWith Huey, he[.] representative of the oldschool mentality. Black Panthers, revolutionary, intellectual, etc...\n\nWith Riley, he represents the newschool gangster wannabee. Street, ignorant, materialistic basically, he[.] a caricature of the image that Viacom helped create.\n\nBoondocks was on Adult Swim/ Cartoon Network and was produced by Sony.\n\nSony is also another of the big media conglomerates. They own Sony Music which is one of the big 3 major record labels and they were slightly not impressed with the direction McGruder took the show, especially with his ongoing feud with BET, so they axed him.\n\nSeason 4 of the Boondocks wasn't written by McGruder. If you watch it, it[.] dumb as shit and doesn't have any of the social commentary or spitting satire of the first 3 seasons. Sony sabotaged the shit out of The Boondocks and turned it into the same dumb shit that McGruder was criticizing BET for."}