{"doc_id": "1904", "name": "2016_08_humanities_student_major_612_lostgeneration", "namespace": "we1sv2.0", "metapath": "", "pub": "lostgeneration", "title": "2016-08-humanities-student-major_612_lostgeneration.txt", "pub_date": "2016-08-10T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.399", "Score": "7", "Upvotes": "7", "Downvotes": "0", "Wordcount": "286", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6btp1a", "Reddit_id": "d6buphi", "Subreddit_id": "t5_2r40j", "Commenter": "baazaa", "length": "1708", "content_scrubbed": "Yeah this is the other problem with the surveys. \n\nThey often struggle to differentiate between:\n\n* My job relates to my degree (i. e. in the same field).\n* My job uses skills I developed in my degree.\n* My degree was useful in *getting* my job. \n\nIdeally you'd think the second question would be the best one, unfortunately all the arts graduates say yes to that, which I find hard to believe (this is the question most open to bias). The third question can just reflect credentialism, it doesn't necessarily entail that society is better off with so many degrees being produced.\n\n In any case, I think the vast majority of people who say that university hasn't helped them in their life are ridiculously overqualified, so it[.] a revealing answer that way. Very few people will be tempted to say 'no' simply because on-the-job training could theoretically have replaced their education.\n\n  In general there seems to be very little overlap between people[.] degrees and benefit to their eventual careers regardless of whether their degree is relevant \n\nThis seems to be depend a bit on the country. In my country (Australia) major is vitally important, arts graduates are totally screwed, while university attended doesn't matter much at all. In the UK there[.] far more elitism, Oxbridge grads do well regardless of major and the worst universities do terribly regardless of major. It[.] quite possible that the arts graduates you know did well simply because of your milieu. \n\nPersonally I don't think anyone[.] learning much at all at university; our arts graduates could do the exact same thing our business graduates do, but it[.] a moot point because the arts graduates aren't getting a shot at it here. \n\n\n\n"}