{"doc_id": "1877", "name": "2016_08_humanities_student_major_372_debateanatheist", "namespace": "we1sv2.0", "metapath": "", "pub": "DebateAnAtheist", "title": "2016-08-humanities-student-major_372_DebateAnAtheist.txt", "pub_date": "2016-08-06T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.295", "Score": "4", "Upvotes": "4", "Downvotes": "0", "Wordcount": "367", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4wg765", "Reddit_id": "d66uxa1", "Subreddit_id": "t5_2ryfy", "Commenter": "BogMod", "length": "2102", "content_scrubbed": " TL;DR: Religion goes above the law and is beneficial because it can inspire the average person to follow things they otherwise wouldn't if they weren't religious.\n\nAnything can theoretically inspire a person to do some thing that they wouldn't do if they weren't that thing.\n\n We know that marriages were introduced in agricultural and civilized societies. In hunter-gatherer societies, women and men mated freely, with a few men at the top getting the majority of women. When we settled down, in order to prevent chaos marriages were introduced so that the men lower in rank wouldn't go without a wife.\n\nThis is a novel idea I haven't encountered before.  Can I see the support on this from some historical sociologists?\n\n Religion allowed us to prevent destructive human nature that isn't compatible with civilization, such as just that for examples. \n\nOr law.  Law is good for that.  \n\n Without religion, what will inspire the average person to marry? Since God isn't real, what will stop the average person from sleeping around and never settling down to raise a healthy family?\n\nSo the average person is inclined to not want to raise a family, have a single partner they feel a deep love for?  Interesting but I am not so sure that you are right there.  Besides that there is societal custom and again aspects of law can be brought in.  Taxes or perks.  Plenty of ways to encourage it without religion.\n\n I think atheists have misunderstood religion; it was not about burning bushes, talking snakes, or other jewish fairy tales. It was about control (that is not to say that there is a widespread conspiracy around).\n\nI think the average believer will disagree with you here.  I think we may also have a different idea what humanities true nature really is.  If all you want though is a tool of control law and custom do the exact same thing as you seem to think religion only can.\n\n Without religion as a power tool people quickly jump back to their true nature.\n\nGiven how the least religious nations in the world are right now you are going to need a lot more to back that up then your say so."}