{"doc_id": "2015", "name": "2016_08_humanities_student_major_1645_commandline", "namespace": "we1sv2.0", "metapath": "", "pub": "commandline", "title": "2016-08-humanities-student-major_1645_commandline.txt", "pub_date": "2016-08-23T00:00:00Z", "Sentiment": "0.023", "Subjectivity": "0.183", "Score": "6", "Upvotes": "6", "Downvotes": "0", "Wordcount": "275", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_d6t5mvc", "Reddit_id": "d6t8hxh", "Subreddit_id": "t5_2s4oq", "Commenter": "PlayMeWhile", "length": "1488", "content_scrubbed": "The author of the post seems like an interesting fellow:\n\n Stephen Ramsay is Susan J. Rosowski Associate University Professor of English and a Fellow at the Center. He specializes in philosophical issues related to the use of technology in digital humanities, and teaches courses in programming and software engineering to humanities students.\n\nI think it shows in his writing skills. But my point is that his audience is probably other humanitarians and his students. In which case he wasn't preaching to the choir. And after this post he had 2 other posts that in essence were arguing about GUI vs CLI with somebody from the comments.\n\nAlso in this regard I think he might not have a need to look at photos, listen to music or watch movies. I find that with myself as well - the older I get the less time I spend doing these things. It[.] about half a year since the last time I listened to music. And I have no photos on my computer except for wallpaper.\n\nAnyway - Just like you I do more outside of CLI than he does as well: read PDFs, skype, play online poker, web. But I liked his main point - that of integration. For example take two programs - mutt for email and vim for text editing. With these two I can do both: write my emails with vim and from withing vim do something like \"!ap mutt Steve\" to email a paragraph from the text I am editing to my contact \"Steve\" using mutt. And via pipes it[.] possible to integrate any other command tool like cal, sed, grep between those two."}