{"doc_id": "211", "name": "2016_06_humanities_student_major_2085_northdakota", "namespace": "we1sv2.0", "metapath": "", "pub": "northdakota", "title": "2016-06-humanities-student-major_2085_northdakota.txt", "pub_date": "2016-06-29T00:00:00Z", "Sentiment": "0.231", "Subjectivity": "0.447", "Score": "5", "Upvotes": "5", "Downvotes": "0", "Wordcount": "716", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4qe1f3", "Reddit_id": "d4su0zb", "Subreddit_id": "t5_2r04w", "Commenter": "Khatib", "length": "3868", "content_scrubbed": "Context - I'm in my early 30s.  Live in Grand Forks and don't like it much. Went to NDSU on an athletic scholarship and for EE but didn't finish.  Work for an engineering firm currently anyways.  Would leave if I had a degree and could get as good a job elsewhere.  Have tons of friends in Minneapolis and go there all the time.  Heading down Friday in fact.\n\nFor the most part, I'm looking to get away from people I know and start fresh.\n\nI feel like you'll have to go way outside the tri-state tuition reimbursement zone to make that actually happen. And realistically, you just need to choose to go make new friends and not hang out with everyone from high school on your own.  You can find hundreds of people you've never met who you'd get along with on any area campus.\n\nI have a 30 on my ACT and a 3. 56 GPA\n\nCool. All three are state schools anyways, so you'd get in any of them easily.  What do you actually want to go to school for though?\n\nIf you want to go for a STEM major, NDSU is better than UND by a chunk, and in EE or biomed, better than UMTC.  UMTC is better in Chem Eng though and not really behind in ME or Civil.\n\nIf you want to do something more liberal_arts, UND and UMTC are probably pretty comparable.  I know UM Duluth has a good international business program, but not a lot beyond that.\n\nIf you think frat life is amazing you'd have a good time at UND.  There are frats at NDSU, but they were a joke to at least half the campus.  You'd be better off just making friends on your floor as a freshmen and then renting a big house off campus with 5+ people. Would easily have more fun than dealing with frat drama.\n\nUND hockey is pretty cool, but it might not be your sport.  Their football team is an afterthought for most of the town and the students.  Their basketball is decent.  NDSU football is seriously amazing.  Yeah, it[.] FCS, but the tailgating is fantastic, and the program is awesome.  UMTC is scared to play us.  NDSU basketball can be a good time as well, and they just got a new building to play in.  UMTC has all the sports as well and that awesome new stadium.  Their program isn't as successful, but it[.] not complete shit yet.\n\nFargo is a considerably more interesting town than Grand Forks.  Live music, bar variety, great places to eat, etc.  But it[.] stuff that[.] more expensive that you'll probably skip out on at college age in favor of house parties half the time anyways.\n\nOf course, Minneapolis is even better than Fargo, but again, cost of living is higher, as well as cost of events, and you'll probably house party a lot as well.  Somewhat of note, you probably weren't familiar with Minneapolis and the campus down there that much, but developers have been gutting Dinkytown pretty hard lately, so it[.] a ton of high end condos and shit.  A lot of the best student housing has been gentrified.  It[.] definitely gonna be a lot more expensive and more of a hassle to live down there as a student now than it was for my friends that went down there 12-15 years ago.\n\nSo that[.] definitely something that can be a point in favor of NDSU.  It'll be cheaper.  Outside of the easier access to indie shows and stuff at all the Minneapolis venues, although again, a lot of those are 21+ and won't be something you'd do until late in your college career anyways -- you'll have a pretty similar experience in any of the three spots.  Meeting a bunch of new people your age, studying, drinking, working part_time jobs, etc.\n\nSo focusing on matching your program to a school, then also a place you like, and can afford are pretty big things.  But all three of these are midwestern schools, and they're not gonna vary all that much in general experience.\n\nYou'll find PLENTY of open minded younger kids at any of them.  And always some conservatives from rural areas, and some tumblerina types that are way too fuckin liberal.\n\n"}