{"doc_id": "1954", "name": "2016_08_humanities_student_major_1077_worldnews", "namespace": "we1sv2.0", "metapath": "", "pub": "worldnews", "title": "2016-08-humanities-student-major_1077_worldnews.txt", "pub_date": "2016-08-16T00:00:00Z", "Sentiment": "0.061", "Subjectivity": "0.356", "Score": "154", "Upvotes": "154", "Downvotes": "0", "Wordcount": "765", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_4xxw54", "Reddit_id": "d6jjkpw", "Subreddit_id": "t5_2qh13", "Commenter": "RalphNLD", "length": "4457", "content_scrubbed": "I did an international study in the humanities at a Dutch university. People from all over the world, but particularly the US, Canada and the UK were enrolled in that study. The study included a mandatory 14 week Race & Gender course. Well, as a white young male who is interested in politics, understanding society and all for equality, how bad can it be right?\n\nWell the course was given by an American black (Well, she was Hispanic, but kept insisting she was black. Anyone know how that works?) feminist woman. Well, I thought, perhaps she[.] actually pretty passionate about her principles of equality then and none the less it[.] going to be interesting to learn how somebody like her comes to her ideas.\n\nThe course started with a seven week block on race, with 14 lectures and seminars in total. Of those 14 seminars and lectures not a single one was from a white point of view. Instead of an interesting dialogue or constructive debate, it turned into a privilege-shaming session aimed at the white people that were present. The lecturer always said that I \"couldn't have suffered from [x], because I was a white male with upscale appearance and manners.\" My response, that the fact that I'm white and more mannered than most people here is simply thanks to my personality and sadly not due to the privileged position of my parents, was taken as racist. Okay, well luckily it couldn't get any worse than that right?\n\nWe started the gender block. It started out with a pretty level headed guy explaining the basic theories behind gender. It was very informative and pretty interesting. However, before I got my hopes up, near the end of the lecture a Canadian girl raised her hand and spent the next 20 minutes of everyone[.] time complaining about the size of the average tampon isle(!) in Dutch supermarkets compared to Canadian Walmart stores (the supermarkets here are quite small). And that kind of set the tone. I even heard some girls arguing he shouldn't be lecturing in gender studies because he was a white male.\n\nOf those 14 lessons, there was only one that was about male gender stereotypes and discrimination and it was set up in such a way that the end result came down to: males cannot be discriminated. I tried to raise points about sentences being up to 65% longer for men than women for the same offence, tried to touch on the issue of domestic violence against men, try to start a discussion on affirmative action for and against men in different areas, etc. All of it merely resulted in bad standing with the professor and no discussion, apart from one about clothing stereotypes for men, ever took place. And in that discussion she, at several points, ignored guys wanting to make a point \"because we want to have a somewhat equal number of male and female speakers in our class\" - which she had never done before and usually preferred \"people with first-hand experiences regarding the issue\". This woman was a celebrated university professor.\n\nOne of the most eye opening things I learned there was the stark contrast between people from the Anglosphere (UK, US, Canada) and people from mainland Europe (Netherlands, Germany, Italy). Most of the people from mainland Europe were very down to earth and pretty straight forward. We all were for equality, and they knew that. They treated everyone humanly and weren't blinded by my white male skin reflecting the sunlight into their eyes. Of the people from the Anglosphere (and actually, there was a single guy from London and like 15 girls), they were almost exclusively militant and feminist. It was a very stark contrast.\n\nNow what has this got to do with this story? Well, these people are pretty likely to at some point get some kind job that involves making policies for the government or going in to law. There is a very strong and exclusive culture of feminism at many universities. The student population is increasingly dominated by women. Universities seem less like the open, diverse place for discussion of controversial ideas, but seem to have become large echo chambers that silence dissenting opinions not rarely though institutional means. Our judges, politicians and policy makers mainly come from universities. There is a very real case to be made for saying that those people are in fact increasingly biased towards men.\n\nPlease, let us get to a point where we don't look at gender, race or class. Only when that happens have we fully tackled discrimination."}