{"doc_id": "1167", "name": "2017_04_humanities_student_major_2271_gamedesign", "namespace": "we1sv2.0", "metapath": "", "pub": "gamedesign", "title": "2017-04-humanities-student-major_2271_gamedesign.txt", "pub_date": "2017-04-20T00:00:00Z", "Sentiment": "0.09", "Subjectivity": "0.338", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "414", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66ikdf", "Reddit_id": "dgir273", "Subreddit_id": "t5_2qimq", "Commenter": "Icy_Manipulator", "length": "2394", "content_scrubbed": "Not to be a jerk, but some of these questions should be *Googled* instead of asked on a forum.  But since you asked nicely...\n\nAn associates degree is a 2-yr degree.  These are common for accounting, drafting, and other specialized business tasks.\nA bachelors degree is your \"standard\" 4-yr degree.  BA (Bachelor of Arts) covers a lot of the humanities, history, English, music, philosophy, etc.  BS (Bachelor of Science) covers the sciences and engineering.\nA masters degree is a 2-yr degree above a bachelors.  These are generally specific and focus a students efforts into a specific aspect of a field of study.  (I have a Masters of Engineering in structural engineering and Bachelors of Science in civil and environmental engineering.  Structural engineering is a subset of civil.)\nPhD/Doctorate are VERY specific and generally require research.  These are useful for people who want to pursue careers in academia.\nThere are also other specialized advanced degrees for law, medicine, business, etc.\n\nNow, all that said, it[.] time to drop the hammer.  You will not be a game designer.  The field is oversaturated; you'll never get noticed.  Pursue a different career.\n\nStill reading?  Good.  Think of game design like any other art form.  Think of it like starting a band or becoming an actor.  There are plenty of musicians that play in garage bands or have a few gigs a month at a local bar or venue.  There are plenty of actors that have minor roles, or actors in local productions of *Fiddler on the Roof*.  But these people have other careers.  Sure.  There[.] a guy named Dave Grohl.  He[.] awesome, and he got to make a career out of being a music guy.  But statistically, you're probably not Dave Grohl, so I recommend you have a different career path ready.\n\nNow that I hit you with a truth-bomb, let[.] go over what you can do.  Programming / computer science is a great direction to go.  There[.] still a large market for a career in the CS field, and it inherently gives you the some of the tools to make games.  Graphic design is another good field.  But don't discount other careers that don't directly translate to games.  There are LOTS of people (myself included) who work in a satisfying career, and make games in their offtime.\n\nAgain, I don't mean to be a jerk, but I like caution eager young people who want to hitch their wagon to games.  It can be a brutal career path.  "}