{"doc_id": "224", "name": "2017_10_humanities_student_major_1_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_1_AskReddit.txt", "pub_date": "2017-09-30T00:00:00Z", "Sentiment": "-0.06", "Subjectivity": "0.378", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "261", "Permalink": "http://reddit.com/r/AskReddit/comments/73cf82/serious_why_is_prejudice_against_white_people/dnqo1hl/", "Threadlink": "http://reddit.com/r/AskReddit/comments/73cf82/serious_why_is_prejudice_against_white_people", "Parent_id": "t3_73cf82", "Reddit_id": "dnqo1hl", "Subreddit_id": "t5_2qh1i", "Commenter": "YourWorstReward", "length": "1567", "content_scrubbed": "As a white dude, understand that there is a lot of natural bias to what I'm about to say. The impact/importance of prejudice is clearest seen when done by people with powerful positions. \n\nTo give an example that will hopefully not come across as controversial, Reconstruction, the period of radical republican control of southern politics, was an attempt to put non-racist people in positions of governance and education and police force, but in the land of racism it is hard to find a person who isn't, so as soon as the North stopped it[.] intervention, Jim Crow, hate crimes with no punishment from the law, and job opportunities for black people disappeared. Specifically because those who help the power were prejudice, those who were being prejudiced felt a massive impact.\n\nConnecting this back to our situation, white people still have the majority of powerful positions, and those with a clear distaste for white people are massively lacking in power (think about local government, police, Congress, supreme court, President, even when those people aren't white, they will never, and can never, talk bad about whiteness or they lose their position). So when we talk about the impacts of prejudice, there[.] not much that some people yelling in a square with a bunch of liberal_arts majors can do to affect the lives of white people. Thus, compared to some of the impacts POC face, economically, socially, and politically, any form of white prejudice is truly insignificant.\n\nBut that[.] just my 2 cents. Maybe that clarified some stuff, maybe you hate me. W/e."}