{"doc_id": "471", "name": "2017_10_humanities_student_major_2398_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2017-10-humanities-student-major_2398_slatestarcodex.txt", "pub_date": "2017-10-25T00:00:00Z", "Sentiment": "0.064", "Subjectivity": "0.28", "Score": "51", "Upvotes": "0", "Downvotes": "0", "Wordcount": "387", "Permalink": "http://reddit.com/r/slatestarcodex/comments/78lpeo/how_did_new_atheism_fail_so_miserably/dov23cj/", "Threadlink": "http://reddit.com/r/slatestarcodex/comments/78lpeo/how_did_new_atheism_fail_so_miserably", "Parent_id": "t3_78lpeo", "Reddit_id": "dov23cj", "Subreddit_id": "t5_30m6u", "Commenter": "somealarbalo", "length": "2514", "content_scrubbed": " Maybe the New Atheists accidentally got on board just before a nascent Grey Tribe/Blue Tribe split and tried to get Blue Tribe credibility by sending Grey Tribe signals. At some point there was a cultural fissure between Acela Corridor thinkfluencers with humanities degrees and Silicon Valley bloggers with STEM degrees, and the former got a head start on hating the latter while the latter still thought everybody was on the same anti-Republican side.\n\nThis aside is actually more interesting to me than new atheism itself. Somewhere in the last ten years blue state culture seems to have developed a strong Two Cultures split, starting with word people disliking / resenting number people; at this point the dislike has intensified to near hatred, and exists in both directions. Journalists as a class went from being largely fine with techies to being virulently opposed to everything about tech and Silicon Valley. The recent Bodega moral panic really brought this home for me - the entirety of the *tech* press was [jumping] (https://www. reddit. com/r/slatestarcodex/comments/70gka3/culture_war_roundup_for_the_week_following_sept/dn4v33r/) on the techies-are-inhuman-robots bandwagon. \n\nIt doesn't really track economic factors in the broader society either - tech in the 90s and early oughts was Microsoft and Oracle and IBM. It was antitrust, Amazon shutting down those infernal small book stores, Napster and iTunes killing the music album, Google making everything searchable and Wikipedia doing encyclopedia by crowdsourcing. Facebook and Uber seem like small potatoes in comparison. And yet blue state humanities_major didn't hate CS majors back then. Of course, an economic factor of a narrower sort is relevant - back then tech was disrupting supply chains and the music industry, not newspapers. And the new journalists, in a very lowbrow and un-genteel clickbait ecosystem, absolutely despise techies. \n\nAnd yet, the performance of that hate is distinctly cultural - way more Social Justice than Bernie, and definitely way more SJW than Ron Paul privacy stuff. It[.] all about tech not being Diverse, rather than tech and knowledge economy being too winner-takes-all, or tech being a privacy problem. Makes sense too - when you have a blue versus gray divide, the principal component cannot be economic concerns, since plenty of techies share those concerns. And certainly not privacy - since nerdy techies if anything care more than normies. The axis has to be diversity and Damore and Soylent..."}