{"doc_id": "434", "name": "2017_10_humanities_student_major_1953_halifax", "namespace": "we1sv2.0", "metapath": "", "pub": "halifax", "title": "2017-10-humanities-student-major_1953_halifax.txt", "pub_date": "2017-10-20T00:00:00Z", "Sentiment": "0.201", "Subjectivity": "0.263", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "243", "Permalink": "http://reddit.com/r/halifax/comments/77n6lu/university_question_dal_vs_smu/donf1qm/", "Threadlink": "http://reddit.com/r/halifax/comments/77n6lu/university_question_dal_vs_smu", "Parent_id": "t3_77n6lu", "Reddit_id": "donf1qm", "Subreddit_id": "t5_2r77k", "Commenter": "princesssquid", "length": "1340", "content_scrubbed": "Honestly, my suggestion is to try to combine the two. I've gone to both schools, and personally I found SMU better. I was in the Arts, and I found it easier to connect with professors, get opportunities and engage academically. I knew each professor by first name. I kept in touch with them even after graduation, and overall just thought it was the best decision I ever made.  Let me tell you, by 3rd year, the partying slows down. You'll be looking how to better yourself professionally and truth be told, the access to opportunity is the way to go.  This is how you secure employment. \n\nWhile still being a SMU student, I was also a president of a Dalhousie student group. I actually often played on Dal intramurals and overall studied at Dalhousie more. They have great student union things like better food, better student clubs and societies, better resources because they're bigger - but academically, I thought SMU was nicer. It[.] easy to combine the two - and to me, not worth the change because I didn't find Dalhousie very helpful to the arts. Let me get this straight though, I didn't find it easier to get good grades at SMU. \n\nI'm now back at SMU for a Master[.] of Science... love it just the same.  No one cares about where you do your undergrad at in Canada. SMU has cheaper tuition too. Oh - but whats your plans for after?"}