{"doc_id": "926", "name": "2017_04_humanities_student_major_95_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2017-04-humanities-student-major_95_college.txt", "pub_date": "2017-04-01T00:00:00Z", "Sentiment": "-0.049", "Subjectivity": "0.365", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "468", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_62tk7c", "Reddit_id": "dfps46x", "Subreddit_id": "t5_2qh3z", "Commenter": "MrPockets11", "length": "2726", "content_scrubbed": "I'm 30, and I'm getting my 2nd bachelor[.] degree because the first one was a colossal waste of time and money. The first time I got a bachelor[.] degree, my parents demanded I go to a school of their choice and not mine (they sent me to a small privately funded liberal_arts college with a religious accreditation, not a state accreditation). That school had limited options regarding majors. No engineering majors, no computer science majors (they had minors, and the year after I was admitted it was added to the catalog of courses on campus), and no specialized biology majors. The campus was dangerous and students were physically violent (I still have a big hard scar that hasn't faded over the last 8 years, in my right side from getting assaulted and stabbed in a dorm elevator). There are no benefits to having my first bachelor[.] degree, and the career services office does not help students get jobs after graduation. Staff is rude and unhelpful and usually hangs up the phone on me when I call. I have had loads of issues getting the school to provide transcripts since graduation, and I still occasionally get harassing phone calls the vice president of student life regarding my assault (he sometimes makes vague threats of physical violence and the police have been repeatedly notified but can't do much due to unspecific threats of violence). Alumni association meetings are very rare nation wide. My transcript is also really messed up (I took more classes in my minor than my major, and I was graduated even though I had zero senior level classes in my major because of limited faculry qualified to teach those courses courses). \n\nI have tried gre practice tests and not done well on them due to the majority of my education being taught counterfactual information. I am definitely not ready to pursue a Masters degree. \n\nI was admitted into the wrong department last semester at a large local state school due to a series of mistakes made by the admissions department. At this time, the department I want to get a major in (computer science) doesn't want to accept me because I have zero computer  Science courses on my transcript and no calculus credits. At this time I am uninterested in returning to class next semester if  am required to take courses in the wrong major. I also am being required to retake classes (history, art, English literature, etc) I have already taken multiple instances of at my previous college because the credits from my first college cannot be transfered in to my current college due to problems regarding mismatched course curriculum. I'm not interested in continuing this exercise in frustration, so... I guess I just won't ever have a real college education at this point :("}