{"doc_id": "319", "name": "2017_10_humanities_student_major_836_debateanarchism", "namespace": "we1sv2.0", "metapath": "", "pub": "DebateAnarchism", "title": "2017-10-humanities-student-major_836_DebateAnarchism.txt", "pub_date": "2017-10-09T00:00:00Z", "Sentiment": "0.176", "Subjectivity": "0.507", "Score": "28", "Upvotes": "0", "Downvotes": "0", "Wordcount": "267", "Permalink": "http://reddit.com/r/DebateAnarchism/comments/75cy3y/why_is_the_programmingfoss_community_so_far_to/do5fju5/", "Threadlink": "http://reddit.com/r/DebateAnarchism/comments/75cy3y/why_is_the_programmingfoss_community_so_far_to", "Parent_id": "t3_75cy3y", "Reddit_id": "do5fju5", "Subreddit_id": "t5_2vkaw", "Commenter": "KingKoronov", "length": "1613", "content_scrubbed": "I haven't noticed that it particularly was. The STEM field in general is more reactionary than the humanities, but the Free Software movement is more of a left-wing thing, as most people would agree that the_left is for putting things into the public domain whereas the_right is for keeping things in private hands, although I'm glad if there[.] some self-proclaimed right_wingers who support it too. Some propertarians don't recognize intellectual property as a legitimate form of private property and I can find some common ground with those people.\n\nIt is also important to note that there are two major factions in the Free Software community. There are those like Richard Stallman for whom Free Software is an ideological thing. These people are more likely to be on the_left. Then there are those who support free software purely for its practical applications, and their political ideology doesn't play a role. These people are probably just as likely as the general population to be reactionaries. Free software doesn't conflict with capitalist ideology unless the software is forcibly collectivized. It therefore doesn't have the same sort of repulsive force for the_right as it does an attractive force for the_left.\n\nI think a lot of the recent Mozilla hate probably comes from people who are more centrist and have bought into the whole \"Antifa and fascists are the exact same thing\" meme. Centrists take up right-wing talking points very easily. When you see people saying hateful things about anti-fascists, remember that it isn't always the Nazis saying that. Centrists hate the_left almost as much."}