{"doc_id": "458", "name": "2017_10_humanities_student_major_2237_jordanpeterson", "namespace": "we1sv2.0", "metapath": "", "pub": "JordanPeterson", "title": "2017-10-humanities-student-major_2237_JordanPeterson.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "0.055", "Subjectivity": "0.234", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "268", "Permalink": "http://reddit.com/r/JordanPeterson/comments/788eo3/jordan_peterson_goes_full_neckbeard_wears_a/dospnam/", "Threadlink": "http://reddit.com/r/JordanPeterson/comments/788eo3/jordan_peterson_goes_full_neckbeard_wears_a", "Parent_id": "t3_788eo3", "Reddit_id": "dospnam", "Subreddit_id": "t5_32jqy", "Commenter": "mundaneExistence", "length": "1648", "content_scrubbed": "The article being critiqued is a bit outdated as according to this study men[.] wages are on the rise again were as female wages are in the decline as of 2016. \n\nhttp://www. chicagotribune. com/business/ct-male-female-wage-gap-20160429-story. html\n\nMy assumption for this is a growing number of men are heading into Tech/STEM by default now. Even a couple years ago Comp Sci was seen as exclusively part of 'nerd culture'. In my own experience I see a larger number of men going into these careers as they're generally lucrative immediately after graduation and the cultures changed.\n\nMy concern is the social upheaval we're going to see once a sufficient number of 'leftest' type males get unemployed. This honestly is what I think much of Antifa is, as the majority are unemployed young men who either studied the humanities or never attended University. They're disgruntled, unemployed and emasculated. If their numbers continue to swell they will cause major social upheaval and that concerns me. \n\nI think more right_leaning types aren't as much of a concern as many of them are employed either in construction or some kind of a trade, jobs more left_leaning young men I personally find are less likely to do. \n\nI don't think we'll see social anarchy from matriarchy, as it seems again that young men, especially with immigrant backgrounds, are reclaiming much of the key economic positions. What I do think will cause it is the unemployed 'left' types who refuse to take working class positions but will never rise into the STEM centered, information economy currently being built. \n\nThey will be the destroyers of civilizations, not women. IMHO."}