{"doc_id": "428", "name": "2017_10_humanities_student_major_1878_labrats", "namespace": "we1sv2.0", "metapath": "", "pub": "labrats", "title": "2017-10-humanities-student-major_1878_labrats.txt", "pub_date": "2017-10-19T00:00:00Z", "Sentiment": "0.146", "Subjectivity": "0.349", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "280", "Permalink": "http://reddit.com/r/labrats/comments/77iexr/university_of_chicago_graduate_students_vote_to/domh89j/", "Threadlink": "http://reddit.com/r/labrats/comments/77iexr/university_of_chicago_graduate_students_vote_to", "Parent_id": "t1_dom363k", "Reddit_id": "domh89j", "Subreddit_id": "t5_2srnv", "Commenter": "three_martini_lunch", "length": "1536", "content_scrubbed": "My university unionized when I was a grad student. For biomed students the biggest change was that we had to pay dues ($500/yr) and all the \"soft\" rules became formal rules including our one semester teaching experience. Instead of being able to bed rules everyone had to teach and take a class to do so. Instead of skipping out on TA training the years we weren't teaching we had to mandatorily attend TA training for a week every year. Since I only proctored exams for my teaching experience, this was a huge waste of time each year. \n\nIt also meant we had to fill out a lot more paperwork and we lost our preferential parking in faculty lots that was subsidized by the department. \n\nOverall it was a huge downgrade for biomed students working in funded labs. It also increased the overhead charged to grants for PhD students so it was more expensive to take on a PhD student.  It also capped grad student pay raises to only what all students received. If the university couldn't afford more than a 1% raise for all students then this was the maximum raise all students got. Before unionization we were getting a raise of 3-5% every year. After unionization I never got another raise.  Most labs are now post-doc dominant or post-doc only whereas when I was a student it was the opposite. The PhD program is 1/3 the size it was when I graduated 8 years ago. The union also went on strike one year and so we were technically not allowed to be in our labs. Only on the public spaces outside.\n\nFor humanities students it was a huge win. "}