{"doc_id": "978", "name": "2017_04_humanities_student_major_541_wayofthebern", "namespace": "we1sv2.0", "metapath": "", "pub": "WayOfTheBern", "title": "2017-04-humanities-student-major_541_WayOfTheBern.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.149", "Subjectivity": "0.353", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "269", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfw2lyu", "Reddit_id": "dfw4h6g", "Subreddit_id": "t5_3ff8l", "Commenter": "SpudDK", "length": "1572", "content_scrubbed": "There are all kinds of benefits.  Sociology gets broad application in sales and marketing, two very obvious examples.\n\nPhilosophy is an excellent way to refine one[.] critical thinking.  In fact, it[.] worth it to understand how to think, modes, ways, means.  Parents all over the place can employ these to great effect.  Mentors, councilors, many other fields benefit from this kind of education.\n\nWhat you did here was highlight shallow thinking on your part.  Good news for you is this state of affairs is likely something you can improve.  Many people do.  Maybe you can be one of them.\n\nThere is more to the world than the rather simplistic view presented by corporations looking for \"human resources\" to exploit.  It[.] in you and yours best interests to understand that better than you currently do.\n\nAs it stands right now, you are being manipulated and don't know it!  A big part of that is likely willful ignorance.  You aren't alone in that shit.  You may also simply lack the tools to get there.  Definitely not alone.\n\nYou stand a great chance of very seriously improving your life, both perception of it, your choices, as well as your real prospects for better income, more work / life freedom, success, by having a few honest, in-depth conversations with liberal_arts majors you can find.\n\nDo this.  Please.  You will be better for it.  You should feel no shame, no insult either.  My intent is neither of those.  It is all about someone seeking that which they are not likely to find without some greater perspective.\n\nDon't miss out.  Seek.  You will find.  "}