{"doc_id": "256", "name": "2017_10_humanities_student_major_244_writing", "namespace": "we1sv2.0", "metapath": "", "pub": "writing", "title": "2017-10-humanities-student-major_244_writing.txt", "pub_date": "2017-10-03T00:00:00Z", "Sentiment": "0.039", "Subjectivity": "0.279", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "556", "Permalink": "http://reddit.com/r/writing/comments/74512w/to_those_of_you_who_majored_in_creative_writing/dnvr019/", "Threadlink": "http://reddit.com/r/writing/comments/74512w/to_those_of_you_who_majored_in_creative_writing", "Parent_id": "t3_74512w", "Reddit_id": "dnvr019", "Subreddit_id": "t5_2qh2n", "Commenter": "theinternetswife", "length": "3097", "content_scrubbed": "Here[.] my two cents. I'm 29, B. A. in Creative Writing, it[.] been 8 years since I graduated and I just began my first semester of my MFA in Fiction. Go Me! (I should be working on my reading, but alas to fuel other young writers!)\nI work in corporate america for a giant company, and I've worked in Business since I left school, 8-9 years? Who[.] counting? But yes, I'm leaving my six figures, soon. I am leaving a job that makes me a 1%er because I literally could not go on anymore ignoring this passion. 1. because I hated who I'd become 2. because I realized it wasn't some impossible dream, writing to a certain extent is quite practical.\n\nHere[.] the thing. If you have a supportive family (they'll let you live with them, help you out now and then), if you don't absolutely need to make a lot of money out of school, follow your path. I got sidetracked because I personally needed to be on my own, the economy was in the tank. \n\nMOST IMPORTANTLY: [READ THIS BOOK] (https://www. amazon. com/Scratch-Writers-Money-Making-Living/dp/1501134574) ALSO IMPORTANTLY, double major in something practical. If I could go back and do it all again, I'd learn computer programming. Through my work I got some exposure to it and the parallels between writing code and writing a short story are weirdly and satisfyingly similar. Programmers can get lucrative contract work and take longs stints of work off. Think code for 9 months, write for 9 months. It[.] like being a teacher, where you get plenty of vacation time, but with a lot more money. Also there is something about stretching your mind in ways you never imagined that makes you better at writing.\n\nIf you don't want to program, write. Take journalism classes, marketing classes, write copy, write blog posts, pitch pitch pitch. Hustle, but no matter what happens, unless mom and dad are letting you chill out, you're going to be writing from 5-9 and working from 9-5.\n\nRealize that MFAs mainly go back into the same fields that they were in before. 2-3 years is just not enough time to crank out a book and publish it. It[.] barely enough for a 1st draft. \n\nDon't give up though! Persistence is key. Most professional writers didn't have any more talent or passion than anyone else, they just kept going. Write as much as you can, read as much as you can. Hustle. You can get there, but try to build yourself a bridge, by being rational, rather than wandering around for a decade looking for an easier crossing. \n\nedit: TLDR Do it! But learn how to make money also, it[.] not pretty but it[.] how everyone else is getting by.\n\n2nd edit: Older millennial here, obviously, DO NOT GO INTO DEBT FOR SCHOOL, at all, not a penny. I'm nearly 30 and I am paying off my last payment this month and that was for 1 semester my parents couldn't cover, (thanks recession). I have friends that went into the arts and are paying on average 1 to 1. 4k a month in their loans back and aren't even making a dent in their balances. If someone tells you majoring in the arts is foolish and will make you poor, realize that taking on debt (no matter the major) is even worse."}