{"doc_id": "953", "name": "2017_04_humanities_student_major_332_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2017-04-humanities-student-major_332_GradSchool.txt", "pub_date": "2017-04-03T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.306", "Score": "17", "Upvotes": "0", "Downvotes": "0", "Wordcount": "850", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_639xfx", "Reddit_id": "dfsyw6x", "Subreddit_id": "t5_2r4r8", "Commenter": "three_martini_lunch", "length": "4926", "content_scrubbed": "My PhD university[.] grad students unionized while I was a grad student. I am in a STEM/bio field.\n\nOverall, for STEM students it was a negative. It increased fees on GRAs and healthcare costs, so that most students in funded labs took a pay cut and/or saw increased costs to grants. It also changed the rules for teaching assignments such that it was harder to find a teaching assignment if your lab ran out of money to support you AND you were paid at the GTA rate (no exceptions) instead of having the department subsidize your pay. As I recall GTA pay was ~$14-18k, with a maximum of $18k (mid-2000[.]), but our program set GRA pay at a minimum of $27k. It was customary for the department to chip in for the salary difference with no additional teaching prior to unionization. Post-unionization, this was not allowed, so if your lab ran out of money you took a significant pay cut. It resulted in a \"caste\" system within the department that previously was smoothed over by the department. It also set up a class assignment system that was based on seniority. Thus, if your lab ran out of money you were last in line for an assignment and you got the worst assignment. If you lost money say in your last year, it was common to get an intensive assignment and usually delayed graduation. Previously, the department would give you a soft assignment in this situation. This also had the consequence of eliminating the system where grad students that were delayed in finishing for whatever reason no longer dropped back to teaching while they finished up. This tied up grant funds for new students, so faculty were not always able to take a rotation student, where previously they move a finishing student into a GTA position for their last semester or two. During the NIH doubling this wasn't a big problem, but now that grant funding is hard to obtain, the number of students in the program has shrunk by about 20-30%.\n\nThe other negative was the mandatory out of pocket annual fee for the union.\n\nThe union primarily set rules for grad student parking and teaching pay and conditions for GTA. For those in the humanities, it was a huge boon, especially some of the poorer departments, where GTAs were very poorly paid and taught 40 hours a week in addition to their courses and research.\n\nThe plusses were that the quality of our health care went from abysmal to just good enough to make sure you could survive a trip to the student health center. It also opened up the ability to enroll in the faculty/staff healthcare plan or the student health plan (the former at substantial out of pocket cost). However, if you had kids or dependents, you were eligible for the faculty staff health plan so it was good for them to actually have health care at a decent rate for the time. At the time this was a pretty big deal because it was before ACA, but right at the time that health care costs were spiraling out of control.\n\nUnionization also resulted in the implementation of an outside representative to your grad committee. This helped address the more egregious issues with faculty abuse of prelims and defending dissertations.\n\nThe other plus is that the parking situation improved quite a bit. Ultimately with more grad students paying into parking fees they were able to build new garages, and with the increased costs of permits spread evenly, more people choose to bike to campus or take the bus.\n\nThe final positive is that policies had to be applied evenly to all students. For example, we had several foreign faculty that were in the habit of only accepting students from their home country. For various departmental political reasons, these students were exempt from the normal application standards and process (i. e. they would be accepted into the professional MS program to skirt GPA and english proficiency requirements and then be moved to the PhD program). These faculty would pay them the university minimum, $14k if I'm not mistaken, and treat the like slave labor. These students could never pass the TOEFL and university-administered English course for TAs so they never had to participate in our teaching requirement of two semesters. Post-unionization, departments had to set policies and all students had to have pay lines, minimum pay etc. It got rid of the ability to skirt admission standards and set university and departmental standards for admission that were hard to skirt without significant effort. They also turned our teaching requirement into a class that was required for the degree, so all students had to pass the TOEFL and English proficiency exam. In general, it curtailed some of the poor practices by some of the worst faculty. The good thing about this is that most of these faculty left the university pretty quickly. I'm sure the university misses the indirects, but the overall quality of the faculty and graduate program improved hand-in-hand. It took a while for this to play out."}