{"doc_id": "536", "name": "2017_10_humanities_student_major_3024_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2017-10-humanities-student-major_3024_slatestarcodex.txt", "pub_date": "2017-10-31T00:00:00Z", "Sentiment": "0.1", "Subjectivity": "0.362", "Score": "25", "Upvotes": "0", "Downvotes": "0", "Wordcount": "764", "Permalink": "http://reddit.com/r/slatestarcodex/comments/79n6oy/culture_war_roundup_for_the_week_of_halloween/dp55g6n/", "Threadlink": "http://reddit.com/r/slatestarcodex/comments/79n6oy/culture_war_roundup_for_the_week_of_halloween", "Parent_id": "t1_dp51yul", "Reddit_id": "dp55g6n", "Subreddit_id": "t5_30m6u", "Commenter": "BarnabyCajones", "length": "4468", "content_scrubbed": "I honestly don't know where I would put myself, or even how to make sense of the frame.\n\nMy interest (or even fixation) with the Culture War is less about which participants are correct on which questions, and more a question of what the hell it actually is, on a deeper level.  Is it inevitable?  Will it ever end?  Are there better ways to understand it?   How much damage will it do?  Is there any possible way to drain the poison?  So I guess my main interests are less at the object level and more at the meta level.  I'm most curious about it epistemologically, and as a (deeply threatening, long_term) social phenomenon.\n\nI hope the following isn't too tediously self-psychologizing.  By nature, I am a pretty contrary person who _heavily_ values peace and compromise as terminal values, has problems with authority, is extremely sensitive, and am deeply prone to skepticism.  I have always had this really deep gnawing sense of doubt about how much I should be certain about what I think I know, for as long as I can remember (and that doubt applies to other people too, if I bother to think about it, but I mostly don't).  I have a deep-seated wariness about human nature and idealism, so I think I'm naturally more inclined towards certain kinds of small c conservative views on things than the modal libertarian.  I have _extreme_ difficulty internally affiliating with group identities, and am extremely prickly if I feel myself being social pushed into them by other people.  I think I'm missing whatever it is that makes people have disgust reactions and create social power and control through stigmatization.  And I'm deeply committed, in my bones, to a kind of live-and-let-live small 'l' liberalism generally, which I think is most compatible, at a pragmatic level, with the skepticism I feel.  People need space to think and to be uncertain and to doubt and to work stuff out for themselves.\n\nI've also had the interesting life experience of seeing really hard, opposite edges of the Culture War as lived by people who are native to core parts of it.  And I think that fuels a lot of what I'm trying to work out in my comments, too.  \n\nI grew up in a suburb in the South, surrounded by Southern Baptists and in a devout Mormon household.  I think the county I lived in was listed as the 5th or 6th most conservative place in the country by some Daily Caller list a while ago.  And then I moved to a college town that was listed, on the same list, as the 5th or 6th most liberal part of the country, while hanging out with humanities grad students and attending a Unitarian congregation for a while.  I straddle worlds.\n\nAnd I don't join groups well.  I've felt kind of estranged and pushed away during this entire process, just as much among American Liberals as conservatives / traditionalists / fundamentalists.\n\nMy general sense has grown to be that the conservatives I know deeply don't understand many of the liberals I've known in my life.  They feel as though they have a Universalist understanding of the world, and given that Universalist frame, they know where the place of liberals in it.  And although they can claim to understand liberal values at a very superficial level (because they've heard the language of diversity and rights, etc), they mostly just don't get the actual worldview of liberals at a deep level.  They necessarily work with caricatures.  Actual liberals are, at once, both much nicer and more decent than, and much, much more alien than, what conservatives are led to think by their much-too-narrow Universalist frame, a frame they are convinced accurately can explain American liberals.\n\nI could write an almost identical paragraph about many of the American liberals I know.\n\nAnd I think that[.] roughly where I am right now - I'm afraid our problems are that there are no particular villains (at least in the broader populations of normal people), but people are _much_ further apart at the basic level of worldviews than they think they are, and so they're busy theorizing each other with totally incompatible Universalist theories that make hearing each other, difficult in even the best of circumstances when people[.] worldviews are so incredibly disjoint, almost impossible.\n\nNone of that is to say that the worldviews themselves don't matter, at an Object level.  But I don't think the particular worldviews account for the especially intractable nature of the conflict, which is what I'm most interested in."}