{"doc_id": "1117", "name": "2017_04_humanities_student_major_1819_jobs", "namespace": "we1sv2.0", "metapath": "", "pub": "jobs", "title": "2017-04-humanities-student-major_1819_jobs.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.138", "Subjectivity": "0.511", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "328", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65ok9o", "Reddit_id": "dgc1dcq", "Subreddit_id": "t5_2qhnd", "Commenter": "Stoicviking", "length": "1781", "content_scrubbed": "The 1990[.] made sure to flood the job market with people with 4 year Graphic Design degrees. It was seen as a hot career with growth then, which was true as the internet was an emerging technology. By the mid-Aughts, Graphic Design Bachelors were a dime a dozen, and competition for sub 40k jobs was intense. Studios were the worst. They knew they could push a 30k design job and get 500 applicants, so they had their pick of the best portfolios and most skilled while paying peanuts and getting 60+ hours of work a week out of a designer. Most designers lack business skills since the majority of their schooling was on creative learning and humanities rather than hard business and marketing. The internet did however make it easier to DO business, so many of the 10+ year veterans looked at starting their own niche businesses, or continuing their education and moving into more of a marketing MBA direction.\n\nThings the way they are now, someone looking for a Graphic Design job probably won't even get a phone call unless they have a 4 year degree. I haven't seen any Graphic Design jobs that are offering more than 40-45k a year in my area in a few years. As a Graphic Designer my salary was pretty flat at 38-50k from the mid 90[.] to 2005 or 2006. I had a few good years with my own business making close to 90k in my last year of business when the recession hit and my business fell out from under me. I ended up refocusing my career and learning more business skills for a few years, more customer service and sales skills as well as marketing. Salary dropped back in to the 40k range for me during this time, but I've finally been able to redirect my career in more of a marketing direction and after 20 years have my most realistic chances of being in the 90-100k range."}