{"doc_id": "1042", "name": "2017_04_humanities_student_major_1098_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2017-04-humanities-student-major_1098_slatestarcodex.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.071", "Subjectivity": "0.402", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "514", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg2qelz", "Reddit_id": "dg2xndt", "Subreddit_id": "t5_30m6u", "Commenter": "HircumSaeculorum", "length": "3211", "content_scrubbed": "I'm really not sure how generalizable your (doubtless regrettable) experiences with humanities departments are.  \n\nI'm studying in the humanities department of a fairly mainstream university (there[.] an Intersectional Feminist Club, forums for marginalized genders, an elected representative for ethnic-minority students - all of which I think are wonderful, to give away my political persuasion) and what you're describing in your first paragraph is not something I would ever expect to see.\n\nIn general, the image of modern Western humanities departments as liberal propaganda machines totally fails to describe the one I see around me. Sure, there are lectures on the importance of gender in historical societies, and course material on the negative effects of colonialism - *because gender is an important component of social structure, and because colonialism was genuinely a very bad thing*. \n\nBut those discussions don't march in lockstep with the maximally conventionally-leftist possible position. A professor in one of my courses spent a significant amount of time explaining why the concept of patriarchy in 17th-century England shouldn't be conceived of as an oppositional relationship between men and women, or as uniformly oppressive, or as born of coordinated malice (and, to be clear, \"patriarchy\" was what the people of the time called it - that[.] not an insertion of contemporary politics). The conventional feminist stereotype would have an aneurysm if they walked into one of the lectures on witchcraft. The textbooks on African history do not fail to explain, in abysmal detail, why colonial governments were shitty, but they also make no attempt to gloss over the bad decisions of postcolonial African leaders, and nor do they shrink from giving the colonial officials their due from time to time. I could go on like this for quite a while. \n\nOverall, I've been consistently impressed by the concern for rigor, nuance, learning, and understanding displayed by the academics and students who are so often portrayed as raging nutcases blinded by propaganda. \n\nOf course, it could be that the History academe is an isolated island of free thought, soon to be swamped by a rising tide of liberal ideology - but I *really* don't think so. The literature majors seem to be happily reading Shakespeare and discussing *hamartia* and Aristotle[.] *Poetics*; the Classics students are burying themselves in Tacitus and the pre-Socratics, just as they did hundreds of years before the birth of Marx, and just as they will do hundreds of years from now. Of course, you can argue that that[.] all worthless, but that[.] a different (or at least vastly broader) discussion. The point is that they aren't spending all their time ragging on \"dead white guys\" or soaking up the rhetoric of social-justice liberalism.\n\nVis continental philosophy - I'm with you on the factual correctness of people like Hegel and Eliade. I'm 100% a materialist! Matter and void, for me. But those people were influential and important, and if you want to study the study of religion, you'll have to study them. If you want to understand how people think, or how philosophy develops, you can't confine yourself to correct ideas."}