{"doc_id": "1262", "name": "2017_04_humanities_student_major_3188_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_3188_AskReddit.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "-0.035", "Subjectivity": "0.421", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "357", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgv5nj4", "Reddit_id": "dgvkcqi", "Subreddit_id": "t5_2qh1i", "Commenter": "assaily", "length": "1914", "content_scrubbed": "Oh man, I feel this fishing. Through most of high school I had bad math teachers. So I gravitated toward the liberal and language arts until I had a bad english teacher too and I thought I was just a big dumbass. My parents always taught me that it[.] my fault if I fail. Never even considered it could be the teachers.\n\nFinished high school, forced to go to college (my mom threatened to kick me out and I WOULD NOT go live with my grandmother), I struggled but passed and pretended I was smart for two years.\n\nRan out of GE classes so I went to talk to a counselor and gave me a series of puzzles to try, my favorite had to do with pattern recognition. Suggested a pre-calc class. I failed it miserably. He wiped my record and told me to take a different professor, suggested a group of teachers at neighboring community college that was more stem focused. (Two different college that work in the same district that have two different focuses because there are so many students. We're a big college town, five community college in total, three big universities, and a UC school too. I thought he was crazy to send me *away* from the liberal_arts school)\n\nSecond time I excelled. He pushed me to do calculus. I have hated math all my life, and I took this class expecting to fail it. First day of classes, the prof does what I can only describe as mathmatical magic, and tells us that we are going to spend the entire semester solving this problem. By the end of it we will know how to do it backwards (which is funny now coz derivatives and anti-derivatives).\n\nI adore calculus. \n\nMath, phyics, engineering. Shit I never thought I could do. And here I am doing them. Coz one good student counselor at a crummy community college saw potential in a failing student. He fished me out of a vat of shit and pointed me toward the showers. God bless that man.\n\nSorry it got long, wanted to share my fishing story too. :)"}