{"doc_id": "388", "name": "2017_10_humanities_student_major_1531_debatereligion", "namespace": "we1sv2.0", "metapath": "", "pub": "DebateReligion", "title": "2017-10-humanities-student-major_1531_DebateReligion.txt", "pub_date": "2017-10-17T00:00:00Z", "Sentiment": "0.088", "Subjectivity": "0.317", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1001", "Permalink": "http://reddit.com/r/DebateReligion/comments/76x8ri/cmv_there_is_no_evidence_secular_humanism_is_true/dohgemh/", "Threadlink": "http://reddit.com/r/DebateReligion/comments/76x8ri/cmv_there_is_no_evidence_secular_humanism_is_true", "Parent_id": "t3_76x8ri", "Reddit_id": "dohgemh", "Subreddit_id": "t5_2snuc", "Commenter": "ThatguyIncognito", "length": "6256", "content_scrubbed": "Here, for those who aren't familiar with it, are some affirmations from Secular Humanism:\nWe are committed to the application of reason and science to the understanding of the universe and to the solving of human problems.\n\nThat you are asking for scientific proof and only scientific proof of secular humanist \"claims\" means that you agree.\n\n We deplore efforts to denigrate human intelligence, to seek to explain the world in supernatural terms, and to look outside nature for salvation.\n\nAgain, you are demanding scientific proof that this is true. You are agreeing with methodological naturalism. Do you have any scientific evidence that supernaturalism is a valid approach instead?\n\n We believe that scientific discovery and technology can contribute to the betterment of human life.\n\nWe have plenty of evidence for this. See, for instance, penicillin.\n\n We believe in an open and pluralistic society and that democracy is the best guarantee of protecting human rights from authoritarian elites and repressive majorities.\n\nDo you have an alternative that you feel has a superior human rights record? We don't conduct lab experiments with systems of government, we use social_sciences. \n\n We are committed to the principle of the separation of church and state.\n\nWhile there are countries that have a head of state who is also the head of their religion, the ones that I'm aware of, such as the UK, in effect do not have theocracies.  I'm willing to entertain your atheistic arguments for why it[.] better to use the government to advance religion, but I think this one[.] pretty obvious.\n\n We cultivate the arts of negotiation and compromise as a means of resolving differences and achieving mutual understanding.\n\nWhile I'm sure that there are game theory experiments and psychology experiments to back the controversial conclusion that we would rather try negotiation and compromise often rather than imposing one view over another, I don't believe we need anything other than personal and historical examples of how this approach has worked to avoid war and continuing resentment.\n\n\n We are concerned with securing justice and fairness in society and with eliminating discrimination and intolerance.\n\nDo you really want to test us to see if we have this concern?\n\n We believe in supporting the disadvantaged and the handicapped so that they will be able to help themselves.\n\nAgain, personal experience and historical examples of people with handicaps leading better lives if we support them is rather obvious. What scientific evidence do you have that we should not support the handicapped?\n\n We attempt to transcend divisive parochial loyalties based on race, religion, gender, nationality, creed, class, sexual orientation, or ethnicity, and strive to work together for the common good of humanity.\n\nThere is plenty of evidence that humans are human, that many problems are global, and that parochial divisions can cause great harm. See, for instance, the Rwanda Genocide committed by people who were essentially similar to their victims.\n\n We want to protect and enhance the earth, to preserve it for future generations, and to avoid inflicting needless suffering on other species.\n\nPreventing needless suffering is a value choice. We can point out that preventing it leads to better physical and mental health and that protecting the environment does, too. You are agnostic as to these assertions? Really?\n\n We believe in enjoying life here and now and in developing our creative talents to their fullest.\nThese are values. If we value happiness and mental health, then encouraging people to develop creative talents is preferable to discouraging this. While there is probably psychology evidence supporting this, it is something that I've experienced enough in life and from looking at the history of places that repress creativity that I feel no need personally to seek out research on the subject. \n\n We believe in the cultivation of moral excellence.\n\nThis is just axiomatic. I believe moral excellence to be somewhat subjective. We decide on what we consider to be our moral principles such as whether we favor health and wellbeing. But then we can look at objective standards for how any given act supports or hinders those values.\n\n We respect the_right to privacy. Mature adults should be allowed to fulfill their aspirations, to express their sexual preferences, to exercise reproductive freedom, to have access to comprehensive and informed health-care, and to die with dignity.\n\nWhich of these do you challenge? \n\n We believe in the common moral decencies: altruism, integrity, honesty, truthfulness, responsibility. Humanist ethics is amenable to critical, rational guidance. There are normative standards that we discover together. Moral principles are tested by their consequences.\n\nPersonally, I'm agnostic as to one part of that. I don't know that we discover existent moral standards. As far as I can tell, morals aren't dictated by the universe or a god. I agree that, as I roughly define morality, we judge by consequences. The various moral decencies listed have proved beneficial historically and in personal experience.\n\nI will stop going one by one. which of these both needs and lacks evidence:\n\n We are deeply concerned with the moral education of our children. We want to nourish reason and compassion.\n\n We are engaged by the arts no less than by the sciences.\n \nWe are citizens of the universe and are excited by discoveries still to be made in the cosmos.\n\n We are skeptical of untested claims to knowledge, and we are open to novel ideas and seek new departures in our thinking.\n \n We affirm humanism as a realistic alternative to theologies of despair and ideologies of violence and as a source of rich personal significance and genuine satisfaction in the service to others.\n \n We believe in optimism rather than pessimism, hope rather than despair, learning in the place of dogma, truth instead of ignorance, joy rather than guilt or sin, tolerance in the place of fear, love instead of hatred, compassion over selfishness, beauty instead of ugliness, and reason rather than blind faith or irrationality.\n \n We believe in the fullest realization of the best and noblest that we are capable of as human beings.<"}