{"doc_id": "1129", "name": "2017_04_humanities_student_major_1932_hawaii", "namespace": "we1sv2.0", "metapath": "", "pub": "Hawaii", "title": "2017-04-humanities-student-major_1932_Hawaii.txt", "pub_date": "2017-04-17T00:00:00Z", "Sentiment": "0.13", "Subjectivity": "0.376", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "425", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgduofd", "Reddit_id": "dgdva0y", "Subreddit_id": "t5_2qi3u", "Commenter": "Pulelehua", "length": "2768", "content_scrubbed": "The Merrie Monarch- \n\nThe festival is dedicated to the memory of King David Kalakaua, the last king of the Kingdom of Hawaiʻi, who reigned from 1874 until his death in 1891. Kalakaua was \"a patron of the arts, especially music and dance,\" and is credited with reviving many endangered native Hawaiian traditions such as mythology, medicine, and chant. He was also a strong supporter of the hula, a traditional form of dance. Many of these cultural practices \"had been suppressed for many years under missionary teachings.\" The festival is named after Kalakaua[.] nickname \"Merrie Monarch\" because he was known to always be happy, fun, and loving towards his people. The structure of the festival takes after Kalakaua[.] Silver Jubilee. This was a two-week celebration of Hawaiian culture on his 50th birthday (1886) at ʻIolani Palace on the island of Oʻahu.\n\nhttps://en. m. wikipedia. org/wiki/Merrie_Monarch_Festival\n\nFirst begun in 1964 as a way to attract tourists to tsunami-devastated Hilo, the Merrie Monarch festival didn't become a success until it refashioned itself into a cultural event showcasing Hawaiian hula. Originally sponsored by the Hawai'i Chamber of Commerce, in 1968 the festival was taken over by Dorothy (Dottie) Thompson who served as festival chairperson. George Na'ope, one of the festival[.] original creators, worked with Thompson to make the event a focal point of cultural rejuvenation as well as a testing ground for serious kumu hula and their students.\n\nThe festival is named after King David Kalakaua (called the Merrie Monarch) who encouraged a Hawaiian cultural renaissance during his reign and included hula performances in his 1883 coronation celebration. He stated, \"Hula is the language of the heart and therefore the heartbeat of the Hawaiian people.\"\n\nIn 1971, the first year of competitive dancing, nine halau (wahine only) danced at the Hilo Civic Auditorium. In 1976, the kane (men[.]) division was introduced and by 1976, the event had grown so large it had to move to the Edith Kanaka'ole Tennis Stadium, where it is still held today. Each year sold-out performances are enjoyed by islanders and visitors from as far away as Japan, Italy and Germany. Since 1980, the three competition nights have also enjoyed live statewide television coverage.\n\nhttp://www. hawaiihistory. org/index. cfm?PageID=346\n\nIn 1964, the festival consisted of a King Kalakaua beard look-alike contest, a barbershop quartet contest, a relay race, a re-creation of King Kalakaua[.] coronation, and a Holoku Ball among other events. But by 1968 the festival fell into hard_times and would have been suspended had it not been for Dottie Thompson, who took over as Executive Director of the festival.\n\nhttp://merriemonarch. com/history-merrie-monarch-festival\n\n"}