{"doc_id": "280", "name": "2017_10_humanities_student_major_455_personalfinancecanada", "namespace": "we1sv2.0", "metapath": "", "pub": "PersonalFinanceCanada", "title": "2017-10-humanities-student-major_455_PersonalFinanceCanada.txt", "pub_date": "2017-10-06T00:00:00Z", "Sentiment": "0.267", "Subjectivity": "0.448", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "745", "Permalink": "http://reddit.com/r/PersonalFinanceCanada/comments/74mljh/how_many_of_you_achieved_the_career_youve_always/dnzo0r6/", "Threadlink": "http://reddit.com/r/PersonalFinanceCanada/comments/74mljh/how_many_of_you_achieved_the_career_youve_always", "Parent_id": "t3_74mljh", "Reddit_id": "dnzo0r6", "Subreddit_id": "t5_2tasy", "Commenter": "ndhl83", "length": "3954", "content_scrubbed": "Depends...\n\nI have a career that is demanding and mentally stimulating, but I'm not passionate about it. The financial reward, however, allows me to generally do as I please in my private/family life, within reason.\n\nWhen I was a kid I thought I would become a doctor because I loved science, had the grades to prove it, and I wanted the prestige that came with being an MD. In high school I developed a larger interest in computers (and incorrectly thought I lacked the empathy to be a doctor) and went bonkers learning VB and Visual C++ programming in classes, networking, and building rigs. Unfortunately this new hotness blinded me to my old path...\n\nI went to university and turned my back on science, pursuing a CS degree through the Arts faculty so as to avoid Physics and Chem through a B. Sci degree. After a year of programming, however, I discovered I am an advanced hobbyist who enjoys dabbling, but not a programr and have no desire to be one professionally :P\n\nSo... I switched to business because I'm great at math and great with people and the credits I had already would see me graduate on track. I had taken \"Intro Biz\" as an elective and it was a fun and interesting class. In retrospect I know that the better/more challenging decision would be to have started over from scratch as a year 1 science student, but now 12 years later I'm a CPA and CMA helping to run a large group of construction companies, and my personal life is 11/10... so if doing anything differently would have put me someplace other than where I am right now... I would not want that. I love where I am right now, as I type this especially my SO, tbh. I wouldn't change anything if it meant I wouldn't meet/woo/fall in love with her, and have a child with her.\n\nSo, back to today/\"dream job\": I am not personally excited by our products or industry, but I love the owner/boss, the company, and all of my co-workers. I like being here, I like managing people, I enjoy the scope of the work and the responsibility I have. I have a fun time at work and usually head home with energy to spare and in a good mood from being around good people all day.\n\nAll that said: I work to live. Some of my older coworkers have this identity based on their role at the company that extends into their home life and I just can't relate to that. I very much have a \"work identity\" and a \"real me\". There is overlap, of course, and maybe that isn't a normal attitude, but it[.] how it is for me. When I am home I am not thinking about work, at all. That is also because I do what I need to do M-F to ensure I don't have to manage work issues in off hours.\n\nI guess, at the end of the day, having your \"dream life\" (within the bounds of reality) is more worth aiming for than a \"dream job\". My job/career is what funds my life... and my life is great. Relaxing, fun, easy, stimulating, loving, etc. All the stuff I pictured as being part of my life when I was younger, I now have: Brilliant SO, a child, dogs, a nice house, investments, and working on getting some land outside of the city as our next goal, for a place to relax and keep in the family.\n\nSo don't get hung up on your \"dream job\" unless you are one of the lucky few who end up working in a field you are truly and legitimately passionate about... like if you were a huge animal lover and you work towards being a vet at a wildlife rescue reserve, or some jazz. Otherwise just keep perspective on your life as a whole and what having a good and stable career, that you do well at, will do for you. It takes a lot of the shine off that ideal of the \"perfect job\" or \"dream job\". It[.] still a job... work towards a dream life instead where you can fulfill your interests and desires not just for work, but for what nourishes your soul on your own time ;)\n\n**TL;DR** - Mid 30[.] guy reflects on life/path, realizes that \"dream job\" is kind of a lofty ideal, but that any job/career done well can help you build your \"dream life\"."}