{"doc_id": "1279", "name": "2017_04_humanities_student_major_3301_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_3301_AskReddit.txt", "pub_date": "2017-04-29T00:00:00Z", "Sentiment": "-0.02", "Subjectivity": "0.321", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "315", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgwywgg", "Reddit_id": "dgx4cxq", "Subreddit_id": "t5_2qh1i", "Commenter": "King_of_Avalon", "length": "1723", "content_scrubbed": " Putting your kid into IB is legitimately child abuse. \n\nOh, fuck right off. You clearly have no perspective of IB. I finished my diploma 13 years ago and don't regret a second of it. It put me streets ahead of most of my university classmates and prepared me for how to actually write academically. I had about 2 hours of homework per night.\n\nthey literally can't have a social life\n\nMine didn't suffer at all. I routinely went out with friends and stayed in the Boy Scouts at the same time to achieve the rank of Eagle the same month that I graduated.\n\n do any sports or band or drama programs\n\nI was in the band for my whole four years of high school. I also found time in the afternoons to take piano lessons, trombone lessons, and play in my local youth symphony for two out of those four years.\n\n A program where they're less likely to receive a scholarship offer.\n\nAt that time, at least in the state of Florida, I got a full scholarship even as a relatively mediocre student specifically because of IB. I never paid a dime of tuition, nor did any of my classmates who stayed in Florida at a public institution.\n\nWhere your only option of getting college credit is through an AP class you aren't prepared for\n\nAll of my relevant IB classes transferred to a liberal_arts school in Florida, and we also did a few AP exams in addition to IB.\n\n I could've graduated with my Associates before my high school graduation.\n\nDid you?\n\nYes, it[.] difficult and you need to put in the work, but it[.] no more difficult than any undergraduate degree. But hey, we all know that college kids are notorious for never going to parties, never acting crazy and never leaving the library because of the immense stresses of their studies."}