{"doc_id": "979", "name": "2017_04_humanities_student_major_542_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2017-04-humanities-student-major_542_GradSchool.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.207", "Subjectivity": "0.455", "Score": "16", "Upvotes": "0", "Downvotes": "0", "Wordcount": "279", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63q7bd", "Reddit_id": "dfw5q6o", "Subreddit_id": "t5_2r4r8", "Commenter": "Jibs93", "length": "1534", "content_scrubbed": "I am a student that is about to enter in a Phd program in the humanities. Yet, most of the comments I read about graduate school are overly negative, how the job market is terrible and how people are depressed while in graduate school\n\nKeep in mind that, in general, subs such as this one are an outlet for people to find support and ask questions. This means that students who are struggling or are uncertain are more likely to post here, and therefore, the students who are doing well and flourishing in grad school are underrepresented. \n\n\nMy question is, if all of these things are true, why do you still pursue? What is your main motivation?\n\nFor me, it[.] because I am in love with the experience. I went into this master[.] program thinking that I would get in, get out, get a job. Not even a full year in I was so happy with my experience that I decided to pursue a PhD as well. Teaching, working in the lab, documenting my work, taking courses that push to the bounds of knowledge, it[.] all a great time for me. My thought process is: if I'm enjoying the work associated with obtaining an advanced degree, I will most likely also enjoy the work available for those with advanced degrees. In my field, those with undergraduate degrees are usually stuck working very boring, low-level jobs that ultimately lead to management positions. That isn't for me. \n\n\nMoreover, I would like to know if a PhD is better for jobs than work experience.\n\nThis is highly dependent on your field of study and what you would like to end up doing. "}