{"doc_id": "477", "name": "2017_10_humanities_student_major_2470_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-10-humanities-student-major_2470_ApplyingToCollege.txt", "pub_date": "2017-10-25T00:00:00Z", "Sentiment": "0.151", "Subjectivity": "0.311", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "245", "Permalink": "http://reddit.com/r/ApplyingToCollege/comments/78phkh/washington_university_in_st_louis_vs_harvey_mudd/dovoyu1/", "Threadlink": "http://reddit.com/r/ApplyingToCollege/comments/78phkh/washington_university_in_st_louis_vs_harvey_mudd", "Parent_id": "t3_78phkh", "Reddit_id": "dovoyu1", "Subreddit_id": "t5_2y2r8", "Commenter": "virtualpropinquity", "length": "1490", "content_scrubbed": "I think that between these two schools Harvey Mudd is generally regarded as having the stronger engineering undergrad program. However, there are some things you need to think about. Harvey Mudd[.] required curriculum is extremely intense and demanding- they require every student to take math, chem, bio, physics, engineering, and CS alongside a large number of humanities/arts courses. WashU will give you some flexibility- not a lot, but definitely more than Mudd. Harvey Mudd is a liberal_arts college, which means more individual attention and generally better teaching, but that comes at the expense of the variety of specific engineering courses and leading researchers a world-class university like WashU will have. WashU students seem happier to me and the campus amenities/quality of life cannot be topped. Mudd students seem to be drowning in work all the time. You have the Claremont Colleges for a bigger experience, yes, but Mudd students seem to take advantage of it the least due to how much work they always have. It may be good to get some perspective from engineering students at WashU specifically regarding rigor. A big thing for you will be that ED to WashU has a big boost- nearly a 40% acceptance rate- whereas ED to Harvey Mudd barely helps (it is the most selective ED school in the country- yes, more than Columbia/Penn/Brown/Duke/etc.)\n\nHave you checked out Rice at all? Rice is pretty similar to WashU but is regarded as having the stronger engineering program. "}