{"doc_id": "367", "name": "2017_10_humanities_student_major_1308_aznidentity", "namespace": "we1sv2.0", "metapath": "", "pub": "aznidentity", "title": "2017-10-humanities-student-major_1308_aznidentity.txt", "pub_date": "2017-10-14T00:00:00Z", "Sentiment": "0.077", "Subjectivity": "0.438", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "350", "Permalink": "http://reddit.com/r/aznidentity/comments/76a98q/blatant_racism_being_gilded_and_upvoted_by/docpx63/", "Threadlink": "http://reddit.com/r/aznidentity/comments/76a98q/blatant_racism_being_gilded_and_upvoted_by", "Parent_id": "t1_docplir", "Reddit_id": "docpx63", "Subreddit_id": "t5_3amv4", "Commenter": "Leetenghui", "length": "1887", "content_scrubbed": " I am of the opinion that your typical liberal_arts 4 year degree from a regional school isn't worth a fuck in the U_S.\n\nI don't know. I really loathe education snobbery. I went to school X so I'm better than you. Even as somebody who went to a very good university (and then some not so good ones for my other degrees) I don't look down on those who went to lower ranked universities.\n\n\nThe ranking vs the teaching quality or outcomes can be very different.\n\nA woman I dated briefly went to UCL in London. UCL is highly ranked. She told me the classes were very old style. Massive lecture theatre with a professor with slides waffling on for 2 hours. There was very little interaction other than a few questions. Student to professor ratio of 300 to 1.\n\nOTOH not so good university didn't do old style lectures they taught almost like in high school classes of 20 not 2 hours of being spoken to and lectured but short presentations. Then activities to reinforce understanding then more material and more activities. \n\nOr outcomes.\n\nWay back rank 67 university gave you ACCA exemptions up to stage 3 meaning you only had to do 5 exams and your sign off portfolio to become an ACCA. \n\nThe rank 12 university gave you ACCA exemptions up to stage 1 meaning you had to do 12 exams and your portfolio sign off to become a full ACCA.\n\n\nSimilarly when I was a semi senior and was involved in the hiring. The top university folks could talk the talk but when you presented them with tests simple things like T tables they often couldn't do them. The mid and lower level university guys tended to not be as brazen and bold in talking but they could complete easy stuff like T-tables like it was nothing..\n\n\n\n\nSo really there are far too many variables and what you do with it is the important bit. The piss easy I'm going to teach ESL with it is one of the worst things you can do.\n\n\n\n\n"}