{"doc_id": "277", "name": "2017_10_humanities_student_major_391_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-10-humanities-student-major_391_politics.txt", "pub_date": "2017-10-05T00:00:00Z", "Sentiment": "0.116", "Subjectivity": "0.414", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "252", "Permalink": "http://reddit.com/r/politics/comments/74gb5l/americans_losing_faith_in_college_degrees_poll/dnya7e5/", "Threadlink": "http://reddit.com/r/politics/comments/74gb5l/americans_losing_faith_in_college_degrees_poll", "Parent_id": "t1_dny8ir5", "Reddit_id": "dnya7e5", "Subreddit_id": "t5_2cneq", "Commenter": "DrollerCoaster", "length": "1502", "content_scrubbed": "If money is no object, then have at it and enjoy your the experience of lots of parties and casual sex, major choice be damned.\n\nI think you're vastly overestimating how much fun liberal_arts majors have. The real party people at the universities I've attended are the business and nursing students.\n\nThat aside, I think you're being too black and white about the matter. For one, not all loans are created equal. DoE loans are generally much easier to pay off than those from private lenders, for example. For another, what good is your choice of major if you don't obtain your degree? Someone who absolutely can't stand marketing or accounting and, thus, does poorly in those subjects probably isn't going to do very well regardless of how lucrative the career options might be for those fields.\n\nSure, people need to be more careful about borrowing money. But, I think there[.] a healthy amount of middle-ground between \"money is no object\" and \"I'm borrowing money, therefore career prospects should determine my major.\" $40-50k worth of debt is manageable, even for lowly political science or philosophy majors. Sure, you might have to work in a field you might not have expected, since they've closed all the major philosophy factories in the U_S But, between choosing a less-than-lucrative major that one enjoys and getting a degree as opposed to choosing a supposedly lucrative major that one hates, I'm going with the less-than-lucrative major choice every day of the week and twice on Sunday."}