{"doc_id": "1059", "name": "2017_04_humanities_student_major_1302_writingprompts", "namespace": "we1sv2.0", "metapath": "", "pub": "WritingPrompts", "title": "2017-04-humanities-student-major_1302_WritingPrompts.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.054", "Subjectivity": "0.234", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1066", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64repx", "Reddit_id": "dg5gc5q", "Subreddit_id": "t5_2s3nb", "Commenter": "CosmicIce05", "length": "5734", "content_scrubbed": "Doma 7, Cycle 6 10\n\nI woke up early Cycle 6 to the intercom system and the flashing red lights.\n\n*Attention passengers. Destination compromised. Detour to Base Titan*\n\nThat was what I was able to translate when it happened.\n\nMy name is Jason Ji. I'm 24, not like that matters anymore. In the time I've spent with the Oga people I've detached myself from the rest of my people. They took me on to teach me about their cultures, their languages, their biology, you get the picture. \n\nEven they think that they're any different from each other, but they're all the same. Back home we used to pick on each other based on our race, our body shape, our origins, and we thought we were alone. That was until *they* came. \n\nAll the countries in the world had their nukes ready and their soldiers ready and their bunkers ready but it was pointless. They weren't intimidated at all by our weapons. Their ships were in hundreds and them, millions. To them we were aliens, with our barbaric habits and our gross biology. Everybody on earth picked on one another for their biology and even I am guilty of this. They were appalled by the extent in which we've discriminated against our people.\n\nThe leader of one of the big ships lead his ship to the outskirts of DC and met with President West and her dozens of guards with their rifles waiting to slaughter the poor captain. The captain[.] name was Brindia, and he told me that his Joken had high hopes for reaching earth in the future, which is why she prepared him for the encounter.\n\nBrindia and President West, after many, MANY hours of live interviews and even a couple of failed nukes and a mini-war that resulted in Pyongyang being destroyed, agreed on a negotiation. The Oga requested one human to go with them for one of their earth years and monitor them, and the Humans requested technology to colonize and terraform Mars. The Oga agreed to the terraforming only and they got to pick which human to take with them, so long as it was okay by the citizens government.\n\nThe next day Governor Blue issued a PSA to the entire Rhodeachusetts state and it[.] statewide broadcasting networks summarizing the results of the trade deal. I was thinking to myself \"I wonder who they are going to pick. Maybe Funko? What about Genevieve Cho? Nah, why would they pick a celebrity?\" Until WHOOP DEE DOO DUN GOT PICKED UP BY A DEATH STAR.\n\nAll of these thoughts were going through my brain of fear and panic and uncertainty. For the first time in my life I felt like there was so little that the brain could possibly handle, and this was something I could not handle.\n\nBrindia sat me down for a good thirty seconds before telling me that we had arrived at DC. This was the first time I have heard him speak in person. His voice was nurturing and lighthearted if I could put it that way; I guess the microphone somehow distorted his voice to sound like some kind of alien. Somehow he made me less intimidated just by telling me I was hundreds of miles away from my home with my pants down, but it was *how he said it*, though.\n\nHe docked the ship and got me out of their weird, yet comfortable seats. He held my hand and gently walked me to the Oval Office. I noticed he did not even knock when coming in any doors and the guards, while armed and ready to fire, did not hesitate to stop him. He said \n\n\"I choose this one\". Remarked Brindia\n\n\"What? Who is this? Why him?\" Said West\n\nI stumbled and rambled explaining myself.\"*ahem*... uh, hello Mrs. President. I-I'm *ahem*... My name is Jason Ji. I am 23 years. I was born and raised in Massachusetts. I majored in History and Chemistry at Ca-\"\n\n\"Okay, good Mr. Ji. Now Brindia, why did you choose him?\"\n\n\"You said I could pick whoever I want as long as it was okay with you.\" Said Brindia.\n\nWest paused for a moment and asked me \"Okay, Mr. Ji, I'm sure you know about the deal, but are you okay with being humanities representation for the Oga?\" \n\nI paused for a moment deciding on this, having to sit down to think.\n\n\"Let me remind you of a couple of things, Mr. Ji. This is the first time our species has ever encountered a race of people who have matched our intelligence. This being has taken time out of his life to not only learn English but also to study the history and cultures of our entire planet over the course of hundreds of thousands of years. Now a fleet of them waltz on by to earth finally prepared to form an alliance after the Forty Years of Suffering, willing to help us reach their levels, and all they request is that *one* human spend a year of Earth time with them, and they picked *you*.\"\n\n\"You realized I watched the entire interview, right?\" I said with a smirk on my face. \"Alright I'll go with them, just give me two weeks to prepare.\"\n\n\"How does that sound, Brindia?\" Said West.\n\n\"Make it 12 days and it would be perfect. That[.] when Doma 3 starts. He should be back by mid Doma 7 if everything goes as planned.\"\n\nI couldn't believe I had just said that like it was nothing. Leaving the entire planet earth for a year with little consideration was very irrational, even for me.\n\nMaybe it[.] for the best. I had no girlfriend, a part_time job as a server, and my parents were having the time of their lives. Maybe they didn't need me on earth.\n\nBut now it[.] gone. Earth is gone. It[.] blank. No radiation, no fragments of earth like rock, not even any detection by Oga scanners in change of movement. It[.] like it was never there in the first place. I've been caught between so many emotions for the past year of my life that I just wanted to go home and lay low. Brindia was nice enough to write down all the information he learned about me and I learned about him and his people, but I guess humanity isn't going to need it."}