{"doc_id": "355", "name": "2017_10_humanities_student_major_1190_samharris", "namespace": "we1sv2.0", "metapath": "", "pub": "samharris", "title": "2017-10-humanities-student-major_1190_samharris.txt", "pub_date": "2017-10-12T00:00:00Z", "Sentiment": "0.011", "Subjectivity": "0.228", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "309", "Permalink": "http://reddit.com/r/samharris/comments/75wpvp/harris_and_college_kids_gone_wild_why_does_this/doa82wz/", "Threadlink": "http://reddit.com/r/samharris/comments/75wpvp/harris_and_college_kids_gone_wild_why_does_this", "Parent_id": "t1_do9ioy6", "Reddit_id": "doa82wz", "Subreddit_id": "t5_2thqg", "Commenter": "Palentir", "length": "1762", "content_scrubbed": "I think it[.] important even if overblown simply because of which kids you see doing it, and the extremes they're willing to embrace both as positions and as tactics.\n\nFirst the WHO:  it[.] upper class kids at elite colleges and universities, and at that the students of liberal_arts.  These are essentially the future elites, the ones who will go on to run large companies, run for public office, work in think tanks.  In short, these are precisely the people who will set the agenda for the next generation.  \n\nThe extremes of policy:  well, words are now violence, and none of our future leaders believe in free speech enough to even give lip service to the idea that opposition to their ideas has a right to be spoken.  They don't believe that males, particularly white men have any claim to anything society has.  They want to shut down anything that[.] largely enjoyed by males, they won't allow any debate on things men need, they think anyone in the majority has no right to be heard at all.  It[.] always \"derailing the conversation,\" and \"shut up, listen and believe,\"  and if men need a domestic abuse shelters, eff that.\n\nAs for tactics, it[.] the stuff of extremists.  Says something they don't like, they willingly do anything they can to get you fired.  They don't see a problem with riots, broken windows, punching people, or anything else.  They see no problem with vandalism.  It[.] just \"shut it down, burn down campus so the other side can't talk\" and so on.\n\nIt not a huge storm yet, but in ten years the people in antifa will be running American institutions, setting policies, etc.  that[.] what scares me.  I don't drink Starbucks, you can destroy all of them, I don't care.  But that[.] not where it will stop.  It stops with congressman Antifa."}