{"doc_id": "1220", "name": "2017_04_humanities_student_major_2775_samharris", "namespace": "we1sv2.0", "metapath": "", "pub": "samharris", "title": "2017-04-humanities-student-major_2775_samharris.txt", "pub_date": "2017-04-24T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.348", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "381", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67cib5", "Reddit_id": "dgpeav1", "Subreddit_id": "t5_2thqg", "Commenter": "TheAJx", "length": "2233", "content_scrubbed": "I'm a bit agnostic on racial diversity, although I think it should be promoted where possible.  (primarily because I believe that most corporate and institutional structures, led primarily by white men subconsciously prefer increasing or maintaining whiteness over a true meritocracy (which isn't to cast negative aspersions on them, but a reflection of my observations).\n\nHowever, I do think there is one downside to affirmative action in schools and that is that it leaves a lot of black students behind in STEM, and it leaves a lot of black students at public universities behind.  \n\nThe way AA works now, a black student with a 1350 SAT score has a high likelihood of being accepted into an ivy league or liberal_arts college or something like that.  They will do fine wherever they go.  Not to say that SAT scores dictate all outcomes in life and education, but lets just use it as a proxy for scholastic ability.  Because all the 1350 SAT scores are going to prestigious private schools, to maintain racial quotas, Berkeley naturally has to now look for the 1200 SAT score black students.  Perfectly capable, intelligent students by *not positioned to succeed at Berkeley* because they are competing with other 1400 SAT score students.  I don't think you can \"hard_work* your way through that.  Curves and mandatory 10% fail reates . . . its rough. \n\nSo what happens?  These black students are not playing on a level playing field and lose motivation, end up getting a degree sociology or mass communications.  I don't think there is a strong \"pull you up\" effect from Affirmative Action in academia.  But maybe there is, but IMO, I have felt that minority students and public universities have not been well served by affirmative action because the top black students go to private schools.\n\nWouldn't it have been better if that 1200 SAT score black student went to UC Davis with a bunch of other 1200 SAT score black, white Asian and Hispanic students, competed on a level playing field, and got his degree?  You don't have to be a genius to be an engineer.  You can pretty much be of middling intelligence and be a suitable engineer.\n\nHow many minority engineers and scientists are missing in America because of this effect?"}