{"doc_id": "463", "name": "2017_10_humanities_student_major_2251_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2017-10-humanities-student-major_2251_slatestarcodex.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.415", "Score": "35", "Upvotes": "0", "Downvotes": "0", "Wordcount": "379", "Permalink": "http://reddit.com/r/slatestarcodex/comments/787dqd/culture_war_roundup_for_the_week_of_october_23/doswk0o/", "Threadlink": "http://reddit.com/r/slatestarcodex/comments/787dqd/culture_war_roundup_for_the_week_of_october_23", "Parent_id": "t3_787dqd", "Reddit_id": "doswk0o", "Subreddit_id": "t5_30m6u", "Commenter": "CAnon20171023", "length": "2334", "content_scrubbed": "http://www. spiked-online. com/newsite/article/how-identity-politics-divided-reed-college-black-lives-matter-free-speech/20417 \n\nFollowup by the Economist writer who did the first piece on the protests and identity politics turmoil at Reed College. Added valuable context is that the school is one of the top 4 producers (for its size) of PhDs, so this has some bearing on the future of academia. Also the students here are all decidedly to the_left so in deciding how much charity to give the activists note the people they're going after are likely bernie-sympathetic people. Lastly, the author is throwing some shade with the Lewis and Clark references as it[.] kinda crapped on as the dumb jock cousin.\n\nDangerously close to a boo outgroup piece but I saw some unexpectedly positive feedback from people I would expect to have problems with the piece on facebook so sharing it here. Website also looks dodgy but I think the writing holds up and the Economist[.] vouch is meaningful for me. Hopefully this might be a useful parable to warn activists about the damage a mob can do to innocent people.\n\nThe piece sparked a very visceral reaction for me. Went to the school and appreciated what it stood for in terms of big C Conservative philosophy and respect for the classical cannon. Disappointed with how it has leaned into identity politics battles and how the faculty has begun to gut that humanities curriculum. The school has put more effort into trans and various identities studies as well while under-funding it[.] economics department which has also been disappointing. I think it[.] striking that we're seeing the students not the administration driving the response. I wish this article did more with the \"thinkery\" group.\n\nWhat happened to Hunter also just feels like pure evil and it understand that the people that did that to him are only short-sighted and selfish rather than something worse. The author tries to cut through to her. I don't think she[.] consciously double dealing. I just think she[.] so sure of her purity and the truth of her actions that she cannot comprehend his point.  Maybe.\n\nChoice quote\n 'People who feel they've been ostracised for their political beliefs should look at their beliefs and ask themselves why a lot of Reed[.] student population feels that way', \n\nAlt because I went to the school."}