{"doc_id": "1216", "name": "2017_04_humanities_student_major_2757_samharris", "namespace": "we1sv2.0", "metapath": "", "pub": "samharris", "title": "2017-04-humanities-student-major_2757_samharris.txt", "pub_date": "2017-04-24T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.322", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "365", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgoqqxp", "Reddit_id": "dgp4wg9", "Subreddit_id": "t5_2thqg", "Commenter": "thepillowcover", "length": "2296", "content_scrubbed": "Other than the fact that the scientific community has completely discredited the theory that some races are smarter than others due to their genetic makeup?\n\nCool lie bro\n\nPoll done on experts in IQ:\n\n\"The role of genetics in the black-white IQ gap has been particularly controversial. The question regarding this in the survey asked \"Which of the following best characterizes your opinion of the heritability of black-white differences in IQ?\" Amongst the 661 returned questionnaires, 14% declined to answer the question, 24% voted that there was insufficient evidence to give an answer, 1% voted that the gap was \"due entirely to genetic variation\", 15% voted that it was \"due entirely to environmental variation\" and 45% voted that it was a \"product of genetic and environmental variation\". According to Snyderman and Rothman, this contrasts greatly with the coverage of these views as represented in the media, where the reader is led to draw the conclusion that \"only a few maverick 'experts' support the view that genetic variation plays a significant role in individual or group difference, while the vast majority of experts believe that such differences are purely the result of environmental factors.\"\"\n\nhttps://en. wikipedia. org/wiki/The_IQ_Controversy,_the_Media_and_Public_Policy_(book)\n\nDo I have evidence?\n\nNo you don't have evidence, you're straight up lying and making things up. I posted a poll consisting of hundreds of experts in IQ. Most of the experts who responded to the poll (over 50%) reported that they believe the black/white IQ gap is due partially to the environment and genes.\n\nLiar liar pants on fire.\n\nAlso inb4 an attempt to weasel your way out of this \"I said smarter, I didn't say anything about IQ because that[.] assuming IQ is a good measure of intelligence\" even though this entire conversation is about IQ.\n\nThis is like talking to a bunch of Trumpkins spouting off their \"alternative facts\".\n\nYeah it[.] kinda similar to dogmatic leftists who spout off lies about the scientific community.\n\nImplying you have the scientific high ground and then lying about a consensus that doesn't exist in the scientific community? That is low, you don't give a fuck about honest science stop pretending that you do. Go into your humanities corner where ideologues belong."}