{"doc_id": "1067", "name": "2017_04_humanities_student_major_1355_tifu", "namespace": "we1sv2.0", "metapath": "", "pub": "tifu", "title": "2017-04-humanities-student-major_1355_tifu.txt", "pub_date": "2017-04-12T00:00:00Z", "Sentiment": "-0.015", "Subjectivity": "0.315", "Score": "184", "Upvotes": "0", "Downvotes": "0", "Wordcount": "334", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg5s1s6", "Reddit_id": "dg5sg64", "Subreddit_id": "t5_2to41", "Commenter": "silent--echoes", "length": "1927", "content_scrubbed": "I come from quite a working class background in a small town/farming community. I've also worked some shitty jobs in a couple of cities and pubs.\n\nI find a lot of the folks who are worse for this behaviour (simultaneously preaching uber-liberal acceptance and equality, whilst decreeing all men evil, or all conservatives as evil, or anyone they don't like as being evil due to their social standing, gender or political allegiance) - and this is PhD students and academics - are the ones who have come straight through the education system. School to uni to masters to PhD to to academic career. \n\nThe girl who reprimanded me for talking about my girlfriend didn't understand how the tax system worked, as she[.] never had a job. I had to explain that, yes, the government can and will take money from you. \n\nThese people typically come from wealthy backgrounds, have been in education/academia all their lives, socialise in highly liberal and academic circles and then go on to make good money. One of them - who is the definition of this. 50k a year, lives in a darling rural area in a big house, was telling me why I should back Corbyn because he supports \"normal people like us\"? \n\nThey genuinely believe that they represent the majority of British people. I tried to explain that we are HIGHLY privileged in what we do. \n\nHe said that North of England had let the country down for abandoning labor/voting Brexit and suggested that it was down to their latent racism. \n\nI suggested that genuine working class people may have bigger day-to-day issues than the type of politics that we discuss in the department (identity politics, safe spaces, immigration etc).\n\nApparently not. \n\nI'm proud of my PhD, my research and striving to be an academic. But at the same time, I truly hate the hypocrisy that is rampant in humanities/liberal_arts. \n\nSorry for the rant. I envy you guys in STEM. You guys have far more common sense.\n"}