{"doc_id": "1106", "name": "2017_04_humanities_student_major_1786_newzealand", "namespace": "we1sv2.0", "metapath": "", "pub": "newzealand", "title": "2017-04-humanities-student-major_1786_newzealand.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.148", "Subjectivity": "0.427", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "477", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65iag2", "Reddit_id": "dgbn4a5", "Subreddit_id": "t5_2qhma", "Commenter": "paulfknwalsh", "length": "2931", "content_scrubbed": "This is an interesting discussion. Good work all round. :)\n\nI agree wholeheartedly with your post. Personally, though, I've ended up in some weird middle ground on this issue; on the one hand, I am supporting my family off my art (finally cleared $60K!), and I also have an arts degree.. but these two facts are pretty much unrelated. In fact, I'm pretty sure I would be doing better if I hadn't gone to University, because of the student loan. \n\nThis is because my degree was in audio production for film and theatre, not visual arts; but I've never really used those skills since. I tried getting into audio production for years, but it[.] a difficult but to crack; then I realised how much money I could make DJing, and just focused on that. (Which.. kind of counts, I guess?) On the other hand, I'd already sold over $2K worth of paintings by the time I finished high school, and continued to make money by selling canvases throughout Uni - and since that was my passion, I was happy spending hours in the library reading every art book I could find. \n\nWith disciplines that are almost entirely subjective - mostly fine arts - a lot of people shouldn't really need tuition from anyone to be able to produce quality work. This is one area where the Internet, a library card and a connection to others in the same field can give you almost the exact same level of education, provided you have the drive to learn. (What[.] that Picasso quote.. \"Every child is an artist. The problem is how to remain an artist once we grow up.\")\n\nOn the whole, though, I still think the humanities are an absolutely necessary component of higher education, society does need to bankroll the avant-garde weirdness that has limited appeal, and sometimes it can also be a profitable industry - the film industry alone had [$3. 3 billion](http://www. radionz. co. nz/news/business/328692/nz-screen-industry-revenue-rises-to-$3-point-3bn) in revenue last year. \n\nIMO a great option for post-secondary art education is through something like the (now virtually defunct) PACE scheme - Pathway to Arts and Cultural Employment, otherwise known as the 'Artist[.] dole'. This was a business-oriented approach to the arts, where participants had to prove the economic viability of their artistic practice by treating it like a trade, and actually making money off it and supporting themselves. The problem with it was largely, well, musicians are crap at making money. And there were a *lot* of musicians who went on that scheme.. that[.] partly why NZ music had a really productive period in 2002 - 2009. Oh and some hack named Taika Waititi reckons it was essential to his career development, but what in Asgard would he know....  we really need to bring that scheme back. \n\n(Relevant article: [What happened to the PACE scheme?](http://www. stuff. co. nz/dominion-post/capital-life/4612498/What-happened-to-the-Pace-scheme) )\n\n**TL:DR;** Art is horseshit, buy tacos. "}