{"doc_id": "1192", "name": "2017_04_humanities_student_major_2520_askwomen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskWomen", "title": "2017-04-humanities-student-major_2520_AskWomen.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "0.076", "Subjectivity": "0.335", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "339", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66x83o", "Reddit_id": "dgmb5fn", "Subreddit_id": "t5_2rxrw", "Commenter": "ferazel9", "length": "1949", "content_scrubbed": "I'm honestly a little amazed at some of the responses on here.  I'm a conservative-leaning libertarian, an evangelical Christian, and a grad student in the humanities, which means that most of the people I have found to be friends with have been atheist/agnostic liberals.  I have exactly 1 friend of maybe a dozen close friends who is remotely right of center or theistic.  Why can you not be friends with someone whose values aren't the same as yours?  From a sort of philosophical standpoint, isn't there value in surrounding yourself with a variety of viewpoints?  How will you ever think about things differently or be forced to thoroughly defend your own viewpoints without being confronted with viewpoints that are different than your own?  \n\nSecondly, I just don't bring up politics very much, if ever, really with most people.  If I know I'm with people who already think like me, we're not going to make any intellectual progress by circlejerking each other around over a bottle of wine for an hour, and if we don't agree with each other, we're unlikely to convince each other to switch sides.  However, if we are both people capable of being civil and thoughtful, then sometimes it is worthwhile to bring up politics and actually seek to *understand* where the other person is coming from, even if i continue to disagree with them, for the global purpose of trying to understand my fellow human and all.\n\nThird, is all you do with your friends sit around and gripe about politics?  Do you not do other things in which politics plays no role?  Politics honestly play such a minute role in my friendships that I just have a hard time understanding how this would work.  I don't make friends in order to have somebody else affirm what I already believe, I make friends with people because I think they're funny, or kind, or clever, or fun, and we maybe like doing some of the same stuff.  Is that no longer a reasonable basis for friendship?"}