{"doc_id": "255", "name": "2017_10_humanities_student_major_241_blogsnark", "namespace": "we1sv2.0", "metapath": "", "pub": "blogsnark", "title": "2017-10-humanities-student-major_241_blogsnark.txt", "pub_date": "2017-10-03T00:00:00Z", "Sentiment": "0.124", "Subjectivity": "0.303", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "240", "Permalink": "http://reddit.com/r/blogsnark/comments/7424bi/help_from_other_blogsnark_phds/dnvox1u/", "Threadlink": "http://reddit.com/r/blogsnark/comments/7424bi/help_from_other_blogsnark_phds", "Parent_id": "t3_7424bi", "Reddit_id": "dnvox1u", "Subreddit_id": "t5_39xf0", "Commenter": "littlerapunzel", "length": "1343", "content_scrubbed": "You're not alone! I cried ALL the time during the first two years of my PhD program (humanities), and then some.  Balancing coursework, research and publications, conferences, teaching, and fellowships while prioritizing your dissertation and trying to have some tiny sliver of a home/social life is practically impossible - but remember, you don't have to do it all, and you don't have to do it all at once!  \n\nOne major thing I learned between my MA and my PhD is the importance of exercise on stress management.  I know it feels like you don't have a second to breathe, let alone an hour to work out, but I promise you'll feel so much better if you sneak in a 30 minute run or a yoga class before you head to class for the day.  Exercise helps center you, energize you, and will help you sleep well at night.  I started running marathons in my PhD program and actually having two major long_term goals to work towards daily really helped me stay on track with both my research and my fitness.  I felt infinitely better than I did in my Master[.] program, before I learned to manage stress with exercise, sleep, and nourishing fuel (and hugs!!).\n\nAs an aside, what is with all the people diminishing humanities PhDs in this thread? FYI, a humanities PhD is just as intense and impressive as a STEM PhD or MD.  They're all doctorate degrees..."}