{"doc_id": "998", "name": "2017_04_humanities_student_major_710_gifs", "namespace": "we1sv2.0", "metapath": "", "pub": "gifs", "title": "2017-04-humanities-student-major_710_gifs.txt", "pub_date": "2017-04-07T00:00:00Z", "Sentiment": "0.067", "Subjectivity": "0.435", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "309", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfypwc9", "Reddit_id": "dfys7m2", "Subreddit_id": "t5_2qt55", "Commenter": "veRGe1421", "length": "1763", "content_scrubbed": "TX is a big and diverse place. There are many rural districts that are terrible, no doubt about it. That being said, Highland Park ISD, Collin County, Kendall County, Coppell ISD, Ft. Worth Academy of Fine Arts, South Texas ISD, Southlake-Carroll ISD, Alamo Heights ISD in San Antonio, Lovejoy ISD in Allen, Liberal Arts & Sciences Academy, Lake Travis, and Eanes in Austin, and Plano or Frisco ISD are excellent school districts. A few in particular are some of the best in the country. According to one study, when it comes to the total number of gold medal schools, California had the most – 84 – followed by Texas with 61 and New_York with 58. The gold and silver awards reflect which schools are most successfully preparing students for college, based on students participating in and achieving passing scores on Advanced Placement and International Baccalaureate tests. For a school to be eligible for a gold or silver medal, its students must also do well on the appropriate statewide tests and graduate at high rates. \n\nI know it[.] easy to shit on TX for not emphasizing/funding education relative to a liberal haven like CO (I wish our gov't operated more like CO in so many ways); however, TX is really diverse and offers a wide range of whatever you're looking for. If you want CO-esque policies, looking in big cities or suburbs of big cities like Austin, DFW, or Houston can provide a lot of the same educational strengths you find in CO. It[.] not all terrible. Don't get me wrong, I have mad respect for public policy and the governmental priorities in CO. We could learn a lot from such policy making, but it[.] ignorant to disregard the entire state as having poor education just the same. There are good and bad, as you'll find in most places."}