{"doc_id": "1258", "name": "2017_04_humanities_student_major_3165_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-04-humanities-student-major_3165_AskHistorians.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.332", "Score": "22", "Upvotes": "0", "Downvotes": "0", "Wordcount": "907", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgv7jwv", "Reddit_id": "dgv7kc9", "Subreddit_id": "t5_2ssp3", "Commenter": "sunagainstgold", "length": "5547", "content_scrubbed": "[2/2]\n\nI argue that increasing incentives for participation, drawing on AskHistorians roots in and out of academia, can help address this imbalance to make our subreddit a better public history platform. By working towards the mutually reinforcing goals of publicity, legitimacy, and advocacy, we can incentivize participation by academic and independent historians on both a personal and professional level.\n \nMore importantly, our strategies have the potential to be adapted for other public history platforms and situations. As we go forward into a world with fewer and fewer academic research positions, more trained PhDs, and less money for public projects, our experiments, failures, and successes can help found a viable \"independent historical\" profession, hobby, and community.\n \nThe biggest incentive for AH panelists is the audience. Who[.] going to read my dissertation? My advisor. My mother, my best friend. The rest of my committee if I'm lucky. I write something on AH in three hours, and 4000 people might read it that day alone. We need to work to increase this number for our popular posts and bring our less popular ones in line with it.\n \nOn a bare material level, we will recruit new readers as well as panelists most basically if people know about us. The problem we face with social media promotion is that each new iteration of social media seems to favor shorter and shorter engagement--and our entire reason for being is longform writing and thought.\n \nWith our Facebook page, we are working to balance the lure of more sensationalizing headlines with an underlying sobriety that points to what is actually behind the link. No, teachers don't HATE US--actually, teachers, we want you to use our answers to help improve your curriculums beyond the textbook! But there is a difference between asking, How did nineteenth century theologians interpret the story of Jonah and, did people ever experiment to see whether a person could live three days inside a whale? We need to be better than our readers--using the unique enthusiasm and personal connection with history as a template for our own efforts at promotion.\n \nBut we know \"exposure\" or work for free is a scam. If we want to make AH viable for the overworked, we need to make it a legitimate crossover activity between hobby and profession. I'll mention two potential strategies here that don't involve one of us winning the lottery. First, using AH as a springboard for individual involvement in other public and paid activities. Second, treating reddit as an albatross in the fullest sense of the metaphor.\n \nA lot of people in and out of academia WANT to do public history or popular history; we[.] teachers and lovers of the past, and we want you to love it, too. Let[.] make AskHistorians a platform to build that sort of presence or strand of a fuller career. When authors use AH to promote their new books, we market those events as hosted by AskHistorians, as well as the promoting the author. Meanwhile, I recently landed a paid writing job for an online history magazine with a portfolio entirely of AH answers. The quality of work being produced on AskHistorians is often astronomical. We need to get over our own anonymous user accounts and claim it.  Adding AskHistorians to our online resumes in forums that professional historians see outside a job search context, can help make us more viable as a line on a cv FOR that future job search.\n \nThe other hurdle with legitimacy in the professional historical world is reddit. Reddit used to be known for cat gifs and militant atheism; now it[.] known for misogyny and white supremacy. We can promote reddit to professional historians--especially young academic ones--as our chance to make a real, concrete difference. We are the place to head off future recruits to Holocaust denialism. Combined with a push towards legitimacy, AskHistorians can make itself the place to fight those battles and get professional acknowledgment for it.\n \nThis bleeds into our final sphere of strategic engagement, activism. The politics of AskHistorians is the politics of doing history responsibly. We have a 20 year moratorium on discussing current events.\n \nUntil recently, that is, when the moderation team chose to take a public stand against the destruction of the NEH and NEA. I don't have to explain why this is the hill we'd die on, I think. But the interesting thing was, although we got some pushback for political involvement, we also got some publicity out of the event. I suggest we can use that kernel of a public platform beyond our subreddit going forward, and mobilize in ways that will help us and similar efforts gain an even bigger role in the kaleidescope of public history.\n \nIn particular, we should barge our way into the gruntwork of shaping what \"digital humanities\" is going to look like. It[.] disheartening to watch online efforts replicate the academic-public-popular history divisions. Online courses and TEDtalks are one sided, reinforcing the magisterial nature of a single authoritative story. Sensationalist podcasts are fifty thousand times more accessible than responsible academic work. Even cool projects like the one that recruits people to transcribe manuscripts requires paleographical and language training that is already tied to academia.\n \nIn the middle of the kaleidescope of histories, AskHistorians is uniquely poised to see that the replication of that divide in the digital humanities is NOT inevitable. We must be a voice for a unified and unifying online historical world."}