{"doc_id": "1108", "name": "2017_04_humanities_student_major_1797_collapse", "namespace": "we1sv2.0", "metapath": "", "pub": "collapse", "title": "2017-04-humanities-student-major_1797_collapse.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.091", "Subjectivity": "0.431", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "547", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65lrd2", "Reddit_id": "dgbrjt6", "Subreddit_id": "t5_2qhw9", "Commenter": "[deleted]", "length": "3322", "content_scrubbed": "I always think of how this entire period of the last 70-odd so years where humanitarian universalism was in vogue will be viewed by history; probably not positively.  \n\nI have noticed that almost all 'philanthropists' I've run into, besides a few cult-like but well intentioned Effective Altruists (EAs) are using it as a means to further their self image. The person going to Africa gets a neat experience, something to put on her resume, and a facebook profile picture which shows she (it[.] usually a she) cares about all God[.] children. This is a simplistic narrative though, I don't see 'virtue signalling' as comprising the majority of the reason for someone[.] actions.   \n  \nPeople will often differentiate social justice warriors focused on trivialities from people looking at 'actual injustices' with the intent of making the latter look better and the former look wretched. Honestly, the rationalist, EA type is far more dangerous than the blue-haired SJW (I am speaking in stereotypes and avoiding nuance, surely the situation is more nuanced than that, I agree with the SJWs on some things actually; for example. I think that wearing an Amerindian headress is disrespectful and is worthy of reproach to wear it at someplace trivial like a music festival etc. ). The neoliberal SJW (I differentiate between leftists and liberals) is busy trying to make sure that half of all drone strikes have a woman at the joystick, or to make sure that female CEOS make 350x more than the average worker, instead of the lowly 300x that they are used to. This is largely window dressing, it doesn't reform society in any meaningful way, in fact, its major perniciousness arises from the fact that it legitimizes the current order by rebranding exploitation and ecocide as 'empowering', 'liberating' and 'feminist'. \n  \nThe supposed rationalist is an extreme danger to the ecosystem. Try explain to one of these eggheads the value of hearing birds chirp in the morning, or hearing the creek of the pines and they will tell you that that[.] all of purely aesthetic value. And the assumption is that the aesthetic is necessarily less important than the issues causing real suffering. Why are we spending money on art galleries when there are starving children? Au contraire. Why are we spending money on starving children when we have art galleries to fund? This procrustean desire to preserve life is toxic, beauty can't survive when we strip our entire society down to the lowest common denominator in order to feed the yeast colony on petri dish Earth. And by excess I don't mean consumerist excess, which is only harmful to the spirit. Some people say it would be the greatest testament to our civilization if we were to feed the world. I think it would be a far greater testament to drown out the neverending din of human suffering beneath our symphony orchestras.  \n  \nWe need to be clear that humanitarian intervention has backlash, which turn the good intention into destruction. Free goods make the local economy crash, food aid gets seized by warlords and used to control the population; when it is distributed properly, the population booms while simultaneously undermining the region[.] ability to feed itself. Spending money on 'frivolities' like the humanities has no negative consequences, just an opportunity cost. "}