{"doc_id": "1190", "name": "2017_04_humanities_student_major_2514_lostgeneration", "namespace": "we1sv2.0", "metapath": "", "pub": "lostgeneration", "title": "2017-04-humanities-student-major_2514_lostgeneration.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "-0.022", "Subjectivity": "0.416", "Score": "19", "Upvotes": "0", "Downvotes": "0", "Wordcount": "229", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66yagf", "Reddit_id": "dgm7wl0", "Subreddit_id": "t5_2r40j", "Commenter": "nowaysalliemae", "length": "1472", "content_scrubbed": "My wife is in the same boat. Has a STEM degree, and at the time of her working through the degree, job advertisements didn't require a masters degree. The economy crashed and then all of the jobs wanted a masters. Unable to get into grad school (too competitive as many millions flooded grad programs to wait out the recession), she fell to the wayside and is still to this day unable to get a job in her field. She now has a worthless STEM degree of the same worthless value as a degree in English, history, or music. Unable to make the minimum monthly payments on student loans eventually resulted in default. \n\n \n\nThis is only going to get worse for STEM degree holders. You see, since 2008, everyone was told that if they got a degree in STEM that it would be a surefire way to obtain a very good job that would allow for a good living *and* the ability to pay off the student loans. Only a foolish person would study subjects in the liberal_arts, they said. \nUntold numbers followed the mantra (and continue to do so), and we're now beginning to see the the negative results of an oversaturation in the market. STEM field wages are declining [[1]](https://www. theatlantic. com/education/archive/2014/03/the-myth-of-the-science-and-engineering-shortage/284359/) [[2]](https://www. reddit. com/r/lostgeneration/comments/4eokbu/dont_major_in_stem_there_is_no_defecit_of_stem/), and there are more graduates being pumped out by degree mills than there are openings."}