{"doc_id": "467", "name": "2017_10_humanities_student_major_2326_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2017-10-humanities-student-major_2326_canada.txt", "pub_date": "2017-10-24T00:00:00Z", "Sentiment": "0.08", "Subjectivity": "0.216", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "236", "Permalink": "http://reddit.com/r/canada/comments/78fig2/atheists_have_rights_too/dou7ew4/", "Threadlink": "http://reddit.com/r/canada/comments/78fig2/atheists_have_rights_too", "Parent_id": "t1_dou3b39", "Reddit_id": "dou7ew4", "Subreddit_id": "t5_2qh68", "Commenter": "mollythepug", "length": "1341", "content_scrubbed": "It[.] like this... You have a choice of School Board A and School Board B.  You can send your kid to either Board.  Both have to adhere to and meet provincial standardized testing and teach the same curriculum.  Let[.] say whoever you picks gets $1000/kid.  Some of this comes from the Municipality you pay your property taxes to, and part of this comes from the province you pay income taxes and sales tax to.  School Board A puts more priority on the arts and languages, will hire anyone with a teaching degree, and doesn't give a shit about what the teachers do on their personal time.  While School Board B puts more priority into math and technology, and only hires teachers that come with a recommendation from a trusted neighborhood leader, and have shown dedication to being involved in their community.  And if that teacher ever gets into shenanigans like say;  accelerating their student loan repayment down at the local brass pole, or living with the wife and kids on school nights then shacking up with the cute yoga instructor Chad on the weekends.  Well, then they are asked to resign or take a leave until they can adjust their lifestyle into a more agreeable example for the younglings.  Wherever you send your kid, you pay the same amount of taxes.  The kicker is, you pay the same amount of taxes weather you have kids or not!"}