{"doc_id": "1199", "name": "2017_04_humanities_student_major_2578_dndnext", "namespace": "we1sv2.0", "metapath": "", "pub": "dndnext", "title": "2017-04-humanities-student-major_2578_dndnext.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.177", "Subjectivity": "0.482", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "613", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_670yj0", "Reddit_id": "dgmynxs", "Subreddit_id": "t5_2vbgl", "Commenter": "J97800", "length": "3474", "content_scrubbed": "Doing a homebrew setting is immensely rewarding! My suggestion is to start small. Start VERY small. A singular village, a singular dungeon, the immediate area, and a reason for your players to be there. Your best bet to provide long_term consistency and a base to develop your world is to work out of something you're already familiar with. One of my favorite homebrew settings is one from where I drew from good source material - it was a mythologized version of the woods near my house. I'd highly recommend basing your world off something that you know intimately, whatever that may be. \n\n\nOnce you've selected something to work off, then comes the fun part of writing. If you're worried about missing large pieces of the world, consider giving your setting an in-game reason for that information to be 'hidden' rather than missing. For example: your PCs are all refugees from a city in the underdark that has been isolated from the larger world for a thousand years, and they have been exiled/sent on a quest/forced out by a supernatural event. Or perhaps your world could be coated with a heavy fog because the barrier between the prime plane and the astral plane is slowly breaking down. Nobody except adventurers travel much into the fog, and thus nobody *truly* knows about the world at large. They could be adventurers on a boat that[.] taking them to a new continent freshly discovered, fleeing from their old life in hopes of treasure and glory.\n\n\nNow, these are some intense narrative choices. They do a few things right out the gate for your homebrew setting, though. First, they give the players something interesting to roleplay. Not only do the *players* not know anything about this setting, but neither do the *characters* they are playing. It[.] a mysterious world, and questions the players have are questions the PCs will have. That makes for a very pleasant experience. Second, it gives you a lot of leeway in designing your world. If the players are all fantasy conquistadors sailing to a new world with a grand expedition, you have plenty of opportunities to build the world around them without planning TOO far ahead. \n\n\nFinal suggestion: don't dump all the information you write on your players. A lot of the writing that you, the DM, do for this project is for your own benefit. Your players may not necessarily want to read a 10-page document on the ecology and magical theory of your world. They would like to read a quick, one-paragraph synopsis outlining the major aspects of your world as well as a list of what the races are like (if you change that) or what the options are as far as backgrounds go. Remember; you're writing for your own sake, to help your game proceed smoothly. The writing isn't for your players, it[.] for you to work from.\n\n\nBest of luck out there!\n\n\nEDIT: I'm also going to go ahead and throw out some recommendations for reading material, if you want to hear from people more versed than I in the arts of worldbuilding and game design.\n\n* *Gary Gygax[.] World Builder* by Dan Cross and Gary Gygax.\n\n* *A Magical Medieval City Guide* by Expeditious Retreat Press.\n\n* *Dungeon Master[.] Guide* by TSR or WotC. The 5e DMG has some interesting  info on building a world, but so do a lot of older books. If you get your hands on them, you can find a lot of fun info out there. The 4e DMG gets a big shout-out for being well-written and interesting to read.\n\n* *The Tome of Adventure Design* by Matthew Finch of Frog God Games.\n"}