{"doc_id": "1029", "name": "2017_04_humanities_student_major_989_askmen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskMen", "title": "2017-04-humanities-student-major_989_AskMen.txt", "pub_date": "2017-04-09T00:00:00Z", "Sentiment": "0.141", "Subjectivity": "0.322", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "402", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64f1k9", "Reddit_id": "dg1mxv8", "Subreddit_id": "t5_2s30g", "Commenter": "DEEPoSEAN_", "length": "2331", "content_scrubbed": "Get the hardest degree you can pressure yourself through, even if you go into a different field post graduation. College is literally just a stress test for real jobs, and most entry level jobs are going to teach/train you on the skills they want anyway (a good career job will, a \"paying just to bill more hours\" job won't). Showing you're capable of complex problem solving and deep understanding of complex topics is infinitely better for selling yourself to potential employers than any skill you will develop in a liberal_arts degree. If you really want to branch out, take some electives NOT LINKED TO YOUR DEGREE AT ALL. Not even for credits, if you can afford it. Just to improve your skills in the areas you're truly interested in.\n\nUse your weekends and free time to polish your arts/writing skills, these can all be self taught and there are tons of resources online for learning/understanding them in a reasonable time. The reverse is true for basic math/science skills, but you only get the \"change how you think\" and \"perceive information\" skill(s) from continually exposing yourself to difficult questions and left field situations. You don't get this from a liberal_arts focus.\n\nVirtually nothing you learn in college from either side of the BA/BS line will translate directly to real jobs. You're just collecting tools in a box for future application to whatever life throws at you. You get as much as you put into it, and the harder you push yourself now, the more return you'll get on your investment later.\n\nI wouldn't worry about your GPA too much. Just try and keep it above 2. 75 (on a 4 scale) and you'll be fine. Just don't fail half your classes every semester. If that[.] the issue, you need to go to your universities student union and ask for help/explore the options they have for either tutoring or extra help. A 2. 75 in STEM translates to more in the work force (and naturally, in compensation/benefits) than a 3. 8+ in liberal_arts. After your first job/long internship, nobody cares about your GPA. They'll only care what you can do, or what you're capable of learning to do.\n\nNot saying it[.] easy, it isn't (and shouldn't be). However, the payoff is great.\n\nJust the two-cents of someone who has 2 bachelors degrees. One in Communications (BA) and one in Electrical Engineering (BS). (Career switch)"}