{"doc_id": "529", "name": "2017_10_humanities_student_major_2953_portland", "namespace": "we1sv2.0", "metapath": "", "pub": "Portland", "title": "2017-10-humanities-student-major_2953_Portland.txt", "pub_date": "2017-10-30T00:00:00Z", "Sentiment": "0.085", "Subjectivity": "0.428", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "478", "Permalink": "http://reddit.com/r/Portland/comments/79jnl8/opinion_professors_like_me_cant_stay_silent_about/dp45bpy/", "Threadlink": "http://reddit.com/r/Portland/comments/79jnl8/opinion_professors_like_me_cant_stay_silent_about", "Parent_id": "t1_dp3xu2s", "Reddit_id": "dp45bpy", "Subreddit_id": "t5_2qi2i", "Commenter": "Jason-in-silico", "length": "2862", "content_scrubbed": "I didn't go to Reed, but I'm pretty deeply connected, in ways I don't want to say too much about here. I've been around the institution, and aware of these debates for a lot longer than the 4-6 years that typical students experience. \n\nMost of what you say is totally reasonable, and I agree with some of it. But I think you're pretty wrong about how things have worked with the Hum curriculum. There have been substantial changes to the reading list in the past decade, deliberately designed to broaden it[.] focus to non-European sources. These changes were the result of dialogue, and sincere listening to criticisms from students and alumni. There are certainly arrogant, crusty, academically-conservative faculty who would like for nothing to ever change. But there are many faculty who are committed to critical examination of the course and the required material. And there has been an active effort to do it again, over the past couple years, partly in response to RAR and related activity.\n\nThat said, it sounds like most of the gripes (yours and other folks) really come down to two major issues with the kind of institution Reed is:\n\n1. Reed is deliberately a faculty governed institution (always has been, it[.] in the founding documents...) and curricular decisions are made by faculty, according to their own bylaws. A lot of folks seem to think these decisions should be made by \"the community\", but that[.] just not how the college is governed.\n\n2. Reed is a 'traditional' liberal_arts institution, based on a somewhat-antiquated education model that emphasizes reading the Western Cannon.\n\nThere are certainly legitimate criticisms for both of these points, and I'm not really defending them. Probably the faculty should be more open to criticism and dialogue, and maybe the curriculum should be further revised (although personally, I see a lot of value in reading the same set of texts that many, many intellectuals have read for the past few thousand years...)\n\nAnyway, I'm not defending the way Reed is run, or the texts read in Hum. But I do think that every student should have known these things when they chose to attend, and I don't totally understand why they are there if they think the curriculum is terrible? Are they opposed to the idea that any education institution, anywhere emphasizes the Western cannon? \n\nAnd I certainly think the 'revolutionary' tactics they've used to disrupt education of other students are inappropriate. I'm glad to endorse radical tactics for addressing real injustices in the world. But the Hum curriculum is not a real injustice in the world. Depriving other students of the education they are seeking, and attempting to block the speech of faculty are both a lot closer to real injustices. (And again, I know you aren't supporting their tactics, not trying to argue, just explaining my thoughts on it.)"}