{"doc_id": "986", "name": "2017_04_humanities_student_major_604_the_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "The_Donald", "title": "2017-04-humanities-student-major_604_The_Donald.txt", "pub_date": "2017-04-06T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.315", "Score": "24", "Upvotes": "0", "Downvotes": "0", "Wordcount": "238", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfwwc9y", "Reddit_id": "dfx2n9h", "Subreddit_id": "t5_38unr", "Commenter": "paoisdjfpoiajspdoifj", "length": "1472", "content_scrubbed": "Working class/first generation college Asian Americans are ignored by the system. I know because I was one of them. You are penalized for being Asian, on top of being disadvantaged for not coming from a family of wealth and education. The Asians and other minorities who typically get into top schools come from families that are very highly educated and privileged. Many of them are international students who come from the richest, most elite of their countries. But that doesn't matter, because diversity! Racial quota systems mean all Asians are the same, no matter if they come from wealth and privilege, or if they come from the working class. And there is ample evidence that the elite private colleges and universities (such as Harvard) have a carefully-balanced racial quota system that deliberately limits the percentage of Asians accepted. So since it[.] already harder for you as an Asian to get in, it[.] even harder because you have to compete against Asians who have wealth and connections who know how to get their kids into the elite schools.\n\nBut fuck the elites, anyway. All they do is brainwash students into becoming conformist liberals who can't critically think for themselves and issue useless liberal_arts degrees that don't help working class students get good jobs. Liberal arts degrees are for rich kids who don't ever have to work for a living.\n\n\nTucker Carlson destroys the idea of affirmative action https://www. youtube. com/watch?v=GDbSmSIV1lc"}