{"doc_id": "448", "name": "2017_10_humanities_student_major_2151_writing", "namespace": "we1sv2.0", "metapath": "", "pub": "writing", "title": "2017-10-humanities-student-major_2151_writing.txt", "pub_date": "2017-10-22T00:00:00Z", "Sentiment": "0.163", "Subjectivity": "0.42", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "373", "Permalink": "http://reddit.com/r/writing/comments/782hjd/creative_writing_undergrad_grad_and_alumni/dor3xfb/", "Threadlink": "http://reddit.com/r/writing/comments/782hjd/creative_writing_undergrad_grad_and_alumni", "Parent_id": "t3_782hjd", "Reddit_id": "dor3xfb", "Subreddit_id": "t5_2qh2n", "Commenter": "eraev79", "length": "2030", "content_scrubbed": "Just have a Bachelor[.] in Creative Writing.\n\nLike I've seen in a few responses here, I found it to be a great experience, but not necessarily something I'd recommend to others. $40,000 of debt is honestly too high a price looking back on it. However, being surrounded by others in my field and constantly reading and writing probably sped my growth as a writer more than I could have on my own.\n\nThe curriculum is exactly what you'd expect: you read good writers, you read books about writing, you read and critique other students' work, you re-read and edit your own work. I also had to take public speaking and several humanities courses (philosophy, mostly). You write a lot of essays about things you read. You practice forms you might not otherwise have tried. \n\nI am currently working in the restaurant business, but when I initially graduated I was able to land a job as a proposal writer for healthcare, and shortly after, as the publisher[.] assistant for a magazine. Neither job worked well for me because I really dislike the day in and day out of office work (and I have some issues with authority), so I decided instead to pursue freelance editing. I'm still working out the kinks there and trying to make it work full-time, which is why I am working in a restaurant to make money for the time being.\n\nI'd still love to get my work published, but I'd prefer to do it on my own time. Once I can make enough freelance editing, I'll pursue that full-time so I have total control over my schedule. Is this something I needed a degree for? No. But I have one anyway and in general I think college is a good experience, if a poor financial choice.\n\nLong story short, you don't need a degree to be a writer. If you want one, that[.] a different story, but don't let anyone tell you college is necessary to be a writer. The only thing I'd say you need to be a writer is to be a reader. I learned more reading others' work than any professor could lecture me on. Not necessarily an absolute statement, but a good place to start."}