{"doc_id": "988", "name": "2017_04_humanities_student_major_618_artsphere", "namespace": "we1sv2.0", "metapath": "", "pub": "ArtSphere", "title": "2017-04-humanities-student-major_618_ArtSphere.txt", "pub_date": "2017-04-06T00:00:00Z", "Sentiment": "0.122", "Subjectivity": "0.323", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "911", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63r2jr", "Reddit_id": "dfx8skv", "Subreddit_id": "t5_2splh", "Commenter": "duhidiot", "length": "5985", "content_scrubbed": "I would say the exact opposite is true. I think the misunderstanding lies in a flawed assumption of what \"contemporary art\" is, by using a very narrow definition that incorporates only a specific type of theoretical, \"non visually aesthetic-centric\" production, rejecting it as \"undecipherable, too abstract, random and even rubbish,\" and mistakenly thinking that this is representative of contemporary artistic production as a whole. \n\nThere is certainly more conceptually abstract, theoretical art than there ever has been. But there[.] also more purely visually aesthetic art, or \"beautiful\" art, than there ever has been. For example, look at some of the most critically acclaimed contemporary painters, and you'll find that the idea of beauty (or, more generally, making something visually interesting) is still very much at the forefront of their work. I'm thinking of artists like [John Currin](https://www. google. com/search?q=john+currin&safe=off&espv=2&source=lnms&tbm=isch&sa=X&ved=0ahUKEwji_MCGuZDTAhVosVQKHdihBP4Q_AUIBigB&biw=1366&bih=700), [Jenny Saville](https://www. google. com/search?q=john+currin&safe=off&espv=2&source=lnms&tbm=isch&sa=X&ved=0ahUKEwji_MCGuZDTAhVosVQKHdihBP4Q_AUIBigB&biw=1366&bih=700#safe=off&tbm=isch&q=jenny+saville), and others.\n\nBut what you'll notice with these artists, as with other artists and types of art of today, is that \"beauty for beauty[.] sake\" (an idea that had perhaps its most potent expression in the now often maligned art of French Rococo) is not their sole aim. Modernism, and later Post-Modernism, encouraged artists to ask questions about the nature of art itself, what it could accomplish, how it relates to the viewer, what even qualifies as \"art\" to begin with. \n\nLooking back to the earliest days of Modernism, which many consider to have arisen along with European Impressionism (but I would actually date much earlier, perhaps as far back as Goya or Blake or Turner), there were many in the general public that thought this new, questioning form of aesthetics was not art at all! It was too theoretical, too dense and impenetrable. They \"didn't get it.\" Even types of art that we consider commonplace today, such as Abstract Expressionism, were called \"non-art\" before they were later accepted and even championed by the wider public. \n\nAnd so you have a continuum, with pure aesthetics (\"beauty for beauty sake\") on one side, and pure theory (or conceptual abstraction) on the other. I'd say one of the defining characteristics of \"this artistic era,\" as you call it, is that you have more artists at every point on this line -- both in the center, and perhaps more noticeably, at the extremes. \n\nIt[.] important to note, however, that what one might call \"extreme theoretical\" art has existed for quite some time at this point. Marcel Duchamp[.] [\"Fountain\"](https://en. wikipedia. org/wiki/Fountain_(Duchamp)), which was at the time of its creation rejected by a committee of extremely avante gard artists, has since been called the single most important piece of 20th Century art, because it pushed the definition of what art could be, and emboldened literally every generation of artist that followed. \n\nI think the most glaring rebuttal of your theory, though, is video. Video is without a doubt the most ubiquitous and widely consumed contemporary art form that exists today, and the vast majority of it is specifically made to be understood by the broadest possible audience. Video, just as art generally, exists on the theoretical<---aesthetic spectrum. I don't think anyone would deny that the abstract, confusing \"video art\" you see in soe galleries is in fact \"real\" art. But I think it[.] important to note that film and television are equally valid art forms. \n\nNow, you may be saying, \"but a movie isn't (capital-A) Art!\" But not so fast.  If you look back at the history of art, you can see that it does not differ materially in its function from films of today. Think of religious art in Renaissance cathedrals, for example: it[.] visual, narrative art, meant to tell a story and often acts as a call to action. Whereas a major function of art back then was to encourage piety or increase donations to the church, today film increases commercial sales, motivates political groups, or just sells tickets for the viewing of itself. And this is a type of art that is consumed in some form every day by almost every person on the planet. \n\nSo when you say \"contemporary art is undeniably elitist,\" you're actually just referring to a very small, very limited sub-group of theoretical, conceptually abstract contemporary art. Moreover, if you choose to use the term \"contemporary art\" to refer just to this specific, intrinsically less accessible type of art, and you ask if (your definition of) \"contemporary art\" is less accessible to common people, then you're essentially just asking if a tautology is a tautology. If I choose to define \"contemporary art\" as only photo-realistic paintings of beautiful women, then ask if people think (my definition of) \"contemporary art\" is too focused on photo-realistic paintings of beautiful women, then of course the answer is yes!\n\nPerhaps it[.] different because I work in the arts, but I see the vast majority of contemporary art as easily accessible. I see whole families with small children and people from every walk of life in contemporary galleries and museums every day! They tend to like the more easily digestible \"aesthetic art\", whereas I personally like something a little more theoretical that challenges me to think about the meaning of the work -- which is why, as contemporary art does, it[.] so important to have art on every point on the spectrum. \n\nIncidentally, if you want to read an interesting analysis of how we found ourselves with the type of art you characterized as \"contemporary (i. e., conceptually abstract and theoretical),\" check out John Berger[.] \"Ways of Seeing\".\n"}