{"doc_id": "931", "name": "2017_04_humanities_student_major_150_edmonton", "namespace": "we1sv2.0", "metapath": "", "pub": "Edmonton", "title": "2017-04-humanities-student-major_150_Edmonton.txt", "pub_date": "2017-04-02T00:00:00Z", "Sentiment": "0.188", "Subjectivity": "0.331", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "323", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63065d", "Reddit_id": "dfqewx6", "Subreddit_id": "t5_2raht", "Commenter": "Blackagenda", "length": "1756", "content_scrubbed": "I have seen some great success come out of EDAC and some tremendous talent. (I work with three alumni.) All three are working in there desired field after going to EDAC. It[.] definitely not my cup of tea but they all flourished there. If you feel it[.] right for you go for it. \n\nAs for NAIT? I disagree. Depending on your program of choice the design/drafting programs are subpar to Grant MacEwan and the university of Alberta. But I think it depends on what your end goal is. \n\nDon't get me wrong, NAIT has some incredible programs, but when it comes to what they teach and how, professionals in the business kind of overlook NAIT students due to how they are taught. (Im talking specifically in anything with arts/drafting) no one learns how to use traditional media and only use digital. You may have one class requiring you to learn the traditional way and then move on. Once again I did not attend but being in the arts field this is something that is discussed quite a bit. \n\nNow Grant Mac and The UofA are going to more traditional and academic. Lots of life drawing, still lives, and learning process and traditional skills before even touching your own art practise. If that works for you, great! I could talk in lengths about both of these programs and if you want more info let me know! I didn't attend either of them but this was the route I went. I choose my school on what I was looking for and went for it. \n\nEDAC may be a for profit school but how they teach and what they teach is very relevant to there field. They give you a well rounded spectrum of skills touching on traditional and digital. If your feeling unsure maybe set up a meeting with them? I'd do the same with NAIT, the University and MacEwan.\n\nGood luck on your endeavours! "}