{"doc_id": "1092", "name": "2017_04_humanities_student_major_1720_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_1720_AskReddit.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.063", "Subjectivity": "0.323", "Score": "331", "Upvotes": "0", "Downvotes": "0", "Wordcount": "860", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65gb8m", "Reddit_id": "dgal3nh", "Subreddit_id": "t5_2qh1i", "Commenter": "doc10house", "length": "4910", "content_scrubbed": "I told my mom through tears. Woke her up; she was sleeping on the couch because Dad had been snoring so loudly. She woke him. My parents, the realists, said this would destroy me, in the sense that I would be committing professional suicide. Crippling my potential. That the only sensible choice was an abortion, obviously, so I could continue my liberal_arts education and \"become someone.\"  They weren't angry, just disappointed that I'd been so irresponsible, and concerned about my future. They were parents. That was their job. Hers, the starry-eyed small-town Baptists, neither of whom had progressed beyond high school, countered that the only reasonable option was to drop out of school (I'd had a year of college at that point), take on two or three jobs, and get married, obviously, since it was the Will of God or some such.  The four of them had a Parental Summit at my kitchen table, while I was in my room upstairs listening in and reporting to my future baby mama on the phone, as they had left her home. Presumably so we wouldn't get into any more Trouble together. ;) The summit ended in a stalemate, her mother yelling that as long as we put God first, everything would be fine. Mine rolling her eyes and responding sternly with her take on just how ridiculous she thought that was. \n\nUltimately it became clear that she was going to choose to remain pregnant with or without my involvement, so I jumped in. We got married precisely a month before I turned 19, and our son was born 7 months hence. We were beyond broke but I had parents who were not only loving and supportive but who also, thankfully, had the wherewithal to keep us from starving. She worked at a walk-in haircut place and then at Burger King. I studied at night while working a campus security booth.  Good friends helped us with transportation to the grocery store. I drank a lot of really cheap beer. \n\nI doubled down on my education. Fatherhood gave me direction and purpose. Study for study[.] sake had seemed like mental masturbation; study so that I might be equipped to provide for a tiny person for whose well being I was entirely responsible made it real.  I had previously held no career aspiration, until my aforementioned transformative experience with hospitalization and childbirth (I vividly remember the day of the C-section, seeing the reflection of my young wife[.] crimson innards in the surgeon[.] glasses while he casually discussed LSU basketball head coach Dale Brown having angrily struck an official in that day[.] NCAA game). Combine that with an urge to choose the most difficult vocational path I could think of to playfully spite my father (with whom I was close and friendly but who was certain the decision to continue a pregnancy was the End of me. It was sort of a \"you think I'm fucked because I decided to keep this baby?  Hold my beer and watch this\" thing). All of this culminated in a decision to pursue medicine. \n\nI finished college in 3. 5 years, as opposed to the usual 4, by taking extra courses and some over summers, while working. She put her education on hold after a lengthy discussion of which of us would continue on. Was accepted to medical school. Graduated.  Opted to specialize in Obstetrics and Gynecology. Was accepted into a four year residency program and graduated, with accolades. Performed countless C-sections myself... such is the circle of life. Decided to have a second child... on purpose this time, just to see what that was like. \n\nWorked. A lot. Came home and focused on my kids. A lot. Sacrificed plenty to assure they were shielded from our squalor and could just be kids. Like all parents do. Had successes. Had huge failures. Made many mistakes, personally and professionally. Like all adults do. And so on. \n\nWe stayed together probably longer than we should have, \"for the kids,\" who of course always know there[.] a problem despite one[.] best efforts to project an air of happiness and calm. We had an EXTREMELY amicable divorce in 2012 after 21 years of marriage, and the boys (20 and 13 at the time) took the news as well as anyone could have. She still lives locally and we coexist well and communicate easily, and our sons are 25 and 18 and are happy, well-adjusted, excellent, intelligent, witty, brilliant, fully realized individuals. One is engaged and living with his fiancee as an entirely functional adult (who decided college wasn't for him and is alternating time between shift work and playing bass in a metal band) and the other, who still lives with me, is preparing to graduate and head to college locally himself. I am not yet to my knowledge a grandparent, as my eldest prefers the company of cats to small humans. I do not believe him to be entirely in the wrong in that regard.  I've been a damned good dad and I don't regret for a moment the decision to go ahead and become one. \n\nTL;DR: It was good. \n\nEdit: fixed typos and grammar. "}