{"doc_id": "970", "name": "2017_04_humanities_student_major_512_exalted", "namespace": "we1sv2.0", "metapath": "", "pub": "exalted", "title": "2017-04-humanities-student-major_512_exalted.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.075", "Subjectivity": "0.418", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "765", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63nh0u", "Reddit_id": "dfvohei", "Subreddit_id": "t5_2sgtt", "Commenter": "brofistr", "length": "4644", "content_scrubbed": "wasn't it some emo nonsense like suffering loss and then dwelling on the futility of existence?\n(why bother? sorcery is better. the black naidar whatever was pointless.  \"hey lets go on a quest and risk dooming the world for something vastly shittier than we already have!\" and while we're at it, the underworld doesn't suck enough, lets fuck with the sleeping embodiments of endless pain and bad poetry, liven up their nightmares a bit so they'll leak. why? because fuck ghosts    \n (don't feel bad little necromancer, I don't think necromancy would have sucked half as much as it did if it weren't associated with abyssals. if we only had solar necromancers it'd have been somehow made suitably awesome. but it[.] abyssal[.] magic with the top tier closed to solars(and only solars can have nice things) so it had to suck like abyssals.\n same reason the animal rules aren't even *half* assed. what[.] the quote? \"only one splat even interacts with those anyway\"?);)   \n... kidding,   but I do actually think the trial was something like that.    \n\n\nedit- looked it up instead of guessing\nTrials of the Void.   \nThe first trial is that of melancholy. In many ways,\nthe Underworld is the nadir of all existence. No natural\ninhabitant of the place has true life—a ghost[.] experiences\nare dulled immeasurably from what he knew\nin Creation, and even his tools and pets are no more\nthan shadows of what was buried with him. Likewise,\nghosts aren't truly dead as long as they resist the call\nof reincarnation or Oblivion. Inhabitants of the Underworld\nare truly the most unnatural and unwanted of\nall things. In a study of melancholy, the necromancer\nmust experience true rock bottom. To have nothing left\nbut to continue to live, living almost without purpose,\nshows the necromancer how little really separates the\nliving dead from those living without cause.   \nThe second trial is memory. To learn the arts of\nthe dead, the necromancer must learn as the people of\nthe Underworld do. Just as the sunless realms change\nonly slowly, shaping themselves to the memories of\nthose who dwell there, the necromancer must engage\nin self-instruction. He must learn something by exploring\nhis own memories of experiences past, discovering\nnew meaning in old knowledge. When a necromancer\nhas a guide through his initiation, he sometimes passes\nthis trial by mystically exploring another[.] mind and\nmemories rather than his own.   \nThe third trial is stasis. The Underworld resists\nchange. For most places in the Underworld, one can\nreturn year after year after year and see no difference\nin the landscape or inhabitants. A necromancer must\nunderstand this intimately. Those consciously trying\nto pass the trial often choose a featureless plain in\nthe Underworld, where they sit and remain until enlightenment\ncomes. Others draw this experience from\nmemory of living in the same unchanging village for\nyears in childhood, or the stasis of marching for months\non end through a land that never appears to change.   \nThe fourth trial is infl iction. Death comes to all\nthings in time, as the Primordial War proved. And\nwith the Underworld[.] inception, death became something\nmore frightening than guaranteed reincarnation\nand continuance. Now, one may languish as a ghost\nfor centuries or even fall into the forever depths of\nOblivion. People fear death, now. In some manner, the\nnecromancer must infl ict total and complete, gibbering,\nturn-guts-to-water fear of death upon someone else. A\nstudent might slowly kill a beloved pet before the eyes\nof its young master, while another could murder an\nentire village and leave only one alive with a promise\nto return for her. Less hideously, an eloquent or passionate\nspeech can leave listeners as mind-bendingly\nfearful as such awful demonstrations.   \nThe fi fth trial is decay. It shares a great deal with the\nfi fth sorcerous ordeal, of sacrifi ce, but the necromancer\nmust sacrifi ce through degradation. This loss sharpens\nthe necromancer[.] mind, opening it fi nally to the black\nwonders of necromancy. Sacrifi ce can be of anything,\nbut the manner must be appropriate. Rather than cutting\noff a fi nger, the necromancer ties it off and lets it\nblacken and die from lack of blood. Instead of severing\nties with a lover, the necromancer slowly poisons his\nrelationship with lies or neglect, and its death is all the\nmore painful for it. One might decimate his excellent\nreputation through repeated demonstrations of fallibility\nor vice. Regardless, the sacrifi ce must be done through\ndeterioration for the necromancer to truly understand\nthe slow rot that eats away all Creation.\n\n^(source:bos2: white and black)\n\n"}