{"doc_id": "478", "name": "2017_10_humanities_student_major_2483_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2017-10-humanities-student-major_2483_changemyview.txt", "pub_date": "2017-10-25T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.306", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "239", "Permalink": "http://reddit.com/r/changemyview/comments/78pkoj/cmv_not_everyone_should_go_to_college/dovvx4k/", "Threadlink": "http://reddit.com/r/changemyview/comments/78pkoj/cmv_not_everyone_should_go_to_college", "Parent_id": "t3_78pkoj", "Reddit_id": "dovvx4k", "Subreddit_id": "t5_2w2s8", "Commenter": "Positron311", "length": "1287", "content_scrubbed": "Although I largely agree with your view, you did not state a few facts:\n\n1. College degrees are having an increasingly smaller influence on whether or not you get a job.\n2. Trade work is not encouraged and work is pretty high in demand. Depending on what you do, you can make quite a decent bit of money as a plumber or an electrician.\n3. College, in very few cases, can actually severely limit one[.] own potential. Take Bill Gates as an example. He dropped right out of Harvard, a very elite university to work on his idea, and look at him now. \n\nEven if you do manage to stick it out and get a degree, there is no guarantee that it will get you a job. I'm not just talking about liberal_arts majors, but some STEM degrees as well. There are some jobs where a bachelors degree just won't cut it, and that means more money and time to get where you want to be.\n\nThe STEM degree part is debatable. Banks hire a decent bit of physics majors (idk why, but they do). \n\nHowever, as a devil[.] advocate point, college does provide a chance for people to not only delve into their interests from a more professional perspective, but also open their mind to new ideas. Obviously, this can be something done outside the classroom, but a college provides a more productive environment in this case."}