{"doc_id": "480", "name": "2017_10_humanities_student_major_2509_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_2509_AskReddit.txt", "pub_date": "2017-10-25T00:00:00Z", "Sentiment": "0.059", "Subjectivity": "0.443", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "387", "Permalink": "http://reddit.com/r/AskReddit/comments/78qifg/how_would_you_feel_about_having_a_mandatory_class/dowbcnh/", "Threadlink": "http://reddit.com/r/AskReddit/comments/78qifg/how_would_you_feel_about_having_a_mandatory_class", "Parent_id": "t1_dow749t", "Reddit_id": "dowbcnh", "Subreddit_id": "t5_2qh1i", "Commenter": "listlessthe", "length": "2008", "content_scrubbed": "Who[.] mad? I didn't take out 100k in student loans. I got academic scholarships and have very little debt. Same with my friends who were in mostly the same boat. We're all gainfully employed in non-customer service positions as well (teaching pays the bills). I've starting investing a little and I've got a tiny IRA. I might go to grad school in like 5 years, but right now, like I said, I'm doing well as a performer and I'm not ready to give it up. \n\n25k isn't a lot; you're right. But I do get to travel and perform and I don't have to live a 9 to 5 lifestyle. My earning potential isn't capped off at 25k. I'm decently young. I could have taken a promotion at one of my jobs, which would have earned me a decent bit more money, but it would have really tied me down in terms of time and geography and logistics. \n\nI made this comment to point out that it[.] ridiculous that you should feel like a loser because some person on reddit thinks you're a failure if you make less than 60k a year at 27. There[.] this weird strawman that a lot of STEM types have built up of the arts major who works at starbucks and fails to pay back hundreds of thousands in student loans. It[.] like y'all think we're just sobbing into our aprons about how it[.] unfair that we don't make 80k a year (our aprons? I don't even own one). That[.] just not the case a lot of times. All of my friends also teach and perform and are able to support themselves off of that. Plenty of artists went to sensible in-state schools and don't have much debt. There are plenty of jobs for artists, and yeah we may not be making hundreds of thousands, but working a butt-in-seat 9-5 job sounds like an apathetic nightmare to me right now. A lot of people on reddit have a definition of success that they don't realize doesn't apply to everyone. I love money, sure, but I'm happy with my 5 year old laptop and my small apartment and the fact that I get to be onstage and that I get to move around all day and get that adrenaline rush on the reg. "}