{"doc_id": "273", "name": "2017_10_humanities_student_major_373_conspiracy", "namespace": "we1sv2.0", "metapath": "", "pub": "conspiracy", "title": "2017-10-humanities-student-major_373_conspiracy.txt", "pub_date": "2017-10-05T00:00:00Z", "Sentiment": "-0.012", "Subjectivity": "0.361", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "560", "Permalink": "http://reddit.com/r/conspiracy/comments/74e53v/eric_paddocks_tshirt_connects_him_to_a_crisis/dny2y3e/", "Threadlink": "http://reddit.com/r/conspiracy/comments/74e53v/eric_paddocks_tshirt_connects_him_to_a_crisis", "Parent_id": "t1_dny0ppr", "Reddit_id": "dny2y3e", "Subreddit_id": "t5_2qh4r", "Commenter": "dollrighty", "length": "3175", "content_scrubbed": "Let me explain something to you *very* carefully.  Those lists of most powerful people?  They're bullshit articles put together by editorial boards of a magazine.  They are chosen based on the opinion of the people at said magazine and are judged based on the impact they make in their community.  This is not some scientifically decided fact that they are incredibly powerful and thus able to control the government to do sadistic shit like massacre innocent people at a concert.\n\n**So your talking point that she happens to be one of the most powerful people in Orlando is just weak and idiotic.**\n\nSecond.  Why is she a senior member of the board at a Theater Arts Center.  She is also a board member of the Orlando Science Center... gasp!!!  She like many people clearly supports the arts and science.  Her, being in an influential position within Orlando, has opted to join the board of directors of both entities.  Hardly a crazy ass thing to do.  I work for a renewable energy company and we have senior people here who are also board members of public entities separate from the company as well.  It is not a uncommon thing.  People with the means to make an impact and the desire to do so tend to branch out.\n\n**Her being a board member of both is not a crazy thing.  In fact, it is common.  Mark Cuban is on the board of many other companies and entities as well.**\n\nWhy would she \"Just so happend\" to manage the crisis at Pulse?  Well, she is fucking based out of Orlando and she has been recognized as one of the best crisis management people in the city of Orlando.  Not a hard assumption that after a mass casualty even involving LGBT people they would go to the best person for the job.  WHAT A SHOCKER!\n\n**She was the crisis management for Pulse, because she is based in Orlando and so is pulse.  Also--she is fucking awesome at her job.**\n\nSo why would Eric Paddock be wearing a cfcarts. com shirt?  Well, he is from Orlando too. There are 277k people in Orlando.  Central Florida Communty Arts is not a theater company.  They are an arts company.  They do choir,theator, orchestra, children & youth events, they're a school of performing arts and other things as well.  All this is readily available if you google and look for even 30 seconds. \n\nWhy would he be wearing their shirt?  He might play the fucking tuba.  He might have played peter pan once.  He may be a mentor to kids there.  Who the fuck knows.  But you AUTOMATICALLY assume he is some expert actor skilled in the arts of deception which is idiotic on your part. \n\nThe problem with you and the rest of the idiots that believe this particular conspiracy theory is that you are taking extremely flimsy--treating is as it is irrefutable fact with Sara Brady.  Then taking was is a not even unlikely coincidence that he is wearing a shirt for something she is a part of.  Acting like it is some major revelation--its not.  Then putting the two together.  Tacking on pulse as a justification/validation despite her being involved with pulse making total fucking sense.  And then tossing them all together and acting like it is some grand conspiracy.  It is laughably stupid and laughably weak.\n\n"}