{"doc_id": "1178", "name": "2017_04_humanities_student_major_2430_brownu", "namespace": "we1sv2.0", "metapath": "", "pub": "BrownU", "title": "2017-04-humanities-student-major_2430_BrownU.txt", "pub_date": "2017-04-21T00:00:00Z", "Sentiment": "0.111", "Subjectivity": "0.431", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "657", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66teds", "Reddit_id": "dglblz2", "Subreddit_id": "t5_2sbc1", "Commenter": "brownthrowaway222", "length": "3608", "content_scrubbed": "Wow, there[.] a lot here. First of all I'm happy you had a good time at ADOCH and are giving Brown consideration. Congrats! \nI've given tours of Brown in the past and have gotten the Columbia vs. Brown question in the past. I've always thought of the two as the most different of the Ivies, yet many people end up in your situation every year. Obviously I don't know anything more than what you wrote here so I can't tell you where to go, but here are my thoughts:\n\n1.) Yik Yak is a dumpster fire and you shouldn't base this decision on the shit people post anonymously there. I know people from my high school who love Columbia, have made great friends there, and have embraced life there, so I think it[.] best to just ignore the dumb \"jokes\" and comments people make about prefrosh (side note: I've heard a couple here and there at Brown too).\n\n2.) One thing I didn't see you mention is size and student body composition, specifically undergrad/grad ratio. A quick google search gave me Columbia: (6k ugrad):(20k grad) students. Meanwhile, Brown: (6. 5k ugrad):(3k grad) students. This is a substantial difference, and to sum it up, Brown is primarily an undergraduate focused institution. The thing we say on the tours is \"We have the size and feel a liberal_arts college, but have the resources of a larger university\". I can't 100% confirm the resources part, but you will definitely get close attention from Professors, so long as you make a little bit of effort to seek it out (e. g. go to office hours once or twice). I have a sense that some of \"bureaucracy\" you described at Columbia stems from the fact that there[.] just a lot of grad students there, and grad school is really more like a job than college.\n\n3.) People in all Ivies (and all colleges I'd imagine) talk and \"humble brag\" about jobs and internships. At Brown our grading system (A/B/C/NC and you can take any course Pass/Fail) is great at reducing competition. I can speak personally that impostor syndrome does exist here, I've had to deal with it myself, but I've found that the people I've made friends with in and out of my classes have always been willing to lend a hand, and haven't looked down on me for asking a question (i'm in physics btw). \n\n4.) Providence, specifically East Providence where Brown is, is great, but it[.] no New_York, so it[.] very hard to draw comparisons. I'll say that it[.] certainly easy to get a job in New_York after Brown, if living there is a thing you want to do, but it[.] more likely you won't make your way to RI if you start out in NYC. Food for thought.\n\n5.) You got the_right advice in that Brown Applied Math is stronger and has better teaching in general than Pure maths. But again, if you're not dead set on pure math, then having the APMA department right there (and a pretty great CS department too) is nice. Columbia math I'm sure is fabulous though, so I'd say you can't go wrong. If you wanna do undergrad math research, I know there are opportunities for you to get involved in that here.\n\n6.) You were able to write out in several paragraphs why you liked Brown and ADOCH. Ignoring the girl, you've put in enough thought to justify your decision one way or another. You're right in that you shouldn't put significant weight on the speciifc friends you make at ADOCH, but if you think Brown and the atmosphere here helped make it easier for you to make those connections, that[.] something to consider.\n\nGotta run unfortunately. You can PM me too if you have any questions. Hope this was helpful and that you let me/us know one way or the other. You do have two great options here. Best!"}