{"doc_id": "1249", "name": "2017_04_humanities_student_major_3117_askmen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskMen", "title": "2017-04-humanities-student-major_3117_AskMen.txt", "pub_date": "2017-04-27T00:00:00Z", "Sentiment": "0.216", "Subjectivity": "0.459", "Score": "25", "Upvotes": "0", "Downvotes": "0", "Wordcount": "316", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67z8zy", "Reddit_id": "dgugeng", "Subreddit_id": "t5_2s30g", "Commenter": "Trilldungsroman", "length": "1823", "content_scrubbed": "I'm not an older man, but I'd like to chime in to this question anyway. I feel two things are massive perennial issues at work: a *lack* of self-identity and the rise of social media.\n\nAs a 20 year old student I'm exposed to many different people in University who want different thing out of life. However, a lot of these men are dissatisfied. A lot of degrees such as sociology, gender studies and liberal_arts aren't necessarily conducive with what these people want. They find themselves in mental potholes about what they want out of their future in five years time, which is incredibly saddening to see - they pick these degrees to just 'get by' (with the exceptional impassioned desire to study, which in part solves my issue of identity). Moreover, as descendents of the baby-boomer generation, I feel a lot of people my age have 'had it easy' in comparison to generations past. The lack of exposure to adversity like many older men that peruse this subreddit makes for a significant lack of character, which in turn becomes an internalised sense of dread and isolation. Many men, however recognise this - weightlifting and other recreational activities supplement and improve their character.\n\nAdditionally, the rise of social media has arguably been one of the most damning devices of this generation. It[.] as if the world has become exceptionally small with how accessible the lives of others are, in the short space of time to do so. It makes for resentment, and longing to be like these successful men doing well for themselves on forums like Facebook and Twitter. I didn't grow up with much, but one thing I'm glad I've learnt is not to compare to anybody but myself. The sooner men of this generation learns this principle, as well as appreciation of a sense of purpose, the better off I believe they'll be. "}