{"doc_id": "230", "name": "2017_10_humanities_student_major_45_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_45_AskReddit.txt", "pub_date": "2017-10-01T00:00:00Z", "Sentiment": "0.069", "Subjectivity": "0.429", "Score": "24", "Upvotes": "0", "Downvotes": "0", "Wordcount": "686", "Permalink": "http://reddit.com/r/AskReddit/comments/73leh7/what_are_we_not_in_the_golden_age_of/dnrlle1/", "Threadlink": "http://reddit.com/r/AskReddit/comments/73leh7/what_are_we_not_in_the_golden_age_of", "Parent_id": "t1_dnra47r", "Reddit_id": "dnrlle1", "Subreddit_id": "t5_2qh1i", "Commenter": "rooftop_jenkem_farm", "length": "4221", "content_scrubbed": "first off: it[.] astonishing that you don't mention the PhD market, given that graduate schools in just about every field have been consistently overproducing PhDs for years and it[.] recently reached the point where even garbage adjunct positions in rural south dakota get 200-250 applicants, most of whom are exceptionally well-qualified.\n\nbut moreover:\n\none of the strangest things about \"academia\" as a subject is the way that people, even those within the system, talk about it as if it[.] a trans-disciplinary shared experience. it[.] not. i have no idea why we stick with the term \"academia\" when someone getting their MA in decolonial indigenous studies, someone working as a researcher in a pure mathematics lab, and a business school professor are all obviously doing very, very different things (in life as in study), yet we identify all of these people as participants in \"academia\" and surmise that they have meaningfully similar experiences.\n\nyou can see this sort of break down in what you're saying, even.\n\npublish or perish\n\nthis is more important for STEM or \"social science\" based fields than it is for the humanities, although for many of those (e. g. history, my field) you do obviously need to publish or somehow generate publication lines for your CV. that being said, teaching-focused SLACs don't necessarily value publication history in the same way that an R1 might, regardless of your discipline. \n\nlike yeah if your goal is to be some kind of full professor at a state research institution you will need to publish a shit ton of stuff all the time, constantly, but i encourage you to look at the CVs of junior faculty at any tiny liberal_arts school and think on this some more.\n\ndwindling research funding\n\nthis is, again, one of those things that[.] real but informs different \"academic\" experiences differently. for people in, say, an english department, the primary funding you need for research would be anything required to access your archive of choice and compensation for time spent on said research (like, if you need to take a sabbatical or something). they, by nature, do not need to get grants and funding for intensive studies or stuff like that because that[.] not generally necessary for research within the discipline.\n\nobviously cuts to NEH, etc. threaten the way research is funded, even for humanities types, but the degree to which this would impede legitimate research is not evenly effected across \"academia\"\n\ngrade inflation\n\napart from a few outlier institutions that do this out of some kind of misguided idea of prestige (note: i am also in an ivy league school and they do not all do this), inflation is not a policy but rather a product of individual professors. what school is gonna tell their instructors \"you guys need to fail more students\"? who benefits from that?\n\nPC bullshit\n\nhere are two things that are true:\n\n1. there are absolutely shared beliefs and mores (which are ideological!) within disciplines\n\n2. the idea that (in particular) the upper echelons of the humanities operate as some kind of real life form of tumblr is a right-wing fiction\n\nas a history phd student it is astonishing how much political disagreement happens within the discipline. you have old-school materialists who absolutely hate stuff you might perceive as \"contemporary PC culture,\" you have people whose methods are 100% informed by critical race theory who regard any other methods as racist, you have people from very influential programs who are straight-up conservative and say so openly (see [this](https://en. wikipedia. org/wiki/National_Association_of_Scholars)). it[.] really strange to me that people have this idea of \"academia\" as a hugbox where people go to have their otherkin identities affirmed or something--being a professor is pretty much the only job where you are encouraged to describe your colleagues as idiots\n\nadminstrative bloat\n\nokay, this one[.] real, and it affects pretty much every university\n\nbut what i'm trying to get at is this: \"academia\" cannot ever be a monolithic entity and i generally regard most attempts to treat it as such as a tendentious move designed to paint \"professional scholarship\" as an irrational and purely ideological enterprise."}