{"doc_id": "479", "name": "2017_10_humanities_student_major_2489_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_2489_AskReddit.txt", "pub_date": "2017-10-25T00:00:00Z", "Sentiment": "0.123", "Subjectivity": "0.36", "Score": "28", "Upvotes": "0", "Downvotes": "0", "Wordcount": "639", "Permalink": "http://reddit.com/r/AskReddit/comments/78mpfx/students_and_professors_of_reddit_what_moment/dow0f8i/", "Threadlink": "http://reddit.com/r/AskReddit/comments/78mpfx/students_and_professors_of_reddit_what_moment", "Parent_id": "t1_dovofbm", "Reddit_id": "dow0f8i", "Subreddit_id": "t5_2qh1i", "Commenter": "Midwestern_Childhood", "length": "3851", "content_scrubbed": "Professors at Research 1 universities (Ivy Leagues, Stanford, flagship state universities like University of Michigan in Ann Arbor, etc.) may have a 2-2 load (2 courses per term). They're also generally required to produce a lot of research (books in the humanities, grants in the sciences to fund research--and pay for graduate student and undergrad research fellows, etc.) and supervise graduate students. Most of them are doing a lot more work than the 2-2 teaching load suggests. (Sure, many of you can cite exceptions, but most of them are working hard, and if they aren't tenured they're working *really* hard.) So many of the big schools rely on on graduate student teaching assistants and/or large class sizes to manage the student load. (Source: I went to this kind of school for grad school.)  \n\nSchools with less prestigious programs but that still have master[.] level programs (or even lower-ranked PhD programs) will have a higher teaching load (2-3 or 3-3 usually); faculty manage some graduate students, perhaps, and still have high research responsibilities. \n\nFaculty at primarily teaching colleges and universities have higher teaching loads (3-4 or more likely 4-4); given the shrinking number of jobs for PhDs, these schools can these days often demand more research pre-tenure than they once did, so the faculty are working pretty hard.\n\nCommunity college professors, if they're fortunate to have a full-time job, usually teach 5-5 loads. They don't generally have the research demands that four-year schools do; on the other hand, it used to be possible to get a full-time community college position with just a master[.] degree but now there are so many PhDs without jobs that community colleges in urban areas can be picky and hire PhDs for the (relatively) few full-time positions they have.\n\nGenerally the service load (advising, committee work, etc.) increases as you move down this scale too. \n\nThe increase in demand for services for students (more $ needed for academic success centers, counseling services, etc.) plus increased technology needs (in classrooms, for faculty, etc.) plus shrinking amounts of money provided by states for schools in state systems means schools need to do more with less. (A lot of people in college today don't realize that the state subsidized a much higher percentage of their parents' public university degrees. These days tuition is treated more like a user tax than a state investment in the work force.) So universities use part-time faculty so that they don't have to pay them as much or pay benefits, to cut their own costs. Classic labor exploitation. \n\nGrad students do the jobs in bigger schools; smaller schools rely on adjunct faculty. Adjunct faculty may have PhDs, or they may have stopped with the master[.] degree. \n\nSome states cap the number of classes that adjunct faculty can teach for a school, so that they don't have to pay benefits. Because if a full time faculty member is teaching three classes, and an adjunct faculty member is teaching three classes, that would make the teaching load the same, so the latter should get benefits--except the state budget can't handle that so that[.] why they create the cap.\n\nSo adjuncts trying to make ends meet then have to drive to classes in several different schools to earn enough money to live on. I knew one who was teaching 10 classes in 4 different schools. I doubt her students got very good teaching from her--there aren't enough hours in a day or a week to manage that.\n\nSo that[.] how the system worked--more information than you wanted, I'm sure, but it[.] a complicated system. It[.] also horrendously exploitative of adjunct faculty, many of whom make little more than adjuncts did back in the 1970s. $500 per credit hour was standard then, and it wasn't bad money; $600 per credit hour in 2017 is nearly slave labor."}