{"doc_id": "368", "name": "2017_10_humanities_student_major_1314_frugal", "namespace": "we1sv2.0", "metapath": "", "pub": "Frugal", "title": "2017-10-humanities-student-major_1314_Frugal.txt", "pub_date": "2017-10-14T00:00:00Z", "Sentiment": "0.021", "Subjectivity": "0.281", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "253", "Permalink": "http://reddit.com/r/Frugal/comments/768qja/an_anarchist_is_teaching_patients_to_make_their/docxy33/", "Threadlink": "http://reddit.com/r/Frugal/comments/768qja/an_anarchist_is_teaching_patients_to_make_their", "Parent_id": "t1_docx4dk", "Reddit_id": "docxy33", "Subreddit_id": "t5_2qhbe", "Commenter": "jlking3", "length": "1323", "content_scrubbed": "Seriously, if it were not for that one student in Key West who let me sleep on their sofa in exchange for lessons, I would probably not be here. That one act of kindness and support when I needed it the most enabled me to get back on my feet.\n\n16 years earlier, I was on top of the world. I had a teaching studio of 75 students at Mars Music, I was working for Warner Bros. Publications as a sheet music editor, and earning close to $60k/year. Then Mars declared bankruptcy. I went on my own, but I'm not a good marketer, and having a music store advocate and advertise for me (and handle the schedule and payments) is worth it to me. On my own, I saw my student base dwindle down to 5 over the course of a few years.\n\nWarner Bros. Publications got sold to Alfred and while I was eager to move to Van Nuys, CA, they chose to let me go. I worked for a year at FJH Music as a sheet music editor, but was released about the same time that Randall and Nancy Faber left FJH to be distributed by Hal Leonard. I found the adjunct college position after my attempt to have a soapmaking business failed. (And that[.] about when my story above begins.) The college is primarily a marine science school, but they are required to teach courses in the Humanities, and that[.] where I fit in there, teaching Music History and Appreciation."}