{"doc_id": "1183", "name": "2017_04_humanities_student_major_2459_entp", "namespace": "we1sv2.0", "metapath": "", "pub": "entp", "title": "2017-04-humanities-student-major_2459_entp.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "-0.02", "Subjectivity": "0.31", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "481", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgkzyko", "Reddit_id": "dgll3eh", "Subreddit_id": "t5_2qoy3", "Commenter": "lightfive", "length": "3024", "content_scrubbed": " humanities are rather useless\n\nDegrees in history or literature won't score you jobs as easily as a degree in compsci or engineering. If you meant that by useless, I can understand your point. \n\nIf you feel that the disciplines themselves are useless, I can understand the negative reaction. Would you consider fields like history, linguistics, philosophy and anthropology useless? \n\nHistory, the study of the past both politically and culturally gives insights into the present and hints at past trendlines that could determine future ones. Studying history gives you an understanding of the world[.] past, sheds light at problems like the Israel/Palestine conflict, the Crusades and their importance, how and why the consequences of the WWI are still felt today in some parts of the world (Germany only recently (2010) paid off her war reparations for example, and the Middle_East remains a quagmire partly due to the partition of the Ottoman Empire).\n\nThe work of historians is far from useless and present leaders are well-advised to look at history to understand the bigger picture of which they are a part. History doesn't repeat itself, but it rhymes. \n\nSimilar things can be said about literature, which is an integral part of every culture and gives insights into a culture[.] zeitgeist during a certain period. Often an understanding of history and an understanding of culture and literature goes hand in hand. \n\nLinguistics is the study of language. Language is something we use every day, in conversation, in writing (uhh... literature? History?), it is even used during our thought processes to a certain degree. Language is fundamental to the human condition. Linguistics is subdivided into fields like morphology, phonology, syntax (basically language from a technical point of view) but also fields like semantics, pragmatics and sociolinguistics. \n\nPhilosophy as a field of study is extremely wide-ranging. From ethics over logic to fields like Philosophy of language, which pertains well to linguistics. Linguistics and philosophy also overlap with STEM. Computational linguistics will be important when it comes to the creation of AI. Or to use a more practical but less exciting example, computational linguists were crucial to the creation of auto correct software. So they're partly responsible for your phone changing 'fucking' to 'ducking' every ducking time. \n\nPhilosophers like Hilary Putnam gave way to solutions that are applied in modern day computer science. What about set theory, which is a concern to both philosophers and mathematicians? \n\nSo no, the humanities are far from useless since the study of the human condition -- the study of ourselves and what makes ourselves ourselves -- is extremely useful because it provides us with an in-depth understanding of who we are and which problems might arise from that.\n\nI get it that pursuing a degree in one of the disciplines might be a fruitless effort especially when it comes with huge amounts of student loans and a barren job market. \n\n "}