{"doc_id": "1020", "name": "2017_04_humanities_student_major_925_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2017-04-humanities-student-major_925_college.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.069", "Subjectivity": "0.234", "Score": "47", "Upvotes": "0", "Downvotes": "0", "Wordcount": "289", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64ak00", "Reddit_id": "dg0qzpk", "Subreddit_id": "t5_2qh3z", "Commenter": "OrangeBluejedi", "length": "1605", "content_scrubbed": "Holy shit, I've been saying this for years.\n\nOnly thing I would add:\n\nDO NOT DISMISS TRADE SCHOOLS OR COMMUNITY COLLEGE.  DO NOT WRITE THEM OFF AS A JOKE.  \n\nMany many community colleges have transfer agreements with in state colleges that spells out down to the last dotted eye and crossed t what credits/courses will and will not transfer.  \n\nMany even have direct transfer AA/AS degrees, meaning if you earn certain AA/AS degrees.  100% of everything will follow you if accepted to xx university.\n\nTrade schools:  don't write them off as a joke either.  Many credits at trade schools will follow you if you earn a completion certificate.  Depends on the course.  But still, regardless.  Don't write them off as a joke either.  I can name a crap ton of people who went to the local trade school and/or community college, walked out 6 months to 3 years later with maybe 5000 in students loans and into 30-40 grand a year jobs.  \n\nOne of my good friends went through the community college food service program.  Took 8 months to complete it, only cost $800 out of pocket.  Walked into a job as a prep cook for one of the casinos for $12. 50 an hour.  \n\nWent back to same community college, finished off his AA degree in liberal_arts 3 years later.  That cost him another $6700 out of pocket.  Quit his job at the casino and took a job at another casino in town as a line manager making $16 an hour.  He started that 5 months ago and loves it.\n\nDon't go to college if you don't want to, but remember if you feel like you need something from college, don't over look the trade school/community college route."}