{"doc_id": "499", "name": "2017_10_humanities_student_major_2726_askredditafterdark", "namespace": "we1sv2.0", "metapath": "", "pub": "AskRedditAfterDark", "title": "2017-10-humanities-student-major_2726_AskRedditAfterDark.txt", "pub_date": "2017-10-28T00:00:00Z", "Sentiment": "0.094", "Subjectivity": "0.349", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "914", "Permalink": "http://reddit.com/r/AskRedditAfterDark/comments/798s6d/have_you_ever_posed_nude_or_performed_sexually/dp03cbz/", "Threadlink": "http://reddit.com/r/AskRedditAfterDark/comments/798s6d/have_you_ever_posed_nude_or_performed_sexually", "Parent_id": "t3_798s6d", "Reddit_id": "dp03cbz", "Subreddit_id": "t5_2vh2s", "Commenter": "JR477", "length": "4839", "content_scrubbed": "When I was a senior in college I took a communications class and met a sophomore named Lisa.  Lisa was a pretty brunette with large breasts and a curvy ass to match.  She dressed in what we called the \"alternative\" style in the '90[.].  Long skirt, black boots, retro/thrift store coat.  We happened to sit next to each other in class and got to talking.  Turns out she was an art major and asked if I might be willing to help her out with one of her projects.  She didn't go into it in class but asked if we could meet for coffee afterwards to discuss the details.\n\nTurned to she was interested in using film, photography, and video as her artistic media.  She told me that she was interested in giving hand jobs to men on film.  Neither of our faces would be shown.  Just her hand and the men[.] (my) penis.  She was interested in the time it would take her to get each man off.  Consistent or variable?  Amount of ejaculate relative to length, width?  Or was there no correlation at all.  I was impressed with how Lisa was able to discuss all of this with a straight face.  She truly saw artistic (or scientific) value in this.  At the end of her pitch I said, \"Well, for art[.] sake, who am I to turn you down?\"\n\nWe went back to her apartment into her bedroom where a black backdrop was already set up.  She had what looked like a 35 millimeter camera that used actual film.  She told me she was able to borrow it from the university.  It was old-school, but she wanted the grainy look of film against a black back drop.  She asked me to completely undress and lie down on the fabric that draped the floor and went up the wall and laughingly told me, \"Don't worry, I wash this between sessions.\"  She also had me sign a waiver.  She was not sure she would turn this into her professor, but she wanted to go through the legal formalities if she did or if she used the footage in the future.  I didn't mind because as long as my face was not shown (which the waiver explicitly confirmed) I did not mind how she used it.\n\nI undressed and lied down as instructed.  She had told me earlier that due to the expense of the film she said she was not going to start shooting until I was erect.  However, I was already hard when I got nude.  Lisa noticed and said, \"Awesome, you're already aroused; just let me turn on the camera and line up the shot.\"  Hoping that, if not at this hour, I might have a chance to have a full, reciprocal sexual session with Lisa I tried flirting a little and replied, \"Well, beyond wanting to support the arts I do find you very attractive.\"  Lisa blushed a little and said, \"Aww thank you.\"\n\nLisa turned on the camera and lined up the shot.  She returned and carefully knelt on a small \"x\" of black electrical tape that was affixed to the fabric.  I hadn't noticed this because it matched the color of the backdrop so well, but I reasoned this was her mark so that only her hand, and not her body, was in the frame.\n\nLisa got to work.  No saliva, no lube, just a good old-fashioned hand job.  Her palm was soft, and she seemed to have much experience giving hand jobs.  She gripped my cock tightly but not overly so and gave plenty of attention to my glans.  One thing I noticed was that she angled my penis toward me knees instead of toward my chest.\n\n\"There[.] no audio - I may be doing that later,\" Lisa said, \"so you can say whatever you want, moan, whatever makes you feel comfortable.\" I decided to treat this like any other conventional hand job I'd ever gotten and when it started to feel really good, I'd express my pleasure.  Lisa got me to that point about ten seconds later.  She had been giving me a hand job for all of about one minute and already I could feel my orgasm bubbling up.  \"Ohhhhh,\" I moaned, \"this feels so good.\"  Gratified either for her hand prowess or the effect this would have on her film, I don't know, but Lisa grinned and whispered, \"Good.\"  No more than 20 seconds go by and Lisa brought me to orgasm.  \"Ohhhh, Lisa,\" I moan, \"I'm ready to cum.\"  I start ejaculating (what I would later observe to be) six long ropes onto my knees and upper thighs.  Lisa jacked me thoroughly until the very last drop.  Her hand got pretty drenched toward the end of it.  She politely got some Kleenex for me and for her hand.  I cleaned off, got dressed, and said, \"That was a lot of fun in several ways.  Could we see each other again, like for dinner or drinks?\"  Lisa replied, \"Well, I'd at least like to see you so that we can lay down the audio track after I'm done compiling and editing.\"\n\nIf there is any interest, I can relay the story of our audio follow-up.  But I don't want to belabor this if no one is interested or it[.] tl;dr.\n\nYes, we did go out socially after the art project work was complete, but, again, I'll refrain from posting that story if there is no interest.     \n    "}