{"doc_id": "294", "name": "2017_10_humanities_student_major_554_turkey", "namespace": "we1sv2.0", "metapath": "", "pub": "Turkey", "title": "2017-10-humanities-student-major_554_Turkey.txt", "pub_date": "2017-10-07T00:00:00Z", "Sentiment": "0.076", "Subjectivity": "0.441", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "329", "Permalink": "http://reddit.com/r/Turkey/comments/74vlup/how_is_bilkent_university_as_an_employer/do1k5kk/", "Threadlink": "http://reddit.com/r/Turkey/comments/74vlup/how_is_bilkent_university_as_an_employer", "Parent_id": "t3_74vlup", "Reddit_id": "do1k5kk", "Subreddit_id": "t5_2qlnu", "Commenter": "gvm40", "length": "1963", "content_scrubbed": "Bilkent is one of the best private schools in Turkey (I'd probably rank it #3 for humanities, just below Koc and Sabancı). The pay will be good I reckon, and it[.] in one of the most affluent areas of Ankara. You will get some ultra rich, spoiled, bratty students, but you'll also have a significant amount of students on a scholarship, who have to be crazy competitive to keep their grades up. The student body should be like a 80-20/70-30 split between the two.\n\nIn terms of social and cultural life/activities/sightseeing Ankara isn't the best city in Turkey, worse than Istanbul/Izmir/Antalya etc for sure. As an Istanbulite I'm biased, but really it[.] known as a \"city of civil servants\", monotonous and generally boring. Besides some 1920-30s Republican era landmarks and a few museums there isn't much of note (well, there[.] also the old castle and restored houses in Hamamonu and Roman bath ruins in Ulus), though if you've never been to a Turkish city before or your schedule is busy there should still be enough to entertain you. Ankara has a continental climate similar to US Midwest: generally dry, pretty cold (especially Bilkent which is in a hilly area, you'll probably see -15/-20 C for at least a few days) and occasionally snowy in winter, scorching hot (35-40 C) in summer. There are small parks dotting the city and 3 large forested areas nearby: Golbası, Eymir and Ataturk Orman Ciftligi (if you're an adventurous eater definitely try *kokorec* here, grilled intestine sandwiches, real good stuff). You can probably get by with English, though learning some basic Turkish vocabulary would help if you're going to venture out of Bilkent and try local Turkish stuff. There are some rough neighborhoods you should avoid (like the infamous Cincin and Yenidogan), though security won't be a concern in central Ankara and especially not in Bilkent. I'm not an academic but a humanities student in Istanbul, is there anything I can elaborate more on?"}