{"doc_id": "967", "name": "2017_04_humanities_student_major_469_raisedbyborderlines", "namespace": "we1sv2.0", "metapath": "", "pub": "raisedbyborderlines", "title": "2017-04-humanities-student-major_469_raisedbyborderlines.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.012", "Subjectivity": "0.32", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1574", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63c98y", "Reddit_id": "dfv136p", "Subreddit_id": "t5_33d8b", "Commenter": "bunnylover726", "length": "9030", "content_scrubbed": "My dad is a hermit. I'm a little late to the party commenting because I couldn't read the chapter straight through in one sitting- it was a bit too nail on head for me.\n\n 1) **Do you have a hermit? What has that looked like for you?**\n\nYeah. 95% of the time dad is a hermit, but 5% or so of the time he'll turn into a sadistic witch for no apparent reason. The reason for my flair saying \"Cluster B Clusterfuck\" is well, it[.] because a mental health professional called him that word for word and because while my dad[.] biggest issue is BPD, there[.] a lot more going on. Our best guess is the ICD-10 criteria for Asperger[.] + DSM-V BPD + DSM-V [OCPD](http://outofthefog. website/personality-disorders-1/2015/12/6/obsessive-compulsive-personality-disorder-ocpd) + some lead poisoning based off info I got from his ramblings and my looking up maps, soil tests, and records of the area where he grew up. \n\nFrom what I've heard, as a kid, it was pretty obvious that he was \"off\". He was a little kid on the autism spectrum who was bullied at school, bullied by the neighbors, picked on by his siblings, and abused by a raging narcissist of a father. He can't really read people[.] emotions and his theory of mind skills are non-existent. My counselor, who has published work on BPD and sees a lot of young clients with Asperger[.], thinks that the biggest issue of my dad[.] abandonment and fear came from not being taught social skills or helped with the on the spectrum issues. \n\nHis kindergarten teacher realized that things were wrong and that he *needed* help from a trained professional as a kid. His narcissist of a father and his mother were furious that their parenting skills were insulted, how dare you imply something is \"wrong\" with our son, etc. and threw my dad into the abyss to be swallowed whole. What the book said about hermits finding their sense of self through their career, etc. is very true. My dad has no friends, he just has his special interests and his obsessive compulsive behaviors. (Checking and rechecking the knobs on the stove, the locks on the doors, just like the book mentioned. Buying 8 coffee makers and stashing them in the closet, stocking up on quart sized bottles of ketchup because they were on sale and he'll need food [Ketchup, really?] in case of a natural disaster; you know, typical \"eh, I don't think that guy[.] OK....\" behavior.)\n\n 2) **Have you, or how have you, handled the hermit[.] fear? How has your response changed over time?**\n\nAs a kid, I couldn't help but give him really weird looks during his paranoid freak outs. That just made everything worse and made me an evil target of derision who was conspiring against him as well. There[.] nothing that can handle his fear. Nothing. My response has simply been to leave.\n\n 3) **Which (if any) of the Hermit[.] core messages in the list resonate with you?**\n\n\"Something terrible just happened!\", \"You've done it now!\", \"Don't tell anybody!\", \"THEY'RE OUT TO GET US!\" \"They\" being Jewish people, black people, hispanic people, asian people, uppity women who think they're actually *people*, liberals/Democrats, Protestants, Muslims, Free Masons, Foreigners, LGBT people, people with arts/humanities degrees or business backgrounds, pretty much everyone who isn't a baby boomer aged Republican white straight cisgender male Catholic electrical engineer is out to get him. \"KEEP YOUR DOORS LOCKED!\" (He literally delivered most of these messages verbatim in a panicked yell.) \"What[.] the matter with you?\" and \"Don't let them in.\"\n\n 4) **How have you felt this fear in your own life? How do you feel it still? How has your relationship to it changed?**\n\nI'm diagnosed with social anxiety and I'm on the autism spectrum myself. My upbringing obviously seriously fucked my ability to form and maintain relationships. I have trouble even checking my email because I'm afraid that it will be full of messages of people hating me. So that[.] why I see a counselor with the dual experience of knowledge of BPD and the skill set of teaching social skills and tips to kids on the spectrum. I'm very far away from being mostly recovered, but just keep putting one foot in front of the other.\n\n 5) **what[.] your truly outlandish hermit story?**\n\nI have lots of stories. Here[.] one- my dad[.] college roommate almost killed him. Dad was sitting there and felt something pointy on his back and his roommate was holding a knife to him. Dad acts like this came out of absolutely nowhere and the roommate must have been completely unhinged. While you do need to be pretty unhinged to threaten someone like that, I *highly* doubt that it was unprovoked and dad was some sort of perfectly innocent victim. The university took it seriously enough to kick the roommate out of that living arrangement, but charges couldn't be filed because it was a \"he said/he said\" situation. Once dad was also punched in the back at the cafeteria. And another time someone \"wailed on\" him at work. Sorry, dad, most human beings don't randomly become violent. If a grown-ass adult is upset enough by you to risk assault charges then you probably *really* fucked up. Even my enabler mother insists that he probably wasn't innocent in *any* of those situations, but I roll my eyes at this person going through life acting like a heroic innocent protagonist in this epic saga of near death experiences. Sigh.\n\nDad would always lose his shit because my mom kept spare change for toll roads in her car. This was apparently going to attract black drug addicts to smash all the windows of her car and rip the car apart to steal the quarters, nickels and dimes to spend on heroin. We lived in a country-club Republican area (seriously, the country club was about a half mile down the road); a place visited by sitting president George W. Bush and by Mitt Romney to rub elbows with campaign donors. If anyone[.] doing drugs there, it[.] doctors abusing stimulants to get through their shifts and lawyers snorting Oxy after defending a particularly sleazy client in court.\n\nSo terrifying story time that hopefully won't identify me- my dad worked on the control systems at one of the US[.] large nuclear power plants. Most of his work experience as an electrical engineer involved nuclear in some form or another. Anyway, I have a good feeling of how this unfolded because one of the mechanical engineers at his work place was a high school classmate of mine, and is as sweet as 3. 14. Dad thought the mechanical engineers were conspiring against him for some reason (???) He claimed they were making fun of him and moving his coffee mugs around. I think he may have also been concerned about them switching caff/decaf. Anyway, they actually *did* get mad at him for his crazy, because the nice coffee maker I lent him wound up getting shipped off to dry storage for items contaminated with radiation as petty anonymous revenge. I think it[.] hilarious. RIP coffee maker, you were nice while I had you. Eventually he raged at work enough that the power company decided that \"Hmmm.... having a crazy and paranoid person flying off the handle all the time and with intimate knowledge of the plant[.] control systems is probably not wise.\" So they fired him. \n\nHe claims he wasn't fired and was discriminated against for age. He hired a lawyer and tried to make a case and everything. When the actual facts got out, it was apparently so lopsided in favor of the power company that the lawyer backed down and refused to go to court for him. It sounds awful, but I can't help but snicker at the idea of a \"coffee conspiracy\". \n\nOn another occasion, when the gay games came to our local major city, I was stuck in the car with him on a 150 mile or so ride. Ugh. He was ranting about how bisexuals are going to pick up a bunch of STDs hanging out around the gay games then attempt to find ways to infect innocent straight people with them. He also used the term \"Anally Inflicted Death Sentence\". My dad is a living breathing caricature of a homophobe. I'm bisexual and he has no idea. Like, I was wearing a bunch of pride stuff and he was too stupid to get it. My nails were painted in a rainbow and said \"PRIDE\" on them. He apparently thinks that the [freedom rings](https://images10. newegg. com/ProductImage/A1S0_1300853198483404000ulSg2O5T0. jpg) that I wear are \"Olympic Rings\". Lol, OK.\n\nOnce we were in the dining room and he was storming around raging and he knocked a chair over. He screamed \"PICK UP THAT CHAIR I'M TOO BUSY!\" and ran out the front door, slammed it in such a way that it creaked back open, then drove off to go who knows where. Normally dad doesn't like going places alone, so this was welcome relief and my siblings and I literally cracked up.\n\nEdit: typos\n\nEdit 2: Another story- dad claims that our neighbor spit on our lawn because he bought a Chevy Impala. (???). If I had to guess, the neighbor was going for his morning jog like every day, and had some mucus or something in his mouth and just felt the need to spit. Dad ascribed some random motive to it afterwards."}