{"doc_id": "443", "name": "2017_10_humanities_student_major_2099_math", "namespace": "we1sv2.0", "metapath": "", "pub": "math", "title": "2017-10-humanities-student-major_2099_math.txt", "pub_date": "2017-10-22T00:00:00Z", "Sentiment": "0.218", "Subjectivity": "0.408", "Score": "18", "Upvotes": "0", "Downvotes": "0", "Wordcount": "391", "Permalink": "http://reddit.com/r/math/comments/77zp4c/people_with_phd_in_pure_mathematics_how_much_work/doq05kz/", "Threadlink": "http://reddit.com/r/math/comments/77zp4c/people_with_phd_in_pure_mathematics_how_much_work", "Parent_id": "t3_77zp4c", "Reddit_id": "doq05kz", "Subreddit_id": "t5_2qh0n", "Commenter": "profzoom", "length": "2234", "content_scrubbed": "I kind of did the inverse of that.\n\nI did my undergrad at a well-known private university (AMS Group I).  A[.] & B[.] in my math classes the first two years without really trying.  Then my junior year I took real analysis, thinking I could do the same thing.  I never really learned my lesson, and finished the last two years as a C student in most of my classes.\n\nAfter graduation and a failed attempt at getting a job as an actuary, I worked in retail for a few years before finally deciding to go back to grad school.  With my weak grades, weak recommendations, and weak GRE subject test score, I was only admitted to an AMS Group III school, the flagship public university in a pretty small western state.\n\nHowever, the environment in grad school was perfect for me.  It was a relatively small department, and I felt like I \"fit in\" much more than I did as an undergrad.  I was more mature (started grad school at 25) and learned how to study.  I did great in all my classes and developed good relationships with the faculty.\n\nAnd most importantly, I had a teaching assistantship the entire time.  It was a small department, but the university had a big engineering school.  So it needed *tons* of instructors for the calculus/diff eq/linear algebra courses.  I got some wonderful teaching experience and consistently won the department[.] grad student teaching award at the end of the year.\n\nWith the teaching experience, I was a relatively attractive candidate for more teaching-oriented positions after I got my PhD.  My interviews were pretty much all for positions at small private liberal_arts colleges or regional campuses of larger public universities.  A couple non-tenure track positions at bigger places.\n\nI ended up with a 2-year visiting position at one liberal_arts college, and moved to a permanent position at another after that.\n\nI love it.  The teaching load is big, but I still get to do some research.\n\nI guess the moral of my story is that if your undergraduate experience wasn't the greatest, then it[.] still possible to get a PhD and have a career as an academic mathematician.  However, I would *not* recommend my path to someone who wants to end up at a top-rank school doing lots and lots of research.\n\n"}