{"doc_id": "502", "name": "2017_10_humanities_student_major_2739_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2017-10-humanities-student-major_2739_AskAcademia.txt", "pub_date": "2017-10-28T00:00:00Z", "Sentiment": "0.058", "Subjectivity": "0.221", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "242", "Permalink": "http://reddit.com/r/AskAcademia/comments/7999h1/any_teaching_stream_professors_in_the_sciences/dp0d452/", "Threadlink": "http://reddit.com/r/AskAcademia/comments/7999h1/any_teaching_stream_professors_in_the_sciences", "Parent_id": "t1_dp0ch9y", "Reddit_id": "dp0d452", "Subreddit_id": "t5_2sakj", "Commenter": "Rtalbert235", "length": "1415", "content_scrubbed": "Unlike R1, R2, etc. universities, there[.] no Carnegie classification for \"small liberal_arts college\" and so how many there are, and how big they are, is up to interpretation. But in my experience -- 14 years teaching in SLAC[.] and working with SLAC consortia before my current position -- there are a lot of them, and they range in size from under 500 students to as big as 2000-3000 (not counting online students, which makes the counting tricky). \n\nExample: I have worked in the past with the [Appalachian College Association](https://acaweb. org/) whose members are SLAC[.] in the Appalachian region in the US. That[.] actually a fairly narrow criterion but there are 35 colleges just in that consortium, and all of them are as I described above. There are some consortia of SLAC[.] with hundreds of members. So, there[.] a lot -- probably more in number than R1[.] and possibly more than R1 and R2 together. \n\nAs for \"quality\" and \"caliber\", it depends on what you are classifying. Many of these SLACs will not show up on the radar if you are looking at average SAT or research output, but they are extremely high quality nonetheless in terms of the education they provide their students. Conversely there are R1 schools out there that are supposedly known for their \"quality\" and \"caliber of students\" but which do next to nothing with their teaching, so I'm not so sure how \"quality\" those schools really are TBH. "}