{"doc_id": "1277", "name": "2017_04_humanities_student_major_3293_c_s_t", "namespace": "we1sv2.0", "metapath": "", "pub": "C_S_T", "title": "2017-04-humanities-student-major_3293_C_S_T.txt", "pub_date": "2017-04-29T00:00:00Z", "Sentiment": "0.093", "Subjectivity": "0.338", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "327", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgvifl2", "Reddit_id": "dgwxwsw", "Subreddit_id": "t5_37lis", "Commenter": "ghostdate", "length": "1843", "content_scrubbed": "I think that there[.] an argument to be made for the difference between gender and sex. The gender is the social construct (what you describe as the expressions) while sex is the biological basis. Gender can be fluid, as some males may lean more towards feminine traits and behaviours, and vice versa. Sex however is not, you're born in the body you're born in, and it either has male or female genitalia (or in some cases both, but that[.] not the norm) but your experiences as a human being, regardless of sex, will affect your gender expression. Gender fluidity I think is a real thing, as a man can be highly effeminate, or a woman can be highly masculine, and either can be to such a degree that they think of themselves as the other gender.\n\nAs far as why this idea is being pushed so hard, I can't be certain, but it does seem like there[.] a move towards the breakdown of the traditional family unit in western civilization. I feel personally that it might be tied more to liberal academia, where most of these ideas develop, and the liberal media trying to stay on top of these ideas. Academia in areas of psychology and gender studies, and the liberal_arts in general have developed a bit of an echo chamber, and I also feel that academia does little to challenge its own viewpoints, rather they just work to affirm their ideas, and when met with criticism often dismiss it as homophobia, misogyny etc. When really that critical feedback is crucial to refining and clarifying ideas. Something I feel these areas of study are becoming increasingly opposed to -- for instance in college anybody that challenged a profs point of view regarding a subject such as this would often be marked poorly, rather than seen as an interesting challenge to the profs ideology where they have to make a rational, well informed response to the students."}