{"doc_id": "1115", "name": "2017_04_humanities_student_major_1816_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_1816_AskReddit.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.071", "Subjectivity": "0.285", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "281", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgbxt7n", "Reddit_id": "dgbying", "Subreddit_id": "t5_2qh1i", "Commenter": "disposable-name", "length": "1583", "content_scrubbed": "Yeah, and for millennia men were expected to work in dangerous jobs, get conscripted and fight, work outdoors, do manual labor... what[.] your point?\n\n\"Oh, we're not allowed to let what men traditionally went through be admitted to the argument, but what women went through two hundred years ago is still perfectly valid today.\"\n\nHere[.] news for you: not one of the women in your class you're bitching about was alive to experience the historical horrors you use an argument.\n\n Nursing. Agreed. Female sex dominated. There a lot of hesitation by major educational groups to target males for these positions as it still feels like women are catching pace with men in the workforce.\n\nArts. Wtf are you talking about, lol. 🙃 Men have dominated the arts for centuries. It may be thought/perceived that art is more feminine, but I am sure if you tried to think of a list of 20 famous artists in history - no google - you would mostly come up with men. \n\nSpoken like a true CS major. You're, by your own admission, studying in a faculty that gives you limited exposure to and dealings with the opposite, and, again by your own admission, will enter a field that is entirely male-dominated.\n\nI work in a female-dominated industry. I know what it[.] like. I've got firsthand experience, not the typical rose-tinted nerdy view of women as mystical, mythical beings. \n\nI'm not saying a woman[.] place is in the house. I've yet to meet a woman who can cook or iron as well as I can. \n\nI'm saying that if women want to be rewarded the same as men, then they're gonna have to start acting like men. "}