{"doc_id": "1290", "name": "2017_04_humanities_student_major_3383_samharris", "namespace": "we1sv2.0", "metapath": "", "pub": "samharris", "title": "2017-04-humanities-student-major_3383_samharris.txt", "pub_date": "2017-04-30T00:00:00Z", "Sentiment": "0.105", "Subjectivity": "0.356", "Score": "22", "Upvotes": "0", "Downvotes": "0", "Wordcount": "398", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_68exl2", "Reddit_id": "dgy9z9z", "Subreddit_id": "t5_2thqg", "Commenter": "Belostoma", "length": "2382", "content_scrubbed": "I agree that Bill Nye relies too much on arguments from authority. I don't have a big problem with those when presented by non-scientists, and it[.] perfectly fine for Al Gore[.] main argument to be, \"Listen to the scientists!\" But Nye presents himself as a scientist, and that means it[.] his job to not just say \"listen to the scientists,\" but to show people the goods. He needs to know the things the scientists will say when people are listening. He needs to stop hamming it up for the media quite so much and put in the time to become an expert on the evidence. He doesn't need to become a full-blown climate scientist, but he should know the IPCC report inside and out and be able to quote the major supporting work.\n\nAs for the accusations of elitism, though, I'm not sure what kind of blueprint exists for a science popularizer to *not* seem elitist to some people. Carl Sagan seemed to fit the bill, but he was mostly known to the public through carefully produced TV appearances. He wrote a great book against superstition and pseudoscience (The Demon-Haunted World), but the kind of science denialism we see today from the likes of creationists, climate deniers, anti-vaccers hadn't really developed. Although social media has done much good, it has also spread dumb ideas in balkanized social circles where people have their idiotic beliefs reinforced by like-minded idiots. At the same time, science popularizers are expected to be active in all these short-form, unscripted formats ranging from Twitter to Reddit AMAs to podcasts. Is it fair to put a scientist in front of so many microphones, bombard them with abject stupidity from all sides, and expect them to avoid saying anything that suggests they're *more elite* than the people who think it was God[.] plan to have the Chinese fabricate climate science to distract us from their secret plan to turn all our kids autistic with vaccines? Likewise, can they be expected to universally respect the humanities while feminist leaders are calling Newton[.] *Principia* a rape manual and postmodernists are saying facts aren't a thing? \n\nI get that smugness should be strategically minimized when trying to persuade people, but it[.] hard to live a very public life as a smart person without occasionally sounding condescending about people who have incredible access to knowledge and choose mind-numbing stupidity instead."}