{"doc_id": "1260", "name": "2017_04_humanities_student_major_3167_politicaldiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "PoliticalDiscussion", "title": "2017-04-humanities-student-major_3167_PoliticalDiscussion.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.02", "Subjectivity": "0.265", "Score": "12", "Upvotes": "0", "Downvotes": "0", "Wordcount": "454", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67xaoi", "Reddit_id": "dgv8l9n", "Subreddit_id": "t5_2sfmf", "Commenter": "FortCollinsEnt", "length": "2527", "content_scrubbed": "I went from a pretty big lefty to leaning towards the \"right\" end of the spectrum. I always wondered how Republicans could stray to the Democrat party, it seemed like party-treason or intellectual weakness. I understand now... I understand how they were alinated. In my case, I was very involved with social activism until I was pretty much told I wasn't welcome. It started in college where it was verbally stated \"Why is there a white guy allowed in the Arabic club?\"... Then when I was dating a Palestinian girl, I was told I was \"fetishizing\" women of color. When Gaza was bombed in operation Cast Lead there was a vigil on campus. I majored in Middle_Easten studies and colleagues were going, so I went to support. When a white dude showed up(me), I was asked if I was Jewish.... I'm not, but what if I was??? This same sentiment was held with professors I had as well... After I felt I wasn't welcome, I started to question the status quo in the Humanities dept at my university, by asking scholarly, challenging questions only to be told I was a trouble maker. Fast forward to the election. When I questioned the nomination of HRC, I was flat out labeled a woman-hater. I was unfriended or blocked by about 50 people when I said on social media that \"I'm not with her.\" ... Likewise, when you point out basic facts about terrorism, Islam (again, which I studied in university and in Cairo) or certain fallacies of certain leftist view points, that led to being labeled a bigot and an intolerant piece of shit. Didn't vote for Trump and I don't necessarily support his policies, but I see how he won the election given the ridiculous social and political atmosphere that had existed the last 3-5 years. I honestly feel like I have beliefs that are supported by the_left, but I am sorry, I am not going to subscribe to the idea that because I'm a \"cisgender\" white male that I am inherently evil, racist that is responsible for all the problems on the planet. Same with being a Southerner, people automatically assume I hate black people or that my family owned slaves... My family fled WWII in Europe and ended up In North Carolina.. Tell me again how I'm a hillbilly and a bigot cause I happen to be from a particular region. Also, I come from a multicultural family with members of a few different races and ethnicities. But when you wake up every morning being told you're the reason for an oppressive, patriarchal system... How can you stay in that party unless you have a serious case of self-loathing, which I don't."}