{"doc_id": "358", "name": "2017_10_humanities_student_major_1238_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2017-10-humanities-student-major_1238_AskAcademia.txt", "pub_date": "2017-10-13T00:00:00Z", "Sentiment": "0.014", "Subjectivity": "0.437", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "465", "Permalink": "http://reddit.com/r/AskAcademia/comments/760h89/foreign_graduate_student_in_anglophone_school/dob3uje/", "Threadlink": "http://reddit.com/r/AskAcademia/comments/760h89/foreign_graduate_student_in_anglophone_school", "Parent_id": "t3_760h89", "Reddit_id": "dob3uje", "Subreddit_id": "t5_2sakj", "Commenter": "beimpermissible", "length": "2641", "content_scrubbed": "My first grad course was in Germany (I'm Anglophone), reading Hegel. It was brutal. I felt like a complete dummy, and all my language confidence just ebbed away.\n\nI spent a lot of time reading the same sentences over and over and over, trying to make out their basic meaning and relation to the sentences around them. By the time I finally turned a page, I'd have already lost the thread from the page before.\n\nYears later, I found out that everybody feels like that when they first read Hegel. It wasn't my language skills (though they were indeed stretched!); it[.] just that reading Hegel is hard.\n\nIn fact, today a long ways down the road, having read much more Hegel and published on his philosophy, I look back on that grad course and it[.] clear that I was actually *getting* about as much as anyone else, maybe more. The very heartwrenching struggle it took to just comprehend what was happening linguistically was, at the same time, a thorough and serious engagement with Hegel--more thorough and serious than many of my classmates', I later came to see.\n\nIt was really hard at the time, and I felt very badly about myself. I never would have guessed that I'd end up a German-English philosophical translator (among other hats) down the line.\n\nMy point, I guess, is that grad school is a struggle for everyone, while struggling in a non-native language is especially demoralizing--and that[.] okay. For me, the biggest lesson of that part of my life was accepting not being as verbally fluid as I was used to being: learning to live with that sense of failure and inadequacy and do the thing anyhow. It[.] a skill that[.] come in handy almost ceaselessly in the years since then.\n\nSo, hang in there, and give yourself a break!\n\nYour advisor is right about the failure part of things, too. You'll be happiest in your program when you learn to love the struggle, and that means deprioritizing the evaluation part of things and being as present as you can to the beauty of the struggle as it unfolds. Love the ongoing failure that is learning at a new level, and don't worry about the specter of institutional failure--as long as a grad student has their heart in the work, their professors will mostly look out for them.\n\nAs a prof told me in grad school, \"There[.] no question that you're smart enough. Everybody here is smart enough. Lots of people are smart enough. Being smart enough is easy. It[.] sticking with it that can be hard.\"\n\nSticking with it when you feel like a failure is--in my experience, at least--pretty much *the* core emotional/maturity skill you learn in graduate school, no matter your discipline. It[.] a good skill."}