{"doc_id": "938", "name": "2017_04_humanities_student_major_198_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-04-humanities-student-major_198_ApplyingToCollege.txt", "pub_date": "2017-04-02T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.289", "Score": "16", "Upvotes": "0", "Downvotes": "0", "Wordcount": "866", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfqxa8k", "Reddit_id": "dfqz7vn", "Subreddit_id": "t5_2y2r8", "Commenter": "virtualpropinquity", "length": "5029", "content_scrubbed": "1. We're not well-known to the general public. People 5 minutes away from us have never heard of us, and we're constantly confused with Cal Poly Pomona. \n2. It[.] difficult for underclassmen and upperclassmen to interact because of how the campus is structured. Juniors and seniors live on the north end of campus while first years and sophomores on the south end. It[.] not like other schools where everyone, regardless of class year, lives in the same places. \n3. It gets really hot in the first few months of school. Most dorms don't have AC, so there are days in which the school needs to open up AC buildings for students to sleep in. We're also on top of an ant hill, so if you leave food out, ants will swarm it quickly.\n4. Have you heard of the Stanford Duck Syndrome? Pomona has it too. On the surface, people seem to have gotten everything together. It[.] constantly sunny and there[.] this feeling that people are leading perfect lives- getting A[.] in all their classes, doing 2 internships and research with professors, running 4 clubs and organizations, playing a sport, etc. But Pomona is very rigorous and very good at making people who're not used to the college atmosphere or not succeeding in the traditional way feel out of place. It[.] difficult for students who're struggling to point it out against the dominating culture of happiness and perfection. There was this harrowing point made in orientation that Pomona students are more likely to use mental health resources than the national average, and it[.] in part because the superficial nature of things makes people hesitant to speak openly about their struggles. Things have improved over my time at Pomona, but it is some thing students need to realize and challenge. \n5. There is a big STEM focus at Pomona compared to other schools, and pre-professionalism is rising. Pomona actually has more STEM students as a % than the Ivies and more STEM majors than every other LAC except Mudd. This could be seen as a pro for some students, but to me, it[.] not (and I'm a STEM major). The humanities and social science part of the liberal_arts are being attacked by outside forces. As we as an elite LAC make the conscious decision to prioritize our STEM offerings to the relative neglect of our other offerings, we perpetuate that belief. One thing I appreciate is that there isn't a divide like some universities. Most students will take courses in a variety of different areas and will interact without judgement with people from all sorts of majors. But still, when I see that over 50% of our students are majoring in STEM, whereas those majors only represent 20% of all the majors we have to offer, I get worried. \n6. A lot of activism and administrative change is student led without any compensation. There is a lot of apathy by administrators to consciously research the things needed to make Pomona better. They wait on students to identify those aspects. While they make promises to listen, one gets the feeling that they wait on the activists to graduate so they don't have to deal with those pressures and respond to the changes being requested. Pomona isn't alone in this respect- every single college is like this- but Pomona shouldn't be thought of as being different and better. \n7. A lot of opportunities are very competitive. Even though Pomona covers a lot of experiences for a school of its size, there is so much demand from the student body that a lot of students get rejected. For instance, there[.] the Summer Experience Funding Program for low or unpaid internships. Only a little over half of all the students who apply get it, though they have been increasing the amounts of people getting funded each year (yet, the number of people applying has gone up, too). Some of our most heavily sought out professors just don't have the lab space to take in all the students who want to work with them. \n8. There[.] a big bubble on campus called the Claremont Bubble. Claremont is considered one of the nicest parts of SoCal. It[.] beautiful, tree-lined amidst a drought, and privileged. But to our immediate surroundings, the neighboring towns have a lot of poverty. A lot of students make no effort to go out and understand how fortunate they are to be where they are. In all of our all you can eat steak/shrimp nights, endless access to free concerts/speakers/etc., wonderful classes backed by huge financial resources, and so much more, one can lose sense of the picture of what the reality is like for so many out there. A lot of kids at Pomona are sheltered. They address economics, sociology, anthropology, etc. with an entirely theoretical framework. Even when the college provides service learning courses and community engagement opportunities to make it possible for students to learn more directly about how the majority of Americans live their lives, few take advantage of them.\n9. The school lacks political diversity, and a conservative will find it difficult to espouse their views openly without being critiqued by the student body. "}