{"doc_id": "431", "name": "2017_10_humanities_student_major_1923_touhoujerk", "namespace": "we1sv2.0", "metapath": "", "pub": "Touhoujerk", "title": "2017-10-humanities-student-major_1923_Touhoujerk.txt", "pub_date": "2017-10-20T00:00:00Z", "Sentiment": "0.149", "Subjectivity": "0.389", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "793", "Permalink": "http://reddit.com/r/Touhoujerk/comments/77lwgf/is_eosd_a_timeless_masterpiece/don3u82/", "Threadlink": "http://reddit.com/r/Touhoujerk/comments/77lwgf/is_eosd_a_timeless_masterpiece", "Parent_id": "t3_77lwgf", "Reddit_id": "don3u82", "Subreddit_id": "t5_2x8ci", "Commenter": "Hyogomori", "length": "4352", "content_scrubbed": "**is UFO a flying masterpiece?**\n\nlet[.] take a look at some FACTS:\n\n- UFO has the best OST out of any other touhou game. the music is simply unforgettable, and draws you in and make you feel like you're actually in the game. i get goosebumps whenever i listen to incredible tracks such as the beeps the UFOs make when they change colors and the sound of Shou firing her curvy lasers: they're just that good.\n\n- UFO has the best story out of any other touhou game. the whole idea of Byakuren going full Jesus mode is brilliant. ZUN took a classic premise and made it his own. not only that but he added a touhou twist-- Byakuren ONLY wanted to be able to hang out with her youkai buds without being shamed to death and y'knowTM she planned to do so by escaping gensokyo with that flying ship she bought at kourindou[.] garage sale because y'knowTM if you hit the airship very hard against the hakurei barrier you can actually break it. this is the only touhou game to have such a shocking plot twist, let alone one at all.\n\n- UFO arguably has the best cast of characters. the designs are impeccable as well as their personalities. each character leaves a lasting impression on you. the cast is practically BEAMING with color, not to mention they're badass: a cheese whore? check. a youkai with a taste for fisting? check. cheese whore reappers in stage 5? check.\n\n- UFO has an ICONIC character: nue. the only other game in the series that has an iconic character is Super Mario Bros. 2 (with Luigi). the fact that UFO was able to spawn another iconic character shows how much of a phenomenon this game really was.\nUFO has the best gimmick out of any other game: UFOs. it[.] a gimmick whose name matches the game[.] title, which is very useful when it comes to touhou, not just UFO. not only that but because UFOs are so risky to collect, it shoos out pretty much any filthy casuals who thinks the game will be nice and hold their hands.\n\n- UFO has the best stage designs out of any other touhou game... a the sky? check. some flying ship on the sky? check. inside the flying ship? check. not only are the locations amazing, as you can see, but the actual detail is jaw-dropping as well. the stages have so much dimension and depth, it[.] makes the game almost feel like a major motion picture.\n\n- UFO has the best bullet patterns out of any other game. it[.] very clear that ZUN took his time with this. each spellcard is SO unique and SO memorable. not only that, but they're very pleasant to look at. i'd argue that each spellcard has it[.] own personality, if y'knowTM what i mean. just look at rare metal detector, which everyone loves, and radiant treasure, which everyone also must love. every spellcard is like a single word in a big letter made up by all of them together but whose message you can only fully comprehend if you play on lunatic.\n\n- UFO has the best playable cast: reimu, marisa and sanae. each character is important canonically and and has a PERFECT exchange of dialogue with nazrin. each shot-type is perfect which isn't the case for any other touhou game that has any other playable character beyond reimu marisa or sanae, for everyone else totally sucks in this franchise.\n\n- UFO has arguably the best art out of any other game. one may argue that the art looks the same as the art from the other older games: but they'd be DEAD wrong. TH12[.] art is done in a special way that makes characters look like zombies with their greenish skins and lifeless, empty but still famished-looking facial expressions and there[.] y'knowTM this DEEP message about the nature of death hidden in the artstyle which is discussed througout the entire game without you even noticing (as opposed to DDC[.] bland and forgettable style or IN[.] in which everything is so dark you can't fucking see anything on the screen and you have to play the whole game using your ears alone).\n\nP. S: no, the difficulty is not \"cheap\". curvy lasers are a necessary part of the game and if you're using bombs when they appear you've been playing it wrong because you're a fucking casual who can't predict the movement of anything that doesn't goes in a straight line with a speed of 2 centimeters per hour and in all honesty ya should just stick to playing HSiFS if you can't handle toramaru[.] spellcards. oh wait HSiFS has curvy lasers as well so I guess you're just screwed."}