{"doc_id": "451", "name": "2017_10_humanities_student_major_2194_xenoblade_chronicles", "namespace": "we1sv2.0", "metapath": "", "pub": "Xenoblade_Chronicles", "title": "2017-10-humanities-student-major_2194_Xenoblade_Chronicles.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "-0.06", "Subjectivity": "0.359", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "312", "Permalink": "http://reddit.com/r/Xenoblade_Chronicles/comments/7880ku/people_who_find_pyras_design_offensive_can_you/dorxog7/", "Threadlink": "http://reddit.com/r/Xenoblade_Chronicles/comments/7880ku/people_who_find_pyras_design_offensive_can_you", "Parent_id": "t1_dorujsm", "Reddit_id": "dorxog7", "Subreddit_id": "t5_2vcc3", "Commenter": "ultrazap", "length": "1693", "content_scrubbed": "\"I can't believe that people are actually hyped for and love this game, and love the artstyle and designs of it, this community makes no sense!\" is basically what this post is.\n\nPeople don't hate this game anymore. They love and support it now. Can you not accept that the majority of people now love what they see about this game? Every comment I happen to see from you in this subreddit and even the other nintendo subs is constant hate on everything about this game, and you seem upset that in general, people don't agree with you anymore. \n\nYou seem to just want the subreddit and the community at large to remain steeped in hate of this game, and can't let it go that it[.] not like it was right after E3. Get over it. We are sick and tired of the constant hate on this game, the exact same things brought up over and over. We've heard your complaints a thousand times, it has never failed to be vocal. We know. We have heard and understood that you guys hate the designs and other things about the game, we're not blind that the opinions exist. You feel alienated now that every other post here isn't an issue with this game anymore. This community isn't \"filled with the antithesis of sense\" now that the outrage over this game is past and the hype and enjoyment is taking over. \n\nThe people like you that think that the sub can't accept that there[.] negative opinions seem to have forgotten how flooded this place was with them about half a year ago, there[.] nothing more to be said. You really need to take a step back and ask yourself why you want this place to go back to constantly having complaint posts and outrage posts over this game rather than constant positivity and support."}