{"doc_id": "492", "name": "2017_10_humanities_student_major_2664_jobs", "namespace": "we1sv2.0", "metapath": "", "pub": "jobs", "title": "2017-10-humanities-student-major_2664_jobs.txt", "pub_date": "2017-10-27T00:00:00Z", "Sentiment": "0.15", "Subjectivity": "0.344", "Score": "22", "Upvotes": "0", "Downvotes": "0", "Wordcount": "250", "Permalink": "http://reddit.com/r/jobs/comments/792j7m/have_a_bachelors_in_history_that_im_sure_is/doyv8qz/", "Threadlink": "http://reddit.com/r/jobs/comments/792j7m/have_a_bachelors_in_history_that_im_sure_is", "Parent_id": "t3_792j7m", "Reddit_id": "doyv8qz", "Subreddit_id": "t5_2qhnd", "Commenter": "ArthurCyning", "length": "1735", "content_scrubbed": "Hello, fellow history major here. Here are some thoughts worth considering:\n\n* As soon as I saw that you were working on a teaching career, my mind immediately went to substitute teaching. In my area, subs make $95-110 a day depending on the district. That[.] $13-15 an hour, easy. $18 if you do kindergarten. I would highly recommend this since it is easy to get into, you can start working quickly, and you get experience in one of the most important parts of running a classroom: Classroom Management.\n\n* History degrees are not worthless. In you plan on becoming a history teacher, a professional historian, or teaching college history, then a history degree is really the only choice. Don't buy into the whole STEM degrees are the only degrees that matter. Yes, an engineer will make a higher salary than many humanities degree holders. Nevertheless, a history degree will give you the skillset that is still desirable in the workplace: forming a persuasive argument; conducting solid research; writing well; and understanding human relationships etc.\n\nhttps://www. fastcompany. com/40440952/why-this-tech-ceo-keeps-hiring-humanities-majors \n\nhttps://www. forbes. com/sites/georgeanders/2015/07/29/liberal_arts-degree-tech/#8492fd6745d2\n\n* You are correct in the sense that history knowledge itself would not be useful unless you are directly working in a history related field like I mentioned in my first point. Nevertheless, the skills you developed in pursuit of that degree make you marketable for a host of jobs that have to do with writing. Here are a few: exhibit designer; content creator; business analyst; social media manager; copywriter; editor; et al.\n\nhttps://www. selloutyoursoul. com/2017/02/09/best-jobs-history-majors/"}