{"doc_id": "485", "name": "2017_10_humanities_student_major_2566_samharris", "namespace": "we1sv2.0", "metapath": "", "pub": "samharris", "title": "2017-10-humanities-student-major_2566_samharris.txt", "pub_date": "2017-10-26T00:00:00Z", "Sentiment": "0.067", "Subjectivity": "0.325", "Score": "155", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1229", "Permalink": "http://reddit.com/r/samharris/comments/78u9fa/teaching_maths_perpetuates_white_privilege_says/dox4ypl/", "Threadlink": "http://reddit.com/r/samharris/comments/78u9fa/teaching_maths_perpetuates_white_privilege_says", "Parent_id": "t1_dowz601", "Reddit_id": "dox4ypl", "Subreddit_id": "t5_2thqg", "Commenter": "LondonCallingYou", "length": "7780", "content_scrubbed": "I actually disagree with Gutierrez, even given the full context provided by the comment and (at least the paper you linked).\n\nTo give some background, I've taken upwards of 12 mathematics classes in my University career including graduate level to get a minor, but I have also taken many \"____ - studies\" classes like \"Women[.] studies\" or \"African American studies\" as part of my University[.] requirement for courses outside your major. I'm not trying to circle-jerk about my educational achievement, I'm just giving context to show that I'm somewhat familiar with both Maths and these types of social_sciences. The instructors of these classes actually use approximately the same \"type\" of reasoning and language as Gutierrez as far as I can tell, and it[.] a fairly common one inside modern humanities/social_sciences.\n\nSo let[.] go through a little. First, per the comment on her work:\n\nHer position is that since the practice of mathematics is to some extent dependent on underlying assumptions made by mathematicians, math itself is politicized. \n\nThis is my first issue. I find this way of thinking to be honestly pretty ridiculous.\n\nMathematics is politicized only insofar as you think that the socialization of the Mathematician themselves leaks into the mathematics. However, anyone who has studied Math knows that while there is -some- small amount of subjectivity thrown around (notation preferences, approaches to problems, which problems to solve) there really isn't a whole lot of socialization of the author to be found in Mathematics. Gauss[.] Divergence Theorem is pretty independent of what Gauss thought of black people.\n\nLet[.] go to the author[.] words herself to see why she thinks Mathematics isn't \"objective\":\n\nFor example, the mathematics community has verified neither Kepler[.] sphere packing conjecture nor the classification of simple finite groups - yet mathematics continues its expansion. Moreover, highly theoretical branches of mathematics rely on probability rather than certainty. Yet we continue to view mathematics as truth, not social phenomena. \n\nFirstly, mathematicians taking an inductive leap in order to continue working on an emergent field despite one of it[.] central theorems not being fully proven is not even close to demonstrating that Mathematics (at every level up until very very high level theoretical maths) isn't objective. Secondly... what[.] wrong with probabilities? We use probabilities to solve problems that can't be solved analytically all the time. That doesn't make the answers less \"true\", what determines if they're true (in application) is their usefulness and their adherence to the objective (gasp!) reality of the situation. If your approximation based on a probabilistic method can calculate a flux distribution with precision and accuracy, then I don't really see the issue. It[.] less \"beautiful\" mathematically but still valid. \n\nNext part of the comment interpretation of Gutierrez you linked:\n\nFurther, it[.] politicized in such a way that it emphasizes the achievement of white mathematicians and downplays the participation of non-white participants. \n\nI'm going to be honest, in a math education you kind of do learn mostly theories made by white guys. However, I do not view it as \"emphasizes the achievement of white mathematicians\" and especially don't see \"downplays the participation of non-white participants\".\n\nAt low level math (grade school) we're taught that the concept of zero was independently developed by multiple non-white mathematicians before Europe gained this knowledge. We're taught the number system is derived from the Indian number system and that the Roman number system was really hindering Mathematical progress (it was), and that Inca society had a clever way of calculating astronomical events, and had a hand made calculator of sorts that was used in this.\n\nHowever, if we look historically, something happened around the time where all these non-white contributions ended and all these European contributions to Mathematics really exploded and took over. It[.] called colonialism.\n\nColonialism took over basically the entirety of these societies that were producing Mathematics and all of the countries that weren't even related to Mathematics. As a result, billions and billions of dollars in today[.] equivalent wealth and resources was siphoned into European society, and a lot of it was put to use in the maths and sciences.\n\nThis is why if you're studying mathematics, you're not hearing Roman names, you're not hearing medieval British names, you're not hearing many names at all before the Renaissance and colonialism. You're going to hear a bunch of French guy[.] names (shouts out Laplace) and a bunch of German guys names (like Gauss), because Germany and France were the intellectual capitals of the entire world for mathematics, philosophy, physics, economics, and so on.\n\nThe thing is, while colonialism was racist and horrific, that does not mean that all the fruits of colonialism are racist or prejudiced or influenced in any way by colonialism. The fruit of the poisoned tree, in this case, are not poisoned. \n\nMathematics was created in a social context, true, but just because the authors had a social context doesn't mean that it affected their work. It does not invalidate the rigorous logical methods Mathematicians use to prove theorems. It doesn't affect Mathematics' real world applications through physics that prove (to me at least) that Mathematics is deeply ingrained into the fabric of the universe itself, and the more closely it can predict physical phenomenon, the more \"true\" it is.\n\nBut then Gutierrez goes on to make a claim that I find deeply problematic. She says that reason and abstract logic itself are Western inventions that, essentially, reinforce racism. Even a cursory look at the history of mathematics kind of blows this out of the water. Here are the societies that independently invented the concept of Zero:\n\n* Babylon\n* The Mayans\n* India\n\nTo me, the concept of zero might be the most abstract concept in Mathematics aside from infinity. And notice, 3 non European civilizations came up with this, using logic and reason, the same sort that Europeans would then use.\n\nThis is because logic and reason aren't entirely social constructs, and they actually map to reality. As such, non-European civilizations are perfectly capable of using logic and reason, because there is nothing intellectually different about non-white people that prevents them from doing fucking mathematics. \n\nBut wait! If Europeans didn't invent logic and reason and use it to call everyone else primitive, why didn't the Mayans and the Indians and the Babylonians continue to do abstract Mathematics?\n\nWell, we just went over that: **colonialism**. The Babylonians were destroyed by the Mongols but the Indians an the Central Americans were destroyed by Europeans. That[.] not an environment conducive to producing useless abstract Math. But when Babylon was rich they produced math. When the Indian subcontinent was rich it produced math. When the Mayans were rich they produced math.\n\nRich societies do math. That[.] it. There[.] nothing special about Europeans.\n\nI would go on, but I have class in a few moments. I may continue critique of her ideas afterwards, depending if I can muster the courage to drudge through more social science jargon. \n\nUltimately, unless the author can definitely show that Euler[.] socialization in any way affected his work, or the *truth* of his work, then this entire argument is baseless. I didn't even see a cursory attempt to show this. It[.] just accepted as a truism in the humanities these days that if somebody was socialized in Western culture, their work (which maps directly to reality itself) is somehow tainted. "}