{"doc_id": "955", "name": "2017_04_humanities_student_major_369_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2017-04-humanities-student-major_369_GradSchool.txt", "pub_date": "2017-04-04T00:00:00Z", "Sentiment": "0.13", "Subjectivity": "0.323", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "399", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dftdsml", "Reddit_id": "dfthm00", "Subreddit_id": "t5_2r4r8", "Commenter": "PhD_sock", "length": "2278", "content_scrubbed": " First of all, from my understanding, things were pretty good before we were unionized.\n\nYes, but you don't mention how things got to that point. I can guarantee you it wasn't out of the kindness of NYU administration. \n\nThere were similar conversations where I am--Yale--before the union vote. Of course Yale offers a fantastic package: everyone in the graduate school of arts and sciences receives $30,000 x 6 years (12 months, not 9). It[.] still very modest in an overall scheme of things sense, but in the humanities that[.] probably one of the top 3 stipend packages in the country. And you get excellent healthcare, no fees whatsoever, etc. \n\nSo yeah, people said exactly what you just did: things are pretty good, we've no complaints. Except these people tended to either not acknowledge or be unaware of *how graduate students ended up getting that good a package in the first place*. Incremental steps, fought for and won, almost always by sustained student pressure and activism, by an informal union never recognized by Yale admin, etc.\n\nCorey Robin has plenty of posts on the history of Yale admin vs. unionization since his own graduate days, if you want to read up on it. My point is simple: don't assume that there is no need for a union just because things happen to be decent *now*. That[.] like saying we don't need Civil Rights enshrined in law because we had President Obama. Look where we are now.\n\nOf course this means the potential benefits won't be as large to us, but we aren't necessarily doing this for *us*--NYU, Yale, whatever--as much as for *academe* at large. Public universities have had unions for a long time. Privates are the ones missing out, perennially operating at the whims of university administrations. Unions bring us together, literally. It[.] sort of a future-proof measure if you will.\n\nWhen you consider everything that a union affords, now and in the future, shelling out the price of a pair of good shoes or a decent blazer ($600 applying your 2% to the Yale stipend) honestly does not strike me as a bad deal at all.\n\nI've less to say about the Israel thing as that seems a bit specific to NYU. I've certainly not heard anything like that re: Yale[.] union, and I hope they don't engage in that sort of thing. I hope it works out. "}