{"doc_id": "326", "name": "2017_10_humanities_student_major_918_rmit", "namespace": "we1sv2.0", "metapath": "", "pub": "rmit", "title": "2017-10-humanities-student-major_918_rmit.txt", "pub_date": "2017-10-10T00:00:00Z", "Sentiment": "0.03", "Subjectivity": "0.248", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "350", "Permalink": "http://reddit.com/r/rmit/comments/75cxuj/uni_of_melb_colleges/do61j4v/", "Threadlink": "http://reddit.com/r/rmit/comments/75cxuj/uni_of_melb_colleges", "Parent_id": "t3_75cxuj", "Reddit_id": "do61j4v", "Subreddit_id": "t5_2ta66", "Commenter": "AUSMEL351", "length": "2483", "content_scrubbed": "Well, to answer your questions (at least the latter two):\n\nTo answer your second question: \n\nTL;DR: It will most likely be harder as there is a quota which means competition may be more fierce.\n\nAfter having a look at http://www. colleges. unimelb. edu. au/future-students/faqs. html, \n\nHere is some info from there you may want to see:\n\nSome Colleges and Halls admit only undergraduate and graduate students studying at the University of Melbourne (which includes the Victorian College of the Arts). Others also admit students studying at tertiary institutions other than the University of Melbourne. Colleges and Halls of the University of Melbourne may not admit more than 15% of their resident students from outside the University of Melbourne. Listed below are all the colleges and the institutions they accept applications from. This may change at any time, so please check with the college directly to confirm.\n\nList of colleges:\n\n1. International House: University of Melbourne (with occasional exceptions may consider applications from students attending other Universities).\n\n2. Janet Clarke Hall: University of Melbourne, Monash University[.] Faculty of Pharmacy and Pharmaceutical Sciences and RMIT City Campus students.\n\n3. Medley Hall University of Melbourne students only.\n\n4. Newman College University of Melbourne, Monash University[.] Faculty of Pharmacy and Pharmaceutical Sciences, Melbourne College of Divinity and limited number of RMIT City Campus students.\n\n5. Ormond College University of Melbourne students only.\n\n6. Queen[.] College University of Melbourne, Monash University[.] Faculty of Pharmacy and Pharmaceutical Sciences and RMIT City Campus (excludes Brunswick) students.\n\n7. St Hilda[.] College University of Melbourne and Monash University[.] Faculty of Pharmacy and Pharmaceutical Sciences students.\n\n8. St Mary[.] College University of Melbourne, Monash University[.] Faculty of Pharmacy and Pharmaceutical Sciences, RMIT City Campus students, and ACU students.\n\n9. Trinity College University of Melbourne students only.\nUniversity College University of Melbourne, Monash University[.] Faculty of Pharmacy and Pharmaceutical Sciences and RMIT City Campus students.\n\n10. Whitley College University of Melbourne, Monash University[.] Faculty of Pharmacy and Pharmaceutical Sciences, RMIT City Campus students. In some exceptional cases, ACU students may be accepted.\n\nAs for your third question, I can recommend UniLodge or sharehousing as possible alternatives."}