{"doc_id": "305", "name": "2017_10_humanities_student_major_672_writingprompts", "namespace": "we1sv2.0", "metapath": "", "pub": "WritingPrompts", "title": "2017-10-humanities-student-major_672_WritingPrompts.txt", "pub_date": "2017-10-08T00:00:00Z", "Sentiment": "0.017", "Subjectivity": "0.365", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1795", "Permalink": "http://reddit.com/r/WritingPrompts/comments/753c3e/wp_the_princess_is_to_have_an_arranged_marriage/do3l7ch/", "Threadlink": "http://reddit.com/r/WritingPrompts/comments/753c3e/wp_the_princess_is_to_have_an_arranged_marriage", "Parent_id": "t1_do3l6az", "Reddit_id": "do3l7ch", "Subreddit_id": "t5_2s3nb", "Commenter": "owningmclovin", "length": "9504", "content_scrubbed": "\"RUN\" Harry shouted and with one arm he pulled Moraine up the stairs while he cast another wall, this one blood red flames in place of the blue. The wall was so thick they could no longer even see Rathbone, but neither was foolish enough to think they were safe. Harry turned to follow Moraine, only to cry out in pain and crumple on the stairs. \n\nMoraine turned and saw several things at once. Harry was at her feet, the hilt of a knife sticking out of his back. The red flames were gone, extinguished as soon as Harry fell. Rathbone stood where the wall had been. He had thrown the knife and through either blind luck or something darker, Rathbone[.] knife found it[.] mark. \n\nMoraine was a novice student of magic. She did not have the knowledge and skill necessary even to create her first wand. The Grand Mage had only discovered her aptitude in her late teens. A time he said was far too late to learn the ways of magic. And so it was that only a disgraced reject of the citadel like Harry would even deign to teach her.  The king loved his daughter and when other nobles might have forced their daughters to learn to be proper young ladies, Moraine[.] father allowed her to ride her horse like a man, to learn to duel and fight with spear, before the king grew ill she would often hunt with him, chasing the game on horseback with her bow like some barbarian from a tale the traders would tell by the docks. The king brought Harry to the castle to teach Moraine what he knew. This angered the Grand Mage so much that he left the castle and did not return until the king was almost dead of plague and even then he departed as soon as the king refused to send Harry away. Moraine had learned quickly in two years but it takes far longer to refine and eventually master the arts of magic. She did not know much. She did not even have a wand. But Moraine had raw power. \n\nRage boiled inside her. Rage at her father for trying to give her away to Rathbone. Rage at Rathbone for conspiring against her family and trying to marry her or kill her. Rage most of all at the knife in her beloved[.] back. \n\nThere was no spell, no intricate wand movements, or hours spent studying over old spell books. Energy exploded from Moraine. It was pure wrath, out of her control and dangerous. Rathbone stood for only a moment before he was swept down the hall like a scare crow in a hurricane. \n\nThe danger was not gone. Moraine stooped and found that Harry was not dead. She began to pull out the knife but the hilt glowed red and seared her hand. She hooked her arm under Harry[.] shoulder and thanked her father for letting her grow strong in the forests and training yards. Even though Harry was thin and wiry it was clumsy work to pull him up the stairs. \n\nBy the time Moraine had dragged him into the Entrance Hall, Harry had woken and was now staggering with her help. \n\n\"Halt.\" It was one of the king[.] guards, \"Princess Moraine? My word what has happened? I'll raise the alarm.\"\n\n\"No don't. It was Rathbone. He is.. I don't know how to say it there is something horrible about him and he just tried to kill us. I have to escape I am not safe here.\"\n\n\"Your Highness this is your own house.\"\n\n\"It[.] no good, now please help me.\"\n\n\"Of course, but what about him, is that Young Harry?\"\n\nHarry croaked something but neither Moraine nor the guard could understand. \n\n\"What? My love what did you say?\"\n\n\"The dagger is black steel. I must.. The Citadel.. Must warn.\" Then Harry slumped unconscious. \n\nMoraine almost dropped him as he fell but the guard caught Harry[.] other arm. \"I must go with you then. To the stables.\"\n\nTogether they carried Harry outside. The guard bumped Moraine[.] hand and it burned again just as bad as when the knife hilt seared her flesh. She bore that pain, as it was nothing to the pain caused by the thought of losing Harry.\n\nIt was dawn and sunlight cut beams through the arrow slits forming perfect rectangles on the ground. \n\n\"Well if it isn't the princess.\" A large bullish man called out.  He was a knight wearing a white sir coat embroidered with palms behind a white tower. It was the single of Lord Rathbone. \"You won't be leaving here little princess. If you don't make it too hard, we won't even hurt *you*\"\n\nMoraine and her father[.] guard lowered Harry so he was sitting on the last step. The knight walked towards them flanked by two men at arms. A blond man on the_left, rested his hand one his sword belt while and ugly rat faced man held both arms behind his back as though out for a stroll in the country. Something about the way the rat faced man looked at her, made Moraine switch her sheathed sword from her left hand to her right. The burn flared worse again and Moraine knew she would not be able to fight with it. She was better with the_right hand but her father[.] master at arms had forced her to learn both.\n\nWith no warning the rat faced man revealed the knife he was hiding and slashed across the guard[.] face.  He then reached out to grab Moraine. Moraine[.] sword flashed and red blood spurted from the man[.] neck to join with the red of the dawn light. Before his lifeless body hit the dirt, Moraine lunged this time at the blond man on the_left. This man was quicker a managed just barely to dodge to one side. But he was off balance now and Moraine swung her sword over and around to bury it in the man[.] head. \n\nThe man fell, and took the sword with him. It was stuck in his iron helm. \n\nMoraine felt inside herself looking for the magic she had used on Rathbone in the dungeon. It was no use she could was unable to do it again and had no time to figure out how. \n\nThe giant slammed down his visor and unsheathed his great sword. Dawn[.] red light glistened off the shining steal giving the illusion that it was already covered in blood. With no time to free her sword, Moraine backed away in hopes of drawing the giant away from Harry.  The giant gave chase and Moraine turned and fled to the wall of the keep. In the back of her mind she wondered where the rest of her father[.] guard were could be. \n\nMoraine thought as she ran. The giant was a huge brute and covered head to toe in well-made armor. She would certainly be faster and more agile but she had no weapon and it would take only one strike from the great sword to cleave her in two.\n\nOn the parapet, Moraine found a guard, he was dead at his post. She understood with sudden clarity, Rathbone[.] men had killed her father[.] guard. Father was in danger at this moment, curse Maria for setting this all in motion and damn Rathbone to the worst hell for betraying her father. The guard[.] spear lay at his feet. It was an eight foot ash staff with an iron blade at its head. \n\nThe Giant was on the stairs now, moving far easier than Moraine would have thought possible in all that steel. Expertly she whorled the spear to bring it to bare on the giant. She held the high ground and for a moment neither could advance. Moraine whipped the spear, jabbing and slashing at the big man[.] face and hands, but the giant was just as quick with his great sword. He parried and deflected every blow until at last Moraine struck his helm, but the spear only glanced off the steal visor and the giant swept his sword sideways. The knight broke the spear between the wall and his own sword. Splinters rained on the stairs and he advanced again pressing his advantage now, charging like a mad bull. \n\nMoraine fled again, knocking over barrels, chairs, rocks and whatever else she could find to throw in the big man[.] way.  She put as much room as she could between the big man and herself until she made it to the other stair case. This one was blocked by another dead guard, apparently this man had fought back before they killed him and he died right on the top steps. Moraine crawled gingerly, taking care not to slip in his blood as she made it back to the ground. \n\nMoraine ran back to the blond man and with her boot on his helmet, yanked her sword free. \n\nThe giant roared. He was close now and Moraine had only a moment to react. The great sword came down and Moraine dodged by no more than an inch. The giant stabbed at her belly and steal rang against steal as she swept the blow to the side. They slashed and struck each other. Now charging, now retreating. All over the keep they fought causing clouds of dust to thicken the air. \n\nMore than once Moraine made contact with the large man[.] armor but to no avail, she could not get through it. Twice she stuck his helm, ringing it like a church bell but it seemed to make no difference. The simple strength and size of the man was too much for her. Moraine was sure he must grow tired soon but she was already exhausted herself. \n\nShe knew instinctively that the knight would try to corner her against a wall or a hay cart where should could not evade him, so she moved like a dancer in and out. The giant stabbed again and Moraine jumped to the side but she lost balance and the giant struck her in the face with his chainmail gauntlet. \n\nShe was on her back, the giant straddling her torso. \"I'm going to kill you. The lord said not to kill you if I don't have to but I want you to know I am doing it just because I want to. I'll tell him it was the only way. I'll kill you. Then I'll kill you mum and your dad and your little brother.\"\n\nThere was a bright flash and the giant reared back, covering his eyes as he bent back his head. His neck was exposed and Moraine took her chance. Her sword glided across the man[.] neck. \n\n***more in next comment***\n"}