{"doc_id": "1014", "name": "2017_04_humanities_student_major_876_foodforthought", "namespace": "we1sv2.0", "metapath": "", "pub": "Foodforthought", "title": "2017-04-humanities-student-major_876_Foodforthought.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.146", "Subjectivity": "0.382", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "359", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_646quq", "Reddit_id": "dg02ot7", "Subreddit_id": "t5_2rete", "Commenter": "Julysky19", "length": "2168", "content_scrubbed": "How does a monarch become great?  Is it when they bring peace, religious tolerance, create stability by establishing a proper line of succession, and sponsor the arts and music of a time?  Aurungzeb did the opposite of all these.  The author keeps mentioning we need to judge him by the people of his time, yet the he was intolerant for the people of his time.  Emperor akbar, a legitimately great mughal king was tolerant.  Dara shikoh the eldest son of shah jahan and the major challenger to aurgunzebs throne was tolerant.  The sufis in that area. were tolerant.  \n\nAurungzeb, during his reign killed his three brother in wars of succession, jailed his living father against Islamic tradition, killed a Sikh guru, and overextended his empire with his obsession with ruling the Deccan.  How is he great except in inheritaning a great emprie?  He overextended an empire which fell shortly after his death.  While having the richest empire, and being the richest man of his time he sponsored no significant scholarly research unlike europe at the time.  He built no navy (the technology was there nearby and cough have been bought) which would lead the Dutch and later British to control the surrounding ocean and later colonize india. He implemented a jizya (a tax on non mulsims) which was not always common during the mughal rule (ie akbar).  \n\nThe author is making a lazy attempt at calling out Hindu nationalism, while ignoring am emperor that created so many enemies largely from his embrace of Islamic orthodoxy (again many mughals kings did such as babur, humayun, and of course  akbar)\n\nThis article also ignores the religious politics of the day which I actually find more fascinating and which is central to south Asian political life for the last few hundred years.  Two main political arms of Islam had emerged in the mughal emprie, the more pluralistic sufi brach (emperor akbar, dara shikoh aurgunzebs brother and shah jahans favored son for the throne) and the Islamic orthodoxy which despized emperor Akbar.  Ultimately to consolidate power Aurungzeb adopted the latter branch.  It[.] a fair point, if this is what caused his ultimate demise eventually "}