{"doc_id": "1142", "name": "2017_04_humanities_student_major_2009_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2017-04-humanities-student-major_2009_slatestarcodex.txt", "pub_date": "2017-04-18T00:00:00Z", "Sentiment": "0.047", "Subjectivity": "0.33", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "346", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgetqgi", "Reddit_id": "dgf2e2q", "Subreddit_id": "t5_30m6u", "Commenter": "heterodox_jedi", "length": "1986", "content_scrubbed": "My small college liberal_arts Hillel very much followed what you're outlining here. We did the hamantaschen v. latke debates, we did a discussion between two Jewish professors with very different views about Israel, we did all that stuff. We tried to be really low-barrier, including with our services.  \n \nIn retrospect? I think we actually turned off religious students. We had kids who I know now had gone to day school and who walked into Hillel a couple of times and went right out. Maybe they came back for high holidays, I don't know, but they certainly weren't there for shabbos. I don't know what their religious practices are now. And as student leaders, we spent all of our time/energy on trying to do this kind of open-to-everyone programming that I think we neglected our own Jewish educations. I planned a lot of bagel brunches but when I graduated from college I lacked a lot of really basic Jewish ritual/observance skills, and I stayed that way until I had kids. (I'm working on it now.) And I was certainly not unique in that regard.   \n\nWhich is to say, there[.] a balance, and I don't know if my Hillel was normal or atypical. But the kids who are there regularly don't necessarily know anything, and you can turn off the kids who showed up thinking of themselves as really committed Jews.  \n\n(Also, I think we might share some common interests. I've thought about hosting an SSC shabbos dinner in my area. I've also been thinking about how to sell Hillel on using alumni networks to connect graduating seniors with alumni who will host them for shabbos dinner. This seems like a place where the non-Orthodox really fail - creating continuity so when you move/change life stages, you feel comfortable with a ready-made Jewish community for you, and you have Jewish families modeling kind of the next stage of life. Do you have ideas as far as this stuff, either for the SSC communities or in general? Is this something you might be interested in being involved with?)"}