{"doc_id": "449", "name": "2017_10_humanities_student_major_2183_deepfriedmemes", "namespace": "we1sv2.0", "metapath": "", "pub": "DeepFriedMemes", "title": "2017-10-humanities-student-major_2183_DeepFriedMemes.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "0.02", "Subjectivity": "0.347", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1241", "Permalink": "http://reddit.com/r/DeepFriedMemes/comments/7829kg/f/dortcxr/", "Threadlink": "http://reddit.com/r/DeepFriedMemes/comments/7829kg/f", "Parent_id": "t1_dorn278", "Reddit_id": "dortcxr", "Subreddit_id": "t5_3a7zb", "Commenter": "DBP17", "length": "6442", "content_scrubbed": "**TL;DR** Could've been much worse, could've been much better. I think I got around a 75.\n\nSo, I just finished 10 minutes ago and I am currently sitting in the freezing library. I got to my 8 AM class this morning at 7:40 and continued studying while tired as hell, and then it hits 8 and I can see my teacher in my peripheral vision heading toward me. She says that I need to take it now (some people get to the class early and start taking it so they gave more time) and gives me the test. I reviewed everything except two sections, but whatever. So there are nine problems and the directions say 10pts each unless stated otherwise. I wasn't really looking at the points so I don't really know how much each was, but the only one I noticed was the first one (15pts). So number one and two, easy. The first was partial derivatives (six of them) and the second was a total differential problem. Flip the page and then there are three (#3-5). I think number three was a propagated error problem, number four was an implicit differentiation problem, and number five was a rate of change problem. I'm pretty sure I had that page down for the most part. Also, this morning when I was studying I spent a good 30 minutes studying chain rule because she said it would be on there, but it was nowhere to be found (albeit it was pretty easy). Then the third page, numbers six and seven. I think number six was a directional vector/gradient problem and seven was one where you're supposed to write the equation of the tangent plane. I definitely knew number six, but no idea with number seven so I just wrote something to get a point or two. Flip to the last page and you see number eight and nine. Number eight was a extrema of functions of two variables problem. I had no idea how to do it, but I kinda made up stuff and wrote something like number seven so I could get some points and then number nine was a Lagrange multipliers problem. This is the one I was looking at right before the test. When I was looking at it earlier I remember that there were two parts to it and that the first part was the complicated part where you have to do the majority of the work and the second part was easy so I just focused on the first part. Then when I do the test, I completely forget how to do the second part, so I had my point (x,y), but not the value. So my answer was something like \"Minimum of _ at (6/5, 3/5)\" and then I just put some number from my work in the blank. So overall, I did better than I thought, hopefully around a 75. But I thought I was gonna know nothing and fail because I didn't get any studying done. Now I know this comment has gone on forever, but let me give you guys some backstory. So, first year in college (community college, too dumb to get into a good school) and I procrastinate a lot, but it worked out in high school. Then just the second week of college, I realize that my physics homework that[.] 80 problems is actually way more than that because they have varying amounts of parts, such as, part A-D or some would have part A-H. So I'm trying to do all my physics homework the day before and there is a mountain of homework. Test day comes and I don't finish it (that[.] when homework is due). I think I'm gonna fail the test because I didn't get to study at all because of the homework, but end up getting an 80 because of the homework and getting a bunch of partial credit. Well, the test was on a Friday and then the following Monday, the first Calculus III test. I don't worry about it too much because it should be easy and I gotta finish my physics homework so I could turn it Monday. So I don't really study at all and then Monday comes and I look at the test and realize I knew nothing. I thought I knew a bunch of these concepts, I didn't know anything except a few things. I expected to get below a 50, but somehow with enough partial credit, I ended up getting a 68. I thought to myself, \"This sucks, but whatever. The final replaces your lowest test grade. Sucks I have to use the replace on the easy test, but whatever, I'll just try hard and do good on the rest of the test.\" Then for a few weeks, I procrastinate/slowly do my homework for physics, but I was still trying to catch up on the old homework, which made me behind on the new one that was due and I the physics mountain of homework is piling up, still. Keep in mind I have still have chemistry (but it[.] the lowest one and it[.] really easy for me because it[.] just like the chemistry I took in high school) and I have a religion class (a humanities credit I need and it[.] online and basically just English with religion sprinkled in). These classes are relatively easy, but still eat up time. And also we don't have any homework in calc (there is but it[.] not for a grade, just practice) so I sadly put it behind everything because I have other homework that is for a grade. So the second calc test rolls around and this time I studied a lot more, but not a crazy amount. I also asked the teacher what formulas do we need to know and she said she'll give us formulas for arc length and curvature, but the rest we gotta memorize, so I didn't even bother studying those two things cause I had a limited time to study. I don't know if I misheard her or something, but the arc length formula wasn't on there at all, but curvature was. So I completely missed the arc length problem and then I missed some other things and I got a 70. I was getting pretty worried now cause the final can only replace one test grade. So the grades we have in that class are our five tests (62. 5%), final exam (25%), and quizzes (12. 5% = one test grade). The \"quizzes\" are just the study guides we get for each test and she posts the answers for them online. I have only part of all the study guides done, so I haven't turned any in so that grade is currently a zero. But if I turn all those in and get at least a B for Test 4, Test 5, and the Final I should get a B. Well, I didn't know where this comment was going, I was kinda just rambling. So sorry for the unnecessarily long comment. At the beginning of this comment, I said I got the class 10 minutes ago. Now, it[.] almost been an hour. Apparently this comment is 800 words. Also sorry for any typos and/or grammatical errors, I'm really tired. Also also if you guys wanna see the massive pile of homework [here](https://imgur. com/a/XlkpM). I don't really know how to end this so I'm just gonna write. **END**"}