{"doc_id": "496", "name": "2017_10_humanities_student_major_2707_worldnews", "namespace": "we1sv2.0", "metapath": "", "pub": "worldnews", "title": "2017-10-humanities-student-major_2707_worldnews.txt", "pub_date": "2017-10-27T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.423", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "300", "Permalink": "http://reddit.com/r/worldnews/comments/79650a/nestlé_mars_and_hershey_breaking_promises_over/dozrhg7/", "Threadlink": "http://reddit.com/r/worldnews/comments/79650a/nestlé_mars_and_hershey_breaking_promises_over", "Parent_id": "t1_dozp3zp", "Reddit_id": "dozrhg7", "Subreddit_id": "t5_2qh13", "Commenter": "Ghostlegend434", "length": "1703", "content_scrubbed": "Don't have to be sarcastic, fat is and always has been a healthy source of calories. Look, think back even only 100 years ago. What did everyone eat? I can tell you now the only major source of carbohydrates were from vegetables and how many people were dying from CVD? Fuck all. Fats have been essential to humanities survival since the dawn of time. The reason for the increase in CVD in the last 40-50 years has been from an increase in carbohydrates and sugars. \n\nSugar, or glucose which all carbohydrates break down into directly increase cholestrol, LDL or \"bad cholestrol\" by a significant amount. There are essential fatty acids but there are no essential carbohydrates. Studies have shown that those in ketosis, which is a state whereby you are providing 70-80% of daily calories from fats, show a *decrease* in that LDL, and an increase in HDL or \"Good cholestrol\" although overall cholestrol levels were lower, which is a good thing. By providing 9 calories per gram from fats as opposed to 4 from carbs you get more for your money when it comes to nutrition and providing a source or rather storage of long-lasting energy.\n\nThe reason glucose gets used up first doesn't mean that[.] it[.] the preferred source of energy, it[.] toxic so the body clears itself from the toxin. It[.] the same story with alcohol, if you applied the same logic then does that mean we should only live off alcohol because our body gives priority to burning that first over fats and glucose? The body was designed to run off fats and if it wasn't humanity as a species probably wouldn't be here right now. Processed fats from canola and vegetables, as well as trans fats are a different story. Those will fuck you up. "}