{"doc_id": "532", "name": "2017_10_humanities_student_major_3009_riceuniversity", "namespace": "we1sv2.0", "metapath": "", "pub": "riceuniversity", "title": "2017-10-humanities-student-major_3009_riceuniversity.txt", "pub_date": "2017-10-31T00:00:00Z", "Sentiment": "0.019", "Subjectivity": "0.292", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "252", "Permalink": "http://reddit.com/r/riceuniversity/comments/79tzhf/is_it_possible_to_double_major_in_chemical/dp4v422/", "Threadlink": "http://reddit.com/r/riceuniversity/comments/79tzhf/is_it_possible_to_double_major_in_chemical", "Parent_id": "t3_79tzhf", "Reddit_id": "dp4v422", "Subreddit_id": "t5_2s3mw", "Commenter": "arkayos", "length": "1349", "content_scrubbed": "Possible, but you have to plan in advance and you have to take higher than average hours (think 18-20 rather than 15) per semester. I think you even need to petition the dean to take more than 18 now? Can't recall. It helps if you took AP anything to get those credits out of the way. Check out the CHBE department online, they should have a suggested schedule for completing the BS posted. They'll tell you what classes to take and what semester. Do breadth requirements for one less credit. Then check out the English major reqs. You will probably get what is called a dual degree, which is essentially a BS in chbe and a BA in english. The best part about that will be that you get all your D1 credits out with the other major, as long as you take one humanities class outside of the department. You'll still have to work really hard to balance the two as there is virtually no overlap. Chbe in itself is a hard enough major that I barely completed in a sane and healthy way. \n\nIf you are a new student (fall 2018) then your advisors will help you out during oweek. You'll basically get hours and hours of prep time to talk to current students about that decision. If you're a current student, you should ask around and plan on taking your freshman year reqs right away. You can drop one major at any time, but it[.] almost impossible to un-drop. "}