{"doc_id": "1125", "name": "2017_04_humanities_student_major_1894_girls", "namespace": "we1sv2.0", "metapath": "", "pub": "girls", "title": "2017-04-humanities-student-major_1894_girls.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.031", "Subjectivity": "0.422", "Score": "15", "Upvotes": "0", "Downvotes": "0", "Wordcount": "436", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgd4hgm", "Reddit_id": "dgd6cs9", "Subreddit_id": "t5_2qj0h", "Commenter": "ich_habe_keine_kase", "length": "2431", "content_scrubbed": "I still take issue with Hannah[.] job and house, and find it extremely unrealistic, almost insultingly so. And of course with Marnie[.] desire to go back to law school, I know they want to write her personality as potentially being a good fit for a lawyer. But this was never explored in any way prior to this episode, and especially for this show, any character who wants to go into academia apparently can.\n\nThese are the issues I had too.  I'm just finishing up grad school (in the humanities), and have zero in-field job prospects.  In academia, it[.] all about waiting for someone to retire or die and then competing with hundreds of other people for that one gig.  Nobody just gets given jobs like that, especially when they're not even qualified.  If I was a student and had a 28 year old professor who didn't even have an MA, I'd feel like I wasn't getting my tuition[.] worth!\n\n(That[.] been an issue all series, too.  As much as I didn't like the Gilmore Girls miniseries, that at least did a much better job showing how hard it is to make is as a freelance writer.  Hannah had short periods of unemployment but only when it helped the plot.  Generally, she did unrealistically well.  And while her apartment isn't nearly as bad as your standard sitcom apartment, I still have no idea how she paid rent each month.)  \n\nAnd that house, Christ.  I grew up in Upstate--that is not the house of a single mother adjunct professor who is living either someone who seemingly doesn't have a job.  Most of my real professors (in both college in central NY and grad school in DC) don't have houses that nice.\n\nThe once thing I didn't have an issue with was Marnie wanting to be a lawyer.  That[.] such a Marnie career, nd Marnie getting into law school wouldn't be nearly as unlikely as everything Hannah got.  Law school isn't med school--it[.] not particularly difficult to get in (although it[.] very hard to get into the good ones).  I imagine she[.] got a pristine undergraduate record, and all she would need would be a halfway decent score on the LSATs, which I'm sure she could do.  As far as never mentioning it, I think that fits Marnie too.  She was all about image and what people thought of her, and in recent years wanted to be seen as a free spirited, almost bohemian musician, not uptight Marnie Michaels like always.  She wouldn't tell people she wanted to be a lawyer, because that doesn't fit the persona she constructed."}