{"doc_id": "1111", "name": "2017_04_humanities_student_major_1808_wearethemusicmakers", "namespace": "we1sv2.0", "metapath": "", "pub": "WeAreTheMusicMakers", "title": "2017-04-humanities-student-major_1808_WeAreTheMusicMakers.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.024", "Subjectivity": "0.466", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "643", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65m9f1", "Reddit_id": "dgbuvho", "Subreddit_id": "t5_2qmah", "Commenter": "Th3Novelist", "length": "4398", "content_scrubbed": "*Inhales deep*\n\n- Trump administration will cut every endowment for the arts, all funding for NPR and local news subsidies, and finally cave to/dump remaining funds into STEM proliferation instead. Well, at least once something of technological significance comes out of the whole US/NK/China/Russia/Superpower tensions thing (ie, state funded green energy, IP backdoor, the future survival of humanity, etc)\n\n- The now-complete Supreme Court will rule on an ever-growing Ticketmaster/Live Nation Monopoly. Since they basically own every major venue (aside from certain mafias), TM/LN will concede a concert-goers right to both film *and* broadcast at a live show in exchange for plea deal immunity from a litany of stacking lawsuits. The FED will back down like pussies in the name of jobs, *maybe* one exec or CEO goes to clubFed.\n\n- Venues big and small will panic until someone is crafty enough to set up unethical house WiFi signals that are bricked, all while telling concertgoers to \"log on for better Facebook Live Streaming!\" (idiots!) while the house streams via dedicated basement servers for ultimate clarity. \n\n- The industry will see a boom in a new niche trade: VR Concert Surrogate. Snarky, caustic Photogs who used to sneer from the VIP barricade will be replaced by millennial scabs in varying sections willing to do it for free or a comped bar tab for them and a plus one. Only catch is wearing a weird MoCap GoPro headpiece that makes you look like [Pinhead from Hellraiser](http://vignette1. wikia. nocookie. net/hellraiser/images/4/4a/960. jpg/revision/latest?cb=20160204075810).\n\n- Venues will have to reinvent themselves for a bigger market pull/lost profits. Hiring Celebrity VR Concert Surrogates, up and coming YouTube stars with XMillion followers, eventually branding themselves as content holders and charging a subscription or PPV fee for non-ticket holding fans wishing to stream the same concert and sacrifice the live experience on the cheap.\n\n- In keeping with business as usual, aforementioned Supreme Court will finally rule on the legitimacy of internet radio licensing and royalty payouts (namely streaming services like YouTube and Spotify). To further maintain a stable economy (*cough keep jobs cough*), they will cite specific (or rather, extremely vague and blanket-y) language that never reflected any technological revolution of any kind. Instead, they'll rule that paying $. 09 per unit sold (since the 19-freaking-30[.], 100 years ago at this point) over it[.] lifetime is more than fair when you consider the minimum wage to hourly ratios for the Common Man, adjusted for inflation all with some bullshit algorithm; and that technically if the servers act as jukebox, and the venue is someones bedroom/living room/car less than 3750 square feet, it[.] considered covered under the same laws that protect restaurants from excessive licensing fees. Slash something equally semantic.\n\n- Philanthropy skyrockets, mostly among Liberals and other anti-Trump supporters, tipping arts endowments and funding for public broadcasting into a new golden age while ironically championing the free market. \n\n- Quality artists resurface en masse. We'll honestly probably get another freakshow Mickey Mouse Club success story going again, where the likes of Brittany Spears, Justin Timberlake, Christina Aguilera and more all used to work on the same tv set and eventually went on to make it respectively.\n\n- Facing contradictory legal precedent and conflicting, outdated language, a liberal president will be elected on the strongest platform of arts education and endowment to date. Her administration will push and ratify extreme changes in copyright and intellectual property law that will end up operating more like a cartel that subsidizes losses for the eldest members while \"protecting the family\" for anyone with X number of views/plays.\n\nHonestly, that[.] just the first ten years or so. Fifty years from now? Fuck... probably more like [Wall-E](https://jonnegroni. files. wordpress. com/2015/04/1322337746_b504365daffc. png?w=1200), considering they've made an algorithm to create music based on brain signals and stimulation instead of personal preference [as of today on Reddit](https://qz. com/959683/brain-fm-and-other-music-streaming-apps-can-now-curate-music-based-on-your-brainwaves/). At that point, music is merely another perfectly succinct, calculated drug."}