{"doc_id": "249", "name": "2017_10_humanities_student_major_194_ottawa", "namespace": "we1sv2.0", "metapath": "", "pub": "ottawa", "title": "2017-10-humanities-student-major_194_ottawa.txt", "pub_date": "2017-10-03T00:00:00Z", "Sentiment": "-0.053", "Subjectivity": "0.316", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "281", "Permalink": "http://reddit.com/r/ottawa/comments/7417ka/how_5_ottawans_are_dealing_with_crushing_student/dnup6d7/", "Threadlink": "http://reddit.com/r/ottawa/comments/7417ka/how_5_ottawans_are_dealing_with_crushing_student", "Parent_id": "t3_7417ka", "Reddit_id": "dnup6d7", "Subreddit_id": "t5_2qpoo", "Commenter": "Attowo", "length": "1667", "content_scrubbed": " The average wage for an Indian person would be around $8,000 Cdn yearly. So considering the fees here are $30,000 a year, it[.] like four times the normal wage of an Indian person just to pay the [tuition].\n\nOK, Mr. Godwin Scott, but you're not going to go back to India with your Canadian engineering degree just to make $8k/year. You're going to stay in Canada and make $80k+ out of university and pay off your debt in a couple years.\n\n Graduated in 2015, with a law degree from University of Ottawa. \nGraduated with approximately $150,000 of debt.\n\nUnless you come from a rich family that pays for everything isn't that normal? Again, you're going to have no problem paying it off and by the time you become a partner at your law firm you'll be a millionaire.\n\n Holds a Bachelor degree in animal biology from University of Guelph.  Currently a second-year medical radiation technology student at Algonquin College.\n Expects to graduate with approximately $50,000 of debt.\n\nOK, maybe you shouldn't have gotten that animal biology degree. I've seen this happen plenty of times. Parents push kids into getting a degree that they don't want or is not viable in this job market, and then go to college to get some real skills.\n\n Third-year PhD student in law and legal studies at Carleton University.\n Approximately $12,500 in debt.\n\nYou serious? That[.] nothing.\n\n Fourth-year humanities student at Carleton University.\n Approximately $15,000 in debt.\n\nAgain, this is nothing.\n\nSeriously, what the hell is the point of this article? Is the bleeding-heart CBC trying to guilt us into paying for foreign students tuition and living expenses or is it just a slow news day?"}