{"doc_id": "450", "name": "2017_10_humanities_student_major_2191_socialism_101", "namespace": "we1sv2.0", "metapath": "", "pub": "Socialism_101", "title": "2017-10-humanities-student-major_2191_Socialism_101.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "0.058", "Subjectivity": "0.241", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "503", "Permalink": "http://reddit.com/r/Socialism_101/comments/7884u3/finding_my_socialism_i_need_help_on_a_few_matters/dorwudr/", "Threadlink": "http://reddit.com/r/Socialism_101/comments/7884u3/finding_my_socialism_i_need_help_on_a_few_matters", "Parent_id": "t3_7884u3", "Reddit_id": "dorwudr", "Subreddit_id": "t5_2ys9x", "Commenter": "bwana22", "length": "2892", "content_scrubbed": "1) What happens to the entertainment industry (Hollywood etc) under socialism? How will the arts function without millions of dollars of investing? If it is procured by the state, wouldn't this risk art[.] ability for political critique? If investors with millions to spend do still exist under socialism, will they count as capitalists?\n\nAs someone involved in the arts, I can tell you funding actual projects is not the issue with arts in capitalism, the issue with arts in capitalism is having to sell your art to get by and make enough to eat. \n\nAt the moment in a lot of underground music there is a trend to work with the capitalists and get brands involved. There are advantages to this for the artist, it means fast payment for your work, it means you can get by, even if collectivizing would mean being more comfortable in your living, people generally are pretty scared about working together because there is a huge risk of it failing and the people involved not getting any return from the work they do.\n\nPeople who work with these brands and labels which put profit first end up forcing out work just for the sake of selling it, to survive. Few people get the time to slow down and work on one project for a long period of time, targets must be met in order for profit. This is how large labels in capitalism run, how brands getting involved in music work. \n\nThe difference in socialism is that some of the more basic things that can be done with little funding (as everything else like food, housing and so on is already supplied for). In reality most art does not require big budgets, just enough to keep the artist surviving.\n\nThere are co-operative projects out there at the moment for arts, music etc. People working together, pooling together resources and creating things out of it. I imagine this is something that would happen a lot more often in socialism, as the incentive to create enough to survive is not there. \n\nWe already have state sponsored art in the capitalist world, in the form of grants, most governments don't set guidelines on how said art should be made, nor is there a political aspect to it.\n\nHowever, at the moment, majority of arts grants goes towards feeding and housing the artist.\n\nIf investors with millions to spend do still exist under socialism, will they count as capitalists?\n\nYeah I'm not sure why you'd think investors would exist in socialism. Investors are capitalists.\n\nGenerally, my understanding of socialism is that art is encouraged, we have a lot to thank for art, music and so on. So there would certainly be communities which would go out there way to make sure the arts can keep going and that artists can live comfortably like everyone else.\n\nAlso, if talking specifically about entertainment, people want to be entertained, entertainment as a thing existed well before capitalism, and it will continue to exist in socialism. "}