{"doc_id": "1234", "name": "2017_04_humanities_student_major_2927_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-04-humanities-student-major_2927_AskHistorians.txt", "pub_date": "2017-04-25T00:00:00Z", "Sentiment": "0.122", "Subjectivity": "0.333", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "859", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgrg1ru", "Reddit_id": "dgrirs0", "Subreddit_id": "t5_2ssp3", "Commenter": "Elm11", "length": "5704", "content_scrubbed": " Can you tell me about some of these problems?\n\nIt[.] no problem at all to talk about the problems! Ranting about Reddit has to be at least two of my favourite hobbies!\n\nThe openness and the public outreach aren't the problems, nor do those problems stem from /r/AskHistorians ourselves (except perhaps for our non-hierarchical moderator team structure, which does generate a lot of inertia against major changes to the way we operate). \n\nRather, our problem, not to put too fine a point on it, is that Reddit is full of racists. This website is very much a mixed blessing for us, since it provides us with our readership and puts us into contact with thousands of people who might never have had any interest in history or the humanities, but who stumble across us through the day to day publicity we receive through Reddit. But it[.] also home to some of the most vile communities you'll find on the Internet. There are [.]ubreddits' - you're probably aware of how Reddit[.] subdivisions work - dedicated to White Supremacy, misogyny, antisemitism, Holocaust denial, the sexualisation of minors and every hateful ideology under the sun. Being in proximity to these communities has a twofold effect. Firstly, it tarnishes our name irrevocably. We might operate entirely independently from any of these groups, but we're still \"part of the same website.\" It[.] for this reason that I wouldn't dare list my involvement on /r/AskHistorians on my resume. Imagine in interviewer googling \"Reddit\" and the first thing they see is [a community dedicated to hating overweight people](https://www. businessinsider. com. au/reddit-bans-r-fatpeoplehate-the-community-furious-ellen-pao-2015-6?r=UK&IR=T), or [a community dedicated to sexualising minors](https://www. dailydot. com/news/reddit-bans-suggestive-sexual-content-minors/). It says a _lot_ that Reddit has its own Wikipedia page dedicated to its [controversial communities](https://en. wikipedia. org/wiki/Controversial_Reddit_communities). So that[.] one issue: The website which we rely upon for our readership is toxic and has a toxic reputation. \n\nThe second issue is with this proximity is that it greatly increases our workload as moderators, since it[.] not uncommon for extremists from any number of these communities to attempt to foist their bigotry here on /r/AskHistorians. Nowadays this is part and parcel of working here and our team has become very proficient at dealing with it. But particularly in the early days of /r/AskHistorians, there were a number of occasions when 'raids' organised from other websites such as 4chan would coordinate large numbers of users to bombard /r/AskHistorians with bigotry, Holocaust denial, or so on. Nowadays we have the manpower and the reputation that nobody bothers to launch coordinated attacks on us, but it[.] still not uncommon to see a \"front page\" thread^1 about a controversial issue (racism, sexism, sexuality, slavery, and genocide being the worst offenders, with some more bizarre topics like linguistics and cooking also being frequently problematic) with hundreds of sub-standard responses ranging from inane jokes to bigoted slurs, all of which have to be removed and dealt with by the moderation team in order to keep the quality of /r/AskHistorians content high.\n\n---\n\nAs a final note, a major challenge we face as a result of Reddit being our platform is demographic. Reddit is overwhelmingly young, white, straight, male and American, and /r/AskHistorians demographics (our most recent census can be found [here](https://www. reddit. com/r/AskHistorians/comments/5fx1xc/census_500k_results/)) reflect that. This demographic base is _extremely_ apparent in the trends of questions which get asked, much to the chagrin of the moderation team and the flaired community. Topics which don't generally appeal to young, white, straight male Americans are both asked less frequently, and receive far less attention (that is, fewer 'upvotes') than those which appeal to that demographic. This means, for instance, that questions about niche topics and non-Anglo-Saxon regions receive too little attention. Conversely, it also means (to paraphrase a description from our presentation to January 2016 AHA) that \"AskHistorians has probably the world[.] largest collection of trivia about Hitler.\" Let me tell you, Reddit _loves_ Hitler (a little too literally, but in this case mostly they love talking about him) and questions about Hitler, World War Two, conflict and military history are vastly over-represented in our readership compared to, say, their ongoing focus in peer-reviewed publications. As a moderator team and a flaired community, we of course do our best to encourage fresh questions and perspectives on topics other than the extremely-well-beaten-path of WWII militaria, through programs such as our weekly theme. At the same time, we don't deploy moratoriums against questions we consider \"over-asked\" (no matter how much we'd like to!\") because, in short, we believe that if people are interested in asking those questions, it[.] better that they ask them here where we can guarantee a quality response, rather than elsewhere we lord knows what could happen. /u/Georgy_K_Zhukov (whose monika really isn't helping in this conversation, dude! :P) has described that dilemma in far finer wording elsewhere, but I can't track it down.\n\nApologies for another disjointed response. If there[.] anything else you'd like to know, I'm more than happy to help!\n\n1.  That is, a thread here on /r/AskHistorians which becomes sufficiently popular that it will turn up on the front of the Reddit website itself, thereby being exposed to large numbers of users unfamiliar with our community and its standards"}