{"doc_id": "309", "name": "2017_10_humanities_student_major_699_simonfraser", "namespace": "we1sv2.0", "metapath": "", "pub": "simonfraser", "title": "2017-10-humanities-student-major_699_simonfraser.txt", "pub_date": "2017-10-08T00:00:00Z", "Sentiment": "0.049", "Subjectivity": "0.465", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "264", "Permalink": "http://reddit.com/r/simonfraser/comments/74f19j/question_about_applying_for_computer_engineering/do41f7d/", "Threadlink": "http://reddit.com/r/simonfraser/comments/74f19j/question_about_applying_for_computer_engineering", "Parent_id": "t1_do3v7jj", "Reddit_id": "do41f7d", "Subreddit_id": "t5_2rlf7", "Commenter": "Ham-tar-o", "length": "1953", "content_scrubbed": "My bad, Computer Engineering. Still MATH 150, though\n\nEngineering is one of the paths that other universities and colleges make it easiest to transfer to. They have pages that show what classes directly transfer like this https://langara. ca/student-services/counselling/university-planning/sfu/applied-science/engineering. html and this https://www. douglascollege. ca/~/media/57BF582A5BA0482D95C4ABE1A1CCE8CB. ashx?la=en\n\nI'd still recommend going elsewhere first unless you have scholarships/grants that cover the cost. You'd think that your tuition being more expensive would somehow benefit you, but at university you're teaching yourself using the textbook--lectures are just for review. You get more benefit at whatever university/college is closest to home because then you get back to studying faster (bus and train are low-quality review times).\n\nAll that said, if you insist on only going to SFU (which I regret doing), just finish your courses and do it. They may admit you to the Arts faculty instead if you don't get in, or general sciences. Just take whatever courses you're able to get into (some are competitive to get into unless you're already in Engineering), as if you're already in. After you complete enough of the first-year courses, you'll be able to apply to transfer into Engineering. \n\nCheck out Systems Engineering and Mechatronics as well.\n\nFor Calc I help, Google:\nTrevTutor, PatrickJMT, KhanAcademy, MathBFF, purplemath, WolframAlpha\n\nAnd for general University studies, I'm not a huge fan of College Info Geek, but he typed this up which is pretty good: https://www. evernote. com/shard/s33/sh/978feb82-1f4b-4e6b-afb7-ccad8375e28e/a5e49b16353adea8\n\nhttp://www. lib. sfu. ca/about/branches-depts/slc/learning/exam-prep/efficient-effective-study\n\npaying special attention to\n\nThe recommended amount of time to spend on your studies is 2-3 hours per credit per week (4 hours per credit per week for Math classes), right from week 1. "}