{"doc_id": "501", "name": "2017_10_humanities_student_major_2735_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2017-10-humanities-student-major_2735_AskAcademia.txt", "pub_date": "2017-10-28T00:00:00Z", "Sentiment": "0.125", "Subjectivity": "0.304", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "576", "Permalink": "http://reddit.com/r/AskAcademia/comments/7999h1/any_teaching_stream_professors_in_the_sciences/dp0a5r1/", "Threadlink": "http://reddit.com/r/AskAcademia/comments/7999h1/any_teaching_stream_professors_in_the_sciences", "Parent_id": "t3_7999h1", "Reddit_id": "dp0a5r1", "Subreddit_id": "t5_2sakj", "Commenter": "Rtalbert235", "length": "3352", "content_scrubbed": "Has anyone here gone straight into teaching from a PhD? \n\nI finished my PhD in mathematics 20 years ago at a top-20 research university in the US and went straight into teaching at a small liberal_arts college. I've been in teaching-intensive positions ever since. \n\nWhat kind of universities offer teaching-only post docs or any post-phd position (bonus points if in US, that[.] where I'm looking to move next)? \n\nAs another person mentioned, there are little to no positions that are literally \"teaching _only_\" unless you go with adjunct or affiliate faculty positions. Tenure-track positions always involve teaching plus research and service, although the mix of those three varies widely. My first TT job at a small liberal_arts college was probably 70% teaching, 25% service, 5% \"research\" which was construed broadly (eg. going to conferences regularly was considered adequate scholarship). Today I'm at a large public university in the Midwest and it[.] more like 50/25/25 and we are expected to publish a little. \n\nIf you got into teaching right after PhD, how did you do it? \n\nOther than the obvious advice of targeting your search toward schools that emphasize teaching, what helped me as a grad student was to teach as much as possible while getting my PhD. I worked at a Sylvan learning center-type tutoring place; taught classes through a teaching assistantship; got an adjuncting gig at the local community college. Also learn as much as you can about teaching and get involved with teaching communities -- e. g. if your university has a Center for Teaching and Learning, go to the workshops it offers and see how you can get involved. Read books about teaching, join professional organizations that focus on teaching, etc. When I was on the market, all that experience really added up and I honestly had no problem finding a position, because so many PhD[.] simply don't put a lot of effort into teaching. So any significant effort makes you stand out. \n\n How did you find the work compared to being in the lab 90% of the time? \n\nI wasn't researching 90% of the time -- it was more like 70% of the time because I was getting teaching experience. You may need to think about dialing back your research if you are aiming for a teaching position. But, I liked teaching way more than mathematics research and I still do. \n\n Is there anything you wish you'd known about a teaching-only post at a university before you got into it?\n\nI wish I had known just how much the amount and diversity of the work that you do ramps up when you move from student to faculty member. \"Ramps\" is not the_right word actually because that implies a gradual, if steep, continuous increase. It[.] more like suddenly being shot into space. I went from working 50 hours a week on my dissertation and 15 hours a week on the classes I was teaching, to 80 hours a week working on -- well, everything as a faculty member including four course preps which included two courses I'd never taught before, plus committees plus getting my thesis published. It was punishing and I did not in any way have my sh*t together. So hear me on that, and also start working _now_ on developing good habits of managing time, tasks, and projects for example using [Getting Things Done](http://a. co/csGI4hq)  or some other philosophy that you can learn now while life is relatively simple. "}