{"doc_id": "384", "name": "2017_10_humanities_student_major_1457_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2017-10-humanities-student-major_1457_slatestarcodex.txt", "pub_date": "2017-10-16T00:00:00Z", "Sentiment": "0.072", "Subjectivity": "0.38", "Score": "48", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1112", "Permalink": "http://reddit.com/r/slatestarcodex/comments/76o422/were_there_dark_ages/dofs0yr/", "Threadlink": "http://reddit.com/r/slatestarcodex/comments/76o422/were_there_dark_ages", "Parent_id": "t3_76o422", "Reddit_id": "dofs0yr", "Subreddit_id": "t5_30m6u", "Commenter": "yodatsracist", "length": "6985", "content_scrubbed": "A couple of disjointed things this makes me think about:\n\nFirst off, a period seen by some as the end of, or at least a pause in, the Dark Ages is the [Carolingian Renaissance](https://en. wikipedia. org/wiki/Carolingian_Renaissance), a fascinating if limited period. Unlike Thomas Aquinas! Gothic cathedrals!, et al., it[.] squarely within Scott[.] 500-1000 CE period (maybe 768-840 CE, generously), and represents a flowering of the state, written records, and the arts. I don't know precisely know how it affects things like GDP, long distance trade, and mining, but those two categories seem decently correlated in European antiquity. It[.] not really a challenge to the idea of a Dark Age, however, as you can't have a renaissance, a rebirth, without a death. The Renaissance humanists took the Carlongian minuscule to be the \"Roman hand\", because that[.] how much of the manuscripts came down to them, giving us after many changes our modern \"italic scripts\" that[.] based on the learning of Charles the Great[.] court Franco-German court, not anything in Italy.  This Carolingian renaissance was short lived, as one 9th century writer quoted on the Wikipedia page puts it:\n\nCharlemagne was able to offer the cultureless and, I might say, almost completely unenlightened territory of the realm which God had entrusted to him, a new enthusiasm for all human knowledge. In its earlier state of barbarousness, his kingdom had been hardly touched at all by any such zeal, but now it opened its eyes to God[.] illumination. In our own time the thirst for knowledge is disappearing again: the light of wisdom is less and less sought after and is now becoming rare again in most men[.] minds.\n\nAsk almost any French person \"who invented school\" and they will tell you Charlemagne (though this is mostly due a silly song they all learned more than historical fact). This \"false dawn\" is one of the most interesting Dark Ages events, at the very least worth a mention. \n\nSecond off, the Dark Ages, and the collapse of the Western Roman Empire, is one of the clearest challenges to [whiggish history](https://en. wikipedia. org/wiki/Whig_history). Now, there are a lot of Neo-Reactionaries here for whatever reason who by definition need no education on the problems with Whig history, but there are also a lot of techno-futurists who seem to believe that better living through science will always make everything better and better forever, amen. Fukuyama gets a bad rap because people read him unfairly, but I think he[.] probably righter than he is wrong. He still wrote a very Whig intellectual history, which I don't recall dealing with an issue like Roman decline, where almost everyone agrees the subsequent system is worse than the present one but the motivations of individual actors lead down the path of decline (see also: illiberal democracy). \n\nThird, while Petrarch called the ages dark in comparison to the light of classical antiquity, as Scott mentions, other later writer have used Dark Ages to refer to a relative paucity of surviving sources, as Scott also mentions. Hence, the Greek Dark Ages, the Dark Ages of Cambodia, Irish Dark Age, and even the Byzantine Dark Ages, when the empire still existed after the first wave of Muslim invasions, but went two centuries leaving very few works. Some of this is a result not of the contexts but in what survives. Hence, some people think there may be a coming \"[digital dark age](https://en. wikipedia. org/wiki/Digital_dark_age)\" where much of what we currently write just disappears to history. People think if this not just in terms of collapse, but in terms of obsolete file formats and storage materials (Zip drives were once archival, now they're incompatible).  Computers seem to crash less these days, and hard drives seem to be less corruptible (knock on wood, I still have most things in my Dropbox too), but I know I suffered some devastating digital Dark Ages in high school and college.  There are stretches of my life I have almost no pictures from, because they were all digital and lost. \n\nFourth, a few small factual notes. First, Vasari is certainly a historian. Sure, he[.] more a historian in the sense that Herodotus is a historian not the sense that van Ranke is a historian, but like his *Lives* is one of the major sources for the men he wrote about. And as for major authors in the Dark Ages, Boethesis, Bede, St. Benedict and the Beowulf poet are all important people who wrote between 500-1000 CE. And while literary accomplishments were few, there were significant artistic accomplishments in Western Europe, but mainly either around the Carolingian court or the Insular Celtic tradition and nothing in a monumental tradition. Still, y'all gotta peep that [Book of Kells](https://en. wikipedia. org/wiki/Book_of_Kells) and them [Lindisfarne gospels](https://en. wikipedia. org/wiki/Lindisfarne_Gospels) (the Wikipedia pages don't do them justice, missing for instance the [iced out cover of the Lindisfarne gospels](http://news. bbcimg. co. uk/media/images/66487000/jpg/_66487096_lindisfarnegospelsfrontcover. jpg)), and know that those are not isolated examples but rather the most famous examples of an extensive tradition. \n\nThere[.] also fascinating Dark Ages poetry. In the English world, we know Beowulf best, but there[.] beyond that.  /u/epistaxis has already pointed to my favorite, but there[.] beyond that, like [the Wanderer](http://poemsoutloud. net/audio/archive/delanty_reads_the_wanderer/). The most famous section of it inspired JRR Tolkien (obviously), specifically his Lament of the Rhorrim. Here[.] one well known translation of the most famous part of the poem:\n\nWhere is the horse gone? Where the rider?\n\nWhere the giver of treasure?\n\nWhere are the seats at the feast?\n\nWhere are the revels in the hall?\n\nAlas for the bright cup!\n\nAlas for the mailed warrior!\n\nAlas for the splendour of the prince!\n\nHow that time has passed away,\n\ndark under the cover of night,\n\nas if it had never been!\n\nI know the Anglo-Saxon tradition best because, well, I'm American educated in English, but there are other traditions. However, as far as I can tell, most, whether the Norse eddas or the German Niebelungensaga which inspired Wagner to write the Ring Cycle, seem to have not been written down until (centuries) after the end of the Dark Ages. It[.] interesting how oral these works are, apparently like Homeric poetry, and apparently unlike most later Greek and Latin poetry. Walter Ong has this fascinating book called *Orality and Literarcy* (I think he confuses changes in *genre* that come with technology with changes in *thought* that come with technology, but still wonderful), and great Albanian novelist Ismail Kadare has a great book called *the File on H.* about two Western scholars attempting to study 20th century Albanian oral epic poetry and end up caught up by the secret police. \n\nAll four of those are meant as disconnected marginalia, not as things to take away from the main point of this post. "}