{"doc_id": "968", "name": "2017_04_humanities_student_major_481_republican", "namespace": "we1sv2.0", "metapath": "", "pub": "Republican", "title": "2017-04-humanities-student-major_481_Republican.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.044", "Subjectivity": "0.381", "Score": "22", "Upvotes": "0", "Downvotes": "0", "Wordcount": "965", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63l7jv", "Reddit_id": "dfv77c4", "Subreddit_id": "t5_2qndt", "Commenter": "cazort2", "length": "5650", "content_scrubbed": "I am appalled by the increase in tuition at colleges and universities in the U_S  It[.] not limited to public universities though, it is across the board, at fully-private, and public-private hybrid models as well.  Some of the worst waste I have actually seen has been at fully private universities, I went to a wealthy liberal_arts school for undergrad, and an ivy league for my second round of grad school.  These schools have had their tuition skyrocket.  I think the culture of academia is somewhat uniform... what happens at one school often ends up happening at other schools, and the culture of public and private schools tends to change in lock-step, when it comes to the specific practices of many departments within these schools.\n\nMy mom is a retired college professor who took on some important administrative roles later in her career, and she has talked to me at length about this.  From what I've heard from insiders in academia, rising tuition costs are largely a function of increased support staff that did not exist in past generations, all sorts of new internal departments, many of which are actually highly beneficial to students, things like counseling centers, student health, tutoring services, writing centers, aspects of the library system, more extensive residence life administration, the list goes on and on.\n\nI do think, however, that colleges and universities, both public and private, could trim costs substantially.  I have seen some alarming levels of waste, things like a college building a steam line (costing hundreds of thousands of dollars) to a new building that didn't use steam heat, buying the wrong size of transformer (again many tens of thousands of dollars) for a new building and then having to buy a second one.  The way facilities are managed is often grossly inefficient.  Two of the colleges/universities I was at had very drafty buildings that were easily bleeding tens of thousands of dollars yearly in easy-to-fix insulation oversights that any prudent or competent homeowner or landlord would fix ASAP.  Last year, I saw new buildings being built with fluorescent lighting, in spite of it having a favorable ROI for me to install all LED[.] in my home, so surely a large institution could get a favorable ROI for LED lighting, especially in a building where the lights are on for 10+ hours a day and some are on 24/7.  And the university that I'm next to now, which is a public-private hybrid model, is insanely wasteful when it comes to management of the physical grounds, making insanely heavy use of all sorts of chemicals that they spray just about everywhere, lots of really heavy equipment (the other day they were using a commercial bulldozer to spread mulch on a flower bed, and the whole reason they need to re-spread the mulch is that they come in with these insanely loud industrial leaf-blowers and blow the mulch away at every opportunity), not to mention maintaining huge expanses of lawn where it doesn't make sense to have lawn and no one uses it, if I ran things I'd cover all unused stretches of lawn with low-maintenance native groundcovers and trees or shrubs.  I also think some universities have disturbingly high salaries for some of the higher-paid administrators, including some who, in my opinion, may sometimes do more harm than good for the school.\n\nI also have seen insane amounts of waste in student organizations and localized departments, based on the whole \"we need to use this money up or we'll be given less\" incentive, which still plagues nearly every academic work environment I've ever been in... even in the extremely stingy university that I am at right now that makes heavy use of internal billing, departments *still* always want to burn through that extra money in the budget, often spending it at the end-of-year taking everyone out to eat at expensive restaurants, even a boat ride (that cost as much as 3-4% of the total tuition cost of the program it was associated with, ugh... that *one event alone* would have allowed them to lower tuition for that program by that amount).\n\nI think if I were put in charge of a university and given free reign I could probably cut tuition costs by 30% or more with only minimal changes to things of consequence.  I might make some unpopular decisions and piss some people off but I think I would be able to deliver the same quality of education without cutting out the more important support programs.  I think merely changing the incentives and rewarding each department for saving, not penalizing them in their future budget, maybe sacking a few of the high-paid administrators here and there, could go a very long way.\n\nI have little faith, however, that merely freezing the tuition, is going to solve these problems.  Freezing tuition and leaving the same people in control is going to result in the programs getting cut that the people currently in charge want to cut.  I think we need people with new ideas, a new way of thinking.\n\nI think the same is true both of colleges/universities, and government.  The problem lies in how people think.\n\nI think we need to spread ideas and a philosophy in society as a whole, of using resources wisely, saving, thinking critically, continually scrutinizing everything we do and always looking for ways to save money.  That[.] how I live my personal life and my living expenses are tiny and I enjoy a very good quality of life.  I also have been able to save tons of money for most employers I've worked for in the past, and I run my business *extremely* efficiently.\n\nIt[.] all because I *want* to do this.  We need to put people in charge, who also *want* to do this."}