{"doc_id": "352", "name": "2017_10_humanities_student_major_1162_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2017-10-humanities-student-major_1162_canada.txt", "pub_date": "2017-10-12T00:00:00Z", "Sentiment": "0.176", "Subjectivity": "0.45", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "325", "Permalink": "http://reddit.com/r/canada/comments/75uvee/most_international_students_leaving_canada_after/do9wbgy/", "Threadlink": "http://reddit.com/r/canada/comments/75uvee/most_international_students_leaving_canada_after", "Parent_id": "t1_do9vo1m", "Reddit_id": "do9wbgy", "Subreddit_id": "t5_2qh68", "Commenter": "NormalGood", "length": "2005", "content_scrubbed": "Oh I fully, 100% agree with you on this one - inefficient and poor employees can and are found in any university administration. However, I think the important part to distinguish here is that this is not the product of the university or its administration, but rather a product of unionization. And this sort of issue is apparent in most unionized work places, especially in the public sector. \n\nAs you've experienced, when you work in a unionized public sector environment, the union will protect even the laziest employees. It takes a lot for a manager to follow through on due process to fire a unionized employee for not being up to par with the job requirements, and so it often isn't done. That, combined with a lack of financial performance incentives, means that unionized environments attract those who are fine doing the bare minimum and it scares away those who are willing to work harder if it means better compensation. \n\nI am in full agreement that unionization of the workplace, and specifically university admin, leads to poorer outcomes. The result is that perhaps some student services cost more to deliver than they should because of inefficient employees. I've mentioned this before in another post, but the students who ask for lower tuition fees and more efficient student services are the same students who, upon graduation, demand workplace unionization, worker protection, benefits, and guaranteed annual raises - the same forces that drive up the cost of their education. Until we can dispel the myth that unions are universally good, which is so prevalent in most undergraduate liberal_arts courses, students are never going to fully understand both the benefits *and* costs associated with unionization, and it[.] impact on their education and delivery of other public sector services. \n\nThere is a higher chance of the entire world 100% switching to renewable resources next year than there is of universities autonomously choosing to de-unionize and deliver better services. "}