{"doc_id": "1019", "name": "2017_04_humanities_student_major_918_askfeminists", "namespace": "we1sv2.0", "metapath": "", "pub": "AskFeminists", "title": "2017-04-humanities-student-major_918_AskFeminists.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.113", "Subjectivity": "0.395", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1313", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg0o03z", "Reddit_id": "dg0ppw6", "Subreddit_id": "t5_2sode", "Commenter": "gkm64", "length": "8475", "content_scrubbed": "[Chapter 2 here](https://www. amazon. com/Campus-Rape-Frenzy-America%C2%92s-Universities/dp/1594038856) has a lot of the info you need regarding bogus rape stats, with references to solid studies and detailed analysis of the deeply flawed ones. \n\nSome quotes:\n\nThe National Crime Victimization Survey (NCVS), conducted every six months by the U_S Census Bureau for the Justice Department[.] Bureau of Justice Statistics (BJS), has long been regarded as the gold standard of crime surveys. In 2014, BJS estimated that 0. 61 percent of female college (and trade school) students, of whom 0. 2 percent are raped, are sexually assaulted per year. Nonrape sexual assaults include unwanted sexual touching, attempted rape, and threats. 5\n\n[...]\n\nThe BJS methodology compares favorably with those used in each of the many surveys that purport to find much higher rates of sexual assault. The BJS survey interviews very large population samples twice a year—90,630 households and 160,040 persons 12 years or older in 2013. The response rate is very high—88 percent for eligible persons in 2013, for example.\n\n A second reality check: The most recent data from the Department_of_Education indicate that approximately 10 million women are enrolled (full- or part-time) as undergraduates. The one-in-five figure would indicate that 2 million of them will be sexually assaulted at college. That[.] 400,000 to 500,000 sexual assaults per year, depending on how many schools are classified as four-year and how many are classified as five-year. For comparison[.] sake, under the expanded definition of rape used in the FBI[.] Uniform Crime Reports, in 2014 there were 116,645 rapes in the entire U_S, a nation of 160 million females, one-sixteenth of whom are in college. 12\n\nThe 1990 Clery Act requires all colleges to report the total number of student sexual assaults. According to the most recent aggregate reports, universities reported an annual average of between 4,558 and 5,335 sexual assaults for the period 2012 through 2014.\n[...]\n\n Occidental College in los_angeles, for instance, reported 10 \"sex offenses\" in 2012. The next year, after a handful of faculty members and student activists portrayed the elite liberal_arts college as dominated by a \"rape culture,\" the number of reports of sex offenses skyrocketed, to 60.\n\n This figure suggested that as many as 5. 1 percent of Occidental[.] around 1,200 female undergraduates were victims of violent crime, making the upscale campus one of the most dangerous places in the country. Yet none of these claims appears to have resulted in a criminal charge, much less conviction. In 2014, the Occidental activist coalition fell apart due to ideological infighting. With the witch hunt over, the number of rape reports plummeted to eight. 21 The apparent surge in violent crime had been ephemeral\n\n[...]\n\n The currently prevalent claim that one in five female college students will be sexually assaulted dates to the 2007 \"Campus Sexual Assault Study,\" or CSA, funded (but not conducted) by the National Institute of Justice. 22 The random, anonymous, self-reported, online sample of 5,446 women found that 19 percent of respondents at two large, unnamed universities, one in the Midwest and one in the South, had been sexually assaulted.\n\nThere are several problems with this survey. First, the respondents did not say (because they were not asked) whether they had been sexually assaulted. Second, the low response rate—fewer than half of the 14,000 women invited to participate—probably inflated the percentage found to have been assaulted. Women who think of themselves or their friends as victims of sexual assault are possibly more motivated than others to respond to such surveys. The lower the response rate, the more this bias skews the result. 23 Third, the survey included incidents that had not occurred on campus and had not involved other students, rendering them irrelevant to the debate over college adjudication processes. 24 Fourth, and perhaps most important, CSA used an overbroad definition of sexual assault: respondents were counted as sexual assault victims if, for example, they had experienced \"rubbing up against you in a sexual way\" or had intimate encounters while even a little bit intoxicated. As defense lawyer and civil libertarian blogger Scott Greenfield has observed, \"[t]erms like 'unwanted' focused the respondents on how they felt about the conduct rather than whether they communicated to the other party involved that it was unwanted.\"25\n\nEven the CSA study[.] authors have criticized attempts to apply its findings about two schools to all college students nationwide. \"We don't think that 1-in-5 is a nationally representative statistic,\" Christopher Krebs, the lead author, told journalist Emily Yoffe. 26\n\nOther compelling examples of misleading statistics come from the reemergence of the one-in-five claim in two large surveys in 2015. 27\n\nIn September 2015, the Association of American Universities released a survey of students at 27 public and private universities across the country. Though it inspired apocalyptic headlines in both The Washington Post and The New_York Times, even the association had warned that \"estimates such as '1 in 5' or '1 in 4' as a global rate across all [universities] is [sic] at least oversimplistic, if not misleading. None of the studies . . . are nationally representative.\"28\n\nThe survey, which had cost $2. 34 million, concluded that almost 25 percent of female college students had been sexually assaulted by sexual touching, and 20 percent of those (and 5 percent of all respondents) had been raped—that is, sexually penetrated either by force or when incapacitated or both. The survey[.] response rate of 19. 3 percent was low, and even the AAU admitted that \"estimates may be too high because non-victims may have been less likely to participate.\"29 Female respondents outnumbered males three to two. 30\nOf these female respondents, 2. 17 percent said they had reported to their schools that they had been penetrated without consent since entering college. 31 In a nation with 10 million female undergraduates, over five years there would have been 217,000 student reports of penetration without consent, plus many more reports derived from the survey[.] other categories of sexual assault.\nBut 217,000 is between 10 and 11 times the number of students (between 20,282 and 22,513) who actually did report sexual assaults to their universities from 2010 through 2014, the five years in which nearly all respondents to the AAU survey were in college, according to the relevant Clery Act reports. Either the AAU data were enormously unrepresentative, or many of the women who told researchers that they had reported assaults to their universities were lying. The AAU[.] 288-page report failed to address this flaw in its findings. 32\nIn a manner typical of such surveys, the AAU classified as \"sexual assault\" a far broader range of behaviors than defined by criminal law or according to common understanding. In an interview with Emily Yoffe, the survey[.] designers admitted that they, at the behest of participating universities, specifically avoided asking about \"rape\" or \"sexual assault.\" Instead, the AAU counted it as \"sexual assault\" or \"sexual misconduct\" every time a respondent answered yes to any of the following questions (and others like them): Have you experienced \"forced kissing\"? Unwanted sexual \"touching,\" which could include attempted close dancing while fully clothed? \"Promised rewards\" for sex? Threats to \"share damaging information about you\" with friends? In addition, the survey[.] failure to define \"incapacitated\" in one key question invited respondents to assume that the answer should be yes if they had been even only a little bit drunk. 33\n\nThe AAU acknowledged that—for the majority of respondents who said they had not reported to campus authorities the events that the AAU classified as sexual assault—\"the dominant reason was it was not considered serious enough\" (emphasis added). Seventy-five percent of the respondents who told researchers that they had been \"penetrated using physical force\" said they had never reported any incident to campus authorities. And 58. 6 percent of that group said they \"did not consider [the rape] serious enough\" to report to their colleges' confidential rape hotlines, or their sexual assault resource centers, or their burgeoning Title IX bureaucracies, or their campus or city police. 34"}