{"doc_id": "336", "name": "2017_10_humanities_student_major_1011_uiuc", "namespace": "we1sv2.0", "metapath": "", "pub": "UIUC", "title": "2017-10-humanities-student-major_1011_UIUC.txt", "pub_date": "2017-10-10T00:00:00Z", "Sentiment": "0.113", "Subjectivity": "0.249", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "323", "Permalink": "http://reddit.com/r/UIUC/comments/75k0xo/how_competitive_is_urap_for_freshmen/do7agz9/", "Threadlink": "http://reddit.com/r/UIUC/comments/75k0xo/how_competitive_is_urap_for_freshmen", "Parent_id": "t3_75k0xo", "Reddit_id": "do7agz9", "Subreddit_id": "t5_2qkxs", "Commenter": "TheseusAegeus", "length": "1805", "content_scrubbed": "Here[.] the thing: no matter how competitive it might seem, apply anyway. You'll get some rejections and perhaps you'll sometimes feel like it was a waste of your time. But truthfully, it wasn't. Every application and interview is an opportunity to refine your writing and, through trial and error and learning from past mistakes, find the best way to communicate your skills and sell yourself. As a student with any ambition at all, you're going to need those skills; you'll be writing plenty of cover letters over the years. \n\nAnother thing to keep in mind is that applying for a position can open doors even if you don't get exactly what you applied for. I applied for a competitive internship at the campus humanities center as a freshman; I didn't get the job, it went to a senior. But I did get an email saying that the director and her team liked my resume, interest, and ideas, and they offered me a position as a research assistant instead. That same year, I applied for a library job that I also didn't get. But when I reapplied the year after, they remembered me, recognized my new experience, and noted me as a seriously interested applicant. I had been thinking for a year about what I'd done wrong in the first interview, spent some time over the summer gaining more experience, and I was able to better present myself the second time around. I got the job that time. \n\nSo if it interests you, definitely apply to URAP. Whether or not you get a placement, it can be a beneficial experience. As to your qualifications, by the way, URAP is specifically looking for freshmen and sophomores with little to no research experience (giving them that experience is the whole point of the program), so you should be more worried if you have the resume of a senior than if you have that of a freshman. "}