{"doc_id": "1243", "name": "2017_04_humanities_student_major_3062_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2017-04-humanities-student-major_3062_AskAcademia.txt", "pub_date": "2017-04-27T00:00:00Z", "Sentiment": "-0.038", "Subjectivity": "0.324", "Score": "20", "Upvotes": "0", "Downvotes": "0", "Wordcount": "419", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67vl1y", "Reddit_id": "dgtkbhy", "Subreddit_id": "t5_2sakj", "Commenter": "restricteddata", "length": "2467", "content_scrubbed": "Here[.] the question: did the dangerous academic, in the sense meant by the author, _ever_ exist? The only cases cited as genuinely dangerous are Berkeley in the 1960s (the protests were mostly run by students, not the professors), and Kent State (again, students). (Also, let[.] be clear that it was not academic ideas or ideals that caused those protests... it was the draft and Vietnam.)\n\nYou want to talk about dangerous academics? Let[.] talk about the ones who have actually _done_ things in the world that were actually dangerous. Fritz Haber. J. Robert Oppenheimer. Henry Kissinger. (Otmar von Verschuer? We could get very dark here.)\n\nAnyway. I agree with the premise that academia is by its nature very conservative (not in terms of its ideological politics, but its practical actions), that university administrations and faculty are not sources for radical intervention (despite tenure[.] supposed promise of free speech), and that the university has become corporatized and exploitive on many levels. Also I agree that professors tend to view themselves as being more important than they are in the wider world, and that they pat themselves on the back for being good, thoughtful liberals even as they contribute to the aforementioned activities of the university. I also agree that it is amusingly absurd that conservatives like to attack professors as liberal indoctrinators, but, you know, what else is new about conservatives attacking the wrong targets? (As a friend of mine put it on Twitter, \"As a professor, Fox News tells me I can turn my students into Communists and experience tells me I can't even make them do the readings.\")\n\nIt is tempting to say \"not all academics!\" — some actually _do_ try to do some good in the world (I notice she is not calling out, say, Paul Farmer), and there are big differences within academia in this respect (e. g., she spends a lot of time talking about people who talk big on Twitter, and the sad state of the humanities and even the sciences, but ignores the academics in public health, policy schools, etc. who do quite a bit of work outside of academia), but on the whole, the criticisms are mostly on point if a little oversimplified. The irony here is that the only people who believe in the \"dangerous academic\" are 1) the far right, and 2) those liberal professors who enjoy the fact that they are attacked by the far right (in the sense that being their enemy must mean you are doing _something_ right). \n"}