{"doc_id": "303", "name": "2017_10_humanities_student_major_640_uvic", "namespace": "we1sv2.0", "metapath": "", "pub": "uvic", "title": "2017-10-humanities-student-major_640_uvic.txt", "pub_date": "2017-10-08T00:00:00Z", "Sentiment": "0.087", "Subjectivity": "0.375", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "492", "Permalink": "http://reddit.com/r/uvic/comments/74zqel/transferring_to_uvic_from_new_brunswick_can/do30x4f/", "Threadlink": "http://reddit.com/r/uvic/comments/74zqel/transferring_to_uvic_from_new_brunswick_can", "Parent_id": "t3_74zqel", "Reddit_id": "do30x4f", "Subreddit_id": "t5_2ru8r", "Commenter": "EvilRoyGustavo", "length": "2968", "content_scrubbed": "ello!  I'll start with the bad news first: of the areas you're asking about, residence will definitely be the trickiest part.  I'm not sure if there are some kind of exceptions for visiting students, but at UVic there are not nearly enough dorm rooms, and the vast majority are reserved for first-year students, with the remainder distributed by lottery.  I believe that coming in January will make it much more likely you can get in a residence, but something to keep in mind is that -unless you're taking classes through summer-  you will be kicked out of res in April and have find off-campus housing.  This makes it a bit easier, as I think lots of places open up around this time, but you're probably going to have to live there for the fall semester as well, as you're less likely to get back into residence.\n\nIf you do look into residence, I'd avoid cluster housing as it tends to become party central.  They do have quiet buildings however, and you can specify your interest in them on the application form.  If you want to get a feel for what you can expect from off-campus housing for price and conditions, you can have a look at the [postings](https://www. uvic. ca/residence/future-residents/off-campus/index. php) specifically targeting UVic students; there are also general rental postings on the usual sites like Kijiji, Craigslist, and UsedVictoria.\n\nAs for making friends, well, you get out of it what you put in.  If you're chatty with the people in your classes it[.] pretty easy to make class-friends, but if you want to develop an actual social group, then I definitely agree with what the other poster said about clubs.  The UVic Student Society keeps a [list](https://uvss. ca/wp-content/uploads/2012/07/Sept2017-descriptions. pdf) of officially recognised clubs, and there are also disciplinary societies like the English Students Association (ESA) or The History Ungergrad Society (THUGS) that you are automatically a member in if you are taking a class in their department.  They host events like pub crawls, or movie nights where a professor may give a short lecture on a related subject.  There[.] always something going on somewhere.\n\nBut my general advice is this: if you want to try out west coast life, Victoria[.] a great choice.  It[.] a beautiful city with lots of greenery and coastline, and super temperate.  It[.] not as busy or wet as Vancouver which I'd consider a plus.  From I understood correctly, you're following a similar academic path to me, getting an English degree before going into Education (I majored in English and  mimored in History [both with a Canadian focus] and now I'm in one of UVic[.] teacher education programs).  From my experience I can say that UVic has some great humanities profs, especially the ones whose expertise is in Canadian topics.  \n\nAnd yeah, if you want a local connection please feel free to PM me and we can share emails or something; I don't think you'd regret coming to UVic, I certainly haven't"}