{"doc_id": "410", "name": "2017_10_humanities_student_major_1700_adjuncts", "namespace": "we1sv2.0", "metapath": "", "pub": "Adjuncts", "title": "2017-10-humanities-student-major_1700_Adjuncts.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.085", "Subjectivity": "0.415", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "358", "Permalink": "http://reddit.com/r/Adjuncts/comments/7790p7/lets_start_over/doklh68/", "Threadlink": "http://reddit.com/r/Adjuncts/comments/7790p7/lets_start_over", "Parent_id": "t1_dokj1bf", "Reddit_id": "doklh68", "Subreddit_id": "t5_2y407", "Commenter": "toxoplasmosisgranny", "length": "2035", "content_scrubbed": "Well, I think I would want to keep the school very small, and that would certainly help. I've been teaching in a very large private university for several years, and I'm tired of large institutional structures.\n\nBenefits are definitely a problem. I don't think it would be possible to provide benefits at first, and I don't know how to fix that. \n\nIn terms of worker satisfaction, I'm very interested in the worker[.] cooperative model. If faculty are co-owners, I think that could really change the social arrangements and reduce alienation. This has not been done very often at the level of higher ed, but there is Mondragon in Spain (more of a technical school, but I'm in the arts so it[.] similar to what I do.) \n\nI don't like to think of my students as \"pampered.\" I think they have it really tough. When I was signing up for college, I didn't have much awareness of what kind of debt I was getting into. 18 is young - I was stupid and I just signed on the dotted line. Tuition is more than double what it was when I started undergrad in 2002. My students are afraid for the future. I think if you reduced admin significantly at an existing school people would be upset, but if you started a new school that was billed as an affordable alternative (with the understanding that administration would be minimal and facilities bare-bones) many students would choose that route.\n\nI'm very interested in online education, but I'm in visual art so it[.] not really feasible. You need to be in the room with the art if you're teaching anything beyond basic technique. My inclination is to go the opposite way, super small, everyone looks each other in the eyes. \n\nI agree that federal loan programs are exacerbating the problem. And these institutions aren't acting in good faith. When you invest in multimillion dollar facilities, but stuff a million kids into a class and gut faculty pay, then you're no longer effectively doing your job. I think someone should provide an alternative - that[.] how the market is supposed to work right?  "}