{"doc_id": "1007", "name": "2017_04_humanities_student_major_817_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2017-04-humanities-student-major_817_AdviceAnimals.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.065", "Subjectivity": "0.363", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "474", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfzo9zf", "Reddit_id": "dfzohgj", "Subreddit_id": "t5_2s7tt", "Commenter": "BrianLemur", "length": "2607", "content_scrubbed": "What the general stigma comes from is the people like this --- Go to college cause why not. I don't know what to do so I'll pick something easy without planning out my future. Yay I graduated! Wait, what do you mean you won't hire me for 100k a year? You know I almost got a 3. 0! College is bullshit and a waste of money. I need to tell everyone!\n\nOh, so you mean a straw man? That[.] what people get frustrated about? Oh, of course! Silly me. Then of course the general hatred is justified.\n\nLook, not everyone knows exactly what they want to do in college. I knew I wanted to be a music therapist. I was still exploring options in college--I just knew the very basics of what I wanted to do. I didn't refine my choice until my final semester of senior year. I wanted to do work in corrections music therapy, or perhaps pediatrics. I had an experience with hospice, fell in love, and never turned back. Now I'm a young professional who is doing very well in the field, and makes good money doing so.\n\nThere[.] nothing wrong with saying \"I know basically what I want to do, I'll figure out the rest based on the opportunities I find.\" Just because some student isn't saying \"I want to work for Lockheed Martin for 80k/year and great benefits doing research and development, specifically in x department\" doesn't mean they don't have a \"plan.\" Some people are not tied down to a very specific career path. They're still trying things out, deciding how to specialize. That[.] GOOD. That[.] what college is for! You aren't supposed to walk out with a degree and suddenly have all the experience you need to get the exact job you wanted. It[.] about giving you a broad overview of the field so that you can find where you fit. Are you really criticizing these people who have a general idea of what they want to do, but haven't specifically decided on an exact field yet? Do you honestly think that you could have made good decisions about your field when you were a freshman?\n\nYou're bashing on this supposedly huge group of people who are just coasting on by through their \"super easy\" liberal_arts degrees. Where are they, exactly? Because my degree falls under liberal_arts. Nearly all of my friends have degrees which are strongly rooted in liberal_arts. They're all pretty realistic about their goals and their desires. They all have a plan that[.] pretty solid. Even the ones who don't are usually pretty flexible--they're willing to move across the country, or work at any job that lets them do x or y without z.\n\nI just genuinely don't think you've thought this through. Not trying to bash you. I just don't."}