{"doc_id": "415", "name": "2017_10_humanities_student_major_1719_mcat", "namespace": "we1sv2.0", "metapath": "", "pub": "Mcat", "title": "2017-10-humanities-student-major_1719_Mcat.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.044", "Subjectivity": "0.271", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "446", "Permalink": "http://reddit.com/r/Mcat/comments/77bybt/cars_124_need_some_support_help/dokt71e/", "Threadlink": "http://reddit.com/r/Mcat/comments/77bybt/cars_124_need_some_support_help", "Parent_id": "t3_77bybt", "Reddit_id": "dokt71e", "Subreddit_id": "t5_2saxp", "Commenter": "1-800-HOTDOGJONES", "length": "2623", "content_scrubbed": "Maybe you need to take a step back amigo! Sounds like you're pretty stressed! Believe me, I feel your pain. May I recommend trying 2 things?    \n1- confidence. Build yourself up with positive visualizations, 10-15 minute 2x daily meditations, and a daily gratitude journal. You're smart, and capable but your spunk is outta whack. If you don't believe me, there[.] research to support it given by TED talk speakers and research done at Hahhhhvahhhd and MIT. It ain't a question of your brain, it[.] just a question of you getting out of your brains way to let it kick ass. STILL don't believe me? Read the stories of other redditors who said \"fuck it!\" Took time off from CARS, said \"idgaf, I'll do my best\" then went on to get 130s even after never having surpassed 125[.]; confidence and comfortability was their key to glory. Quick fact to substantiate my claims: stress shuts down your hippocampus (associated with makin' memories in da mind) due to induced fight-flight responses. This hippy-dippy meditation stuff hits stress hard  in the face allowing your brain to do its job.\n2- speed. You might be rushing this whole process. Slow it down, senpai! Start from square 1 AGAIN. This time though take the 2 hours per day to slowly read the passage or 2 (it can take up to an hour for 1 passage with analysis and question breakdown), highlight/mark-up all that you think is important, then answer the questions (don't peek at the answers yet). Right from the start, see what 2 answers you can immediately eliminate and why (If you read critically enough [noting the tone, key phrases, whose idea is being presented etc]  then you won't necessarily have to go back to the passage to validate your immediate \"nos\"). I'm kinda contradicting myself here, but for every answer you choose, find something in the passage that supports your line of reasoning AND (if time permits) find something that negates and/or contradicts the others: there can only be one...(highlander). Once the passage is done, review your answers plus the correct ones and find a general idea behind why you got something right or wrong. Tweak your methods. Rinse and repeat. Over time your reading skills will improve, your speed will improve, and your confidence will improve. Trust the process. Trust yourself MOTHA fuckah 😎! (Also, it MAY not hurt to start up an Anki hard-words vocab list, after all, we're expected to have a vocabulary consistent with that of a soph/junior level humanities major). If you're really running out of resources, find stuff from the economist to read... ahem... the stuff you WOULDN'T want to read.\nGood luck. Kill it."}