{"doc_id": "1253", "name": "2017_04_humanities_student_major_3136_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-04-humanities-student-major_3136_AskHistorians.txt", "pub_date": "2017-04-27T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.328", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1447", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dguemzx", "Reddit_id": "dgupayv", "Subreddit_id": "t5_2ssp3", "Commenter": "cleopatra_philopater", "length": "9343", "content_scrubbed": "Excellent question, I was not going to get into this aspect of Afrocentrism at first but given the meta nature of this discussion I guess it is still appropriate. Seeing as it is interconnected with identity formation and sociology I have a passing familiarity with most of its criticism, however this is still limited mainly to the African American studies but I feel this may be what you mean anyway.\n\nFirst of all, I *really* want to stress that the Afrocentrism I am mostly talking about is *not* /u/chikindiner[.] \"Black King Arthur\", it is the Afrocentrism of Parker and Asante. This particular Afrocentrism has less to do with straight out revisionism and everything to do with *identity formation*. Typically in the US, African Americans and Hispanics of African descent are simultaneously closely connected to their cultural heritage and bombarded with negative images of it, both of which lead to internalised feelings of \"otherisation\" within society. Depictions of minorities, minority males in particular, (although women experience similar stereotyping) in mainstream media have historically depicted minority groups as being uncultured, superstitious, ascientific, and possessing of qualities associated with primitive or less refined culture. These stereotypes have in turn become internalised and valued as being an integral part of one[.] own ethnic culture and heritage on a conscious and unconscious level which is in part responsible for the statistical underrepresentation of blacks and in particular black males in academia. Basically, it is not seen as \"black\" to wear a suit, or become a scholar, and these harmful stereotypes are applied to individuals on both sides of the racial divide without the individuals even needing to be aware of it. This means that this stereotype is perpetuating and self replicating as those negatively impacted by it will unconsciously reproduce it or have their perceptions of self shaped by it. Most attempts at diversity and inclusion in media and in particular children[.] education is ineffective as it tends to focus on a Eurocentric view of \"important\" heritage and values that have by now become culturally ingrained, and these examples of inclusion of marginalised groups comes off as an afterthought designed to spare feelings and promote inclusion which leads to an \"after school special\" effect, where students perceive the material presented as political and manipulative (\"*They are only including African American characters  to be PC/hip*\"). At best most attempts at diversification in education tries to find a place for the ethnic or cultural \"other\" by assimilation into the mainstream.\n\nSimilarly, history and culture  are racialised by cultural association, to a great extent Western European culture is seen as \"white\" and minorities not as contributors or inheritors of it but as the fortunate uplifted. What I am establishing here is that history and heritage is already a racialised space, although from a purely historical perspective this holds no weight it is highly relevant from a sociological perspective.\n\nAfrocentrism has been advocated as a means to balance an unotherwise discriminatory and exclusionary system on both the higher educational levels and in public schools, however the academic reception of Afrocentrism in higher education despite drawing some criticism has largely become accepted while in children[.] curriculum the matter is still contested and has been from its inception in the late 70s and early 80s. The argument for an Afrocentrist perspective on history is that it can provide individuals with self esteem and a sense of cultural achievement, and that the Eurocentric and racist rhetoric of colonialism and slavery has marginalised a segment of the population and the history of an entire continent to the extent that significant revisionism on every level is necessary. On paper, Afrocentrism would be a parallel to Eurocentric histories and would discover new truths that valued and celebrated the achievements of black Africans.\n\nOn a cultural level it is sometimes advocated as a means through which to reject and eliminate the harmful and negative stereotyping and self representations of Africans in media, and to expose the youth to a cultural identity that they can be proud of.\n\nSocial work as I understand it has also tackled with the issue of Afrocentrism with some supporting it as a theory that could be applied to relating with African Americans as a more culturally familiar and less damaging value system. Proponents of Afrocentrism in social work claim that the European hegemony and erasure of traditional African culture is damaging and that African Americans can benefit from interaction and immersion within their heritage. This has drawn criticism however, and it has been argued that this ideological approach is unscientific and not grounded in scientific methodologies. (see Dwain Pellebon[.] *An Analysis of Afrocentricity as Theory for Social Work Practice*)\n\nIn Black studies and African American studies it still very pervasive particularly in the US, Latin America and the Carribean islands. Often the primary reason it is seen as necessary is that academia as a whole is based out of the Eurocentric mindset and is therefore fundamentally incompatible with dealing with African experiences, as well as the idea that Africans must rediscover their shared heritage that has been denied them. Indeed, it is sometimes presented as the *only* authentic option for individuals of African descent to define themselves by, with anything else being merely a \"darker form of whiteness\" in Asante[.] own words. It has caught a decent amount of traction outside of academia as well with the increasing popularity of Kwanzaa and the concept of Harambe entering the belief system of African Americans who seek to get back in touch with their roots. This system of spiritual and cultural beliefs that has sprung up around Afrocentrism has gained significant traction in North_America and the Carribean in particular and is celebrated both by many scholars in Afro-American studies and by authors such as the Jamaican-Canadian novelist Nalo Hopkinson[.] who intertwines Pan-African spirituality and identity into her science fiction, fantasy and historical fiction novels and short stories.\n\nHowever, critics of Afrocentrism have pointed out the flaws in even the most sober Afrocentric revisionisms, and Molefi Kete Asante as the de facto father of the contemporary movement in particular. The establishment of a pan-African identity for African Americans and the idea of a unified and homogenous \"black history\" has drawn criticism, namely from Tunde Adeleke in *The Case Against Afrocentrism* wherein he asserts the impact of slavery, racialisation and Americanisation of African Americans as well as the diversity and variability of the African diaspora which was by no means a universal experience between the Americas and Europe, culminating in the simple but controversial statement that\nthere is no one African and black Diaspora experience\n\nMoreover, the insistence on conceptualising history as a racialised space has drawn criticism by many for most of history the modern constructions of race did not exist, so an Egyptian or Roman would have had no such concepts or ideology. Additionally the increased emphasis on race as a persistent ethno-cultural grouping that has retained its distinct characterising features is a problematic one, and sure to lead to the dissemination and consumption of biases and misrepresentations of events. The espousement of Asante[.] tripedal model of \"Afrocentric, Eurocentric and Asiacentric\" history is viewed as divisive and methodologically flawed.\n\nTaken all together, there is no one attitude towards Afrocentrism and the liberal_arts and social_sciences do tend to be more lenient in their criticisms of Afrocentrism by nature but on the whole they do still draw a fair share of criticism. I myself tend to view it as somewhat patronising in its attempt to provide African Americans with a replacement for the confidently narrow Eurocentric mindset, but on the other hand it is seen as a tool for positive change for individuals from disenfranchised groups such as inner city youths which is a fair point that counterbalances the methodological problems of the ideology. On the whole, finding a consensus or even a general sentiment shared by members of sociological studies is basically a paradox but Afrocentrism in general is well-received by those directly involved in studies around the African diaspora and identity.\n\nSources and Bibliography:\n\nAmy Binder[.] *Contentious Curricula: Afrocentrism and Creationism in American Public Schools*. Covers the history of Afrocentrism and Creationism and their associated controversy in America.\n\nBernard Ortiz de Montellana[.] *Afrocentric Psuedoscience or Culturally Relevant Science*. Looks at the merits and problems of an Afrocentric approach to history.\n\nMolefi Kete Asante[.] *Afrocentricity: The Theory of Social Change*. If you want to see the other side of my criticisms.\n\nNalo Hopkinson[.] *Brown Girl in the Ring*, *The Salt Roads*, and *Skin Folk*. While fiction these writings are intended to convey, explain, develop and celebrate the experience of Africans in the African diaspora, particularly that of women."}