{"doc_id": "541", "name": "2017_10_humanities_student_major_3066_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2017-10-humanities-student-major_3066_canada.txt", "pub_date": "2017-10-31T00:00:00Z", "Sentiment": "-0.054", "Subjectivity": "0.419", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "234", "Permalink": "http://reddit.com/r/canada/comments/79ubni/canadian_music_festival_staffer_dubbed_racist/dp5udzf/", "Threadlink": "http://reddit.com/r/canada/comments/79ubni/canadian_music_festival_staffer_dubbed_racist", "Parent_id": "t1_dp5gzkx", "Reddit_id": "dp5udzf", "Subreddit_id": "t5_2qh68", "Commenter": "Galvaxatron", "length": "1576", "content_scrubbed": "Get used to it because this is only the beginning. \n\nSpineless liberals, and centrist/conservative moderates, have allowed the far left \"progressive\" ideologues to completely hijack the cultural zeitgeist. \n\nThe far left anti-science Postmodernists/post-Marxists have completely taken over the Humanities and have been churning out well-meaning but dangerously indoctrinated young \"activists\" for well over 3 decades now. Their numbers are growing, and will continue to grow before the tides turn.\n\nThese young adults who go through far left propaganda courses in the humanities are especially fit to fill up media/HR/education jobs, allowing them to shape discourse thus furthering the anti-democracy, anti-free-speech, anti-liberal cultural Marxist agenda(Cue the dismissive snorting).\n\nGet ready for equity over equality of opportunity. Young kids going through our education system right now will be much more suited to an equity-focused society, over equality-of-opportunity. We don't fail kids anymore in school. Competition is now bad. We're changing our school curriculum to discourage competition which we enforce it by not declaring winners/losers in sports or classes. We also teach them about the evil ways of white people by guilt tripping them about slavery and the plight of First Nations peoples. Prime example: my nephew just went through this last week, came home crying about white people being so evil after the school had First Nations activists as guests to \"teach\" the white folks to block their naturally evil ways.\n\nWelcome to the new normal. \n\n\n\n\n\n\n\n"}