{"doc_id": "339", "name": "2017_10_humanities_student_major_1052_the_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "The_Donald", "title": "2017-10-humanities-student-major_1052_The_Donald.txt", "pub_date": "2017-10-11T00:00:00Z", "Sentiment": "0.061", "Subjectivity": "0.371", "Score": "16", "Upvotes": "0", "Downvotes": "0", "Wordcount": "354", "Permalink": "http://reddit.com/r/The_Donald/comments/75obpf/youd_think_they_wouldve_learned_their_lesson/do804an/", "Threadlink": "http://reddit.com/r/The_Donald/comments/75obpf/youd_think_they_wouldve_learned_their_lesson", "Parent_id": "t1_do7omrv", "Reddit_id": "do804an", "Subreddit_id": "t5_38unr", "Commenter": "ThisIsTedSpeaking", "length": "1998", "content_scrubbed": "The left S T I L L seem to think the entire Trump base (likely 80-100 million of us now) are living in mobile homes in deep rural Appalachia and have no exposure to culture whatsoever, so they are safe and free to judge away or marginalize. \n\nI'm a firmly upper middle class person who lives in one of the hottest neighborhoods in my -major- city and I work in the arts. Many of my friends work in film, stage, academia and music, and at the level where some have awards like Tonys and Grammys. Fulbright grants. Most of my actual friends are in my demographic and are Trump supporters. On paper we should all be ridiculous pussy liberals, but instead we are savage-minded, gun-toting, shit-posting, Constitution-worshipping patriots. My POC immigrant buddy might be the most anti-SJW, anti-Democrat person I've ever met. I'm sure some Dem would call him some kind of Uncle Tom. \n\nOh, and those aforementioned \"appalling deplorables\" in the rural lower classes? Concern for them was the *first* thing that brought me to supporting Trump (unfortunately after the election). The first red pill. Many of them are my family. See, I'm going to be fine either way. They are not. I really don't care if they aren't as formally educated or whatever as the smug left. They want to be free to live as they wish and they have wisdom and toughness and straight up Americanism that practically *nobody* I know in the city has. These are the people who join the military, go into the trades, farm, mine, etc. In other words, build and protect our society. I don't want them to liberalize at all. \n\nLeftists and liberals don't fucking get it and it[.] ridiculous. Hate Trump all you want I guess, but at least do the work to understand the what and the why of what is happening right now. That[.] a long list. Because it doesn't end with Trump. It[.] only beginning. Our movement is just getting rolling.\n\nPS: I'll be skipping over Wolfenstein. I have plenty of other games anyway and not enough time to play them.  "}