{"doc_id": "1069", "name": "2017_04_humanities_student_major_1372_studentloandefaulters", "namespace": "we1sv2.0", "metapath": "", "pub": "studentloandefaulters", "title": "2017-04-humanities-student-major_1372_studentloandefaulters.txt", "pub_date": "2017-04-12T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.372", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1014", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg5u0yi", "Reddit_id": "dg5wp5x", "Subreddit_id": "t5_33jzs", "Commenter": "daiyuesen", "length": "5912", "content_scrubbed": "\n\tThe US college debt bubble is becoming dangerous\n\nStudent loans are now 90 per cent public, in an eerie echo of the housing crisis\nRana Foroohar\n\nAPRIL 9, 2017 by: Rana Foroohar\nRapid run-ups in debt are the single biggest predictor of market trouble. So it is worth noting that over the past 10 years the amount of student loan debt in the US has grown by 170 per cent, to a whopping $1. 4tn — more than car loans, or credit card debt. Indeed, as an expert at the Consumer Financial Protection Bureau recently pointed out to me, since 2008 we have basically swapped a housing debt bubble for a student loan bubble. No wonder NY Federal Reserve president Bill Dudley fretted last week that high levels of student debt and default are a \"headwind to economic activity\".\n\nSample the FT[.] top stories for a week\nYou select the topic, we deliver the news.\n\nSelect topic\nEnter email addressInvalid email\nSign up By signing up you confirm that you have read and agree to the terms and conditions, cookie policy and privacy policy.\nIn America, 44m people have student debt. Eight million of those borrowers are in default. That[.] a default rate which is still higher than pre-crisis levels — unlike the default rate for mortgages, credit cards or even car loans.\n\nRising college education costs will not help shrink those numbers. While the headline consumer price index is 2. 7 per cent, between 2016 and 2017 published tuition and fee prices rose by 9 per cent at four-year state institutions, and 13 per cent at posher private colleges.\n\nThe student loan market is hopelessly opaque — only a quarter of students can predict their own debt load\nA large chunk of the hike was due to schools hiring more administrators (who \"brand build\" and recruit wealthy donors) and building expensive facilities designed to lure wealthier, full-fee-paying students. This not only leads to excess borrowing on the part of universities — a number of them are caught up in dicey bond deals like the sort that sunk the city of Detroit — but higher tuition for students. The average debt load individual graduates carry is up 70 per cent over the past decade, to about $34,000.\n\nHaving just attended the first college preparation meeting at my daughter[.] high school, where I was told to expect a $72,000 a year sticker fee for Ivy League and liberal_arts colleges, I would feel lucky to get away with just that.\n\nThis is clearly, as Mr Dudley observed, a headwind to stronger consumer spending. Growing student debt has been linked to everything from decreased rates of first time home ownership, to higher rental prices, to lower purchases of white goods and all the things that people buy to fill homes. Indeed, given their debt loads, I wonder how much of the \"rent not buy\" spending habits of Millennials are a matter of choice.\n\nBut there are even more worrisome links between high student debt loads and health issues like depression, and marital failures. The whole thing is compounded by the fact that a large chunk of those holding massive debt do not end up with degrees, having had to drop out from the stress of trying to study, work, and pay back massive loans at the same time. That means they will never even get the income boost that a college degree still provides — creating a snowball cycle of downward mobility in the country[.] most vulnerable populations.\n\nHow did we get here? Extreme politics played a role. In the US, the Koch Brothers/Grover Norquist tax revolt camp of the Republican party has been waging a state by state war on public university funding for years now: states today provide about $2,000 less in higher education funding per student than before 2008, the lowest rate in 30 years.\n\nMeanwhile, the subprime crisis cut the ability of parents to use home equity loans to pay for their children[.] education (previously a common practice). This left the bulk of the burden to students, at a time when the unemployment rates for young people of all skill levels were rising.\n\nRelated article\nNew_York Fed chief warns on US student debt\nDelinquency rates remain stubbornly high, says William Dudley\n \nThe trend is not limited to the US, of course. In the UK and beyond, completely free post-secondary education is a thing of the past. Beleaguered governments are pushing more and more of the responsibility for the things that make a person middle class — education, healthcare and pension — on to individuals.\n\nWhat are the fixes? For starters, we should look closely at the for-profit sector, where default rates are more than double those at average private colleges. These institutions receive federal subsidies but typically spend a minuscule part of their budgets on instruction; in the US, nearly 50 per cent goes on marketing to new students. It looks all too much like an educational Ponzi scheme.\n\nTransparency is also key — the student loan market as a whole is hopelessly opaque. In one recent US study, only a quarter of first year college students could predict their own debt load to within 10 per cent of the correct amount. Truth in lending documents would help, as would loan counselling paid for by colleges. Sadly, the agency that is leading the fight on both — the CFPB — is under attack from Trump himself.\n\nBut the administration will not be able to hide from the student debt bubble. In an eerie echo of the housing crisis, debt is already flowing out of the private sector, and into the public. Before 2007, most student loans were underwritten by banks or other private sector financial institutions. Today, 90 per cent of new loans originate with the Department_of_Education. Socialisation of risk continues to be the way America deals with its debt bubbles.\n\nWould that we considered making college free, as Bernie Sanders suggested. Even Mr Dudley called this \"a reasonable conversation\". That way we could socialise the benefits of education too.\n\nrana. foroohar@ft. com\n "}