{"doc_id": "419", "name": "2017_10_humanities_student_major_1747_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2017-10-humanities-student-major_1747_changemyview.txt", "pub_date": "2017-10-19T00:00:00Z", "Sentiment": "0.179", "Subjectivity": "0.462", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "460", "Permalink": "http://reddit.com/r/changemyview/comments/77fcsh/cmv_asian_americans_are_unfairly_discriminated/dolmzvp/", "Threadlink": "http://reddit.com/r/changemyview/comments/77fcsh/cmv_asian_americans_are_unfairly_discriminated", "Parent_id": "t3_77fcsh", "Reddit_id": "dolmzvp", "Subreddit_id": "t5_2w2s8", "Commenter": "DjTj81", "length": "2844", "content_scrubbed": "If your definition of \"fair\" is whoever gets the highest test scores, then yes, you are right that Asian-Americans are unfairly discriminated against in college admissions.  But if you use the colleges' definition of \"fair,\" it is more complicated than that.\n\nFrom the perspective of the high school student applying to college, admissions is a contest, where getting into colleges is a prize that should be awarded to the best contestant.  But from the perspective of the college, admissions is a more of a process where the goal is to assemble an entire class with the_right mix of talent, personality, connections, and potential to be successful and contribute something back to the college in the long run.  High school students look at getting into college as an end goal, while colleges look at admitting a class as the beginning of a lifelong relationship.\n\nSo while admitting students with lower tests scores may appear unfair to an applicant with high test scores, the university may view the admission as entirely fair in the context of a candidate[.] potential for leadership, ability to play football, or ability to bring in donations from their parents.  The university may admit a candidate from a minority group or a rural area to spread the university[.] influence to new communities.  The university may admit the child of a celebrity to bring notoriety to the campus.  The university may decide to avoid admitting too many students with perfect SAT math scores because it needs to balance out its science and humanities_major.\n\nSo while high school students, from the outside looking in, only see an unfair disparity in Asian SAT scores vs. white and black SAT scores, there is likely to be a lot more going on under the surface that the university would consider to be fair.  White and black students may be more likely to play varsity sports, more likely to have parents who attended the school, or more likely to come from underserved areas.  Maybe that[.] unfair to you, but the universities spend a lot of time evaluating their processes to come to something that they view as fair and legal.  As one example, this is the admissions policy statement on Harvard[.] website:\n\n*In his seminal opinion in Regents of University_of_California v. Bakke, Justice Powell specially cited to the Harvard College admissions plan in describing a legally sound approach to admissions. Then and now,* ***the College considers each applicant through an individualized, holistic review having the goal of creating a vibrant academic community that exposes students to a wide range of differences:  background, ideas, experiences, talents and aspirations.*** *The University[.] admissions processes remain fully compliant with all legal requirements and are essential to the pedagogical objectives that underlie Harvard[.] educational mission.*"}