{"doc_id": "271", "name": "2017_10_humanities_student_major_356_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2017-10-humanities-student-major_356_UofT.txt", "pub_date": "2017-10-05T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.301", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "514", "Permalink": "http://reddit.com/r/UofT/comments/74d5ei/in_a_dilemma_with_my_parents/dnxvkiv/", "Threadlink": "http://reddit.com/r/UofT/comments/74d5ei/in_a_dilemma_with_my_parents", "Parent_id": "t3_74d5ei", "Reddit_id": "dnxvkiv", "Subreddit_id": "t5_2rbaq", "Commenter": "Teshi", "length": "2985", "content_scrubbed": "I have a History/English double major.\n\nSpeaking practically, your parents are right. CS is one of the few degrees which almost guarantees you some kind of full-time employment. This employment doesn't necessarily have to be in Computer Science/Programming/Software Engineering forever--as some have pointed out, you could easily transition into different positions once you had some full-time working experience under your belt.\n\nA computer science degree could help to pay for a second degree. The reverse is not true.\n\nOne possibility that might assuage you do both. Since you already seem to be starting fresh, it would not be impossible so interlace the end of your CS degree with your humanities classes and get both. \n\nHowever, maybe you really hate CS, don't ever envision yourself working in CS, and wish you'd never capitulated to your parents' demands in the first place. What are your options?\n\n1. Have a plan. CS sets you up to be hired without work experience. The humanities will not. You will need to star getting experience (probably through volunteering) in a field that is similar to your interests right now, making connections and getting experience. If you don't want to be a programr, what do you want to do?\n\n2. College graduate degrees are a thing, they accept people with lower GPAs, tend to be very practically focused, and if you choose carefully and do you research can get you a full-time job. Many of these jobs can pay well, or very well. You should not view getting a college graduate degree as a \"failure\" option, but as a valid method of converting half a CS degree and a History major into full-time work.\n\n3. Teaching is also a thing. Even with only half a CS degree you'll be well-placed to become a high school computer science/history teacher (you'd need two teachables). Teaching[.] a very social profession, and maybe you'd really prefer that to CS (not that CS isn't social). If you're interested in psychology, becoming a teacher is a reasonable profession because kids are nuts and fun to try to understand. Again, volunteering might help you get experience and understand if you'd like it.\n\n3. If you make a choice at odds with your parents', now is the time to accept financial responsibility for yourself the moment you graduate. You can't expect to go home and rely on their financial support once you graduate. You don't have to contribute to the family, but you have to be able to support yourself. Showing your parents you have a plan (e. g. volunteering) will be an important step in trying to show them you are taking this life change seriously.\n\n4. If you're genuinely starting over (which you seem to me to be), your current GPA will not matter. HOWEVER grad school is not a magic bullet. I worked in retail with a MSc because I had no other experience (and didn't want to teach which was my CS), and I was not the only person there with a graduate degree. But there[.] nothing wrong with retail, it just pays badly.  \n\nGood luck!"}