{"doc_id": "919", "name": "2017_04_humanities_student_major_43_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2017-04-humanities-student-major_43_slatestarcodex.txt", "pub_date": "2017-04-01T00:00:00Z", "Sentiment": "0.023", "Subjectivity": "0.468", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "680", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_62tec1", "Reddit_id": "dfp10wv", "Subreddit_id": "t5_30m6u", "Commenter": "werttrew", "length": "4396", "content_scrubbed": "I don't know if you all are sick of talking about [Middlebury](http://www. weeklystandard. com/professor-injured-in-charles-murray-middlebury-protest-responds-with-op-ed/article/2007204) yet, but here[.] one more recent piece that was pretty good.\n\n\nFlagg Taylor for *American Interest*: [The Meaning of Middlebury](http://www. the-american-interest. com/2017/03/29/the-meaning-of-middlebury/).\n\nThen came this revealing exchange:\n\n * Bruni: \"It[.] so hard though because you really want to salute the passion of the students. I like that they are engaged, but...\"\n\n * Haidt: \"If only they'd learned that any virtue carried to excess becomes a vice.\"\n\n\nHere Bruni speaks the language of the credentialed class and all right-thinking people: We must applaud both \"passion\" and \"engagement.\" Bruni[.] inclinations on this score are wholly in keeping with the culture of the contemporary liberal_arts college. The cult of engagement must not only be understood in relation to political correctness, but in relation to what William Deresiewicz recently called the \"religion of success.\" Liberal arts educators are now driven by \"competencies\" and a concern for relevancy. An education at a liberal_arts college is no longer emphasized as a good in and of itself, but something that will prepare you for the \"real world.\"\n\nMany colleges will, for example, give students academic credit for internships. Rather than instruction in a particular discipline and with the expectation of mastery of subject matter, students are offered \"experiences,\" some of which might even be designated as \"high impact.\" This is not to suggest that traditional instruction does not happen or that internships are worthless. But the cultivation of the mind through the reading of difficult texts, through the assimilation of strikingly contrary opinions, and through the discussion of those texts and opinions with one[.] professors and peers is no longer given pride of place at many colleges. We send the message that while that traditional approach is well and good and maybe even somewhat necessary, it isn't nearly enough and is divorced from what the \"real world\" demands.\n\nIt is wrong, however, to think that liberal_arts colleges can \"train\" students and strive for relevancy while also remaining dedicated to the cultivation of the mind. \"Passion\" and \"engagement\" are not only poor substitutes for virtues like moderation, courage, and prudence[;] they create an environment hostile to their cultivation. Further, the demands of the \"real world\" are ever-changing, and adapting the cultivation of the mind to the instrumental goals of society results in a limitation and adulteration of that delicate process. By trying to imitate the real world that has already changed before our imitation can be constructed, as Vaclav Havel once wrote, we end up falsifying the real world. The humanities and social_sciences have retreated from the cultivation of the mind and their devotion to the discovery of truth and the human good. With the question of purpose left unasked and the possibility of truth not considered, space is left open to politically correct dogma and those willing to demonstrate their passionate commitment to the cause.\n\nThis is the other side of Bruni[.] admiration for the passion of the students. Haidt, for his part, seems to imply in the oral heat of the moment in retort that passion itself is a virtue. Perhaps he meant that the commitment activists display in serving their cause is laudable.\n\nBut applauding the passion or commitment displayed by student-activists is problematic for a host of reasons. First, one might be a passionate activist in the service of an invidious cause. Ought we celebrate the passion of a 9/11 hijacker or a suicide bomber? Second, passionate commitment can also embody a cheap moral exhibitionism that is both pointless and self-indulgent. Indeed, precisely that happens a lot these days on campus. Take the Middlebury incident as a case in point: So it was that, after offending vast swaths of the French intellectual establishment with his book *The Opium of the Intellectuals*, Raymond Aron was charged with being both dry and overly negative. \"I must confess to an extreme repugnance to reply to this type of argument,\" he responded. \"Those who let it be known that their own sentiments are noble and those of their adversaries base strike me as exhibitionists.\"\n"}