{"doc_id": "1145", "name": "2017_04_humanities_student_major_2046_gatech", "namespace": "we1sv2.0", "metapath": "", "pub": "gatech", "title": "2017-04-humanities-student-major_2046_gatech.txt", "pub_date": "2017-04-18T00:00:00Z", "Sentiment": "0.165", "Subjectivity": "0.448", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "327", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_661485", "Reddit_id": "dgfn03r", "Subreddit_id": "t5_2r8t2", "Commenter": "Christophu", "length": "1806", "content_scrubbed": "I'm only a first-year CM major so what I know is fairly limited BUT ..\n\nI would recommend CM if you have an interest in both CS and liberal_arts (hence the whole CS + LMC thing). The main difference between CM and CS is that instead of taking a 2nd CS thread, you take an [LMC thread](http://lmcdegree. lmc. gatech. edu/threads/). If there isn't an LMC thread that matches your interests, you might just be better off being a CS major with the Media thread and something else. \n\nFor me, I want to go into UI/UX Design, so I'm doing the People and Interaction Design/Experimental Media threads (a popular path for people who want to go into UI/UX). I love coding but I also love more front-end things like graphic design and interface design. Though there are CS courses on these topics (CS 3750 - User Interface Design), I feel like LMC courses allow you to explore this aspect even more, whereas CS sort of gives you an introduction. \n\nThat[.] not to say you can't do this through a CS major, because I have tons of CS friends who want to go into the same field as me and chose People and Media threads. I just feel like being a CM major lets you learn more specific info about the field without a lot of the unnecessary stuff that[.] in the CS core (like I didn't have to take physics, for example). \n\nAlthough, this is just my very-specific, personal case. I know lots of game designers, (music) producers, and animators who are in CM, as well. There[.] probably a ton of other fields I don't know about, too. \n\nI would also recommend you don't choose CS just because no one knows what \"Computational Media\" is because I don't want you to pick something for the \"name\" and just suffer through it when there[.] a another perfectly viable option available. \n\nIf you have any other CM questions, feel free to ask!"}