{"doc_id": "414", "name": "2017_10_humanities_student_major_1712_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-10-humanities-student-major_1712_politics.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "-0.093", "Subjectivity": "0.392", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "291", "Permalink": "http://reddit.com/r/politics/comments/779dfc/john_mccain_flattens_fox_news_reporter_why_would/dokpf80/", "Threadlink": "http://reddit.com/r/politics/comments/779dfc/john_mccain_flattens_fox_news_reporter_why_would", "Parent_id": "t1_doko3de", "Reddit_id": "dokpf80", "Subreddit_id": "t5_2cneq", "Commenter": "DfizzleShizzle", "length": "1704", "content_scrubbed": "Exactly. And it[.] why the \"both sides are the same and both sides have crazies!\" argument is bullshit. Obviously there[.] nuts on both sides, but the_left does not have multiple multi-million dollar media personalities on mainstream networks spreading outright conspiracy theory and lunacy. There is no left_wing Glenn Beck, or Alex Jones, or Ann Coulter, or Rush Limbaugh... You get the idea.\n\nI mean who fits that description on the_left? The closest you could get to a 'left_wing Glenn Beck' is probably Bill Maher and he[.] not even fucking close... The right has a sophisticated propaganda machine, and they've used that machine to convince their base that it[.] actually the *left* that has a propaganda machine! It[.] fucking insane.\n\nI mean the Tea Party has multiple seats in congress, you have Republican congressmen that think pornography and sodomy should be illegal and that the earth is 6000 years old, you have Alex Jones saying that Hillary smells like Sulphur and is a DEMON, and yet people will point at some student group at some random liberal_arts College that does something a little moronic and go \"see! Both sides are the same!\"\n\nWhat I'm seeing in this country is honestly scaring me. Theres always been a somewhat religious like devotion to the_right from certain people in this country for as long as I've been politically aware, but they are quite honestly getting worse. A whole horde of people that think everything is fake news but spread literal propaganda from documented fake news site every day and don't care... An entire legion of wanna be 'alpha-males' that base their entire political idealology on some weird sense of masculinity. It[.] getting weird in the ol' US of A"}