{"doc_id": "342", "name": "2017_10_humanities_student_major_1073_datascience", "namespace": "we1sv2.0", "metapath": "", "pub": "datascience", "title": "2017-10-humanities-student-major_1073_datascience.txt", "pub_date": "2017-10-11T00:00:00Z", "Sentiment": "0.171", "Subjectivity": "0.346", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "281", "Permalink": "http://reddit.com/r/datascience/comments/75rx4c/transitioning_from_academia_to_data_science/do8k9uk/", "Threadlink": "http://reddit.com/r/datascience/comments/75rx4c/transitioning_from_academia_to_data_science", "Parent_id": "t1_do8jdxo", "Reddit_id": "do8k9uk", "Subreddit_id": "t5_2sptq", "Commenter": "WeoDude", "length": "1608", "content_scrubbed": "My best advice is pick an industry that you want to be a data scientist in and learn what the data science applications are for that field. If you feel like you need to learn some more stuff (maybe Spark, Jupyter ecosystem, Deep Learning) and build a project or two. I know you probably don't have much spare time (I was a physics major at a small liberal_arts school).  \n\nFor me (and perhaps, for you) the biggest question employers had for me was taking business data, building a scientific experiment around it, and then using that experiment to drive action that gave them some monetary value. If you could build a project around that, I think  people will be very willing to forgive that you dont have the \"industry\" software engineering experience. Learning how to use Git, Docker, and the jupyter ecosystem is not that hard. It just might take you some time to do these things because you of course have a day job that might leak into the night. \n\nI dont know if they would contact your current employers (probably only if they were going to hire you), however, I'll leave someone with a bit more experience to answer that. I think places with large coding/data science teams are probably the best fit for you (Amazon, Google, Facebook). They struggle to get people with strong understanding of scientific method (and in some cases mathematics) but have no shortage of people who can code. They are also well suited/calibrated to handle people with your backgrounds. \n\nThe other route you might go is the FFRDC route. If you don't mind working in defense, they also value people with your background. "}