{"doc_id": "1203", "name": "2017_04_humanities_student_major_2610_wayofthebern", "namespace": "we1sv2.0", "metapath": "", "pub": "WayOfTheBern", "title": "2017-04-humanities-student-major_2610_WayOfTheBern.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.019", "Subjectivity": "0.39", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "332", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_671f6m", "Reddit_id": "dgn9w1n", "Subreddit_id": "t5_3ff8l", "Commenter": "SpudDK", "length": "1814", "content_scrubbed": "This is what happens when we force people to take out a mortgage on their own potential then refuse to value and pay them well enough to get a return.\n\nI'll tell you right now, I did some liberal_arts education because it was something I knew I needed given where I came from.  Tech has always been personal improvement.  On topic or book a month for years.  Making that choice was easy, costs modest.  I did it on minimum wage, starting my first career in manufacturing.  I have had to make three career jumps since, just to keep up and o make very modest gains compared to past generations.\n\nIf I had to do over today, there is absolutely no way I would sign on to those loans.  The idea of a career is dubious for a majority of millennials today.  It[.] going to be ugly for all of us.\n\nAnd that is sad, because education really matters to most people.  Even more so today, given how crappy primary education has become.\n\nWorse, a whole generation has already impacted things, Gen Y.  Millennials are coming in big now, and we've seen nothing yet.\n\nThose who have the most are taking all the value, gains, out of everything now, today.\n\nSociety as a whole is going to pay hard for that rabid greed.  They probably won't.\n\nMaybe we should just eat the rich.  Metaphorically, of course.\n\nMore realistically, a raw, ugly fight is on.  I feel we are at the beginning of serious and sustained unrest.\n\nIn that Thomas Frank \"Age of Trump\" video I linked here, he talks about gains taken home by ordinary Americans.  It used to be a solid share.  We all improved, nation strong and vibrant.\n\nSince sometime in the late 80s, that share of gains has been Zero.\n\nHello Bill Clinton and \"The Turd Way.\"\n\nNo matter what, I'm not gonna support those asses ever again.  The harm we have seen?\n\nNo.  I gotta sleep at night.\n\n\n\n"}