{"doc_id": "1218", "name": "2017_04_humanities_student_major_2762_redditforgrownups", "namespace": "we1sv2.0", "metapath": "", "pub": "RedditForGrownups", "title": "2017-04-humanities-student-major_2762_RedditForGrownups.txt", "pub_date": "2017-04-24T00:00:00Z", "Sentiment": "0.107", "Subjectivity": "0.304", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "732", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgn19lr", "Reddit_id": "dgp6nn9", "Subreddit_id": "t5_2sh93", "Commenter": "paratactical", "length": "3852", "content_scrubbed": "I think trying to split this into paragraphs only further elucidates the problems with the writing, but I gave it a shot. \n\n heyheyhey so I've got a topic to talk about TLDR (Summery below, in case no one wants to read all the in detail info.) \n\nI'm currently working at a local Walgreens at 21 years of age, not a college student, without a social life, with a skincare certification that doesn't help me for shit and broke. lets put that all aside for a minute. I'm looking for a help or guidance in finding a job that can help me combine the 2 things I'm good at in this world which I love, art, anything creative, and psychology, helping people. \n\n I was thinking about short term programs in a trade school to help me get a job that pays more than this one (11/h). like nursing, dental, etc. so I can work towards something, get a higher pay and help people, continue my education to hen decide if I want to stop and do social work or continue on to do clinical psychology which is my ultimate goal. but social work and any career in psychology doesn't pay well, even with a masters. keep in mind I have no degree. as for nursing, id still have to find the money to pay for these programs since I don't qualify for any financial aid, reason being why I'm not in college and have no degree, but also I suck at academics. although I love helping people, math and science are very important with nursing, and thats something that would be a weakness of mine. \n\n so I'm open to hearing about options you guys can help me. as for the arts, I have skills in a lot of areas. but any art career is mainly about who you know, not what your capable of doing. even if I wanted to focus on school for that to begin somewhere, web developing or graphic designing for example would require me to get a bachelors which I cannot afford right now, obviously. \n\n as for switching the job I have now, most jobs in my area (Miami) do not pay more than 11 a hour, and although I hate my job, my schedule, and it leaves me with no time, money, or room for growth, it is something. \n\n I've also looked at makeup artistry jobs or skincare jobs, which is what I've done since I was 14, but none pay as much or more than this one, and at a Walgreens of all places. mays and Sephora, etc, pay 11 an hour, not 11 plus commission, which is what I make, and id basically be switching a permanent position for another position where I could get replaced at any point by someone who sells more and still be in a dead end job where there isn't room for growth, not only as a career, but salary wise. let alone, I've looked and no places are hiring anyway, but when they are, the salary is less. \n\n long story short, I want to be able to go back to school, my only option are pay out of pocket or loans, which working full time as I am now won't give me time to do that, and I want to be physically in school to be around people to help me with my depression. \n\n so I want to be able to study at a university or work towards a degree to work on a long_term goal as my back up plan, but also be able to find a job where I can help people to work on self fulfillment for myself that won't require a degree, and schooling I can afford to get a higher salary and room to grow, whether it be helping people or art, so if anyone can please help me out here, give me options, please, please, please help me. \n\n if I can find a job/certification/trade and work towards that, I can find a way to afford uni, and then also find the time to work on personal projects or get an apprenticeship somewhere else. \n\n *****TLDR: What are some certifications/trades that don't require q degree, actually pay well (no bullshit, what ifs or mays) that revolve around helping people or art? My Strengths: Psychology, Illnesses, Art. Weaknesses: Academics, peronal Money situation, running out of time.\n\n"}