{"doc_id": "462", "name": "2017_10_humanities_student_major_2249_grandorder", "namespace": "we1sv2.0", "metapath": "", "pub": "grandorder", "title": "2017-10-humanities-student-major_2249_grandorder.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "0.044", "Subjectivity": "0.369", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "416", "Permalink": "http://reddit.com/r/grandorder/comments/78bw69/should_chaldea_have_a_contingency_plan/dosw4fr/", "Threadlink": "http://reddit.com/r/grandorder/comments/78bw69/should_chaldea_have_a_contingency_plan", "Parent_id": "t1_dosv45o", "Reddit_id": "dosw4fr", "Subreddit_id": "t5_39d7x", "Commenter": "SplitTheLane", "length": "2401", "content_scrubbed": " Don't really get the point you're making here, as none of these were summoned by us in any of the story chapters.\n\nGuda canonically summons all possible Servants. And is bonded with all of them. And has done all of the interludes.\n\nThe ones actually at Chaldea are different from the ones in the story chapters with the exception of Mash and a few explicitly noted exceptions. Chaldean Servants are the ones from the Throne, the others are blank copies. Which is why post-Solomon Servants begin to recognize you despite not being summoned by you: you've made an impression on their original version in the Throne.\n\nThe fifteen Servants I mentioned are the ones that don't care about humanity at all, as opposed to simply being loyal to you over them. The 80% I mentioned refers to the Servants who would normally protect humanity but would turn if their Master wanted them to. Like the KotR, off the top of my head, as evidenced by the Camelot chapter.\n\n Because Gudako/Chaldea in the Solomon Time Temple was humanity[.] last chance at survival. The bonds that were forged helped, but it[.] not as though they showed up at any other time.\n\nI think you missed the part where it was specifically stated that under normal circumstances they couldn't be summoned there at all, but they used Guda as an anchor because their bond was that integral to them now.\n\n Which was my point. If Gudako tried to start some shit against humanity, the Servants would rebel against her. That doesn't necessarily mean they'll kill Gudako, but they will stop her.\n\nYeah, the small percentage that would choose humanity over their Master. Who would get shut down by the majority that wouldn't.\n\n I can only think of two off the top of my head; Kiyohime, for reasons mentioned earlier, and Mephistopheles, if only because he'd get a kick out of your defeat.\n\nAgain, Guda canonically summons and bonds with all of the Servants. Very few of them would choose to break that bond for humanities sake, simply because the majority of them either don't particularly care about humanity, care about their Master more, or are too loyal at that point to turn against the person that means that much to them.\n\n In what way specifically? Gilgamesh[.] actions are pretty simple to understand. Agreeable is a different matter.\n\nHe tried to dump the Grail on humanity because he didn't like the Age of Man. He[.] of the lawful good alignment."}