{"doc_id": "940", "name": "2017_04_humanities_student_major_226_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-04-humanities-student-major_226_ApplyingToCollege.txt", "pub_date": "2017-04-03T00:00:00Z", "Sentiment": "0.273", "Subjectivity": "0.439", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "503", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_633hr9", "Reddit_id": "dfrfyvk", "Subreddit_id": "t5_2y2r8", "Commenter": "09109999", "length": "3057", "content_scrubbed": "If you want to do specific research within CS, I think you might want to consider the schools a bit differently. For one, Tufts has one of the best AI labs in the country, which is a highly popular area in CS currently. [Computer-Human Interaction](http://www. cs. tufts. edu/Research-highlights/research-highlight-brain-computer-interaction. html) and [CS interdisciplinary research at Tufts](http://www. cs. tufts. edu/Research/our-focus-interdiciplinary-research. html).\n\nMost CS undergraduates' main goal is to get a job after graduation; this would mean that area would matter a lot; Tufts and Brown are on the EC, WUSTL is in Missouri (St. Louis itself isn't faring very well), and Rice is in Houston (which is growing rapidly as a business city). If you are looking for good job placement right after college, I would recommend taking area in as a factor (as well as where you would want to stay. Houston is very very very hot and humid in the summer). \n\nIf you plan to move up to graduate level of studies, GPA matters (which makes Brown a bit of a difficult choice; it[.] good to have a closer relationship with your professors at Brown) a lot. Consider a school that is more lenient in GPA, and somewhere you could get a lot of research opportunities. \n\nAlso, look at online communities to have a feel for the professors at each institution. [Shriram Krishnamurthi](https://www. quora. com/profile/Shriram-Krishnamurthi) is a CS professor at Brown that is active on Quora. You can ask him specific questions that you have about Brown on Quora. \n\n\nBrown seems like a good choice off the top of my head, because of the name value as an Ivy (prestige counts a bit in recruiting and applying) and its nice CS program. Also, Providence has good access to other East_Coast states like NY and MA. \n\nI personally like Tufts as a school, but their curriculum is focused on Biology; you would get a lot of interdisciplinary research opportunities at Tufts, considering the amount of money they are currently investing in CS and CS research. It is also in Medford, which is near Boston, and has nice access to other East_Coast states as well. \n\nWashU has one of the best interdisciplinary research projects for its undergraduate students called IPH (Interdisciplinary Project in the Humanities), which allows you to combine topics to research in depth at WUSTL. I am aware that there is a student that combined Psychology and CS for an AI research project with comprehensive support from faculty. WashU also has a pretty rigorous CS program, and you can easily land jobs in Chicago, due to the name-value of WUSTL in the Midwest. However, you want to pursue a PhD, which means that you can have summer research opportunities at close-by places like UIUC. \n\nTo end, I have no idea about Rice, other than the crazy Halloween party, and that Houston is a very very very very hot place (and a busy one too). \n\nGood luck on making decisions, and congratulations on all the acceptances! I hope you find somewhere that suits you well, and provide you with the best experience!"}