{"doc_id": "507", "name": "2017_10_humanities_student_major_2772_careerguidance", "namespace": "we1sv2.0", "metapath": "", "pub": "careerguidance", "title": "2017-10-humanities-student-major_2772_careerguidance.txt", "pub_date": "2017-10-28T00:00:00Z", "Sentiment": "0.119", "Subjectivity": "0.396", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "287", "Permalink": "http://reddit.com/r/careerguidance/comments/798uwi/jobs_for_a_ba_in_psychology/dp102yj/", "Threadlink": "http://reddit.com/r/careerguidance/comments/798uwi/jobs_for_a_ba_in_psychology", "Parent_id": "t1_dp0wasx", "Reddit_id": "dp102yj", "Subreddit_id": "t5_2t9i0", "Commenter": "average97", "length": "1528", "content_scrubbed": "Lol that[.] nice to know at least someone[.] in a similar position as me. It feels like everyone around me is so successful and ambitious and stuff while I'm just left behind in the rubble.\n\nI'm the same way, the lack of a social life brought me down. And my low GPA prevented me from doing other things. I initially planned on doing business but I failed some courses freshman year. I then tried doing elementary education (my mom[.] a teacher and my family made it sound like that was my next best option) but I messed up on this math class required for it. It was a fucking ridiculous class. One time I asked my brother for help on a problem and he told me that my cousin (an engineering student at a top college) asked him for help for a question just like this one! Like damn this was a class designed for elementary ed teachers (to teach math to future students), and they're asking engineering questions lol like what the fuck...\n\nIn hindsight I'm glad that I got away from elementary education though because I would have HATED being a teacher. Psychology (or anything else in the college of liberal_arts) was all I was really left with at that point due to my low GPA, so I just picked psychology. It was my favorite class in high school after all. That, and spanish.\n\nI'm getting a spanish minor too.\n\nI do hope I find out what I wanna do. Good luck to you too! If I've learned anything from my post it[.] that we should take action now while we're young otherwise we're gonna make it harder for ourselves as we get older!"}