{"doc_id": "1153", "name": "2017_04_humanities_student_major_2123_history", "namespace": "we1sv2.0", "metapath": "", "pub": "history", "title": "2017-04-humanities-student-major_2123_history.txt", "pub_date": "2017-04-19T00:00:00Z", "Sentiment": "0.242", "Subjectivity": "0.437", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "857", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_665s15", "Reddit_id": "dgh7kkf", "Subreddit_id": "t5_2qh53", "Commenter": "zsimmortal", "length": "5197", "content_scrubbed": "I'm not sure I can give you a proper answer as I'm not quite an expert on the subject, but having somewhat extensive knowledge of the period you're talking about, I can possibly give you my opinion.\n\nSo first off, what you're suggesting is partially true. However, that[.] the perspective of some more orthodox schools of Islam. With regards to 'ancient Persian culture', you should forget about that aspect. The culture of Muslim (Greater) Iran is not ancient Persian culture to begin with.\n\nWhen the Arabs invaded Sassanid Iran and successfully defeated their armies, they were not in any way, shape or form, an overwhelming group. The Iranian region was very much so Iranian in population despite the migration of Bedouin tribes and Arabic rulers that ruled in the name of the Caliph. Some parts also remained completely unconquered at this time, such as the mountainous Dailam region (whose importance will come back later), which remained staunchly Iranian and Zoroastrian. Despite this, a great proprtion of elites (as Iran was a settled population with nobility) converted to Islam in an effort to gain power and resources, which was granted due to the need for Arabs to have competent administrators to take care of their vast new urbanized territory, something they had little experience in doing. In the same breadth, influence then became a two-way street, as Arabic Muslim culture was also greatly persianized. If you look at the compilations of Hadiths, for example, I believe all of the 'canonical' ones (or at least the great majority of them) are from Iranian scholars. That said, the Arabic influence is very important at this point, as art would neither depict animals or symbols (which was forbidden by Islam, if I recall correctly), which has led to beautiful calligraphy and geometric and floral art.\n\nAs the Abbasid caliph was gradually weakened by weak Caliphs, regional powers grew, and 'Persian' culture was at the forefront of the rise of Iranian powers. The two major powers that emerged were the Dailamite Buyyids (or Buwaihids), a Shia dynasty that would eventually subjugate the Sunni Caliph in Baghdad, and the Samanids, who are best known for their patronage of Persianate culture. Both of these, in the period known as the Iranian Intermezzo, would bring back classical elements of Persian culture, mixed with Arabo-Muslim influence. \n\nThe period[.] end came when a Mamluk emir, best known as Mahmud of Ghazni, would emerge in Afghanistan and topple these powers, creating the first Turko-Persian dynasty. While he nominally recognized the Caliph[.] supremacy (and was named Sultan for it), his empire would start a cultural movement that is the seed of today[.] Iranian culture. His main contribution to the revival of ancient Persian culture (this time, very appropriate) is the patronage of art, which includes the most important Persian piece of literature, the Shahnama, which tells the tale of Iran from the beginning of Iranian civilization to the defeat of Sassanid Iran to the Arabs. This single work would eventually be copied and illustrated all throughout the medieval and later periods.\n\nThe Ghaznavid demise came at the hands of the Seljuqids, the first group of nomadic Turks, who would embrace this Turko-Persian Muslim culture and help spread it all the way into Anatolia. Parallel to this development, an Afghan dynasty from Ghor, would take power in the last remains of the Ghaznavid domain and push this Iranian culture into Northern India, the dynasty being eventually succeeded by Mamluk Turks and other dynasties known collectively as the Sultanate of Delhi.\n\nThe Mongols would subdue the then rulers of Iran, the Khwarazmids, another Turko-Persian Mamluk dynasty, from Khwarazm this time, and their successor dynasty in the region, the Ilkhanate, would also embrace this Persianate culture, giving great patronage to the arts of this kind. It is mostly during this period and the Seljuqid one, that there was a booming revival of former symbols of Iranian culture, such as the Simorgh. The Mongols and Turks very much loved these symbols and re-integrated them into the Iranian culture, as we can see many of them in the Shahnamas of the period.\n\nThe Timurids would succeed the Mongol successors in their embrace of Iranian culture, as would the Turkomans who succeeded them (an important note is that the Aq Qoyunlu ruler Uzun Hasan would take the title of Shah, 'King').\n\nNow, the most important part for the modern country of Iran is the rise of a small Sufi Shia sect, which first received support from the Aq Qoyunlu. The Safaviyya would eventually get a leader named Ismail, who during the civil wars of the Aq Qoyunlu, would come to lead his group to conquering Tabriz and declare himself Shah of Iran. It was in this period that Twelver Shia became the official religion of Iran and would roughly break from the Sunni world, which was to come under the direct control of Ottomans, whose rivalry with the Safavids is well documented, creating a perfect situation for the fostering of their own distinct identity and preserving it.\n\nAnyways, here[.] short history of how Persian culture came to survive from what I know of Iranian history."}