{"doc_id": "959", "name": "2017_04_humanities_student_major_427_calpoly", "namespace": "we1sv2.0", "metapath": "", "pub": "CalPoly", "title": "2017-04-humanities-student-major_427_CalPoly.txt", "pub_date": "2017-04-04T00:00:00Z", "Sentiment": "0.16", "Subjectivity": "0.336", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "326", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63i6e4", "Reddit_id": "dfuc1xa", "Subreddit_id": "t5_2s470", "Commenter": "HeuristicWhale", "length": "1803", "content_scrubbed": "It all depends on what you want.  If I had to suggest one housing option, it would be the Red Brick building that corresponds to the type of people you most enjoy hanging out with.  For example, if you're a liberal_arts student who happens to enjoy being around engineers, I would suggest Santa Lucia.\n\nThe apartments (Cerro and PCV) are good if you want to have more space and a kitchen.  You have a lot more freedom in terms of food here.  They're significantly farther from the campus core than the rest of the dorms, which is an issue for some people.  PCV houses all years of students whereas Cerro is just freshman.  I don't think this significantly changes the experience of living there.  You usually have to actively go out and meet new people here.\n\nThe Red Bricks and the towers are your typical dorms.  You're almost forced to meet new people and be somewhat social here.  Many students view this as a good thing.  You will get a lot less personal space and space for things in the dorms.  I lived in Santa Lucia (one of the Red Bricks) freshman year and really enjoyed it.  Many of my good friends are people I met in my dorm.  Sierra Madre (one of the towers buildings) has a reputation for being the party dorm.  If you enjoy sleep, I would not suggest Sierra Madre.\n\nNorth Mountain is sort of a middle ground between the dorms and the apartments (literally and figuratively).  The rooms are bigger and you share a bathroom with only 8-12 students.  Students in North Mountain have access to the common areas in Santa Lucia.  It is fairly common for North Mountain students to hang out there if they want to meet more people or be more social.\n\nEdit: I meant the towers, not South Mountain.  South Mountain and the red bricks are the same thing.  The towers are Sierra Madre and Yosemite."}