{"doc_id": "291", "name": "2017_10_humanities_student_major_532_germany", "namespace": "we1sv2.0", "metapath": "", "pub": "germany", "title": "2017-10-humanities-student-major_532_germany.txt", "pub_date": "2017-10-07T00:00:00Z", "Sentiment": "0.049", "Subjectivity": "0.418", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "247", "Permalink": "http://reddit.com/r/germany/comments/74todu/how_are_academics_structured_in_german/do13bzp/", "Threadlink": "http://reddit.com/r/germany/comments/74todu/how_are_academics_structured_in_german", "Parent_id": "t3_74todu", "Reddit_id": "do13bzp", "Subreddit_id": "t5_2qi4z", "Commenter": "thewindinthewillows", "length": "1407", "content_scrubbed": "Most of what you've been told is very correct, but quite STEM-heavy when it comes to things like exams, papers etc. In the humanities, at least the ones I had contact with, there are no \"quizzes\" during semesters. If you need a graded proof of your successful participation in a seminar, that is often done through a paper/presentation - essentially, you give the presentation during the semester, and in the end you hand in a paper based on it.\n\nHowever, there are plenty of things that you need to do (say you have to have heard [x] number of lectures, some of them specific ones, some elective) - but no one checks you have done them.\nIt is perfectly possible to note in your list of attended courses that you have heard a lecture or been in a seminar where you needed no lecture/paper, while having been there never or only once. No one checks up on that... but the thing is that you will be expected to *know* the things that you should have learned there, at some point.\n\nThen, of course, there are fields of study that work completely differently. I studied music, and there you have multiple solo lessons per week, most of them with professors. They know all their students personally, they notice immediately if you haven't practised one week, any seminars in theoretical subjects take place in very small groups, admission is based on entrance exam, not school marks... completely different thing."}