{"doc_id": "476", "name": "2017_10_humanities_student_major_2444_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_2444_AskReddit.txt", "pub_date": "2017-10-25T00:00:00Z", "Sentiment": "0.052", "Subjectivity": "0.251", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "297", "Permalink": "http://reddit.com/r/AskReddit/comments/78mpfx/students_and_professors_of_reddit_what_moment/dovi857/", "Threadlink": "http://reddit.com/r/AskReddit/comments/78mpfx/students_and_professors_of_reddit_what_moment", "Parent_id": "t3_78mpfx", "Reddit_id": "dovi857", "Subreddit_id": "t5_2qh1i", "Commenter": "crimsonkodiak", "length": "1657", "content_scrubbed": "Apologies in advance for sounding braggadocious, but it[.] necessary to the story.\n\nSecond semester of my senior year of college I had switched from the college of business to the college of liberal_arts - I had already finished in business by the end of my third year and was getting a second degree in the college of liberal_arts.\n\nEach college had a requirement that students take 2 classes of science - one of which could be a social science and one of which was a physical science.  I had completed my physical science class for the college of business my freshman year - Psych 210: The Brain and the Mind.  It was an interesting class that taught a lot about the chemistry underlying brain function.\n\nWhen I went to complete the courses for the college of liberal_arts, I was informed that the college did not accept that class as a physical science class.  I appealed to the college, as I had already fulfilled the requirement in the college of business (the difference between the two was stupid, IMO) and, frankly, the class had a very hard physical sciences bend, despite being in the college of psychology.\n\nI got back a form letter denying my request for a waiver saying that the college wouldn't waive the requirement because they felt their students needed to be \"well rounded\".  So I dropped the German language elective I had planned on taking and added Geology 103: Rocks for Jocks instead.\n\nI graduated after that semester.  In 4 years, I had amassed over 5. 5 years of credit hours, spoke 4 languages and was summa cum laude with 2 degrees and 3 majors.  Thankfully, I was able to take that Rocks for Jocks class so that I was well rounded."}