{"doc_id": "1159", "name": "2017_04_humanities_student_major_2159_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2017-04-humanities-student-major_2159_slatestarcodex.txt", "pub_date": "2017-04-19T00:00:00Z", "Sentiment": "0.04", "Subjectivity": "0.203", "Score": "15", "Upvotes": "0", "Downvotes": "0", "Wordcount": "307", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65j3fu", "Reddit_id": "dghnxgl", "Subreddit_id": "t5_30m6u", "Commenter": "Midnighter9", "length": "2206", "content_scrubbed": "[No platform for Aristotle](https://medium. com/@dctvbot/no-platform-for-aristotle-867a04c5da50)\n\nThe author is a Jewish leftist describing agitations in London by the student group SDLD50 (Shut Down LD50). LD50 is the so-called \"alt-right\" gallery that features content from frogtwitter and thinkers like Nick Land, who is described by the group as a racist crypto-fascist. There[.] a reference to Kantbot in there too.\n\nImportant to remember is that SDLD50 are children of the cognitive elite — composed in universities, instead of factories. They are not the underprivileged; they are privileged with their nausea. At the same time, they're attending a brutally expensive art university at the end of a long decade in which the costs of elite institutions like the RCA and Goldsmith[.] has dectupled, and their value to their graduates has fallen off a cliff. This generation will be poorer than their parents, who retain unprecedented shares of global wealth, and faces feral competition for diminishing resources and status.\n\nThe structural point pertains to the reality of their political formation within a cultural academic system that is itself a form of exploitation. The reality is this: Demand for art students and liberal_arts graduates does not support production. The difference is split with ideology. Students graduate into debt, precarious employment and freelancing, low-paying service jobs, including sex work, theorized intricately by radical academics, and/or continuing economic support from their parents. By selling them identities instead of skills, paid via debt guaranteed by the government (in the US, student debt is now $1. 3 trillion) universities and the contemporary culture industry have created radicals in and as the process of exploiting them. \n\n---------------------------------------------------------------------\n\nThere was a triple-shooting in Fresno yesterday; the shooter was a black Muslim who said he hated white people, and all of the victims were white. Apparently [one of them](http://www. fresnobee. com/news/local/article145366799. html) was [an antifa supporter](https://twitter. com/r_altright/status/854782140088819718) too, so there[.] the daily dose of irony."}