{"doc_id": "444", "name": "2017_10_humanities_student_major_2122_circlejerk", "namespace": "we1sv2.0", "metapath": "", "pub": "circlejerk", "title": "2017-10-humanities-student-major_2122_circlejerk.txt", "pub_date": "2017-10-22T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.509", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "488", "Permalink": "http://reddit.com/r/circlejerk/comments/7812qi/til_that_harvard_professor_bernie_sanders_was/doqcmlx/", "Threadlink": "http://reddit.com/r/circlejerk/comments/7812qi/til_that_harvard_professor_bernie_sanders_was", "Parent_id": "t3_7812qi", "Reddit_id": "doqcmlx", "Subreddit_id": "t5_2qpol", "Commenter": "jpa321-2", "length": "2703", "content_scrubbed": "I literally can't express how much better my life has been since I attended Oxford. I went to a state school and gradually became the stereotypical moody, withdrawn sensitive type who both despises the quality of his immediate culture and feels a weird pride for having been raised in a sort of anti-intellectual and brutal environment. I was all set to take my Russell Group humanities BA and spend my life working as an anonymous, insecure wageslave forever thankful of being offered a job and forever too insecure to pursue my creative ambitions. The chip on my shoulder had become something of a wedge, and I felt too out of place regardless of my environment, too resentful and bitter to even attempt to make it in the artistic world. Then I finally applied for Oxford and got in to study an English MA, with reassurance that should I work hard enough a career in academia or within one of Oxford[.] affiliated companies would be almost guaranteed. I turned up as apprehensive as usual, and the first few days were spent regretting my decision and desperately feigning a cultured personality. But then I realized that the people there were just interesting and that the snobbery and exclusivity I had anticipated was just a myth borne out of my working class upbringing. I've since graduated, having spend the year dining in grand halls with groups of interesting people, dating several girls (one of whom, a petite Russian whose family traces back to the aristocracy, is now my fiancee). I work four days a week at a publishing company and earn £38k a year. I regularly meet up with friends from my college and visit Oxford for nights out and for meetings with my professors. The Martin Eden-esque novel I have been writing for two years has been selected for publication at a major British publishing house and, honestly, I could not have imagined a few years ago how great life could be. I come on /lit/ and see how pathetic you all are and just shake my head and chuckle. If I saw you guys on the street I would of course throw you a penny or discuss Bukowski or whatever \"realist\" writers you enjoy, but ultimately I would be able to tell within ten seconds if you're an Oxbridge grad and would dismiss you as a potential source of good company if you are not. I never thought I'd know what it was like to be objectively better than somebody else, for the value of my existence to be superior to the value of a stranger[.], but now I do and I've never been happier. People are awed by power and prestige. All I need to do is mention the university I attended (if only for a year) and they immediately begin to hunch and look at their feet because they know they are in the presence of greatness."}