{"doc_id": "922", "name": "2017_04_humanities_student_major_62_negareddit", "namespace": "we1sv2.0", "metapath": "", "pub": "Negareddit", "title": "2017-04-humanities-student-major_62_Negareddit.txt", "pub_date": "2017-04-01T00:00:00Z", "Sentiment": "0.136", "Subjectivity": "0.361", "Score": "14", "Upvotes": "0", "Downvotes": "0", "Wordcount": "422", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_62u138", "Reddit_id": "dfp9fep", "Subreddit_id": "t5_2vsbl", "Commenter": "Rekthor", "length": "2435", "content_scrubbed": "Mostly a lack of education, I find. And I see essentially nobody saying it after second-year university, because that[.] generally the time when all the assholes who are just there because \"they have to be\" have dropped out and the only people who want to be there are doing really well.\n\nI don't hear this line of thinking a lot, given who I spend my time with (philosophy/law major), but in my experience the reasoning always seems to be \"You'll never find a job if you don't work in STEM\" and/or \"Any job that isn't STEM isn't worthwhile because it doesn't contribute to human development.\" There[.] problems with this.\n\n1. STEM fields can only give you a \"How\", not a \"Why\". Science and mathematics and engineering are not good or bad, they are only *true*. It[.] up to fields like philosophy, law, history and the arts to provide a framework for how we *ought* to conduct ourselves—which technologies we should use, how we might use them, and whether we're okay with using them in the ways we want. Both STEM and the Humanities are ultimately trying to work towards the same thing: understanding the universe and our place inside of it, and they cannot do it without the assistance of the other.\n\n2. Interdisciplinary studies has, in my experience and [many others](https://youtu. be/t_N7MAr98CI?t=3m), only led me to having a greater understanding of people, of myself, and of the societies we life, have lived and will live in. Acting taught me how to talk to people, philosophy taught me how to think, history taught me how people have thought, literature taught me how to make other people think, etc. All of these tools are invaluable to you in the job market, because they make you a more rounded, observant person who can learn to perceive the world from many different viewpoints. That, in turn, makes you a more empathetic, comprehensive and wise person, which is the kind of person that is useful in **literally every job on the planet**.\n\n3. In addition to giving you really useful skills that can be brought to every job, studying non-STEM fields also really does make you a more well-rounded person in every other aspect of your life too. If you learn to ask questions and see things from many different perspectives, you also (generally) become more willing to listen and learn and contribute to the lives of others. And the *number one thing* that people look for in others is someone who adds something to their life. "}