{"doc_id": "464", "name": "2017_10_humanities_student_major_2272_southafrica", "namespace": "we1sv2.0", "metapath": "", "pub": "southafrica", "title": "2017-10-humanities-student-major_2272_southafrica.txt", "pub_date": "2017-10-24T00:00:00Z", "Sentiment": "0.147", "Subjectivity": "0.486", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "344", "Permalink": "http://reddit.com/r/southafrica/comments/78c54y/having_to_grow_up_in_this_country_is_a_real_pain/dotchy8/", "Threadlink": "http://reddit.com/r/southafrica/comments/78c54y/having_to_grow_up_in_this_country_is_a_real_pain", "Parent_id": "t3_78c54y", "Reddit_id": "dotchy8", "Subreddit_id": "t5_2qney", "Commenter": "DarfSmiff", "length": "2041", "content_scrubbed": "While I understand and share a lot of your concerns about SA, rather than commiserate or try to persuade you to stay I'd rather speak to what you should do to maximize your opportunities for getting a visa to work in another country and make enough money to sponsor your family to follow.\n\nThe first thing you should do is identify the country or countries your most interested in moving to and have a look at what degrees/skills they offer work/critical skills visas for, then adjust your studies and degree to match.  Broadly speaking, and without knowing your interests or strengths, your best bet for a visa would be to get a degree in one of the more practical fields within STEM, with Engineering and Tech being the two strongest.  Alternatively, virtually every developed country currently has a shortage in skilled trades, of which the more niche areas like high voltage electrician or underwater welding pay very well, very quickly, with the trade-off being the danger and difficulty being pretty high.  If heavy manual labor isn't your thing, hospitality is worth looking into, although the pay isn't that great and the hours are generally pretty shit.  Most importantly, don't bother with a degree that isn't inherently quantifiable, ie anything in the humanities.\n\nWhile I'm admittedly biased towards the following because it[.] something I did myself, if I were you I'd look into software/web development.  You can learn everything you need anywhere there[.] an internet connection for free (or relatively cheaply) through online courses, it[.] a field where you don't need a relevant degree to find a job as long as you're able to prove you have chops and there are a metric dickton of jobs that pay pretty well to start and fantastically well 5 years in.\n\nFWIW, I was raised in New_York, put myself through college and grad school, changed careers 3 1/2 times, have traveled extensively, lived in 4 countries and I've called South Africa home for the last 9 years.\n\nPS Sorry for any mobile induced run-on or disjointed sentences."}