{"doc_id": "383", "name": "2017_10_humanities_student_major_1454_purdue", "namespace": "we1sv2.0", "metapath": "", "pub": "Purdue", "title": "2017-10-humanities-student-major_1454_Purdue.txt", "pub_date": "2017-10-16T00:00:00Z", "Sentiment": "0.071", "Subjectivity": "0.375", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "598", "Permalink": "http://reddit.com/r/Purdue/comments/76l55j/the_decline_of_the_midwests_public_universities/dofnt52/", "Threadlink": "http://reddit.com/r/Purdue/comments/76l55j/the_decline_of_the_midwests_public_universities", "Parent_id": "t1_dofmvup", "Reddit_id": "dofnt52", "Subreddit_id": "t5_2qoyi", "Commenter": "everybodyshomie", "length": "3658", "content_scrubbed": "I would say this. I studied politics and did reporting a few years ago at Purdue, and honestly I think the usefulness of the degree is pretty questionable. I wasn't a slacker. I spent many hours talking to people in an honest attempt to better understand how they thought. I believed in learning meaningful, practical things which I don't think is the prevailing theme for liberal_arts right now. You'll see why below. \n\nMany Division 2-3 universities and community colleges provide access to education that other for-profit institutions simply do not. I don't completely trust Purdue in this regard either since they just spent a decent amount on a deal with Kaplan and I think it was a bad move. That[.] a little beside the point, but I wanted to acknowledge what you said.\n\nI know this is anecdotal, but it gives a good bit of insight to how the local community feels about your proposals and potential expansions, most of which I think would work if implemented in good faith.\n\nWhenever someone would come along with an apartment complex or zoning proposal for a building, the community regulars always weigh in. The grocery store across from Mackey could have been 15 stories, but neighborhood associations (anyone who sends their kids to West Laff K-12 schools or people afraid of losing property value on their homes, typically both) pack city council and county commission meetings all the time.\nhttps://www. purdueexponent. org/city/article_23d4a1cb-f87a-520b-828b-03d9fbbff390. html\n\nAside from the occasional visit from the student body president, seeing students aside from myself at these meetings was extremely rare. \n\nThe problem is, most of those 3 or 4-story apartments where students live all south of and creeping north of State Street used to be historic, quality single-family homes like the neighborhood you see near the sports stadiums. Since they didn't want to commit to 15 or 20-story student complexes close together, they built the ones you see now. The reason they didn't then and are only slowly doing it now is because they didn't want to create a 'Chicago' vibe.\n\n Another concern was the location of the building.\"This is a fringe area, I'm not sure residents would like this, that[.] not the Purdue image,\" she said. \"This is West Lafayette, not Chicago.\"\n\nThat quote almost perfectly encapsulates the mentality of the average homeowner in West Lafayette. It[.] tough to convince people to go along with bold initiatives under those circumstances. They see you as an outsider. They know you're going to leave. Even though students are in the best position to influence their own situation, they don't really think it can be worth their time because in their minds they want to leave too. I know I did. So what you have left over is the councilors, developers, and local families dividing up taxes that come from students. Either way, people complained a ton about the building that now houses the grocery store across from Mackey. I bet people love it now. I certainly wish it was there when I was a student.\n\nI don't know more about the Amtrak situation, but I know the state has been waffling on even keeping access open to Purdue and the Lafayette area.\nhttps://www. purdueexponent. org/features/article_3dce5015-593c-54df-b6f5-beb409200f46. html\n\nI think a high-speed rail concept would help support the revival of rural communities and feature the achievements of our universities much better. But again, they don't even seem to like the Amtrak that much and the people most likely to push for a better service (the students because they use it the most) usually leave in four years or less with little intention of returning.\n\n"}