{"doc_id": "482", "name": "2017_10_humanities_student_major_2543_gradadmissions", "namespace": "we1sv2.0", "metapath": "", "pub": "gradadmissions", "title": "2017-10-humanities-student-major_2543_gradadmissions.txt", "pub_date": "2017-10-26T00:00:00Z", "Sentiment": "0.126", "Subjectivity": "0.444", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "241", "Permalink": "http://reddit.com/r/gradadmissions/comments/78q576/deciding_which_phd_programs_to_apply_for_am_i/dowt4fk/", "Threadlink": "http://reddit.com/r/gradadmissions/comments/78q576/deciding_which_phd_programs_to_apply_for_am_i", "Parent_id": "t3_78q576", "Reddit_id": "dowt4fk", "Subreddit_id": "t5_2tn62", "Commenter": "PurrPrinThom", "length": "1451", "content_scrubbed": "It[.] hard to answer your titular question without knowing anything about your profile - maybe you, maybe you aren't.\n\nBut to address your final question, no I don't think you're pretentious is wanting to a top school. Granted, I'm biased, as I hopped top school to top school but I'll give a perspective anyways.\n\nYou're right in that humanities PhDs aren't exactly lucrative money-making degrees and that a top school can be helpful in obtaining a job. The question of whether prestige matters comes up frequently on this sub, and the other academic subs, and there are unfortunately no concrete answers because everything is marred by personal bias. While this lack of outright answer might be frustrating, it is an accurate representation of the job market at large: some people care about school prestige and will make it a factor in hiring decisions, while others won't. Outside of prestige, however, there are other benefits to an upper-ranked school. \n\nFunding, the potential for a more rigorous curriculum, increased access to resources, and the chance to work with big-names in the field (as top schools like to hire big names) are all major benefits. Because of these benefits, they are highly competitive programs and it[.] possible your recommender was thinking you'd rather get in anywhere than nowhere, and thus suggested you look elsewhere just in case. \n\nI think the idea to apply to other master[.] programs is a good one, as a back-up."}