{"doc_id": "1154", "name": "2017_04_humanities_student_major_2124_ucr", "namespace": "we1sv2.0", "metapath": "", "pub": "ucr", "title": "2017-04-humanities-student-major_2124_ucr.txt", "pub_date": "2017-04-19T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.276", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "770", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65uk6g", "Reddit_id": "dgh865t", "Subreddit_id": "t5_2s3tf", "Commenter": "UCRstudent008", "length": "4720", "content_scrubbed": "Hey, I'm a student at UCR. Though I'm not a film studies major, I have some knowledge about the courses and resources at UCR. I don't think animation courses are offered at UCR or UCI that often. Furthermore, none of the faculty seem to work on animation. If you want to do animation, you will probably have to find friends or work on your own. \n\nAn important thing to note is that UCI does not have an independent film production major. Most classes fall under film studies, which is more theoretical and academic work than hands-on production. There are hands-on courses at UCI but they are all taught by lecturers. This is not a terrible thing since the lecturers hold MFAs from UCLA and Claremont. \n\nUCR does offer film production courses but (from what I'v e heard) mainly they're guides to helping you work on your own projects. ALSO there are two departments related to film at UCR: (i) Theatre, Film, and Digital Production and (ii) Media and Cultural Studies. The former offers more hands-on coursework and the latter is similar to what is offered at UCI.\n\nThe question might be: Do you want a major that integrates both production and film studies? Pick UCI. Do you want to learn more about (unfortunately, live-action) film production? Pick UCR. \n\nI can say that UCI seems to have better resources: http://www. humanities. uci. edu/filmandmediastudies/resources/resources. php.\nAlso, UCI offers interesting minors: Minor in DigiFilm and Digital Arts. http://art. arts. uci. edu/programs-and-courses\n\n*Tip: Try going through the coursework of the programs at both schools. Use ctrl+f to find \"animation\" and keywords relevant to your interests. \n\nThings to Look out for at either school:\n1. School Newspaper\n\t\nThe UCR student newspaper looks for weekly comics and that can help you keep your animation skills sharp.\n\n2. Film festivals and contests\n\nTo submit your work \n\t\n\n3. Samuel Goldwyn Writing Contest\n\t\nScreenplay/Play writing contest for all UC students.\n\n4. Fellowships and Grants for Projects\n\t\nTalk to faculty or consult \n\n5. Galleries and Labs\n\t\nLook for labs and other resources to use. There are editing labs and expensive scanners and so on. Also, look for galleries so you can submit your work or check out other people[.] work. UCR has the Barbara and Art Culver Center nearby. There are free film screenings, student curator jobs available, and photographs to look at.\n\n6. The School Library\n\t\nThe libraries have a ton of movies and books for you to use. You can check out screenplays, film books, oversize art books, and all sorts of movies. \n\n7. Faculty Members and Graduate Students\n\t\nLook for professors and graduate students who are researching what you're interested in. You never know what opportunities a conversation might lead to! \n\n8. Jobs Nearby\nLook for animation jobs nearby. I think you'll learn more about animation at work as an apprentice/assistant than at school.\n\nIn summary, here are some things I think you should consider:\n\n1. Do you want to take courses in philosophy, psychology, literature, and other humanities? \nInterestingly, UCR has a very strong continental philosophy program (ranked #1 by the top philosophy rankings site). Continental philosophy includes existentialism, Nietzsche, Heidegger, Frankfurt School, which are quite influential on the arts.\n\n2. Are you a good writer and interested in theoretical work? UCR offers the Mellon Mays Fellowship (open to only UCLA, UCB, and UCR). The Mellon Mays Fellowship offers a lot of money (10k a year plus summer stipend) for a student interested in pursuing an academic study of some humanities field. You could do a study on \"History of American Animation\" or \"The Experimental Style of Satoshi Kon: Space and Time,\" or whatever.\n\n3. Would you like to work with more diverse undergraduates? This is my guess: students are UCR tend to have more diverse backgrounds (partly because of more diverse ethnicity). This might be a minor factor.\n\n4. Would you like a stronger Art or Film production department? UCI has a stronger Art department (for your purposes) and UCR has a stronger Film production department since the faculty teach film production.\n\nIf I were you, I'd pick UCI for its resources, stronger faculty, and better reputation. I'd only pick UCR if you are confident and interested in doing academic work (so you can get that Mellon Mays fellowship) and if you're interested in Continental philosophy.\n\nAt UCR, you can major in Studio Art and major/minor in Film production while taking other courses on the side. At UCI, you can major in Studio Art and major in Film studies or minor in those special programs offered.\n\nI wrote this pretty quickly, so feel free to message me for more questions and whatnot! "}