{"doc_id": "302", "name": "2017_10_humanities_student_major_633_hockey", "namespace": "we1sv2.0", "metapath": "", "pub": "hockey", "title": "2017-10-humanities-student-major_633_hockey.txt", "pub_date": "2017-10-08T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.381", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "648", "Permalink": "http://reddit.com/r/hockey/comments/74za16/jt_brown_on_silent_protest_i_know_theres_going_to/do2vc1o/", "Threadlink": "http://reddit.com/r/hockey/comments/74za16/jt_brown_on_silent_protest_i_know_theres_going_to", "Parent_id": "t1_do2qxdp", "Reddit_id": "do2vc1o", "Subreddit_id": "t5_2qiel", "Commenter": "1stOnRt1", "length": "3742", "content_scrubbed": "While the definitions are the same, the context provides us the understanding that \"Black power\" and \"white power\" have different meanings. \n\nWith \"power\", white men and women have institutionally discriminated against men and women of colour for generations. No, not all men and women, but a significant occurance as to be able to say that. \n\nWith black power, it has always been a cry for agency, for enfranchisement. It became the rallying cry for black men and women to put to terms there desire and right to no longer be disregarded or thought of as lesser.\n\nThey are not saying that white men and women should not have power, they are saying that black men and women should have power as well. \n\nI recommend this comment from /u/geekaesthete \n\nImagine that you're sitting down to dinner with your family, and while everyone else gets a serving of the meal, you don't get any. So you say \"I should get my fair share.\" And as a direct response to this, your dad corrects you, saying, \"everyone should get their fair share.\" Now, that[.] a wonderful sentiment -- indeed, everyone should, and that was kinda your point in the first place: that you should be a part of everyone, and you should get your fair share also. However, dad[.] smart-ass comment just dismissed you and didn't solve the problem that you still haven't gotten any!\nThe problem is that the statement \"I should get my fair share\" had an implicit \"too\" at the end: \"I should get my fair share, too, just like everyone else.\" But your dad[.] response treated your statement as though you meant \"only I should get my fair share\", which clearly was not your intention. As a result, his statement that \"everyone should get their fair share,\" while true, only served to ignore the problem you were trying to point out.\nThat[.] the situation of the \"black lives matter\" movement. Culture, laws, the arts, religion, and everyone else repeatedly suggest that all lives should matter. Clearly, that message already abounds in our society.\n\nThe problem is that, in practice, the world doesn't work the way. You see the film Nightcrawler? You know the part where Renee Russo tells Jake Gyllenhal that she doesn't want footage of a black or latino person dying, she wants news stories about affluent white people being killed? That[.] not made up out of whole cloth -- there is a news bias toward stories that the majority of the audience (who are white) can identify with. So when a young black man gets killed (prior to the recent police shootings), it[.] generally not considered \"news\", while a middle-aged white woman being killed is treated as news. And to a large degree, that is accurate -- young black men are killed in significantly disproportionate numbers, which is why we don't treat it as anything new. But the result is that, societally, we don't pay as much attention to certain people[.] deaths as we do to others. So, currently, we don't treat all lives as though they matter equally.\n\nJust like asking dad for your fair share, the phrase \"black lives matter\" also has an implicit \"too\" at the end: it[.] saying that black lives should also matter. But responding to this by saying \"all lives matter\" is willfully going back to ignoring the problem. It[.] a way of dismissing the statement by falsely suggesting that it means \"only black lives matter,\" when that is obviously not the case. And so saying \"all lives matter\" as a direct response to \"black lives matter\" is essentially saying that we should just go back to ignoring the problem.\n\nTL;DR: The phrase \"Black lives matter\" carries an implicit \"too\" at the end; it[.] saying that black lives should also matter. Saying \"all lives matter\" is dismissing the very problems that the phrase is trying to draw attention to."}