{"doc_id": "1248", "name": "2017_04_humanities_student_major_3089_thebluepill", "namespace": "we1sv2.0", "metapath": "", "pub": "TheBluePill", "title": "2017-04-humanities-student-major_3089_TheBluePill.txt", "pub_date": "2017-04-27T00:00:00Z", "Sentiment": "-0.003", "Subjectivity": "0.417", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "391", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67wdy6", "Reddit_id": "dgu16sk", "Subreddit_id": "t5_2vzvv", "Commenter": "AnathematicAnarchist", "length": "2526", "content_scrubbed": "People always group us together but MGTOW are way different than incels.\n\n**MGTOW** are, for the most part, guys who have been, to varying extents, fairly well-integrated into society. They tend to have jobs if not long_term careers, they tend to have at least a small circle of friends, and they tend to blend in well enough so as not to attract notice. \n\nThey are almost universally older and almost universally incomprehensibly bitter about one or more failed marriages. They, as a rule, have absolutely zero sense of humor and often lack even the tiniest modicum of self-reflection or serious social analysis.\n\nThey more or less, by consensus, hate women and think women have inferior intelligence and emotional depth. They will often use absurd statistics and bizarre extrapolations from anecdotal evidence to back this up. They are also almost always STEM elitists whereas incels usually don't give a fuck about STEM vs liberal_arts. \n\nCommon mental health disturbances would be things like Dysthymia, Paranoid Personality Disorder, Narcissistic Personality Disorder, and Sadistic Personality Disorder (refer to Theodore Millon[.] work rather than the DSM, which does not currently list Sadistic Personality Disorder as a valid diagnosis).\n\n**Incels**, by contrast, were never well socially integrated and probably friendless losers even as children. They are, at best, peripherally occupied in part-time or menial jobs (but usually unemployed or isolated students), they are almost always devoid of friends or close relationships outside of immediate family, and they tend to be noticeably odd or disconnected from normal society when observed by strangers. \n\nMost incels have a good sense of humor and satire and almost all of them have enough self-awareness to realize that they are completely fucked up worthless human beings.\n\nHating women isn't consensus and is often fiercely debated by incels who have correct opinions (e. g., myself). In any case, it certainly isn't the focal point of the subreddit, unlike MGTOW. Incels are also generally ugly whereas MGTOW are more or less average looking. \n\nCommon mental health disturbances would be things like Autism, Major Depressive Disorder, Avoidant Personality Disorder, Social Phobia, Schizoid Personality Disorder, and Schizotypal Personality Disorder.\n\ntld;r: MGTOW are a completely different species than incels and should not be grouped together. And don't even get me started on comparing us to TRP, who have much more in common with the Alt Right than incels. "}