{"doc_id": "296", "name": "2017_10_humanities_student_major_568_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-10-humanities-student-major_568_AskHistorians.txt", "pub_date": "2017-10-07T00:00:00Z", "Sentiment": "0.049", "Subjectivity": "0.248", "Score": "17", "Upvotes": "0", "Downvotes": "0", "Wordcount": "318", "Permalink": "http://reddit.com/r/AskHistorians/comments/74q415/askhistorians_and_monetization/do1qzag/", "Threadlink": "http://reddit.com/r/AskHistorians/comments/74q415/askhistorians_and_monetization", "Parent_id": "t1_do1ma4f", "Reddit_id": "do1qzag", "Subreddit_id": "t5_2ssp3", "Commenter": "sunagainstgold", "length": "2428", "content_scrubbed": "1. **This subreddit**, per repeated censuses, is consistently 85% male and 15% female.\n\n2. Although women have generally made up a higher percentage of academics in humanities than in social and physical sciences, women in history consistently lag far behind [other humanities fields](https://www. historians. org/publications-and-directories/perspectives-on-history/may-2010/what-the-data-reveals-about-women-historians) (except theology and philosophy) at every level, from PhDs conferred to winning tenure.\n\n3. Numbers for PhDs conferred, where women and men are statistically the closest, is actually a *horrible* metric for measuring gender equality in academia in isolation from other statistics. Grad student/PhD conferred isn't a marker of achievement and success; it[.] a marker of *exploitation*.\n\n4. When comparing the different stages of academia--grad student, postdoc, adjunct, tenure track, tenured associate, tenured full professor--[women make up a smaller and small percentage of people at each ring of increasing success, and not because of lack of qualifications.](http://www. acenet. edu/news-room/Pages/New-Report-Looks-at-the-Status-of-Women-in-Higher-Education. aspx) I had thought some of this discrepancy might be due to older patterns (i. e. the generation of full professors is older than the generation of postdocs), but [this report](https://www. timeshighereducation. com/news/proportion-of-female-professors-up-but-still-below-a-quarter/2018824. article) from the UK suggests otherwise (60% versus 40% of full professors under age 30 in the UK are male:female).\n\n5. The bias is even stronger for women with families, whereas men statistically see *no* harm to their career prospects from marriage or having children. Male tenure-track faculty, in one study at USC, were almost twice as likely as women TT faculty to achieve tenure.\n\n6. In academia as in other fields, [women are paid less than men](http://www. catalyst. org/knowledge/women-academia) at the same rank of seniority.\n\n7. In academia, women consistently take on more non-research/promotion-tenure-friendly work than men.\n\n8. **Regardless** of any of these statistics, the moderation team feels strongly that we should actively promote participation by women of all races and POC of all genders. If you disagree, there are plenty of places on the Internet--and in academia--where you'll fit in just great. We strive for this one to be different."}