{"doc_id": "1171", "name": "2017_04_humanities_student_major_2339_latestagecapitalism", "namespace": "we1sv2.0", "metapath": "", "pub": "LateStageCapitalism", "title": "2017-04-humanities-student-major_2339_LateStageCapitalism.txt", "pub_date": "2017-04-20T00:00:00Z", "Sentiment": "0.143", "Subjectivity": "0.391", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "509", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgjbmk8", "Reddit_id": "dgjplrr", "Subreddit_id": "t5_39qgx", "Commenter": "dustininsf", "length": "2979", "content_scrubbed": "But what about an early death? Breadwinner dies while children are young. Do we force the remaining parent to immediately get whatever job they can and juggle single parenthood because their spouse died in an accident (or whatever)?  Should they be denied the funding of their college education that they would have received? Breadwinner would have likely had life insurance to adequately protect family in case of this, but wouldn't  an insurance payout be similar to an inheritance? and if an insurance payout isn't to be confiscated by this 100% inheritance tax, then how is an inheritance of say, the family[.] real property $300k home, $100k in investments and a $250k retirement account any different than that insurance policy. \n\nI'm very much in favor of a wealth/inheritance tax to prevent the calcification of the top 3%, but I don't think there[.] much harm in allowing for inheritances up to a certain level, and then taxing the hell out of anything beyond that. I'm inclined to say primary residential property should be exempt (to allow for places like SF, where a extremely modest home could be $999k; someone who worked hard to purchase that here is not rich—yes, their income is likely higher than someone in Kentucky, but all of their money is going to higher cost of living and especially housing costs) And beyond a primary residence the estate can transfer $200k per immediate-family beneficiary (spouse, children, sibling, parents), and $100k per non-immediate family beneficiary, up to a total of $1 mil. Anything beyond that (primary residence + $1 mil ) would be taxed at 98% inheritance tax. Charitable donations could be made giving 100% tax free to actual 501c3s out of the initial $1mil pool and above that $1mil threshold charitable donations would still be allowed, but they would be taxed 50%. \n\nThe goal is to allow for some continuity for the family, to allow for the transference of some wealth, and to allow some discretion in where some of the wealth goes for charitable uses (if a fan of the arts, or a soup kitchen or their college, etc. they should absolutely be allowed to support beneficial causes that were dear to them, but not be allowed to simply direct the entirety of their estate to some esoteric group or cause that isn't widely beneficial to  the whole). Why $100k/$200k ? You're not creating a dynasty with that level of money... you're paying off student loans or a down payment on a house or providing a start for a small business. \n\nThe numbers should all be pegged to a real inflation/cost of living index that reflects the actual rates of inflation as felt by the average person (and this new, realistic index would be adopted for use for all adjustments like this - for Social Security, eligibility for assistance, benefits payments for disability, food aid, etc.)  with the goal of having these figures continue to be a fair and reasonable amount in the figure, so we don't end up out of touch with reality in 20-30 years."}