{"doc_id": "382", "name": "2017_10_humanities_student_major_1449_witcher", "namespace": "we1sv2.0", "metapath": "", "pub": "witcher", "title": "2017-10-humanities-student-major_1449_witcher.txt", "pub_date": "2017-10-15T00:00:00Z", "Sentiment": "0.189", "Subjectivity": "0.387", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "296", "Permalink": "http://reddit.com/r/witcher/comments/76m7w3/i_think_i_found_a_major_plot_hole_in_the_books/dofksg3/", "Threadlink": "http://reddit.com/r/witcher/comments/76m7w3/i_think_i_found_a_major_plot_hole_in_the_books", "Parent_id": "t1_dofijc4", "Reddit_id": "dofksg3", "Subreddit_id": "t5_2sebi", "Commenter": "BeeTeeDubya", "length": "1702", "content_scrubbed": "EDIT: Rant inbound.\n\nWell, actually, this is a wholly unsatisfying answer but I stopped entirely not too long ago. The way I learn languages is this: I teach myself the grammar, I find people who speak the language, and I give them a single rule for me: Correct me whenever I am wrong, even if the mistake to you (the person with whom I'm exchanging languages) seems petty and insignificant. I learned Portuguese and Spanish like this frighteningly quickly. But with Polish that was too much to ask! People were either so impressed with my progress that they were scared to criticize - I was a mythical unicorn, and there words were the lashes that would scare me away. Or (I heard this is a problem endemic to slavic cultures thanks to the insularity and mistrust of foreigners, not hatin, just statin), a single mistake was *offensive* to them, and they wouldn't help. I tried learning the language entirely on my own, to improve and augment my own knowledge, but it seemed that the more complex words i knew, the less people were willing to help me. *Added* to that really shitty experiences were a few Polish people masquerading as 'friends' said shitty racist things about my ancestry, and that kinda completely extinguished the desire to learn their language :P I've always considered myself a linguist and humanities type person, so I'm willing to accept broad cultural differences, but there[.] a finite number of names you can call my family :P\n\nTL;DR Too many bad experiences, too much culture clashing, and I really only ever wanted to learn it too read Witcher. Eventually a good friend of mine just told me to read the Spanish translations - they're dope, and I already know the language :P"}