{"doc_id": "540", "name": "2017_10_humanities_student_major_3054_askphilosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "askphilosophy", "title": "2017-10-humanities-student-major_3054_askphilosophy.txt", "pub_date": "2017-10-31T00:00:00Z", "Sentiment": "0.109", "Subjectivity": "0.324", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "492", "Permalink": "http://reddit.com/r/askphilosophy/comments/79xhp6/graduate_students_what_are_your_criticisms_of_the/dp5manc/", "Threadlink": "http://reddit.com/r/askphilosophy/comments/79xhp6/graduate_students_what_are_your_criticisms_of_the", "Parent_id": "t3_79xhp6", "Reddit_id": "dp5manc", "Subreddit_id": "t5_2sc5r", "Commenter": "mediaisdelicious", "length": "2897", "content_scrubbed": "I don't really know how to answer the first question.  I definitely think the field has responsibilities, but it[.] hard to describe in really specific terms some *particular* failure or regret.  If there is a \"missed opportunity\" I think it is probably structural.  I'm sure there are some narrow examples of this that I'm just not thinking of.\n\n What, if any, do you feel are the limitations and lackings of your education, specifically in regards to your ability to enhance the role of philosophy in society at large?\n\nIt is a nearly universal fact that students in philosophy (and most of the humanities) are not trained at all in how to play such a role.  Some are trained in how to think about the possibilities of such a role, but this is not exactly the same thing.  Only rarely do philosophers take courses on how to communicate with lay persons, how to develop questions relevant to practical problems, do any \"civic\" action related to their discipline, etc.  Some philosophers find a way to do this, of course, even without \"training\" in it.  \n\nThis problem is not special to philosophy or even the humanities.  There is in STEM a problem with an proportional lack of \"translational research\" - research that cashes out basic science discoveries in practical ways.\n\nThere are lots of fields where this emphasis is quite different and people are trained to look for opportunities to \"translate.\"  So, surely it *could* be done in philosophy too, though it would require quite a lot of effort and change.  After all - we'd need someone to teach this stuff!\n\n What, if any, are the most pressing and current obstacles impeding philosophy to have a more present role in education and public debate that philosophers can do something about?\n\nThe main \"obstacle\" is the structure of the enterprise (which really explains the prior problem).  Philosophers are trained as they are primarily because this training reflects the profession of philosophy.  At the places that make PhD[.] in philosophy, tenure contracts are largely written so that research matters quite a bit.  As such, that is what they teach students.  You don't get trained to teach much (if at all) at least because even the teachers who think it matters quite a bit don't often feel like they're even particularly qualified to teach pedagogy.  (You can be good at a thing and not feel able to teach it.)  So, realistically, what PhD[.] need to succeed at in this rather conservative view of the point of the PhD (i. e. to be a professor) is research.  Then, of course, once you get the job your service to anything *beyond* the university is quite small in its effect on your promotion and, ultimately, your tenure (insofar as either of these really exist for people these days).\n\nSo, there is a circle.  People training people to be researchers end up primarily being skilled at training others to be researchers.  Big surprise."}