{"doc_id": "1091", "name": "2017_04_humanities_student_major_1714_learnmachinelearning", "namespace": "we1sv2.0", "metapath": "", "pub": "learnmachinelearning", "title": "2017-04-humanities-student-major_1714_learnmachinelearning.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.157", "Subjectivity": "0.296", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "789", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64wavu", "Reddit_id": "dgajiwg", "Subreddit_id": "t5_3cqa1", "Commenter": "soupletters", "length": "5111", "content_scrubbed": "I have taken several courses on Udemy in Data Science and Machine Learning from Kirill Erenmenko and Hadlin de Ponteves, Jose Portilla, and Frank Kane.  These are fantastic instructors!\n\nI agree with sinseption as well.  The Deep Learning A-Z course is kind of meant to follow the ML course (can be taken first but some of the templates use in the Deep Learning course are borrowed ML course and further developed; perhaps then it would be more helpful to start with the ML course).\n\nI recommend taking Kirill[.] Data Science course first (before both) since it naturally progresses one to the ML course.  While it doesn't start with Python, you gain important concepts such as ETL using SSIS and Excel, proper model assessment and evaluation techniques such as t-test/p-value/Adj-R-squared/backward-propagation for linear regression using the simple program called gretl, an important Lift Curve / Gain Curve tool for logistic regression (great explanation for how to interpret coefficients in logit model, e. g. log(odds) = a*x_0 + b*x_1 + c*x_2 + ...), plus visualization skills using Tableau.\n\nThe intention of this course is to use these basic gui[.] to focus on the concepts Data Scientists face: proper file handling, importation (safe-guarding) protocols, SQL templates, ML evaluation (proper use of t-tests/p-value/Adj-R-squared use is often missed I think in all of the other courses on Udemy).\n\n...\n\nHaving said that, Jose Portilla[.] courses are VERY VERY good as well, very thorough and pedantic like Kirill.  Plus you pick up Jupyter Notebooks with Jose in his Python course (He does R, Python, Scala & Spark, PostgreSQL, and more).\n\nFrank Kane also has several good ML courses as well; his teaching style is less pedantic but his scripts are thorough.  Frank[.] course on Hadoop (includes Hive/Pig, MongoDB, Cassandra, more) is amazingly helpful, also his course on Python & Spark gives good overlap with that from Jose[.] course on Scala & Spark.\n\n...\n\n\nI would recommend:\n\nKirill[.] DS A-Z;\n\nJose[.] Python Bootcamp;\n\nJose[.] DS and ML in Python Bootcamp;\n\nJose[.] DS and ML in R Bootcamp;\n\nKirill and Hadlin[.] ML A-Z in Python and R ;\n\nKirill and Hadlin[.] Deep Learning in Python A-Z\n\nNotes: Tie these courses to some more formal texts, e. g. follow Jose[.] advice to read ISLR.  Yes, it[.] 400+ pages, but the content actually lends itself to skimmed reading and detailed highlighting of most important points (for later quick re-reads and re-consumption).  A free online Stanford course (see below) is currently offered which compliments the textbook (a free pdf).  You can add the course certification to your LinkedIn account along with the Udemy courses!\n\nI would focus on working through the Udemy examples first and foremost and put those in the textbook (end of each chapter) on the shelf for awhile.  Maybe come back to them after you get to where you want with AI (ANN[.], CNN[.], and RNN[.]).  Again, do the ISLR (An Introduction to Statistical Learning in R) reading and highlighting.  This will put you in touch with the more formal ML literature (good for adding to your personal confidence in the statistical algorithms, i. e. will help you face your future boss or clients with an added level of confidence).  Lastly, ISLR was written for a broad audience as the intro succinctly mentions; it was derived from the original ESL text (apparently a bit more detailed).\n\nISL website: http://www-bcf. usc. edu/~gareth/ISL/\n\nISL: http://www-bcf. usc. edu/~gareth/ISL/ISLR%20Sixth%20Printing. pdf\n\nESL: http://statweb. stanford. edu/~tibs/ElemStatLearn/printings/ESLII_print10. pdf\n\nFREE Stanford Online Course (Actually a Spring Link, perhaps will be updated again; \"The course will remain available for an extended period of time. We anticipate the content will be available until at least August 2, 2017\"): https://lagunita. stanford. edu/courses/HumanitiesSciences/StatLearning/Winter2016/about\n\n...\n\nThen for scaling to big-data:\n\nJose[.] Scala & Spark;\n\nFrank[.] Python & Spark (Frank has a Scala & Spark course as well, but I took Jose[.] course)\n\nNote: With these last two (along with Jose[.] DS and ML Python course), you'll be on your way to using Amazon[.] clusters, e. g. AWS S3 storage, AWS EC2 or AWS EMR cluster services.\n\n...\n\nThen, Frank[.] Hadoop course has ton[.] packed into it (details on Hadoop/Hive/Pig/MongoDB,Cassandra/etc)\n\nHope this helps!  Survey all courses before buying them, wait until discounts are offered, and use 2x playback speed to help with memory recall! :D\n\n...\n\nP. S. \n\nDisclaimer: I wrote all of this as though you may already have earned a B. S. in say Engineering, Physics, Computer Science, or something similar (in terms of mathematical coursework, see following).  Anyone working to transition into data science or AI may inevitably be thought (by employer, clients, colleagues) to understand or eventually understand some level of the mathematical and programming details behind the scenes.  One may then need to have a formal understanding of at least say Calculus I, II, III; Linear Algebra; Differential Equations; Probability & Statistics."}