{"doc_id": "1165", "name": "2017_04_humanities_student_major_2263_blackfellas", "namespace": "we1sv2.0", "metapath": "", "pub": "Blackfellas", "title": "2017-04-humanities-student-major_2263_Blackfellas.txt", "pub_date": "2017-04-20T00:00:00Z", "Sentiment": "0.012", "Subjectivity": "0.363", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "317", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgiobze", "Reddit_id": "dgipg5v", "Subreddit_id": "t5_2xfe1", "Commenter": "fackmegood", "length": "1772", "content_scrubbed": "one of the issues I face when arguing with internet folk is that you have to bring up ideas that depend on very key concepts of sociological principle. Principles that rely on a basic understanding of the humanities. Because these people were never taught that as a child about the humanities because fuck our education system. They disbelieve in it. \n\nAn example of this would be few days ago that I was talking about representation in a youtube comment and some guy was arguing that its unfair to hire people like that because they should be hired on merit, colour should be irrelevant etc. So now to explain to him why there is an emphasis of representation of minorities I have to now explain how concepts of individualism in a culture works towards majority and minority, which means bringing on a whole new set of ideas to the table for him with sets of examples and arguing those before we can even address the issue in the real world at hand. These sorts of things eventually get tiring, its like I'm trying to debate calculus when the kid doesn't really understand algebra. And the kid is making bad claims about calculus because he doesn't really understand it. I remember it was kinda dark funny that the argument ended with him saying something similar to like \"well the black kids must be brats then for wanting their own race as a teacher. You should be able to identify with any race or you must be a racist\" ugh. I had to let it go. The ignorance is too much.\n\nI think a lot of this is a fundamental systemic education problem, which ultimately is a cultural problem because we need to value both the humanities and STEM. Culturally we don't value humanities as much hence people make such stupid claims and definitely don't understand how real life works."}