{"doc_id": "1133", "name": "2017_04_humanities_student_major_1970_broadchurch", "namespace": "we1sv2.0", "metapath": "", "pub": "Broadchurch", "title": "2017-04-humanities-student-major_1970_Broadchurch.txt", "pub_date": "2017-04-17T00:00:00Z", "Sentiment": "0.089", "Subjectivity": "0.413", "Score": "12", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1311", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgebwj9", "Reddit_id": "dgec767", "Subreddit_id": "t5_2wkk9", "Commenter": "thesearethelinks", "length": "7826", "content_scrubbed": "*Porn, Violence and Rape*\n\n---\n\n88. 2% of top rated porn scenes contain aggressive acts principally spanking, gagging, and slapping, while 48. 7% of scenes contained verbal aggression, primarily name-calling.\n\n- In 70% of occurrences, a man is perpetrator of the aggression; 94% of the time the act is directed towards a woman.\n\n- Only 9. 9% of the top selling scenes analyzed contained behaviors such as kissing, laughing, caressing, or verbal compliments.\n\n- Open-hand slapping occurs in 41. 1% of scenes.\n\n- Sex depicted in porn movies generally focuses on men[.] sexual pleasure and orgasm, rather than equally that of women[.] (Bridges and Wosnitzer, 2007)\n\nPorn scenes have sexist and racist themes through out. Websites often contain menus where users can select genres of women[.] ethnicities, body types, and ages. There are also choices such as \"amateur,\" \"interracial\", and the ever popular \"teen\" category. Men and women who are anything other than white are represented in stereotypical and demeaning ways.\n\n\nStudies show that after viewing pornography men are more likely to:\n\n- report decreased empathy for rape victims \n\n- have increasingly aggressive behavioral tendencies \n\n- report believing that a woman who dresses provocatively deserves to be raped\n\n- report anger at women who flirt but then refuse to have sex\n\n- report decreased sexual interest in their girlfriends or wives\n\n- report increased interest in coercing partners into unwanted sex acts (Bridges, 2006) (Yang, Gahyun, 2012).\nIn a meta-analysis of 46 studies published from 1962 to 1995, comprising a total sample of 12,323 people, researchers concluded pornographic material puts one at increased risk of:\n\n- committing sexual offenses (22% increase in risk)\n- accepting rape myths (31% increase in risk)\n\n**Among perpetrators of sex crimes, adolescent exposure to pornography is a significant predictor of elevated violence and victim humiliation.**\n\nIn a study of 30 college fraternity members on a small liberal_arts campus, the displayed images of women (in posters, screensavers, calendars, pin-ups, and advertisements) were analyzed for their frequency and degrading nature. There was a significant association between the average degradation ratings of the images and the student[.] rape-supportive attitude scale (RSA)\n\nIn a study of 187 female university students, researchers concluded early exposure to pornography was related to subsequent \"rape fantasies\" and attitudes supportive of sexual violence against women. **Researchers believe pornography consumed at a young age contributes to women being socialized to accept sexual aggression as a sexual/romantic event.**\n\nIn 2004 data was collected from interviews with 271 women participating in a battered women[.] program. Pornography use by their partner significantly increased the odds of women being sexually abused by their abusers. When their abuser used both alcohol and pornography, the odds of sexual abuse increase by a factor of 3. 2.\n\nArrested prostitution clients are twice as likely to report having watched pornographic movies over the past year than a national sample.\nJapanese males were divided into three groups and each exposed to different types of home video pornography: a positive rape film (where the female expressed pleasure), a negative rape film (where the female expressed pain), or a consenting sex film. Those who viewed the positive rape film were significantly more likely to state that women could enjoy rape and higher percentages of rape cases are invented by victims.\n\nIn a study of 804 Italian adolescents, ages 14 to 19 years old, viewing pornography was correlated to both active and passive sexual violence and unwanted sex.\n\n\"Women are represented as passive and as slavishly dependent upon men. The role of female characters is limited to the provision of sexual services to men. To the extent that women[.] sexual pleasure is represented at all, it is subordinated to that of men and is never an end in itself as is the sexual pleasure of men. What pleases women is the use of their bodies to satisfy male desires. While the sexual objectification of women is common to all pornography, women are the recipients of even worse treatment in violent pornography, in which women characters are killed, tortured, gang-raped, mutilated, bound, and otherwise abused, as a means of providing sexual stimulation or pleasure to the male characters.\" - Helen Longino\n\nResearch indicates that 25% to 30% of male college students in the U_S and Canada admit that there is some likelihood they would rape a woman if they could get away with it. (Briere and Malamuth, 1983)\n\nIn a study of high school males, 50% of those interviewed believed it acceptable \"for a guy to hold a girl down and force her to have sexual intercourse in instances such as when [.]he gets him sexually excited' or [.]he says she[.] going to have sex with him and then changes her mind'\" (Goodchilds and Zellman, 1984)\n\n\"I went to a porno bookstore, put a quarter in a slot, and saw this porn movie. It was just a guy coming up from behind a girl and attacking her and raping her. That[.] when I started having rape fantasies. When I saw that movie, it was like somebody lit a fuse from my childhood on up... I just went for it, went out and raped.\" Rapist interviewed by Beneke, 1982\n\nThe following statements were made by women testifying at the Hearings on Pornography in Minneapolis, Minnesota, in 1993 (Russell, 1993a). \n\n- Ms. M testified that, \"I agree to act out in private a lot of the scenarios that my husband read to me. These depicted bondage and different sexual acts that I found humiliating to do...He read the pornography like a textbook, like a journal. When he finally convinced me to be bound, he read in the magazine how to tie the knots and bind me in a way that I couldn't escape. Most of the scenes where I had to dress up or go through different fantasies were the exact same scenes that he has read in the magazines.\"\n\n- Ms. O described a case in which a man 'brought pornographic magazines, books, and paraphernalia into the bedroom with him and told her that if she did not perform the sexual acts in the \"dirty\" books and magazines, he would beat her and kill her'\n\n- Ms. S testified about the experience of a group of women prostitutes who, she said, 'were forced constantly to enact specific scenes that men had witnessed in pornography...These men... would set up scenarios, usually with more than one woman, to copy scenes that they had seen portrayed in magazines and books. [For example, Ms. S quoted a woman in her group as saying:] \"He held up a porn magazine with a picture of a beaten woman and said, 'I want you to look like that. I want you to hurt.' He then began beating me. When I did not cry fast enough, he lit a cigarette and held it right above my breast for a long time before he burned me.\"\n\n- Ms. S. also described what three men did to a nude woman prostitute whom they had tied up while she was seated on a chair: \"They burned her with cigarettes and attached nipple clips to her breasts. They had many S and M magazines with them and showed her many pictures of women appearing to consent, enjoy, and encourage this abuse. She was held for twelve hours while she was continuously raped and beaten.\"\n\n- Another example cited by Ms. S: \"They (several Johns) forced the women to act simultaneously with the movie. In the movie at this point, a group of men were urinating on a naked woman. All the men in the room were able to perform this task, so they all started urinating on the woman who was now naked.\"\nNon-violent heterosexual porn often becomes 'too boring' and leads (commonly) men to seek out more 'interesting' and 'exciting' types of pornography: often including abuse and rape. (Zillman and Bryant) (Briere and Malamuth)"}