{"doc_id": "394", "name": "2017_10_humanities_student_major_1607_itcareerquestions", "namespace": "we1sv2.0", "metapath": "", "pub": "ITCareerQuestions", "title": "2017-10-humanities-student-major_1607_ITCareerQuestions.txt", "pub_date": "2017-10-17T00:00:00Z", "Sentiment": "0.059", "Subjectivity": "0.259", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "286", "Permalink": "http://reddit.com/r/ITCareerQuestions/comments/772rv4/career_question/doiqr3z/", "Threadlink": "http://reddit.com/r/ITCareerQuestions/comments/772rv4/career_question", "Parent_id": "t3_772rv4", "Reddit_id": "doiqr3z", "Subreddit_id": "t5_30560", "Commenter": "VA_Network_Nerd", "length": "1728", "content_scrubbed": "I don't see anything good or bad about Broward. Seems a standard state community college.  \n\nBut none of the degrees you linked to look like Associates of Science degrees to me.  \nThey all look like Associates of Applied Science degrees to me.  \n\nAn AS degree is designed to build a foundation of knowledge, and cover GenEd courses so you can transfer to a University for a Bachelor[.] degree.  \n\nAn AAS degree is not intended to transfer well to a University, and instead focuses on trying to prepare you for the workforce.  \n\nThere are no (significant) Humanities or Mathematics or anything like that in these degrees. They all go direct into technical content.  \n\nThese frankly strike me as sales tools for CompTIA. The Network Systems degree has practically the full array of CompTIA certification prep courses inside.  \n\nNetwork+, A+, Security+, Linux+, Storage+, Cloud+...  \n\nI do see a bunch of employable skills being taught here. I kind of question the depth of those skills.  \nI'd echo a lot of the same concerns /u/crankysysadmin  raises.  \n\nWhy aren't they teaching you a broad scope \"Intro to Data Networking\" instead of \"Network+\"?  \n\nSince you only have to pay community college fees for this, I wouldn't say it[.] a bad deal overall.  \nMost people can't teach themselves this much broad spectrum technical info from a book.  \n\nYou might reach out to a State University admissions to ask how much of that degree would be accepted for transfer. I'm sincerely concerned only about half of that degree will be accepted for transfer.  \n\n\nAll in all those degrees will qualify you for jobs. But I'm not super-sure they adequately prepare you to progress very far in those jobs based on your academic learning alone.  \n\n\n"}