{"doc_id": "1036", "name": "2017_04_humanities_student_major_1051_atheism", "namespace": "we1sv2.0", "metapath": "", "pub": "atheism", "title": "2017-04-humanities-student-major_1051_atheism.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.043", "Subjectivity": "0.281", "Score": "23", "Upvotes": "0", "Downvotes": "0", "Wordcount": "701", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64guur", "Reddit_id": "dg2j5m7", "Subreddit_id": "t5_2qh2p", "Commenter": "eat_fruit_not_flesh", "length": "4320", "content_scrubbed": "It[.] almost as if the separation of church and state doesn't exist.\n\nIt doesn't. Politics in America, on a lot of issues, comes down the judeo-christian cult (conservatives) trying to force their worldview on everyone else. Basically one of the two major political parties is a cult with heavy religious influence. \n\nReligion has intertwined itself with all other issues. You can go to christian book stores and find books that command christians how to vote. \n\nIf you talk to conservatives, you'll realize that they don't care about the issues or real world results. They have their christian worldview and they have to enforce it. Everything else comes back to that. They frame every issue from a christian lens and use christianity as a barometer for truth.\n\nAbortion is the perfect example. It[.] proven that increased birth control and sex education decrease abortions. It[.] also proven that banning abortions/ teaching abstinence does not decrease abortions. But conservatives still insist on banning abortion and teaching abstinence. They claim that abortion is murder- so why wouldn't they vote for the policies that decrease abortions? Bc it[.] not about the issue of abortion, murder or results, it[.] about forcing their worldview on Americans. It[.] about controlling others.  \n\nConservatives strongly believe that their judeo-christian culture is the \"true\" culture and that to be a true american, you have to be one of them. This is why lunatics like Alex Jones or Rush Limbaugh or whoever else are taken seriously- because they hate on \"the other\", the ones conservatives don't view as legitimate Americans. \n\nScalia, who was a FEDERAL JUDGE, one of the highest positions in the country outright stated that he was on a mission to extinguish beard-having hippies from America. A federal judge said that. \n\nYou'll also notice in our politics that one side does not care about anything other than winning. They don't care about corruption or lies or collusion with a foreign country or anything else. They don't care if something they proclaimed to hate is now being done by their party. It[.] the conservative cult. Bc they deeply, deeply believe that their worldview is so correct and that everyone else is evil, that no matter the means, if their worldview gets enforced then everything else is justified. \n\nThe right aren't the only ones who see the world through a judeo-christian lens. There[.] liberals and progressives who still approach the world in the same way but it[.] not the same magnitude. There is a decent amount of \"family value\" talk among liberals and of course, liberals are very fond of imperialism. \n\nAlso keep in mind there is no left_wing in the US. Socially, the political spectrum can be understood as varying degrees of classes. So on the_left, you have people like marxists and anarchists who strive for a classless society. On the_right, you have conservatives, fascists, christians, nazis etc who strive for a strong class system. The right wants a bunch of classes and wants certain classes to submit to the \"best\" classes. White supremacists put race in classes, conservatives (who are popular in the US) put people into classes by whether they adhere to judeo-christian culture or not. \n\nI've never encountered another culture in which anti-intellectualism has such a place as America\n\nAnti-intellectualism is one of the necessities to maintain a judeo-christian culture. You can't have intellectually curious people who see the world through a scientific lens because those people will never draw the conclusions of conservatives. No one who understands neurology or biology would think it rational that abortions be called murder or gays be called mentally ill. No one who understands economics would think starving the already lean welfare state is a good idea. No one who understands capitalism buys into trickle-down. No one who[.] ever read studies on abortions thinks abstinence works. You have to willingly be ignorant of reality to buy into these things. You have to be anti-intellectual. \n\nThis is why conservatives always destroy education, downplay the arts, downplay philosophy, downplay natural sciences and so on. Their goal of education is to produce people who can work but not think. People who can program robots but not question the people who own the robots. "}