{"doc_id": "1051", "name": "2017_04_humanities_student_major_1223_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2017-04-humanities-student-major_1223_college.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.063", "Subjectivity": "0.271", "Score": "20", "Upvotes": "0", "Downvotes": "0", "Wordcount": "418", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64mv1c", "Reddit_id": "dg4413n", "Subreddit_id": "t5_2qh3z", "Commenter": "theodore_boozevelt", "length": "2475", "content_scrubbed": "Hi, I'm an English major at a liberal_arts school. I love the humanities and believe studying them is incredibly important. However, with liberal_arts, you need a plan. \n\n\nIf you major in accounting, you'll very likely study accounting, get a paid internship, and get your degree, and get a job. It[.] a very similar pattern for nearly everyone. Same with pre-med-- study undergrad, apply to med schools, study at med school, residency, become a doctor, specialization, etc. \n\n\nWith most liberal_arts degrees, the path is not that simple, and thus it[.] *dumb as fuck* to go into college thinking you'll just get a degree in history and take the same career path as an accountant. \n\n\nMajor in history, work summer jobs as a cashier, and then expect to get a fulfilling, well-paying job? Probably not going to happen. \n\n\nMajor in history, specialize in middle eastern history, minor in both Arabic and visual arts, work as an Arabic tutor and a studio assistant, study abroad in Egypt, get summer jobs and apply for internships at history museums and cultural centers, and then graduate and apply for jobs within your highly specialized field? Chances for a job increase dramatically. \n\n\nMajor in psychology, spend summers bumming at your parents' house, and then expect to get a fulfilling, well-paying job? Nope. \n\n\nMajor in psychology, minor in gerontology, work at a retirement home in summers and busy your ass a pharmaceutical research assistant your junior and senior years, and then graduate and apply to graduate school to become an occupational therapist? Yep. \n\n\nMajor in English writing and hope to find a job? Lol no. \n\n\nMajor in English writing with minors in justice studies and Spanish intending to apply to law school, work every summer as a secretary for an immigration lawyer, become a caseworker, and go to law school? Yep.\n\n\nMajor in English writing with minors in secondary education and French, write newspaper columns since you were 16 years old, study abroad, visit French schools, and write a report on techniques we could implement in the U_S, work summers as a swim lesson instructor and private tutor, work for your college[.] French department, and apply for every goddamn job in the world? Probably. \n\n\nI love my liberal_arts and humanities and I know the value of them. But just because they are valuable doesn't mean that they will get a job. Have a plan. You have a plan. Work hard, get as much experience you can in the area, and be flexible. "}