{"doc_id": "340", "name": "2017_10_humanities_student_major_1067_askliterarystudies", "namespace": "we1sv2.0", "metapath": "", "pub": "AskLiteraryStudies", "title": "2017-10-humanities-student-major_1067_AskLiteraryStudies.txt", "pub_date": "2017-10-11T00:00:00Z", "Sentiment": "0.128", "Subjectivity": "0.326", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "553", "Permalink": "http://reddit.com/r/AskLiteraryStudies/comments/75jthc/seminal_works_within_literary_theory_of_the_last/do8bpse/", "Threadlink": "http://reddit.com/r/AskLiteraryStudies/comments/75jthc/seminal_works_within_literary_theory_of_the_last", "Parent_id": "t3_75jthc", "Reddit_id": "do8bpse", "Subreddit_id": "t5_2tltc", "Commenter": "BuiltLikeTaft", "length": "3272", "content_scrubbed": "I don't really know what to make of the fact that so far, almost every answer here is about works published more than fifty years ago (other than Kristeva and just barely Barthes). I'm not saying they're not worth reading; they are all justly and hugely influential and important for understanding the history of the discipline, but they also aren't very current, which is what I took your question to mean.\n\nBut I don't come just to criticize. A few suggestions:\n\nGilles Deleuze and Felix Guattari, *A Thousand Plateaus: Capitalism and Schizophrenia* (1980, translated into English 1987). It took a little while for its influence to filter into literary study in English, but I would argue that it was probably the biggest influence on theory written in the 2000s, and you can see its influence in many of the major subfields that have their root in that period. It is a book that embraces schizophrenia as a mode of thought, which makes it a bit bewildering to read at times, but it[.] also a lot of fun to read too. It is probably most widely read for its introduction, Rhizome, which I suspect you can find online if you want to get a taste before deciding to commit, in which Deleuze and Guattari elaborate on their idea of non-hierarchical organization of ideas as exemplified by the rhizome, a type of root system that shoots out in new directions without any centrally defined node, as opposed to the more hierarchical branching of tree root systems.\n\nMichel Foucault, *Archeology of Knowledge* (1969), *Discipline and Punish* (1975), and *The History of Sexuality* (three volumes: 1976, 1984, 1984). I would hazard that Foucault is probably the most important theorist shaping theoretical discourse not only in the study of literature but all the social_sciences and humanities throughout the 70s, 80s, and 90s, and these are three of his biggest works, although obviously they cover very different ground.\n\nJacques Derrida, *Of Grammatology* (1967). I debated with myself whether or not to include this, both because it is at the extreme outer limit of the past 50 years, but also because Derrida is famously difficult to understand, but it would be hard to point to someone who was more influential (and more controversial) in the development of what we think of as literary theory in the late 20th century and its identification with Derrida[.] practice of deconstruction.\n\nJudith Butler, *Gender Trouble: Feminism and the Subversion of Identity* (1990). This is the book and the theorist that really put gender studies on the map. It is famous for her development of the idea of the performativity of gender, something that has now so permeated the culture that even my freshman college students are familiar with it. It is densely written (some of her essays in *Undoing Gender* are much more accessible updates of her thinking), but it[.] still well worth going back to the original source.\n\nN. Katherine Hayles, *How We Became Posthuman* (1999). One of the most important books shaping our ideas of how our interactions with technology change us, I would say this is worth checking out if you are at all interested in the intersection of technology with literature. It[.] a bit dated in some ways, given when it was written, but it is still hugely influential."}