{"doc_id": "411", "name": "2017_10_humanities_student_major_1705_shouldibuythisgame", "namespace": "we1sv2.0", "metapath": "", "pub": "ShouldIbuythisgame", "title": "2017-10-humanities-student-major_1705_ShouldIbuythisgame.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "-0.042", "Subjectivity": "0.373", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1121", "Permalink": "http://reddit.com/r/ShouldIbuythisgame/comments/779nl9/ok_guys_spooktober_is_here_and_i_need_some_scary/doklzo2/", "Threadlink": "http://reddit.com/r/ShouldIbuythisgame/comments/779nl9/ok_guys_spooktober_is_here_and_i_need_some_scary", "Parent_id": "t3_779nl9", "Reddit_id": "doklzo2", "Subreddit_id": "t5_2ud8h", "Commenter": "fart_smellow", "length": "6356", "content_scrubbed": "*Alien: Isolation* - Best Sci-fi horror game ever. The sound and music are the best part of this game. You might get bored at first because it takes a lot of play time before the Alien actually shows up. When it does, the fun begins, and begins the hardcore stealth gameplays because if you even run for just one or two steps, the Alien will hear you and catch you. The game has some crafting involved, as well as some puzzles. Beware though, the Aliens aren't the only threat that you will find in the spaceship.\n\n*Amnesia: The Dark Descent* - Classic horror game that has more scary atmosphere than random jumpscares. Even with less jumpscares, this game feels a lot scary and creepy. Play it first, you must. Has Stealth aspects.\n\n*Araya* - A horror game from Thailand. Not the best horror game, but still great enough. It can build up a lot of tension. The graphics aren't top notch, but it has a good story. The control is a bit weird to get used to at first time. There are few bugs as well, but those aren't major. Lots of chasing sequences involved.\n\n*DreadOut* - Another Asian horror game, from a Indonesian dev. My favorite. The ghosts are very scary looking. Just like Araya, this game doesn't have good graphics, which actually makes the game look much more creepy. Puzzles involved. There[.] a chance that you will miss out several ghosts, collectibles and easter eggs at the beginning. But I'm not gonna spoil it out for you. The chapter 0 is basically the demo version that was available for this game, still fun to play. Your only weapon is your camera. Some ghosts can only be seen using the camera. The same thing goes for some of the puzzles.\n\n*DreadOut Keepers of the Dark* - Not a sequel to the original. This one is smaller game with no story. You still play as the main character from the original game. This game is basically a boss battle game. There are several puzzles. Some puzzles and boss fights are required to be done to unlock other levels. Some levels and bosses are from the original game, some are completely new. This isn't mandatory to play, but if you love playing DreadOut and don't mind doing creepy boss fights one after another then you will enjoy play this game.\n\n*Fran Bow* - Story driven point-and-click puzzle game with a very interesting concept. The arts for this game are very creepy and quite disturbing. Lots of puzzles. Have few jumpscares.\n\n*Knock Knock* - Another small horror game, with multiple endings. The story and gameplay might seem unclear at your first play. But you should figure out the strategies as you keep playing this game.\n\n*Monstrum* - Purely stealth survival game with no story. You will be put in a randomly procedural ship, with a randomly generated monster out of three monsters in the game. Each monster has their own abilities, and you need to use different strategies depending on which monster the game randomly placed in the ship. Your job is to stay away from the monster and get away from the ship. There are three escape routes. Each escape routes require several items which are randomly scattered inside the ship. You need to carefully find those without getting caught by the monster, because if you get caught it[.] game over no matter how much you progressed. You will have to start over.\n\n*Penumbra* Series - Play the whole series. Another classic just like Amnesia. Stealth mechanics involved. Actually, Play Amnesia and Penumbra series first if you haven't played any of these games. They are highly recommended.\n\n*Slender: The Arrival* - Well, you probably heard of Slender Man. He isn't very scary looking. What will scare you is the atmosphere this game provides. The game has a story, but the gameplay is basically finding pages or other stuff to beat the level. At later levels, Slender Man isn't the the only enemy you will have to face. If you truly want some challenge, then try playing the game on the most difficult setting.\n\n*SOMA* - From the same developer of Amnesia. Sci-fi horror, has some jumpscares and stealth mechanics. Heavily story-driven game. Probably the best horror story in horror game genre, because most horror games relies on scares rather than stories. Play it after you finished playing Amnesia and Penumbra series.\n\n*Through The Woods* - Very interesting horror game with a nice story involving Norse mythology. Since the game is from a Norwegian dev, you will find a lot of Viking and Norse references. Even the monsters are related to Norse Mythology. The game itself is short. You play as a female character who lost his son in the woods. There are collectibles scattered around the map, so if you are into collecting those, the gameplay can take a bit longer time.\n\n*White Day: A Labyrinth Named School* - A remade version from the original console version which is very old by now. There is also a mobile version of this game. The game has multiple conversation branching, leading to multiple endings depending on which conversation route you took. Some actions also affect which ending you could get. The story is good but not the best. There are tons of collectibles. If you play on easy or normal mode, then you will not be able to encounter several hidden ghosts inside the school. These hidden ghosts only appear in Hard mode/Hell mode. The game involves serious amount of stealth if you are not playing any easy modes, which you may find seriously annoying at certain points of the game.\n\n*Wick* - Survival horror game that has a story which you will have to find out by collecting all the items scattered around the map. Your job is to stay in the light by using the candles that you will find in the map, which you can light up by using your limited amount of matches. The more you stay in the light of the candle, the faster the game will move you to the next level. At the beginning, you will need to stay from a single ghost, but at later levels, you will have to face several. Each ghost has their own abilities that you will need to figure out as you play the game. There are secret levels, easter eggs, puzzles. One secret level is actually an expansion version of the game that includes all the ghosts from the original levels, but with different appearances and enhanced abilities. Once you unlock those secret levels, you can access those levels form the main menu. Has lots of jumpscares and chasing sequences."}