{"doc_id": "1002", "name": "2017_04_humanities_student_major_793_northcarolina", "namespace": "we1sv2.0", "metapath": "", "pub": "NorthCarolina", "title": "2017-04-humanities-student-major_793_NorthCarolina.txt", "pub_date": "2017-04-07T00:00:00Z", "Sentiment": "0.098", "Subjectivity": "0.308", "Score": "15", "Upvotes": "0", "Downvotes": "0", "Wordcount": "299", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_645f68", "Reddit_id": "dfzmdd2", "Subreddit_id": "t5_2qhmx", "Commenter": "2old2care", "length": "1771", "content_scrubbed": "NC is like New_York State--there is a huge variety of communities and geographies. Of the cities, Charlotte is probably most like New_York, but it is deeply southern, too and has become a financial and industrial center. The Raleigh-Durham area is the educational and cultural base with three major and several minor universities, along with State Government. It is also the technology and medical hub of the Carolinas. Asheville is the artsy city with an active community in crafts, visual arts, music, and any kind of food you might want. It[.] also a popular resort, especially in summer, featuring the spectacular vistas of the Blue Ridge and Smoky Mountains. Wilmington is the cultural center of the coast offering a thriving business community as well as access to some of the best beaches on the eastern seaboard. \n\nYou'll find the rural areas of NC to be very different from NY since they are heavily agricultural. Crops from corn to soybeans to strawberries and apples are big parts of the economy. Farming becomes an industry with livestock like chickens, turkeys, hogs and cattle. The NC countryside is typical small-town USA. \n\nThe climate is not as dissimilar from NY as you might expect, especially in the western part of the state. We have generally milder winters and less snow, but can have our share of winter weather. The central and coastal areas can be hot and humid in the summer but with milder winters. In NY you have blizzards more often, here we have hurricanes more often. Take your pick. \n\nPersonally I have lived in Asheville and Raleigh areas and I love them both. If you want a great climate and friendly, quiet atmosphere, choose Asheville. For business or job-hunting, you can't beat Raleigh-Durham. \n\nPlease ask if you have any questions."}