{"doc_id": "542", "name": "2017_10_humanities_student_major_3069_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2017-10-humanities-student-major_3069_philosophy.txt", "pub_date": "2017-10-31T00:00:00Z", "Sentiment": "0.106", "Subjectivity": "0.332", "Score": "81", "Upvotes": "0", "Downvotes": "0", "Wordcount": "564", "Permalink": "http://reddit.com/r/philosophy/comments/79vi2x/academic_philosophy_in_the_west_ignores_and/dp5v2ef/", "Threadlink": "http://reddit.com/r/philosophy/comments/79vi2x/academic_philosophy_in_the_west_ignores_and", "Parent_id": "t1_dp5koh8", "Reddit_id": "dp5v2ef", "Subreddit_id": "t5_2qh5b", "Commenter": "OmarGharb", "length": "3714", "content_scrubbed": " For instance, I don't believe in God; and thus most Christian or Islamic or Jewish philosophy is not interesting to me. \n\nThe article is suggesting that a systematic privleging of the Western philsophical tradition is endemic to universities. Whether you personally find non-Western philosophy interesting or not is irrelevant. \n\nI've experienced that bias myself. For example, many universities falsely advertise the first year introductory course as an \"Introduction to Philosophy\", when in reality what they are offering is an \"Introduction to Greco-Roman / Western European philosophy.\" Somehow, my professors genuinely believed they had given a fair introduction to philosophy, all the while consistently discounting the vast majority of philosophical literature written in human history. I do not think it even occured to them that they were engaging in exclusion - that they had deprived their students the privelege of Xunxi, or Mozi, or Han Fei, or ibn Zafar, ibn Khaldun, ibn Rushd, ibn Sina, al Farabi, or Omar Khayyam.\n\nThis equivocation of 'philosophy' broadly with 'western philosophy' specifically isn't based on merit, it[.] representative of a broader Eurocentric tendency to regard the Western tradition as the standard, and any other approaches as tangenital or 'other.' In order to learn Chinese philosophy, I have to take a course specifically dedicated to that subject, it is never integrated into the curriculum as an equal to the West. Indeed, my philosophy department only offered a single such course, with the vast majority (well over 80%) being 'Western.' In order to actually engage with non-Western philosophy, I had to leave the philosophy department altogether and take courses from the \"East_Asian Studies\" or \"Near-Middle_Eastern Civilizations\" departments. This 'other-ing' is patent and endemic throughout the Humanities, but I've always seen it as especially pronounced in Philosophy. It[.] very limitting. \n\nFor the record, by the way, none of the Islamic thinker[.] mentioned above require a belief in God. \"Islamic\" philopsophy is not the same as \"Muslim\" philosophy. There are atheistic Islamic philosophers, like al Rawandi, who abandoned Judaism and Islam to become a thoroughgoing atheist and champion of unfettered reason. Islamic in this context is used similar to \"Hellenistic\".\n\ninstead, there are philosophical studies of racism, sexism, or sexual identity\n\nThe semantics is irrelevant - the point remains that such philosophical studies of racism, sexism, and sexual identity are generally marginalized/excluded. Call it what you will, as long as it is justifiably represented.\n\nWestern philosophy has successfully distanced itself from religious thought, and in the last centuries it has thrived in the learned communities that liberalism has made possible, moving forward at an accelerated pace in the last few centuries, along with scientific thought.\n\nYou realize there is a wealth of secular, modern philosophy from outside of the West which is still excluded, right? That philosophy outside of the 'West' isn't just trying to reincorporate disproven ideas, which the West in all its genius has now long-transcended, but rather is conceiving of new, modern philosophies as well?\n\nHow about we read what is worth reading \n\nThat[.] exactly the problem. Western institutions have very patently demonstrated an inability to create meritocratic curriculum, and consistently favour their own traditions. If they were really objectively evaluating merit, then we would expect more diversity, not less. The exclusion of the philosophers I mentioned above can hardly be justified by merit. By no objective metric are they inferior to Plato, or Machiavelli, or Descartes. "}