{"doc_id": "954", "name": "2017_04_humanities_student_major_364_criticaltheory", "namespace": "we1sv2.0", "metapath": "", "pub": "CriticalTheory", "title": "2017-04-humanities-student-major_364_CriticalTheory.txt", "pub_date": "2017-04-04T00:00:00Z", "Sentiment": "0.097", "Subjectivity": "0.432", "Score": "17", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1607", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63bbld", "Reddit_id": "dftg35b", "Subreddit_id": "t5_2tmcb", "Commenter": "Kalazb", "length": "9760", "content_scrubbed": "This is an absolutely fascinating article that touches on several issues that are very important to me.\n\nI'll record some of the thoughts I had in response to it.\n\nThe author Bauerlein[.] main point is that defenders of the humanities, of the same stamp that we discussed here, all take a weird, utilitarian line on the value of literature, art, philosophy and history: \"In a word, the defenders rely on what the humanities do, not what they are. If you take humanities courses, they assure, you will become a good person, a critical thinker, a skilled worker, a cosmopolitan citizen ... Tepid and half-credible, these fuzzy encouragements sound ever more vain and dispirited the more they circulate.\n\nThis reminds me of how many people (particularly high school English teachers, much to the chagrin of students) think that the proper way to interact with art is to \"interpret\" it.  They believe the the artist has left a coded message of sorts in his art, and to fail to tease out this message is to fail to properly appreciate the art.  Few people notice that a) these purported messages are suspiciously frequently just single-sentence moralistic platitudes, and b) the whole activity is absurd on the face of it, because if the artist really wanted to get a \"message\" out that damn badly, then he would have just written it down like a normal person, rather than going to the trouble of creating a novel or a painting or whatever to conceal it.\n\nThe \"utilitarian\" justifications for studying the humanities mentioned by the author are absurd for similar reasons.  Maybe reading Goethe really will make you a \"better citizen\" or a \"critical thinker\" or whatever.  But surely that[.] an extremely roundabout way of achieving that goal?  If you just want to turn people into critical thinkers, then surely you could design a more direct curriculum to achieve that end, and dispense with the extraneous vessels of old art and literature?\n\nArtists and humanities scholars concerned about the value of their endeavors would do well to take a page from mathematicians here.  Mathematicians know that, except for rare instances where a mathematical discovery turns out to be useful to scientists, their work will never be of material benefit to anyone.  The vast majority of humans, even among their colleagues, will never be able to understand their work at all.  But they're fine with this.  The intrinsic beauty of the work sustains them.\n\nBut what room does that leave for people like Bauerlein, who want to charge young people to sit in a class listening to him talk about them? If these experiences are self-evident goods, if all that is required to fire passion for them is a little exposure, why do they need to be taught?\n\nRoughly, because thousands of people every day produce art and talk about art, so if so many people are going to do this, then it seems *prima facie* worthwhile to learn how to do it well, if it can be done well at all.  There are many details to fill in in that explanation.  But that[.] the gist of it.\n\nHumanities programs don't make people better humans or more upright citizens. They don't make them critical thinkers either.\n\nThe one exception here is philosophy.  Learning philosophy actually does teach you to think better.  Everyone should be required to take at least some courses in philosophy.\n\nThe University acts as a safety net—it assures intellectual recognition, without the risk of failure or mediocrity. It provides for a very basic need; one people of a certain mindset (again, myself included) imbibe in early childhood, after they ace their first spelling test or read a book intended for students in the year above them. The University tells academics that they are smart. It tells them they are better than other people because they are smart.\n\nYes, 100%, absolutely, perfect.  For a long time after I became aware of the academic research system, I felt a clawing need to have a Ph. D. in something, anything.  Because Ph. D. s were simply better, they were attached to the source of value and the decider of what gets consecrated for posterity (which is of course the university), as opposed to the gigantic masses of Ph. D.-less people, the nameless people of history, who leave nothing behind themselves when they die except a short obituary in the local newspaper.  I still feel that need from time to time, although I've been able to forge a clearer path for myself now, and I've determined that having a Ph. D. isn't vital for advancing along that path.\n\nI shake my head in disbelief at the grad students who tell people, \"why would you want to get a Ph. D.?  You'll make *more money* if you just go straight into industry.\"  Don't they understand *value*?  Are they blind to their own motivations?\n\nThis is exactly the situation that Bauerlein details in his opening, with Geoffrey Hartman[.] claim that writing literary criticism is as valid a creative enterprise as writing literature. Nobody in the entire world ever believed that except literary critics\n\nI'm not a literary critic, but my own view is... *somewhat* close to this.  It seems radically false at first, because the vast majority of literary criticism is crap.  But criticism can and should be its own valid creative pursuit.\n\nThere are two types of academics, I once heard somebody say: failed artists and failed intellectuals.\n\nFailed artists?  Yes, I think that might be the case for many art scholars.  This is most clear in the field of literary fiction, where the art is produced outside of the university, and then the university absorbs the art into the system and grants it its seal of approval.  I think there[.] a clear hierarchy of value there.\n\nBut \"failed intellectuals\"?  In many fields, being an intellectual in that field is simply synonymous with holding a position at a university (certain exceptions notwithstanding; Nietzsche did his best work outside of the university, although remember that even he had a Ph. D.).  Were philosophers like Quine and Lewis \"failed intellectuals\"?  In the hard_sciences, the relationship is even more pronounced.  It[.] just not really possible to make great discoveries in physics from the comfort of your bedroom anymore.\n\nIndeed, even in the cases of intellectuals working outside the university, like Nietzsche, the only reason that we understand them *as* intellectuals today is because their work was eventually absorbed into the university system and perpetuated by the university as intellectual work.  We should take seriously the notion that the university does not merely have a monopoly on intellectual value, but rather, *it is the source of intellectual value itself*.  This is why the notion that the university houses \"failed intellectuals\" is strange.  The university is where intellectuals are created.\n\nWhatever merit the author[.] original statement might have, there[.] definitely something dangerous about it, at least to all those Ph. D.-less people who think \"yeah, fuck the system, I'm going to do *real* work.\"  There[.] a razor-thin line between being a strong independent thinker and being a crank.\n\n The coverage model of academia, where individual academics specialize in order to collectively encompass all recognized knowledge, is set up to produce a substitute for the prestige academics crave\n\nIf academic prestige is merely a substitute, then what is the real thing?\n\n They have a monopoly on the resources required to be an intellectual while also earning enough money to feed your children.\n\nThis phrasing implies that the monopoly of the university could somehow be broken, and the resources could be more freely distributed.  While an egalitarian distribution of material resources is conceivable, an egalitarian distribution of *value* is, I think, not.  Value is only valuable in contrast to what is not.  In terms of the intellectual-as-genius, the intellectual-as-a-success (which are of course what we're really concerned with, rather than just the intellectual-as-career), I think these things may only be conceivable in the context of a university-like institution.\n\nAfter the destruction of the university, value and prestige will not be equally distributed among all.  I think it[.] more likely that prestige would simply dissipate into the wind.\n\n But more sinister than that, the University is a place where radicalism can be used by individuals to succeed according to the standards of the very system under critique: you can profess your profound empathy with the subaltern all the way into a nice house in a white neighbourhood, a nice car, and a tenured position at a prestigious center of wealth (where people know what \"subaltern\" means).\n\nThe academics themselves are undoubtedly subconsciously complicit with this, contrary to their stated egalitarian goals, if not outright consciously complicit with it.  The author admits it himself, right at the beginning of the article: \"The appeal of the University to a certain type of person (I regretfully include myself in this category) is easy to see... The University tells academics that they are smart. It tells them they are better than other people because they are smart.\"  These are all people who *enjoy* social distinction, enough to sacrifice a great deal of time and money to obtain more of it.  They *want to be better* than other people.  It[.] hard to believe they genuinely want, in their heart of hearts, to destroy that system.\n\nIt doesn't fucking matter whether you take your degree in English or in Computer Science.\n\nUm, well, let[.] not get ahead of ourselves.  It definitely does matter whether you do CS or English, in terms of what skills you will possess, what future jobs and positions will be more easily accessible to you, what your expected monetary earnings are, etc."}