{"doc_id": "918", "name": "2017_04_humanities_student_major_40_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2017-04-humanities-student-major_40_explainlikeimfive.txt", "pub_date": "2017-04-01T00:00:00Z", "Sentiment": "0.073", "Subjectivity": "0.366", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "310", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_62s5im", "Reddit_id": "dfozqd2", "Subreddit_id": "t5_2sokd", "Commenter": "cantcountnoaccount", "length": "1907", "content_scrubbed": "Most American Universities believe in the concept of Liberal Arts Education.  This is the idea that education prepares people for citizenship, as well as a job. Therefore it should be wide ranging so that citizens can understand the concepts of government, and participate in democracy.  We got this idea from Thomas Jefferson, who helped write the U_S Constitution, and, also founded the University of Virginia and pretty much created the American system of university education that was imitated around the country, especially by other state universities. \n\nAs a result of this philosophical underpinning, almost all American universities have \"general education requirements\" that you complete prior to specializing.  There are many methods of organizing this concept (almost as varied as the number of universities in the US) but generally, no matter what you study as a focus (called a \"major\" or a a \"concentration\") you will also study language, writing, mathematics, social science, and hard_science to some required degree, BEFORE you begin to work on your major.\n\nYou are accepted to the entire university and can take any introductory class they offer. You are not required to declare a major at most universities until your 3rd year.  Usually knocking out the general requirements takes about 2 years. By taking a variety of classes, many people find that their skills and interests are different than they originally thought when they started. Some huge percent, like 80% of American student change their major at least once. \n\nYou may get a lot of posts in this thread talking about how you must be accepted to the program when you start in Engineering.  That[.] because there are an uncommon number of engineering majors on Reddit, not because that[.] a common scenario in general. That is virtually unique to the field of engineering, and wouldn't be true of almost any other field of study."}