{"doc_id": "238", "name": "2017_10_humanities_student_major_110_neoliberal", "namespace": "we1sv2.0", "metapath": "", "pub": "neoliberal", "title": "2017-10-humanities-student-major_110_neoliberal.txt", "pub_date": "2017-10-02T00:00:00Z", "Sentiment": "0.117", "Subjectivity": "0.447", "Score": "19", "Upvotes": "0", "Downvotes": "0", "Wordcount": "258", "Permalink": "http://reddit.com/r/neoliberal/comments/73tost/nber_paper_englands_shift_from_free_college_to/dnt45if/", "Threadlink": "http://reddit.com/r/neoliberal/comments/73tost/nber_paper_englands_shift_from_free_college_to", "Parent_id": "t1_dnt1hrl", "Reddit_id": "dnt45if", "Subreddit_id": "t5_2sfn3", "Commenter": "Machupino", "length": "1633", "content_scrubbed": "Self replying with some follow-up reading I did: \n\n[The UK uses a different kind of loan that piqued my interest](http://www. researchcghe. org/perch/resources/publications/wp16. pdf).\n\nSome notes from Based Milty on why mortgage style loans shoudn't be used in skill investment:\n In a prescient and highly readable account, Friedman (1955) identified the\nfundamental reason why conventional mortgage-type loans work well for home loans\nbut not for investment in skills. Friedman identifies two strategic problems in the\nmarket for student loans:\n 1: There is a lack of collateral: in contrast with home loans, there is nothing for a\nbank to sell if a student defaults on his/her loan; and, again unlike home\nloans, students can emigrate, leaving no forwarding address. In addition,\n 2: There is asymmetric information: students are better informed than lenders\nabout whether they aspire to careers in say financial markets or the arts.\n\nIncome Contingent Repayments that get taken directly at the payroll level. I'd argue that this system is a strong way to teach financial literacy to college graduates too. Though it would be highly paternalistic (you better service your loan at 8% of your payroll or else!) and would see some opposition from risk taking high income earners and Libertarians. \n\nMaybe I'll do more reading and get an effort post in on why I support ICL over traditional mortgage style fixed loans, and hopefully it'll invite someone more versed in these areas to chime in. I feel that OPs article need this key difference as context. The differences in outcome I argue are heavily based on loan repayment structure. "}