{"doc_id": "1052", "name": "2017_04_humanities_student_major_1224_movies", "namespace": "we1sv2.0", "metapath": "", "pub": "movies", "title": "2017-04-humanities-student-major_1224_movies.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.053", "Subjectivity": "0.269", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "494", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg3zl01", "Reddit_id": "dg44i2m", "Subreddit_id": "t5_2qh3s", "Commenter": "SpeakerOfThings", "length": "2921", "content_scrubbed": "No critic is going to say \"*This gets 2 stars from me because dae whitewashing?*\"\n\n Timmy LaCritic will log onto Twitter and see @QTPie raging about *Summer Blockbuster*[.] impending whitewash controversy. Now, he doesn't want to look like he enjoyed the film *too much* since that might look like he endorses the casting, which is one step away from [.]upporting White Privilege' ; everyone on Timmy[.] feed would see that and he won't get a date with @QTPie and will have to fend off hysteria on his feed.\n\n ( Similar happened to Richard Roeper, said to be ['against equality']( http://chicago. suntimes. com/entertainment/ghostbusters-hater-roeper-ive-had-a-dose-of-some-freaky-posts/)  for his *Ghostbusters* review. ) \n\n So Timmy just gives it 4-5 instead of 6-7. He will quietly score it *punitively*. Social Media has turned what was 10 years ago 'private correspondence' into a spectator sport.\n\n[Here[.] a Pitchfork review of an album]( http://imgur. com/a/4BC6Z) which *looks* a hell of a lot like a retributive score on behalf of a friend of the reviewer : a conflict of interest at the very least. What happens when that takes place en masse ?\n\n\n\n\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\n\n\nCritics are not Philosopher Kings, untainted by bias or prejudice. An industry dominated by urban, college-educated Humanities Majors - many of them young - will have a lot of common ground on social/political issues, similar biases and shared values. They have their finger on the pulse of pop-culture and to no little extent they reflect it and espouse it. Sites like BMD, io9 and TMS are not politically \"neutral\".  That[.] not a statement of derision or anything partisan by me, it[.] *a fact*. Why would we say this has *nothing* to do with PC culture when \n[Film Crit Hulk[.] writing essays defending PC culture]( http://birthmoviesdeath. com/2017/02/23/p. c.-culture-vs.-the-big-joke) ?\n \nI haven't seen *Iron Fist*, but it[.] from a company whose film and tv divisions are both generally critically lauded. Every other Marvel show rates in the late 80s/early 90s. If you told me this was 60% Fresh, I'd believe it. *17%* is looking fishy, as is the *3% Fresh* rating of Zoe Saldana[.] *Nina*. 17% is in the realm of \"*Ok, something dramatically different is going on BTS with the  standards of quality and efficacy by which Marvel[.] legendarily consistent production model normally functions on its shows*.\"\n\n PoC representation on screen is a very good thing to see bloom and grow, and i can understand the impatience and sentiment that it[.] overdue. I also think it is in part simply a demographic reality in a fast-changing world. In the West we're well and truly living in a world that is just not the 50s anymore, not even the 90s. Independent of that, though, we can ask \"**Why does nearly every single film or tv series with a Whitewashing controversy end up getting unusually bad reviews?** \" "}