{"doc_id": "260", "name": "2017_10_humanities_student_major_277_spokane", "namespace": "we1sv2.0", "metapath": "", "pub": "Spokane", "title": "2017-10-humanities-student-major_277_Spokane.txt", "pub_date": "2017-10-04T00:00:00Z", "Sentiment": "0.086", "Subjectivity": "0.309", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "240", "Permalink": "http://reddit.com/r/Spokane/comments/74a03h/looking_to_move_thinking_of_spokane_is_it_a_good/dnwq7o0/", "Threadlink": "http://reddit.com/r/Spokane/comments/74a03h/looking_to_move_thinking_of_spokane_is_it_a_good", "Parent_id": "t3_74a03h", "Reddit_id": "dnwq7o0", "Subreddit_id": "t5_2r9l2", "Commenter": "catman5092", "length": "1314", "content_scrubbed": "You are correct about Spokane being different from when you grew up. The city and area is growing, not like Seattle thank goodness, but is growing.  City population now over 217,000 and metro area ( Inlcudes Coeur d' Alene and Kootenai County is about 712,000). Downtown area still undergoing a rebirth and the same can be said for Riverfront Park. Lots of new bars/restaurants/breweries and such. The arts scene is really taking off. Job market is pretty steady right now, last I heard lowest unemployment in many years. New wood manufacturewr coming to Spokane Valley by sometime next year, will offer 150+ jobs to the area, But, the housing market is really tight and costs are going up. The housing market is not keeping up with the demand. Add to that a historically low 1% vacancy rate and if searching it may come down to who you know, and/or timing. Personally I think its an exciting time to live here now and see all the new things happening. But like all other major cities we have our dark side. Property crime is still too high, and like everywhere this is due to drugs. City is aware of the problem. Just read in the paper today where it looks like the city will be able to add 10 more police to our force. Hope this helps. I am pretty high on Spokane, oh and speaking of, weed is legal of course too."}