{"doc_id": "924", "name": "2017_04_humanities_student_major_65_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2017-04-humanities-student-major_65_GradSchool.txt", "pub_date": "2017-04-01T00:00:00Z", "Sentiment": "0.21", "Subjectivity": "0.515", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "451", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_62rqju", "Reddit_id": "dfpar5m", "Subreddit_id": "t5_2r4r8", "Commenter": "SnowblindAlbino", "length": "2505", "content_scrubbed": "This sounds like *exactly* the situation many humanities grads were in back in the 1990s, when enrollments were very high and it was commonplace to admit unfunded students, then force them to compete Max Max style for a small number of fellowships and TA positions. So some of your elders may have advice worth seeking.\n\nHere[.] what I did as a student in a program where only two of our cohort was guaranteed funding for five years (there were ~50 people in our cohort, in what was then a top ten program). For the first year I had a job as a research assistant in an unrelated program; for years 2-4 I was a TA, so attended lectures, graded all work for 150 students, and ran four weekly discussion sections (x30 students each) in exchange for a tuition waiver and modest stipend; in year five I started working as an adjunct on a per-course basis (no waiver but I was done with coursework) at my home institution and another school 60 minutes away. In year six, when I was writing up my dissertation research, I got very lucky and landed a VAP position at a liberal_arts college 1,500 miles away from my university. I spent that year teaching full time (seven courses) and writing my dissertation at night and on weekends. That position was extended into a second year, which gave my the time/money to finish and defend my diss in year seven, making me the first of my cohort to finish. Ultimately only 10% of the cohort actually earned the Ph. D., which is part of what led the program to dramatically curtail admissions to the point that a decade later 100% of grads received full funding guaranteed for five years.\n\nThe lesson here, if any, is that you have to make your own path if your department can't/won't provide necessary support. I've read thousands of c. v. s over many years of service on search committees and have seen people use everything from teaching high school to working at 7/11 to fund their dissertation work in the humanities. You just have to find something that works for you-- some job that will pay enough to allow you to eat while you write --and get through the project as quickly as possible. Leave your university town, find some place where you can live cheaply, cut expenses to the bone, and work your ass off. For me, that meant working 50-60 hours a week teaching full time and then staying after work writing until midnight M-Thur and all weekend (plus every break of any kind) for 18 months. \n\nGood luck. It[.] a tough road but lots of people have been down it before."}