{"doc_id": "1017", "name": "2017_04_humanities_student_major_913_writingprompts", "namespace": "we1sv2.0", "metapath": "", "pub": "WritingPrompts", "title": "2017-04-humanities-student-major_913_WritingPrompts.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.295", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "556", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_649enh", "Reddit_id": "dg0lvhu", "Subreddit_id": "t5_2s3nb", "Commenter": "imakhink", "length": "3224", "content_scrubbed": "The city of Dair is renown for its trade, entrepreneurial spirit and the merchant empires that grow from nothing.  Exporting more than ideas, its famed armouries supply kingdoms and sometimes empires with rifles, ammunition and the means for self-destruction.  \n\n\nThat being said, it is the greatest importer of foreign cuisine.  Dairish food is little better than eating dirt of a boot.  \n\n\nTamran Yin was such a man to take advantage of this distinct lack of taste. Both in cuisine and lacking a tongue for flavour, he was more than happy to impart some of his fine knowledge of the arts to these city dwellers.\n\n\nHis food stall stood low between two dingy buildings at the end of the market, covered by a thick piece of cloth.  He steams pork filling on a steamed bun, he filled bowls with chicken soup, his beef pasties filled the mouths of miners, aristocrats and the odd beggar.  He had even won a competition against a famous chef, one who cooked the meals for a major trading family.  \n\n\nBut today he was trying something *revolutionary*.\n\n\nBusiness was slow with the winter bleeding into spring.  Fresh stock vegetables were hard to obtain and the only excess material he could find were thick skinned chickens.  But he glowered at the challenge.  He had an abundance of eggs, poultry and a lifetime of lard.\n\n\nHis assistant also found a new import of a strange green and yellow fruit that tasted something sour.  \n\n\nBut as the day came to a close, Tamran[.] mind thought, ran into the alleys, around the city and back.  He had nearly come to making a simple broth when an idea struck him.\n\n\n\"Tess! Get the lard and boil it.  Ryhse, get a box of the yellow fruit, squeeze and mix with a carton of eggs.  Tabs, what spice do we have?\" \n\n\n\"Southern hotspice!\"  Tabs yelled.  It was a strange thing to see it all unfold in a small unsanctioned alley.  \"Smoked reds and hot pepper mixed with that a bit of scarlet chili! peppers!\"\n\n\n\"Pan fry the peppers and ground em! Mix them with most flour and one part spice. Get it done!\"\n\n\nSuddenly the stall began to angrily fill in with smells, the bubbles of large starting to come to erupting from the black pot.  Tamran himself bloodied himself by wrestling with chickens, chopping them into chunks.  As the flour and spices began to come to a conclusion, Ryhse came back bitterly saying that the egg mixture was done.  Tamran, satisfied with all the prep began his own kind of magic.\n\n\nCoating the chicken with flour, then into the eggwash, he coated it once more with flour.  Ryhse followed suit, starting a production line.  Once double coated, Tess quickly chucked the chicken into the now boiling lard.  \n\n\nTamran watched as the white covered chicken materialized into a golden, crispy delectable.  The oil dripped off his hands, burning his already thickened and calloused hands.\n\n\nBut the crunch, the tender soft meat, the tang of that lemon combined with the hotspice made for something fierce in his mouth.  His thoughts, now something tangible was more than anything he had ever done. Again.\n\n\nThey began serving the midnight miners, a sort that demanded food quickly.  Upon being asked to name his dish, he went for the easiest answer.\n\n\n\"Why, it[.] fried chicken.\""}