{"doc_id": "1098", "name": "2017_04_humanities_student_major_1760_tennesseetitans", "namespace": "we1sv2.0", "metapath": "", "pub": "Tennesseetitans", "title": "2017-04-humanities-student-major_1760_Tennesseetitans.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.046", "Subjectivity": "0.279", "Score": "53", "Upvotes": "0", "Downvotes": "0", "Wordcount": "693", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65lpxq", "Reddit_id": "dgb92xy", "Subreddit_id": "t5_2s5fm", "Commenter": "armchairchampion", "length": "4057", "content_scrubbed": "The twelve Titans, children of Uranus (Heaven) and Ge (Earth), were the group of gods immediately preceding the Olympian gods in Greek mythology. The Olympians defeated the Titans in a battle — the Titanomachy. The word 'titanic' refers to the great size and power of the Titans, attributes necessary to make their defeat by their children, the Olympians, more impressive. In appearance, they are thus much like the Giants, and in classical and later art it is often difficult to tell whether Titans or Giants are represented. In addition to the Titans, Uranus and Ge produced monstrous offspring: three beings each with a hundred hands, and three one-eyed giants (the Cyclopes).\n\nThe youngest Titan was Kronos, who castrated his father with a sickle given to him by his sister Rhea, and threw his genitalia into the sea; the Giants sprang to life from Kronos' blood, which fell on the earth, while Aphrodite was born from the foam of the sea. Kronos took his father[.] throne, then married Rhea; but he proceeded to swallow every child born to her, from fear that a child would copy his example and take control of the world. But one child, Zeus, was smuggled away to be brought up in Crete; instead Rhea passed a stone wrapped in a cloth to Kronos to swallow. When Zeus reached adulthood, he gave an emetic to Kronos that made him vomit up Zeus' long-lost brothers and sisters, the Olympian deities. These fought the Titans for ten years, and after the eventual Olympian victory the Titans were banished to Tartarus, a place below the underworld. Despite the cruelty and violence of these stories, the time when Kronos ruled was nevertheless also regarded as a Golden Age by the Greeks, and in some myths he now rules the Isles of the Blessed, where some of the dead are privileged to dwell.\n\nA variant from of Greek mythology given in Orphic theology, known from Neoplatonist sources, told an alternative version of the Titan myth, which also involves the separation of body parts but suggests a dual nature for human beings. In this variant, it is said that the young god Dionysos was dismembered, cooked, and eaten by the Titans, acts for which Zeus subsequently punished them by destroying them with a thunderbolt. Human beings were then created out of the ashes of the Titans; this suggests that, as part of our identity as humans, we have not only a tendency towards violent criminal acts, from the Titans, but also something good, from the parts of Dionysos they had consumed before their own destruction. Dionysos himself was reborn from the one remaining part of his body, the heart, which the goddess Athena preserved. The Orphic literature influenced many Bacchic mystery groups in antiquity; initiates seem to have regarded the body as a 'prison', and believed that they must liberate the divine 'Dionysiac' part of humanity from the evil 'Titanic' part.\n\nAt least one of the offspring of the Titans took on an important role in the period of the rule of Zeus in which the classical Greeks believed themselves to be living. Prometheus, son of the Titan Iapetus, was the major culture-bearer in Greek thought, responsible for many of the arts, crafts, and sciences. In some myths he creates men from clay. A friend to humankind, he stole fire from Zeus to bring to earth, making possible not only the cooking of food, thought to separate humans from beasts, but also sacrificial practice, which allows humans to communicate with the gods. However, Prometheus' cunning tricks annoyed Zeus, causing him to send the first woman, Pandora, as an unsolicited gift to humans; made by the gods to be a seductive snare, attractive on the outside, but containing an evil mind and an endless hunger for all the food a man can work to produce, Pandora went on to open the forbidden jar containing all the evils of the present age. Prometheus himself was punished by being tied to a pillar, with an eagle visiting him daily to consume his liver. Overnight, his liver regenerated, making his punishment unending until Heracles (Hercules) came to set him free."}