{"doc_id": "1049", "name": "2017_04_humanities_student_major_1210_getdisciplined", "namespace": "we1sv2.0", "metapath": "", "pub": "getdisciplined", "title": "2017-04-humanities-student-major_1210_getdisciplined.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.156", "Subjectivity": "0.322", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "301", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64mafq", "Reddit_id": "dg3ylho", "Subreddit_id": "t5_2uzju", "Commenter": "invertedgeek", "length": "1767", "content_scrubbed": "I'm 22, a political science student as well. I am currently studying in a local community college but I will be transferring to a 4-year university this coming fall to finish up the upper division classes for the bachelors degree. To be honest, I don't have much interest in political science neither, the more I learned about how politics works, how inefficient our government is, how corrupted the international community is etc.. the more I feel demotivated in learning almost anything with regards to this major. I have asked myself many times, what can I do with this political science degree? Am I going to be a politician? Most likely not. Do I want to be a political scientist!? Definitely not!  I totally understand your frustration, but I'm sure thousands of millions of liberal_arts students feel the same. However, I don't think we are at any disadvantage, because one of the most important thing employers consider, is your ability to reason, analyze, thus critical thinking.  I've had friends who majored in stem who couldn't find jobs, due to their inability to reason, social networking, or poor human relations.  One thing we can learn as liberal_arts students, is the beauty in liberal_arts itself, it exists for a reason. Try to switch perspective and learn the most out of political science (political philosophy, international relations) etc.. that requires tremendous reading, writing, and analytical skill. With that being said, you gotta find your passion and stick to it! Commit to it, and if you want to change your major, do it, or consider a double major! (Even better)! There are so many ways out, uncertainties, and a long long life ahead of us, but one thing we can assure is the skills we learn and the knowledge we absorb. Good luck! "}