{"doc_id": "1193", "name": "2017_04_humanities_student_major_2524_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2017-04-humanities-student-major_2524_philosophy.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.279", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "272", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgmcnog", "Reddit_id": "dgmd23k", "Subreddit_id": "t5_2qh5b", "Commenter": "Lurkinstein", "length": "1652", "content_scrubbed": "If said doctors were working for big pharma, that might hold water. Such doctors you speak of, however, tend to come from small practices who (again) have axes to grind against the big bad mega corp.\n\nAs for the social construct thing, I think we're using slightly different definitions of the term. I never said social_scientists weren't studying real things, but such things are much more nebulous and subjective then things like physics, math, engineering, etc, and much more prone as a result to the effects of bias.\n\nI'm seeing a tremendous pushback against Enlightenment ideas of objectivity and truth in the liberal_arts and humanities. The most salient recent example I can think of is a letter sent by some students in Pomona College to the college president that has this neat little gem right here:\n\n\"Historically, white supremacy has venerated the idea of objectivity, and wielded a dichotomy of [.]ubjectivity vs. objectivity' as a means of silencing oppressed peoples. The idea that there is a single truth--'the Truth'--is a construct of the Euro-West that is deeply rooted in the Enlightenment, which was a movement that also described Black and Brown people as both subhuman and impervious to pain. This construction is a myth and white supremacy, imperialism, colonization, capitalism, and the U_S are all of its progeny. **The idea that the truth is an entity for which we must search, in matters that endanger our abilities to exist in open spaces, is an attempt to silence oppressed peoples.**.\"\n\nStudents don't invent that stuff in a vacuum. They learn it, either wittingly or unwittingly, from their teachers."}