{"doc_id": "969", "name": "2017_04_humanities_student_major_491_ucla", "namespace": "we1sv2.0", "metapath": "", "pub": "ucla", "title": "2017-04-humanities-student-major_491_ucla.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.172", "Subjectivity": "0.368", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "366", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63mggq", "Reddit_id": "dfvcdn1", "Subreddit_id": "t5_2qscu", "Commenter": "kiwijafa", "length": "2127", "content_scrubbed": "I'm a grad student out here, so I can't speak too much about the undergrad program other than the classes I've TA'd and what my professors have been telling me.\n\nSo the college system in California are set up like this:\n\nCommunity Colleges - supposed to teach a trade (i. e. mechanic, electrician, etc)\nCalifornia State Universities - supposed to teach how to be a highschool teacher, social worker, etc. More \"practical humanities\"\nUniversity_of_Californias - supposed to be top tier research institutions\n\nThe effect of this is that at UC, the professors are research heavy. So they know a whole bunch of theoretical stuff, and they specialize in teaching it since they are so good at it.\n\nThey aren't the absolute best at teaching more hands on skills CURRENTLY. HOWEVER: THIS IS CHANGING\n\nWe have recently hired a bunch of professors (Ankur Mehta, Jonathan Kao, etc) that are much more practical. Greg Pottie and William Kaiser are also working with the department to bring more practical classes to the undergraduate curriculum.\n\nI'd definitely reccommend taking E96C with Dr Kaiser or Dr Pottie when you come in. It[.] under the general engineering school, but its taught by EE professors.\n\nWe are also adding a computer engineering curriculum under the EE department (I think next quarter - Fall 2017).\n\nIf you do end up doing EE, I highly highly reccomend that you also take a bunch of CS classes. It is absolutely necessary to be a competent programer on the job these days. It really doesn't matter if you want to be an RF engineer, digital logic designer, you NEED to know how to program.\n\nIt also opens up a whole bunch of jobs for you, coming in with a background of both electrical and programming knowledge. I can apply for very softwary roles, and also hardwary roles.\n\nThe software classes I reccommend are: CS31, 32, 33, 111.\n\nCS111 is optional (but highly highly highly reccommended. It[.] hard, but every interview I've ever had asks like 30 questions about operating systems. Make sure you take this class and learn from it). You really need to have taken CS31-33.\n\nLet me know if you have any more questions!"}