{"doc_id": "225", "name": "2017_10_humanities_student_major_13_ubc", "namespace": "we1sv2.0", "metapath": "", "pub": "UBC", "title": "2017-10-humanities-student-major_13_UBC.txt", "pub_date": "2017-09-30T00:00:00Z", "Sentiment": "0.158", "Subjectivity": "0.335", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "327", "Permalink": "http://reddit.com/r/UBC/comments/73js12/ubc_coop_hiring_experience/dnquxz8/", "Threadlink": "http://reddit.com/r/UBC/comments/73js12/ubc_coop_hiring_experience", "Parent_id": "t3_73js12", "Reddit_id": "dnquxz8", "Subreddit_id": "t5_2qy2j", "Commenter": "athenafletcher", "length": "1830", "content_scrubbed": "Hi there! I'm in the Arts co-op program and currently doing my third and last work term. I think it[.] different for every faculty, but for Arts we are required to do a minimum of three work terms in order to finish the program.\n\nBeing in co-op has been great and I strongly recommend it. Even though I delayed my graduation by a year, it[.] worth it. By the time I graduate, I will have tons of work experience and networks from three different organizations in three different sectors. As I look back on when I started out, I can definitely appreciate how co-op refined my resume/cover letter making skills, interviewing skills, and networking skills. I feel more confident about all these things, which aren't taught in university courses but are so crucial in the real world after graduation.\n\nThey say looking for your first work term is the most challenging part, and I would probably agree with that statement because you're just starting out. But the upside of having to do lots of interviews and send out so many resumes and cover letters before finally getting that job offer is all the practice you get. When it came time to start applying for my last work term, I already felt like a seasoned pro from having gone through the cycle so much. So, it definitely gets better with time and practice!\n\nI cannot imagine graduating and not having done co-op. I would probably feel inexperienced, lost, and directionless, not to mention broke. Thanks to my co-op earnings, I feel so much more independent and capable. I don't have to solely rely on student loans to pay my tuition. I can also now do more of one of my passions, which is traveling.\n\nI hope this was helpful! In short, join co-op because it will really be one of the best investments you can make not just for your degree but for your personal development as well."}