{"doc_id": "1201", "name": "2017_04_humanities_student_major_2594_comics", "namespace": "we1sv2.0", "metapath": "", "pub": "comics", "title": "2017-04-humanities-student-major_2594_comics.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.15", "Subjectivity": "0.444", "Score": "392", "Upvotes": "0", "Downvotes": "0", "Wordcount": "400", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_671u2h", "Reddit_id": "dgn4l6y", "Subreddit_id": "t5_2qh0s", "Commenter": "fuzzyblackyeti", "length": "2246", "content_scrubbed": "I feel like no one on reddit actually acknowledges what liberal_arts education is and what liberal_arts degrees are actually good for.\n\n\nFirst off liberal_arts is a education theory that means to encompass a wide variety of classes so people can get a broad spectrum of education. It[.] derived from the Greek teachings of Artes Liberales(?) which is the idea that all free people should have a general knowledge of a bunch of stuff so they could participate in society in a meaningful way. And I'm sure most universities follow the liberal_arts mindset at least a little bit. Because think back if your university or college required you to take an amount of humanities credits, math credits, natural science credits, social science credits, even if your major wasn't related to it.\n\nAnd no one is wrong about liberal_arts degrees not being great for landing that sick job you've always wanted blah blah. Because having an approximate knowledge of many things doesn't make for a great resume when you apply for a STEM job or a business job. What a liberal_arts degrees ***is*** good for though, is promotions at \"lower\" jobs. Example. Jacob works at a fast food place and has been for 6 years. He actually really likes it and would like to move up. But hey to be promoted from manager to general manager, you need an associates (or possibly bachelor degree). A lot of places do this so they actually hire decently educated people to be in important leadership roles. Well Jacob sure is in luck because the local university has a good liberal_arts program (often called a degree of applied arts and sciences) that isn't super expensive and he can always take night classes or be a part_time student. And it gives him a broad view so he can make good decisions when he is promoted.\n\nSo liberal_arts degrees aren't a way to get sick high paying corporate jobs, or stem jobs but a good education to have to broaden your perspective on society, and also help people get jobs that don't necessarily require a specific degree, but any degree in general.\n\nGoogle William Cronon[.] paper \"Only Connect...\" and it[.] about the goals of a liberal_arts education.\n\nBut hey, I get that a lot of conservatives like to bash it cause it has the word liberal in it."}