{"doc_id": "1181", "name": "2017_04_humanities_student_major_2447_technology", "namespace": "we1sv2.0", "metapath": "", "pub": "technology", "title": "2017-04-humanities-student-major_2447_technology.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "0.105", "Subjectivity": "0.386", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "846", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dglg7yu", "Reddit_id": "dgliip4", "Subreddit_id": "t5_2qh16", "Commenter": "dsigned001", "length": "4789", "content_scrubbed": "Haha, I'm glad a real chem E showed up to validate the \"I don't use my degree\" bit. I think I was out already by the time I realized that, but it reinforced my decision. Although to be fair, I *do* have a chem e friend who went on to do a post doc in materials science. So technically he used his degree. Lol.\n\nActually, it[.] funny that you mention \"complicated statements made in English\" because it[.] exactly that which precipitated my decision to leave the engineering program. \n\nI don't know where you studied, but at my school, the engineering program was pretty brutal. The whole \"study-socialize-sleep pick two\" was really just \"pick one\". As a result, both of a lack of socialization and of sleep deprivation, guys (and gals, but mostly guys) who had been fairly well adjusted when entering the program began to get more of the \"humorless engineer\" stereotype persona. Seeing the comedy in it, I wrote a satirical piece for the school newspaper. Not a single engineer realized it was satire, but I had several physics professors come tell me how much they laughed. \n\nSeveral years later, I got another chuckle, as one of the examples that I had used of myself \"turning into an engineer\" was my finding the composition of mud fascinating. As any good satire, it was only half joking: being in the engineering program did legitimately stoke my curiousity about things that I think most people take for granted. In other words, I really *did* start to find really \"weird\" things interesting, as understanding the complex physical and chemical interactions gives you a lens to see things where other people might simply see \"mud.\" However, this was interpreted by the engineers as being an insult, rather than a compliment.\n\nSo it was funny to me that down the road I became friends with an engineer who[.] Phd was on mud (floculations, specifically), and that I later worked for a lab whose main source of revenue was testing the erosion of the far side of dikes. A big part of my job was building the test setups in the gigantic flumes, which they would then run water over, and record how the mud eroded.\n\nBut to address your initial point: I think if one thinks of ability as a binary, I agree with you that it[.] erroneous to say that STEM majors can't understand complicated statements. But if we instead think of it as a spectrum, I think it starts to make a bit more sense. I have a basic understanding of organic chemistry. But I never took O. Chem. (one of my few sadnesses about quitting engineering), much less passed with decent grade. And I think with quite a few of the humanities, it can be easy to minimize the difference between a rudimentary grasp of the basics, and a competence in working in the discipline. I don't imply anything about your intellect when I say that you haven't understood Kant. He[.] ridiculously hard to understand when you have someone holding your hand through it all, and I say this as someone whose verbal reasoning ability is absurdly high (another reason that the switch was probably a good idea for me-- my verbal scores were always in a much higher percentile than my quantitative), who has a basic understanding of German, and a fluent understanding of French. \n\nMy aim in saying this is not to pick a fight, or get into a pissing match, but rather to say that I think condemnation of an education that one has not gotten is a dangerous game. I can make comments on the path I chose, but even then, my experience with Philosophy is hardly a hard and fast rule, so I have to be careful about drawing general conclusions about Philosophy degrees from my own experience. But I have almost no basis at all to make statements about, say, medicine. And yet people are extremely comfortable dismissing disciplines of which they have no understanding or concept, entirely on the basis of how \"well\" graduates can monetize their knowledge. \n\nWhen I was a freshly minted grad, I was quite naive and believed all too much about what people told me about my degree. \n\nBut as the years have dragged on, and a few IT certs make me every bit as \"marketable\" as every STEM grad (ok, not *every* STEM grad) out there, I've realized that I take for granted a lot of talents that were forged in my Philosophy classes that the general population is clueless of. \n\nFor example, you'll see reddit bandy about with accusations of logical fallacies. My ability to discern the good logic from the bad isn't some gift from on high. Well, technically, I had an aptitude for it, but it was just \"potential\" until I actually started taking formal logic classes. (As an aside, if someone starts accusing another of a \"logical fallacy\", especially as opposed to simply pointing out an error in reasoning, it[.] usually a good sign that they know jack shit about logic). "}