{"doc_id": "298", "name": "2017_10_humanities_student_major_597_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2017-10-humanities-student-major_597_college.txt", "pub_date": "2017-10-07T00:00:00Z", "Sentiment": "0.009", "Subjectivity": "0.267", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "232", "Permalink": "http://reddit.com/r/college/comments/74w7op/not_a_college_student_how_does_college_work/do2a5y4/", "Threadlink": "http://reddit.com/r/college/comments/74w7op/not_a_college_student_how_does_college_work", "Parent_id": "t3_74w7op", "Reddit_id": "do2a5y4", "Subreddit_id": "t5_2qh3z", "Commenter": "DreamingOfFlying", "length": "1330", "content_scrubbed": "Universities are usually bigger than colleges.  You also have specifically state universities (bigger, usually), city community colleges (smaller, usually).  I think all universities offer post grad programs (masters, phd, etc.) but not all colleges offer this.\n\nAnd then within a university/college you will have divisions of different majors (like a college of liberal_arts, college of applied sciences, etc.).  So your degree would say bachelors of political science in the college of liberal_arts.  (but no one cares about that).\n\nAny major in any college/university will have a schedule for what classes you need to take to get that major.  They usually form that schedule assuming that you will follow it to a T and then you graduate when it says.  But this is real life.  You can take as long as you need to finish it.  So if it takes you an extra year because you take a year off, fail a few classes, transfer, etc.  That[.] fine.  You'll still get your 4 years bachelors after you finish late/early.\n\nA bachelors is 4 years (rarely 5 depending on the program), an associates degree is 2 or 3 years depending on the program, a masters is 4-6 years total depending on the program, a PhD is usually 3+ years after your bachelors or masters.\n\nAll of these can be finished in more or less time than what I listed above as well."}