{"doc_id": "1101", "name": "2017_04_humanities_student_major_1767_shitamericanssay", "namespace": "we1sv2.0", "metapath": "", "pub": "ShitAmericansSay", "title": "2017-04-humanities-student-major_1767_ShitAmericansSay.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.049", "Subjectivity": "0.31", "Score": "36", "Upvotes": "0", "Downvotes": "0", "Wordcount": "397", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgbbhk1", "Reddit_id": "dgbbzub", "Subreddit_id": "t5_2w57u", "Commenter": "LeftRat", "length": "2349", "content_scrubbed": " The number of gender studies majors is stupid and dumb\n\nWhat a well-founded, rational opinion of someone who definitely knows the topic. \n\n if you wanted to study that you'd be a statistics major and they study that.\n\n... you seriously believe that all of gender studies is somehow a subset of statistics, and that a statistics major knows everything a gender studies major knows? You've never actually *been* to a gender studies class, have you?\n\n The number of philosophy, gender studies and other liberal_arts majors doesn't help society.\n\nSays you, a person that doesn't know anything about the history of philosophy and gender studies and how they affected the world.\n\n Half that and you'd have no difference in the amount of knowledge we have in those areas.\n\nThis can only be said by someone who has zero knowledge of contemporary philosophy. Or do you have some source to quote here? Surely, someone so rationally and scientifically minded who shuns the evil soft science has something to back up his opinion?\n\n I'm not an arbiter, society is. If we needed more there would be jobs paid for by companies or governments\n\nJeez, that[.] a lot to unpack. First of all, society is not corporations and government. Secondly, as I have stated before, the free market does not somehow make the best decisions for  society, it just makes the most economically sound decision, leaving all other dimensions unconsidered - I'm sure you know just like me the many situations in which that was detrimental to society. And lastly, saying \"society has decided it doesn't need liberal_arts\" when, in your own admission, a lot of people are choosing those majors ignores that these people are *also part of society*. So large corporations and some parts of the (American) government  don't think they would be useful - that doesn't change the fact that society does.\n\nSociety is neither the free market, nor the government, nor a sum of both. It is much larger than that. Which, come to think of it, might be easier to understand if you'd know something about social_studies or philosophy. See how that happens?\n\n\nEDIT: **dylan here is actually a conspiracy nut who believes in the Nazi myth of Jewish Cultural Marxist conspiracies. Quelle surprise.**\n\n Trump is hated by more than half the elite. The only folks that back him are non cultural Marxist Zionist."}