{"doc_id": "494", "name": "2017_10_humanities_student_major_2681_teachers", "namespace": "we1sv2.0", "metapath": "", "pub": "Teachers", "title": "2017-10-humanities-student-major_2681_Teachers.txt", "pub_date": "2017-10-27T00:00:00Z", "Sentiment": "0.019", "Subjectivity": "0.341", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1163", "Permalink": "http://reddit.com/r/Teachers/comments/792noh/does_your_job_ever_feel_worthless/doz7tip/", "Threadlink": "http://reddit.com/r/Teachers/comments/792noh/does_your_job_ever_feel_worthless", "Parent_id": "t1_doz5q44", "Reddit_id": "doz7tip", "Subreddit_id": "t5_2qqcs", "Commenter": "Physics-is-Phun", "length": "6968", "content_scrubbed": "When you step into the classroom, you are responsible for a variety of things. Some take higher priority than others, depending on what your grade level is. (For example, a kindergarten teacher probably has more responsibility for the actual whereabouts of a student is than I am as a high school teacher- I can typically just give a nod or a wave to a student asking to go to the bathroom and they just go, but I suspect many kindergarten teachers have to send an aide or something, if not have kind-of-scheduled \"whole class\" bathroom trips. That said, I'm not a kindergarten teacher, so I'm probably not informed on bathroom policy at that level.\n\nBut anyway, I think the overall responsibility that society (at least, American society) places on us can be summarized as:\n\n- making sure every child is safe while their parents/guardians are at work and cannot provide for them;\n\n- making sure every child is given a high-quality \"liberal_arts education\" (which *is not to say that they are being indoctrinated as liberals*, but that they are given an education in all the important sciences and \"useful arts,\" a phrase that appears in the Constitution)- or, in other words, making sure they have a basic understanding of how the universe works (bio/chem/physics), how to use that understanding to predict new knowledge or analyze situations (mathematics), where we come from (as an individual nation and as a species) (history/sociology), how to appreciate our culture, the cultures of others, and contribute meaningfully to that culture (music/art/shop/metalworking/etc), how our society works (civics), and how to participate in the marketplace of ideas (language arts/literature/world languages);\n\n- making sure that every child learns some modicum of etiquette and respect (or, at least, appropriate times to follow/question) chain of command, authority figures, and their fellow students;\n\n- making sure that every child is capable of being independent learners/workers, as demonstrated by their ability to earn a high school diploma. (The common phrase now is something like \"college and career readiness.\")\n\n- making sure every student is capable of being *productive members of society* (learning behaviors and finding resources such that they won't become a threat to the social order; learning how to take civic action, including voting and organizing; etc).\n\nI would say that if a school, on average, does all of those things, then you've got a \"good school.\" Or, at least, a \"functioning school.\" At least, insofar as defined by America[.] expectations of teachers. I think, on average, we achieve that.\n\nI hope that helps communicate at least how I see my role in the classroom. I think that other teachers would subscribe to my phrasing, though I obviously cannot speak for all teachers. Largely, we become teachers because we want to \"make a difference,\" which I think is a shorthand for all of that.\n\n But let me ask you this: if a teacher does just show videos and that class all has passing grades on state and CB[.] exams, how is that ineffective? Who says that basic education isn't about passing multiple choice tests? The school won't know the difference. The parents won't know the difference. The government won't know the difference.\n\nSo, I would argue that because of the nature of learning, watching videos all of the time would lead to such poor learning that a properly-constructed test would show that students in this hypothetical class learned very little. If these students are actually all learning enough to earn passing scores on state/national/CB/etc tests, I'd say that one or more of a few possibilities are at work:\n\n- The learning is happening *in spite of* the teacher[.] approach, not *because of.* This would happen in a more wealthy school district, where the parents are typically much more involved in their students' lives, and would a) see their children never have homework, projects, etc that are actually challenging; and b) can afford the resources to bridge the gap (extra tutors and test prep). This is the case in nearly all wealthy districts, which is why the chief predictor of student outcomes (getting into/graduating from college, lucrative careers, etc) is not the teacher in the room, the quality of lunch, the standards a particular state adopts, etc, but *their zip code.*\n\n- The tests are so poorly constructed that they only measure surface recall of facts, which is typically all videos can really offer, most of the time- it[.] practice and effort (trying to solve a problem and failing; having to write drafts over; etc) that makes learning longer-lasting;\n\n- A combination of the two, where the tests are not surface-recall, but are so predictable that there[.] a whole industry of selling prep books. (The CB even sells their own materials for their own tests, for crying out loud. They get you to pay for both the review, *and* the exam- they've got you, or at least your wallet, by the balls!)\n\n\nTo your arguments that:\n\n The school won't know the difference\n\nAdministrators that only became admins for the paychecks won't. But teachers will know that the only reason students are passing is because of the things I wrote above.\n\n The parents won't know the difference.\n\nThis, I would argue, would only be because either the parents are not involved in their kids' lives (for whatever reason- often too little income, requiring 2-3 jobs to make ends meet). If the parents have the resources, they'll switch schools, or get resources (tutors, etc) to bridge the gap so that they know what their kid is learning.\n\n The government won't know the difference.\n\nIn principle, I agree. But I disagree in practice, because we're required to write daily lesson plans and submit them (and, depending on the anal-retentiveness of our supervisor, are asked to account for literally every minute of our instruction). Parent and student complaints, formal and informal observations, etc would be enough to show that such a teacher is not actually teaching, but just showing videos. Eventually, such a teacher will leave the classroom. The government at large may be unaware, but the small-scale government will know. (Don't forget- public schools are part of government!)\n\nReal learning is not something that is summarized on a multiple choice test. If you want to learn to play guitar, do you sit in a room bubbling in a sheet to show a I-IV-V chord progression? Or do you pluck at the strings, read books and watch online tutorials (*as a guide*), buy lessons from an instructor, and keep practicing until you can play?\n\nWhen we get our driver[.] license (at least in the US), we have to take both a written exam and a driving test. That alone should be enough to illustrate my point: \"yeah, you know what a stop sign is. But can you navigate a four-way stop? What[.] right-of-way in the situation? Can you put your car in the_right spot at the_right time, in an efficient way, that does not obstruct traffic?\""}