{"doc_id": "324", "name": "2017_10_humanities_student_major_890_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_890_AskReddit.txt", "pub_date": "2017-10-10T00:00:00Z", "Sentiment": "0.075", "Subjectivity": "0.42", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "271", "Permalink": "http://reddit.com/r/AskReddit/comments/759ds0/reddit_what_are_some_college_majors_that_should/do5s9q4/", "Threadlink": "http://reddit.com/r/AskReddit/comments/759ds0/reddit_what_are_some_college_majors_that_should", "Parent_id": "t1_do4wtsm", "Reddit_id": "do5s9q4", "Subreddit_id": "t5_2qh1i", "Commenter": "[deleted]", "length": "1506", "content_scrubbed": "Science bullshit. \n\nHey, I checked your post history. Why do so many people on Reddit accuse you of being a troll?     \n\nEvery single one of my friends and people I've ever known who majored in the humanities has a good job. \n\nThat[.] a pretty broad claim there. You're saying everyone in your colleges graduating class who majored in humanties has a good job. Every single one, eh? Out of hundreds and hundreds (maybe thousands), you kept up with all of them on a personal basis and wrote down their location of work, and whether or not they had a good job? Bull fucking shit\n\nYou also go on later in this thread to talk about 3 other friends you had who majored in music and had a fairytale life after. \n\nIt couldn't be that you're fabricating all these stories, could it? I could only imagine your incentive behind doing so. I could only imagine your place of origin. \n\nMy own guess is that you're an angst ridden teenager who doesn't live in America and lacks the mental faculties to cope with your general feelings of frustration so you take it all out by shitposting and trolling on the internet to satiate some inane sense of self-satisfaction you only seem to really get from derailing the discussion and fucking up things for everyone else because it[.] the only way you feel like you have control. So you enable yourself to become even a worse person. You're willing to put your ego - above the whole fucking world, because it makes you feel good. \n\n\nBut hey, that[.] just my fun little fan theory. "}