{"doc_id": "405", "name": "2017_10_humanities_student_major_1682_teachers", "namespace": "we1sv2.0", "metapath": "", "pub": "Teachers", "title": "2017-10-humanities-student-major_1682_Teachers.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.006", "Subjectivity": "0.337", "Score": "23", "Upvotes": "0", "Downvotes": "0", "Wordcount": "370", "Permalink": "http://reddit.com/r/Teachers/comments/7797mp/principal_money_matters_race_matters_grit_talk/dokbsu6/", "Threadlink": "http://reddit.com/r/Teachers/comments/7797mp/principal_money_matters_race_matters_grit_talk", "Parent_id": "t3_7797mp", "Reddit_id": "dokbsu6", "Subreddit_id": "t5_2qqcs", "Commenter": "_the_credible_hulk_", "length": "2015", "content_scrubbed": "Q. Your book is titled \"When Grit Is Not Enough.\" What did you make of the movement to instill and assess \"grit\" in young people?\nA. ARGH! So when I first read Paul Tough[.] book I was intrigued, and we did some work at BAA with thinking about the traits he discusses there.\nBut as I began to visit more schools and talk to my alums who were incredibly \"gritty,\" I became actually disgusted with the \"movement.\" It is a movement, for the most part, \"owned and operated\" by white folks and executed onto black and brown bodies.\nOf course you don't get ahead without determination and persistence, and it[.] one of the reasons I'm such an arts advocate. That[.] what you learn in the arts: how to practice, how to work together, how to persist through difficult scenes, lines, choreography, etc. . . . but this notion that \"if we show grit by having strict behavioral codes/rules, all will be well\" is ridiculous.\nI've seen so many schools now — all black/brown kids and majority white teachers — where this 1950s kind of discipline rules. Again . . . it[.] good to look people in the eyes, it[.] good to sit up, it[.] good to pay attention, but the example I write about in the book in a NON-no-excuses school, where the level of dialogue/discussion was so high and kids were in all manner of \"repose,\" proves to me that these somewhat oppressive conditions are NOT the only way to have an engaging classroom. Of course teachers need and want order, but all this \"hugs and bubbles\" stuff has taken it too far.  Silent cafeterias? I have seen LOTS of that. What is that about? \n\nSo, yes, I'm in total agreement.  Sort of.  I also detest lots of the bullshit charter strictness which I would never tolerate for my own kid.  But man, it[.] complicated.  I'm a white teacher.  The vast majority of my kids are Black and brown.  I can't change who I am, but I'm not about to quit either.  I don't know that that[.] what the author would advocate.  \n\nFor what it[.] worth, I would totally send my kid to the school I do teach at.  "}