{"doc_id": "1270", "name": "2017_04_humanities_student_major_3226_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-04-humanities-student-major_3226_politics.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.045", "Subjectivity": "0.312", "Score": "48", "Upvotes": "0", "Downvotes": "0", "Wordcount": "574", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_686qtc", "Reddit_id": "dgw4rnm", "Subreddit_id": "t5_2cneq", "Commenter": "The-Autarkh", "length": "3679", "content_scrubbed": "Horrifying. But at least [this guy](https://img. buzzfeed. com/buzzfeed-static/static/2017-04/28/15/asset/buzzfeed-prod-fastlane-03/sub-buzz-28499-1493408754-9. jpg?downsize=715:*&output-format=auto&output-quality=auto) didn't have a gun, and the people are likely to survive:\n\nThe suspect, who once wrote a BuzzFeed post about conservatives being discriminated against on liberal campuses, reportedly asked students about their political affiliations as he attacked them.\n\n\nA former student of Kentucky[.] Transylvania University was arrested Friday after he allegedly stormed a campus cafe with a machete and a bag of knives, quizzed students on their political affiliations, and injured two women.\n\n**Mitchell W. Adkins** allegedly entered the cafe on the Lexington campus shortly before 9 a. m. local time before threatening patrons and employees, the Lexington Police Department said in a statement.\n\nTwo women suffered non-life-threatening injuries. One was taken to a hospital, while the other was treated and released at the scene.\n\nWitnesses told local media the suspect shouted \"The day of reckoning is here!\" as he began his attack.\n\n\"He asked the first girl if she was a Democrat or a Republican. She said Republican. He said okay, then asked some other girl,\" Michael Soder told Lex 18. \"By that time, some of my friends were running out and yelling for us to leave, and I tried to stay behind to see if — I mean I didn't know what to do, I wanted to help, but I knew I should get out of there.\"\n\n\"He asked somebody what their political affiliation was, they said 'Republican,' and the guy said, 'You are safe,'\" campus newspaper editor-in-chief Tristan Reynolds told the Lexington Herald-Leader. \"And then I realized what was going on and started getting people out.\"\n\n...\n\nIn 2015, after BuzzFeed staffer and Transylvania alum Tracy Clayton wrote a viral post detailing her experiences with racism at the university, Adkins wrote a post on this website as a community contributor. \n\nIn the post, \"[Discrimination of Conservatives in Liberal Arts](https://www. buzzfeed. com/madkins19/discrimination-of-conservatives-in-liberal_arts-1ynfg?utm_term=. wsMdaG2vE#. lcaJk6Gy7),\" Adkins wrote of making \"several enemies\" because he is a \"proud Republican.\"\n\n\"It[.] amazing to me that when I listen to someone[.] political opinion and then give my own, I'm the one who[.] lashed out at for being a 'racist' or 'bigot,' some even go as far as saying 'bane of society' or 'fascist Nazi,'\" he wrote.\n\nAdkins discussed losing friends because of his opinions on gay marriage and Caitlyn Jenner, and detailed his unhappiness with the student newspaper urging students not to wear racially insensitive costumes for Halloween.\n\n\"I am proud of who I am, but this school has shown me that it[.] not okay to be a Republican anymore,\" he concluded. \"All of these people who are all about non-discrimination and against bullies and all for equality, are more than happy to turn around and scream at someone for being different, kick him to the ground, and leave him there. I am not the bigot at this school, it is those who go back on their beliefs in order to encourage them.\"\n\nIn a postscript, Adkins said he had later dropped out of college.\n\n\"The constant bullying and lack of friends drove me to an overdose, a trip to the hospital, and two trips to a mental hospital,\" he wrote. \"The constant thought of knowing I'd never fit in was too much for me to bear.\"\n\n\nOn his Facebook page, where he first shared his BuzzFeed post, Adkins has written and shared a number of posts about his support for President Trump, his views on gun control, and his views on attacks committed by Muslims."}