{"doc_id": "1043", "name": "2017_04_humanities_student_major_1126_jordanpeterson", "namespace": "we1sv2.0", "metapath": "", "pub": "JordanPeterson", "title": "2017-04-humanities-student-major_1126_JordanPeterson.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.05", "Subjectivity": "0.281", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "650", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg2xoiv", "Reddit_id": "dg343au", "Subreddit_id": "t5_32jqy", "Commenter": "quietthomas", "length": "4601", "content_scrubbed": "The problem with arguing \"influence\" is that it treats ideas as infectious and pathological; rather than the vital elements of free thought and free speech that they are.\n\nbut to say the Frankfurt school has had no influence is simply inaccurate.\n\nIs anyone saying the Frankfurt School had no influence? To be clear; I'm saying that The Frankfurt School weren't part of some plot to destroy America - and that the term \"Cultural Marxism\" has a specific academic origin and meaning... and that it[.] unfortunate that some conservatives don't respect this. After all, The Frankfurt School [coined the term \"calculating regressives\" for far-left student protestors](http://field-journal. com/editorial/theodor-adorno-and-herbert-marcuse-correspondence-on-the-german-student-movement), and in my view the alt-right and The Frankfurt School may have more in common than one might think.\n\nAcademically speaking the term 'Cultural Marxism' has been applied to the works of E. P Thompson, The Frankfurt School, and The Birmingham School - all of whom were critics of [the mass production of culture](https://en. wikipedia. org/wiki/The_Uses_of_Literacy#Massification_of_culture) under capitalism and the perceived distortion to human values this process is capable of.\n\nI don't believe that slipping to a low-res, amorphous definition of \"Cultural Marxism\" as \"anyone *influenced* in anyway by anything remotely Communist, Marxist, Collectivist, Communitarian or Socialist\" is a good step for communication or accuracy. I believe this slip provides more assumptions than it does answers (often careless assumptions about how causal, deterministic [or in some cases demonic](http://www. nationalreview. com/article/423707/michael-walsh-devils-pleasure-palace) 'the influence' has been).\n\nWhere as more discrete ideologies - such as Identity Politics (or Identity Fascism); are relatively easy to trace; and I'd find a conversation about at which point Identity Politics BECOMES Identity Fascism to be far more interesting than debating a relatively non-existent conspiracy theory.\n\nsaying that 'identity politics' didn't originate with the Frankfurt school is inaccurate. this is a quote from Wikipedia...\n\nI notice the quote from Wikipedia you've used didn't actually mention The Frankfurt School as originating identity politics.\n\nHowever [the wikipedia page I linked to](https://en. wikipedia. org/wiki/Identity_politics#History) DOES in fact state that Identity Politics in large part originated with the work of [Barbara Smith](https://en. wikipedia. org/wiki/Barbara_Smith); a person who holds SOCIALIST views....\n\n... but her socialist views didn't necessarily come from The Frankfurt School, or even from Marxism, nor did they necessarily influence her attempts at forming groups where women, blacks and homosexuals exchanged their experiences of social life... so again, 'influence' is an ambiguous and stifling concept here (not to mention that people exchanging their experiences sounds like a pretty genuine form of Identity Politics, and really not Identity Fascism or \"Cultural Marxism\").\n\nAs for the American Enterprise Institute[.] claim that there are more Marxists in the social_sciences than conservatives; I'm not sure to what end you're offering this info (I've assumed academic and political freedom is important to both of us here). Regardless, [here[.] another study](http://econlog. econlib. org/archives/2015/03/the_prevalence_1. html) which puts the number of Marxists in academia (on average) at just 3% (jumping to 5% for the humanities).\n\nAnyways getting back to our topic...\n\nTo quote Paul Gottfried, who was a one time student of Marcuse, is a conservative author, and is the man who coined the term 'paleoconservative'; from his book 'The Strange Death of Marxism':\n\n*\"Nothing intrinsicaly Marxist, that is to say, defines \"cultural Marxism,\" save for the evocation or hope of a postbourgeois society.\" ... \"The mistake of those who see one position segueing into another is to confuse contents with personalities.\"*\n\nThis is the problem with amorphous and demonizing concepts like 'influence', you have to draw a line in the sand somewhere - otherwise it could be argued that 'paleoconservatism' is a form of \"Cultural Marxism\"... I mean after all, Paul Gottfried was pivotal to paleoconservatism; and was a DIRECT student of Marcuse: How much more 'influenced' can you get, right?\n\nAnyway, I hope I've clarified the term a little, and highlighted the problems with arguments from 'influence'. Thank you for the effort you put into your reply. Quality and open discourse is always appreciated."}