{"doc_id": "439", "name": "2017_10_humanities_student_major_2015_neutralnews", "namespace": "we1sv2.0", "metapath": "", "pub": "neutralnews", "title": "2017-10-humanities-student-major_2015_neutralnews.txt", "pub_date": "2017-10-20T00:00:00Z", "Sentiment": "0.002", "Subjectivity": "0.264", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "283", "Permalink": "http://reddit.com/r/neutralnews/comments/77mbkl/to_get_harvey_relief_funds_residents_of_dickinson/doo58b2/", "Threadlink": "http://reddit.com/r/neutralnews/comments/77mbkl/to_get_harvey_relief_funds_residents_of_dickinson", "Parent_id": "t1_don5mpd", "Reddit_id": "doo58b2", "Subreddit_id": "t5_2ql83", "Commenter": "PoliticsThrowAway549", "length": "2180", "content_scrubbed": "What?  You can't discriminate against non-citizen African immgrants either.  At the *federal* level, the [Civil Rights Act of 1964](https://en. wikipedia. org/wiki/Civil_Rights_Act_of_1964) \"outlaws discrimination based on race, color, religion, sex, or **national origin**\".  National origin presumably includes things like discriminating against Israeli nationals or immigrants, or religion (as Israel is known for having a majority religion).  I don't know if law is settled about whether private businesses can discriminate against businesses as such.  \n\nThis is *literally* one of the major arguments against the current administration[.] attempt at a travel ban from certain countries.  From the [American Bar Association](https://www. americanbar. org/news/abanews/aba-news-archives/2017/09/aba_urges_u_s_supre. html):\n\n The ABA brief argues that the revised executive order signed by President Donald J. Trump on March 6 violates the prohibition on national origin discrimination in the Immigration and Nationality Act of 1965.\n\n---\n\nWith respect to this particular clause, it[.] fairly common for government grants to require agreements to follow the law.  As an example, the [NEA](https://www. arts. gov/open-government/civil-rights-office/civil-rights-faqs-applicants-and-grantees):\n\n All applicants for funding from the NEA (NEA) are required to certify that they are in compliance with the civil rights statutes that govern nondiscrimination in Federally assisted programs. \n\nFundamentally, Texas is asking for a similar certification.  The other big difference is that this law was passed by the state, although there are *similar* federal programs, like the [Office of Antiboycott Compliance](https://www. bis. doc. gov/index. php/enforcement/oac), which prohibits *agreeing to* boycott Israel (for example, as a condition of doing business elsewhere).  It[.] also unclear that something like this necessarily falls under state jurisdiction (it may).\n\n---\n\nIn short, the law in question may be unconstitutional, but it isn't patently so.  I wouldn't be surprised to see SCOTUS look at something like it in the next decade.\n"}