{"doc_id": "1252", "name": "2017_04_humanities_student_major_3128_movies", "namespace": "we1sv2.0", "metapath": "", "pub": "movies", "title": "2017-04-humanities-student-major_3128_movies.txt", "pub_date": "2017-04-27T00:00:00Z", "Sentiment": "0.119", "Subjectivity": "0.394", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "479", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67ztud", "Reddit_id": "dgul7ze", "Subreddit_id": "t5_2qh3s", "Commenter": "NuclearShadow", "length": "2808", "content_scrubbed": " This is a plea to allow r/movies to expand beyond the majority opinion\n\nOkay but you credit these opinions based on this...\n\n population that frequents Reddit is, and always has been, predominantly young male Americans.\n\nSo if culture and gender have a large impact on the reception and openness to films  wouldn't  other demographics generally produce the same results just focused on different films?    So for example women in South Korea likely have trends in which movies they prefer.      So if South Korean women were the majority here you would see favoritism to some films and others more discarded.\n\n and the democratic voting system, will always direct conversation away from criticism\n\nIf someone is willing to silence their opinion over imaginary internet points than I highly doubt whatever criticisms  of the arts they were otherwise going to construct would have been worthwhile to begin with.    Do such people exist? Maybe but no one of any respectable intellect would put stock into Reddit karma. \n\n and foreign language films, or maybe female driven dramas, \n\nPerhaps you're right here but what do you expect them to do?  You do realize everyone here has likely watched those types of films right?   If they decided it[.] not for them who cares?   Are you really suggesting that  they should watch films they won't enjoy?   I say this as a person who loves foreign films and I heck I am even a sucker for romance movies. and I'm a older American man.   But I wouldn't grab another guy and demand he start watching Blue is the Warmest Color with me if he[.] not into it.\n\n  we're left with a bit of an echo chamber. \n\nWhat I find interesting here is that I don't think anyone here would actually object to you saying \"Hey, check out these movies that you may have not heard of or previously considered\"   but instead you give nothing but a nice way of calling the majority here closed minded jerks who are so unintelligent that they think Reddit[.] popular opinion should dictate their actual expressions.    \n\n   when I would rather be exposed to new things.\n\nOut of everything you expressed this spoke to me the most.  How exactly is r/movies denying you the ability to seek out new things?   Are you really stating that your personal feelings of disenfranchisement from a subreddit is controlling your behaviors outside of it?    Suddenly your urge to watch The Handmaiden (great movie by the way)  is broken by r/movies discussing  The Martix?\n\nEven if your argument is poorly worded and what you mean is exposed to new ideas  and thoughts  rather than \"things\" as you put it on this subreddit.   There are more places on the internet to discuss such things so if a community doesn't seem to be on par with what you desire there are other outlets to discuss films and all the other arts."}