{"doc_id": "1113", "name": "2017_04_humanities_student_major_1811_worldnews", "namespace": "we1sv2.0", "metapath": "", "pub": "worldnews", "title": "2017-04-humanities-student-major_1811_worldnews.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.07", "Subjectivity": "0.263", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "907", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgbwbwy", "Reddit_id": "dgbwu4b", "Subreddit_id": "t5_2qh13", "Commenter": "JStancombe", "length": "5553", "content_scrubbed": "Talent and experience needs to be rewarded like any other profession. In the U_S, students in Schools of Education typically have lower high school GPAs and SAT scores compared with students studying business or engineering. This is because most people do not see a career in education as a worthy investment of time and money because of 1. Teachers are generally admired, but looked down upon 2. Teachers are not compensated similarly to that of their peers entering other professions. 3. Teachers have student loans, rent, mortgages, car payments, health insurance, school supplies, etc. to pay for. You can't pay off a $60,000 masters degree making $38,000 a year.\n\nYour British friend likely taught in Africa for a year right? What was he paid? $300 a week? Did he volunteer and actually pay to do it?\n\nTeaching is a profession. Teachers are professionals. Yet, they are treated like children. If we held our teachers in the same esteem as doctors and lawyers, maybe we would be first in math and English proficiency scores. We pile more and more on our teachers and still pay them the same. It leads to burnout, and Teach for America teachers, who have 6 weeks of preparatory student teaching in classrooms as small as 6-8 kids take their place. You want to know where a large percentage of Teach for America alums go? Into private sector consulting, making 5 times what an average teacher makes.\n\nPersonally, here[.] what I would do. I would double or even triple teacher pay. I would require that all teachers receive a clinically-based masters degree, where they are coached and mentored in the craft of teaching. Before entering a teaching program, they could major in a \"pre-education\" program similarly to that of pre-med and pre-law students. Science teachers would have to complete a STEM degree in subjects such as math, physics, chemistry, astronomy, computer science, etc. English teachers could get an English or humanities degree. Government and history teachers would get a degree in the social_sciences. Music teachers would have to get a degree in music. Physical education and health teachers would get a public health, kinesiology, etc. Too many teachers do not have a mastery of their subjects and in undergrad skate and take easy classes.\n\nAfter being admitted into a masters program, they would have to spend a minimum of a school year working full time in a school as a teachers assistant, and I would trash the PRAXIS, which is a joke, and make a test on par with the LSAT and the GMAT.  While working as a teachers assistant, in a sort of \"residency\" program. As they complete their degree, they would be \"recruited,\" into junior teacher of record positions. Then, every school district in the country would be required to have a pipeline for their teachers, where they would compete for positions such as \"master teacher,\" \"head teacher,\" \"curriculum designer,\" \"performance measurement director,\" where they would work with teachers on improving their teaching craft, curriculum design and development, and measuring performance of teachers. \n\nTeachers would also be allowed to take 1-2 year federally funded fellowships through the after teaching for 5 years to teach like your British friend did in Africa, while still taking a salary. Or they could take a position teaching adults in workforce development programs. Even put them in Teach for America type fellowships where they would teach in the most vulnerable communities after 3-5 years so we don't get poorly trained 22 year olds dealing with classrooms of 30+ students, with as many as 60% diagnosed with an emotional-behavioral disorder. I would also increase the number of days in the school year to 240 days instead of 180 while allowing them to take as much as 1 month per year for a vacation. \n\nFurthermore, teaching is physically demanding--you're on your feet as much as 5-6 hours a day. It is also extremely emotionally taxing. During the space between school years, I would have teachers working together on developing lesson plans, curriculum, taking professional development courses, analyzing student performance data, reviewing Individualized Education Programs (IEPs) for their special education students,  and passing that data onto their next teacher of record. On day one, teachers would have a firm grasp of where every student is in their academic standing. Teaching assistants could act as teachers in summer schools, and as coaches and tutors during the school year, where students lagging behind could receive more intensive individual and small group instruction. This would ensure that teachers have professional pipelines on par with their counterparts, are compensated on par with their peers, and actually respected. Also, It would ensure there is more than 1 adult in the classroom, and that teachers are actually prepared to enter the classroom on their first day as a teacher of record. People who would otherwise choose legal or medical careers would actually consider teaching and make the profession respectable. Finally, it would allow teachers to actually own their industry, and keep out the MBAs and lobbyists who think they know better.\n\nLet[.] pay first year teachers well above the local median income rates, as much as 1 standard deviation above it, with the opportunity to make as much as $200,000 a year after 20 years of teaching. Let[.] give them bonuses for superior performance, just like the private sector. And most importantly, let[.] let teachers frame the education debate and the freedom to innovate.\n\n\n"}