{"doc_id": "543", "name": "2017_10_humanities_student_major_3079_gendercritical", "namespace": "we1sv2.0", "metapath": "", "pub": "GenderCritical", "title": "2017-10-humanities-student-major_3079_GenderCritical.txt", "pub_date": "2017-10-31T00:00:00Z", "Sentiment": "0.101", "Subjectivity": "0.413", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "830", "Permalink": "http://reddit.com/r/GenderCritical/comments/79slxa/opinion_professors_like_me_cant_stay_silent_about/dp5zwuc/", "Threadlink": "http://reddit.com/r/GenderCritical/comments/79slxa/opinion_professors_like_me_cant_stay_silent_about", "Parent_id": "t1_dp58z63", "Reddit_id": "dp5zwuc", "Subreddit_id": "t5_2yk5v", "Commenter": "TossingLobster", "length": "4894", "content_scrubbed": "At Reed College in Oregon, where I work, a group of students began protesting the required first-year humanities course a year ago. Three times a week, students sat in the lecture space holding signs — many too obscene to be printed here — condemning the course and its faculty as white supremacists, as anti-black, as not open to dialogue and criticism, on the grounds that we continue to teach, among many other things, Aristotle and Plato.\n\nIn the interest of supporting dissent and the free exchange of ideas, the faculty and administration allowed this. Those who felt able to do so lectured surrounded by those signs for the better part of a year. I lectured, but dealt with physical anxiety — lack of sleep, nausea, loss of appetite, inability to focus — in the weeks leading up to my lecture. Instead of walking around or standing at the lectern, as I typically do, I sat as I tried to teach students how to read the poetry of Sappho. Inadvertently, I spoke more quietly, more timidly.\n\nThe interpretation of the First Amendment has been at the center of fierce debate on college campuses, football fields, Capitol Hill and cable TV. (Elyse Samuels/The Washington Post)\nSome colleagues, including people of color, immigrants and those without tenure, found it impossible to work under these conditions. The signs intimidated faculty into silence, just as intended, and these silenced professors' lectures were quietly replaced by talks from people willing and able to carry on teaching in the face of these demonstrations.\n\nI think obscuring these acts of silencing was a mistake that resulted in an escalation of the protesters' tactics. This academic year, the first lecture was to be a panel introduction of the course: Along with two colleagues, I was going to offer my thoughts on the course, the study of the humanities and the importance of students' knowing the history of the education they were beginning.\n\nWe introduced ourselves and took our seats. But as we were about to begin, the protesters seized our microphones, stood in front of us and shut down the lecture.\n\nThe right to speak freely is not the same as the_right to rob others of their voices.\n\nUnderstanding this argument requires an ability to detect and follow nuance, but nuance has largely been dismissed from the debates about speech raging on college campuses. Absolutist postures and the binary reign supreme. You are pro- or anti-, radical or fascist, angel or demon. Even small differences of opinion are seized on and characterized as moral and intellectual failures, unacceptable thought crimes that cancel out anything else you might say.\n\n\nNo one should have to pass someone else[.] ideological purity test to be allowed to speak. University life — along with civic life — dies without the free exchange of ideas.\n\nIn the face of intimidation, educators must speak up, not shut down. Ours is a position of unique responsibility: We teach people not what to think, but how to think.\n\nRealizing and accepting this has made me — an eminently replaceable, untenured, gay, mixed-race woman with PTSD — realize that no matter the precariousness of my situation, I have a responsibility to model the appreciation of difference and care of thought I try to foster in my students.\n\nIf I, like so many colleagues nationwide, am afraid to say what I think, am I not complicit in the problem?\n\nAt Reed and nationwide, we have largely stayed silent, probably hoping that this extremist moment in campus politics eventually peters out. But it is wishful thinking to imagine that the conversation will change on its own. It certainly won't change if more voices representing more positions aren't added to it.\n\n\nNuance and careful reasoning are not the tools of the oppressor, meant to deceive and gaslight and undermine and distract. On the contrary: These tools can help prove what those who use them think — or even what they feel — to be true. They make arguments more, not less, convincing, using objective evidence to make a point rather than relying on the persuasive power of a subjective feeling.\n\nI ask one thing of all my first-year students: that they say yes to the text. This doesn't mean they have to agree with or endorse anything and everything they read. It means students should read in good faith and try to understand the texts' distance, their strangeness, from our historical moment. Ultimately, this is a call for empathy, for stretching our imaginations to try to inhabit and understand positions that aren't ours and the points of view of people who aren't us.\n\nA grounding in the study of the humanities can help students encounter ideas with care and learn that everything — including this column — is open to critical interrogation. The trick is realizing — and accepting — that no person, no text, no class, is without flaws. The things we study are, after all, products of human hands."}