{"doc_id": "1035", "name": "2017_04_humanities_student_major_1047_getmotivated", "namespace": "we1sv2.0", "metapath": "", "pub": "GetMotivated", "title": "2017-04-humanities-student-major_1047_GetMotivated.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.039", "Subjectivity": "0.272", "Score": "989", "Upvotes": "0", "Downvotes": "0", "Wordcount": "660", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64iau5", "Reddit_id": "dg2ib39", "Subreddit_id": "t5_2rmfx", "Commenter": "nullandvoid_", "length": "3752", "content_scrubbed": "Professional animator here on a throwaway, and I don't even know where to start with this.\n\nUnfortunately the realities (at least in the country where I work) mean art careers are simply not viable unless you have some means of independent financial support. Half of our office are supported by their SO, the other half either don't care (are doing it for love) or are looking at getting out. Starting out you can expect to earn at a similar level to an office temp, and it doesn't get much better. Your hours are highly likely to exceed 40 hours a week, where I am it[.] not so bad, but elsewhere it can get up to 60-80 hours as a matter of course (talking mainly about the film industry here).\n\nTop graduate? Cool. Otherwise, you are very unlikely to get work. My graduating year was a total anomaly in that about 8 people are currently employed. Out of maybe 100. Usually it[.] much lower. And everyone is on contract. No benefits, no healthcare, no retirement funds, nothing. This arrangement also means no job security, and on top of that no redundancy.\n\nIllustration? Similar story. Very talented friend is currently suffering depression because he can't get work. This guy[.] life should be exactly what the cartoon shows, a total success. And he[.] given up.\n\n[This](https://vimeo. com/66487005) is from 2013 and is still the case. And applies to animation.\n\nSo if you really want to nurture artists, forget about encouragement, no-one I know doing this lacks motivation. You need to start paying people properly, or even just paying.\n\nI'm really sorry for this comment as it pretty much goes completely against the ethos of the whole sub, but I feel the post is wearing some very rose tinted glasses and neglecting some fairly major issues.\n\nSo to try and salvage something from all this and offer what advice I can, here are a few tips. First of all if you are thinking of getting into an art career...\n\n* If you are training, make the best use of your time at school. There are no graduate programs for artists, you will need to be at a professional level when you graduate or start work. Bear this in mind while you're studying. It[.] a great time to practice, experiment and figure things out before getting into projects with serious deadlines.\n\n* Following on, hand everything/something in on time. Regardless of whether or not you think it[.] perfect/good enough. Time constraints are hugely important, so it[.] good to learn how much you are realistically capable of.\n\n* Don't rush. If you can't get to a high enough level at school, get a cafe job, or anything to pay the bills and keep working at it. Some people[.] careers will start later.\n\n* Network. It[.] a cliche but it[.] true. Who you know will get you into places. Go to conventions. Talk to everyone, you teachers, other students, and other classes. 2D artist? Talk to the 3D guys. And vice versa. Also the art community (here at least) is super cool, super friendly and lots of people will be willing to help you develop.\n\n* Keep it broad. Don't pick a super specific career path, especially in the beginning. You are very unlikely to have the luxury of choice, and it pays to be adaptable so you can take whatever comes up. Try and know at least a little of everything, even if you have a clear preference. Can't draw figures? Practice figure drawing. Hate doing backgrounds? Make yourself do some background work. Like modelling but not into rigging? Learn some basic rigging anyway. This will give you more options for work.\n\nFinally, if you really want to support the arts, start paying artists what they're actually worth. Picture commission? Say it takes the artist a day, then you should expect a day rate of a couple of hundred dollars at the very least.\n\nAlright, rant over."}