{"doc_id": "1090", "name": "2017_04_humanities_student_major_1684_ucr", "namespace": "we1sv2.0", "metapath": "", "pub": "ucr", "title": "2017-04-humanities-student-major_1684_ucr.txt", "pub_date": "2017-04-14T00:00:00Z", "Sentiment": "0.067", "Subjectivity": "0.251", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "298", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dga2oh9", "Reddit_id": "dga6yyi", "Subreddit_id": "t5_2s3tf", "Commenter": "Desert_Exile", "length": "1585", "content_scrubbed": "I mean, I love the gym, but some quarters I don't even use it and I know alot of people who don't because of life and because they are commuting. I think, if you want to go to the gym, great! Go to the gym and sign up and pay whatever, but dont make everyone pay for a gym membership. I think the biggest scam though, are the student services fee, KUCR, Division 1 Fee, SRC Expansion Fee, The News Paper fee, ASPB and ASUCR. All that money, jesus christ, I aint getting anything off the services here, which are mediocre. ASUCR and ASPB, I am not getting anything out of those, the ones who are, are the student government people, which is like what, a dozen people? I dont read the school newspaper, I did once for curiosity and it wasn't that good. The radio, well i have spotify and Pandora, never listened to the shool radio. I just feel all of these charges are bogus just to take our money. I also feel they waste it on stupid stuff. Last quarter they were giving out sweaters or something, a lady told me it costed them 100k or somthing near there. 100k.... on sweaters to promote school pride, to hell with school pride, how many people could that money gone to people[.] rent or gas? \n\nI should have ran in the election, would have won in a landslide, even though I just transferred here, after two quarters I see the waste and how they waste our money to benefit a few poli sci and humanities_major. I think the majority of people would agree with me, that all these fees are bs. \n\nHey Student Government people, you reading this? GIVE US BACK OUR MONEY & STOP WASTING IT!"}