{"doc_id": "1285", "name": "2017_04_humanities_student_major_3332_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_3332_AskReddit.txt", "pub_date": "2017-04-29T00:00:00Z", "Sentiment": "0.079", "Subjectivity": "0.447", "Score": "37", "Upvotes": "0", "Downvotes": "0", "Wordcount": "332", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgwthrc", "Reddit_id": "dgxhybl", "Subreddit_id": "t5_2qh1i", "Commenter": "Book_of_Wisdom", "length": "2037", "content_scrubbed": "Not to be that guy, but your entire post is based off of perception and vague correlations. The language at the end is also extremely hyperbolic. \n\nThis death of \"intellectual curiosity\" is equally as likely to be a product of this generation[.] upbringing. Being raised on the internet, this generation has conditioned themselves for instant gratification. They simply don't have the attention spans required for this \"intellectual curiosity\". They've never needed it; they can have the answer in twenty seconds with a google search on their phone. I've taught college freshmen. A huge percentage spend most of their time in-class distracted on their laptops. Most professors make zero effort to adjust their material to account for this culture shift. They'd rather blame the students, and hide behind their tenure.\n\nAnother possible explanation, that you probably won't like, is that colleges have actually ruined \"intellectual curiosity\". The American college admissions system cares about two things: GPA and standardized test scores. College attendance is up tremendously since NCLB went into effect (granted with a down-turn in the past few years). That increase in competition meant that students had to care more about grades, not the content they learn. Hell, I'd go a step further and say the bullshit \"general education\" requirements kill any curiosity left in most college freshmen. I can remember being super interested in a topic during undergrad and excited to take college courses about it. Only to learn I had to spend two years taking classes about random shit in the humanities, just so those programs could have the budget to survive. Whoops, not supposed to say that. I meant, so I \"can be a more rounded individual\". You wanna kill someone[.] intellectual curiosity? Force them to take two years of classes on things they don't give two shits about, while charging them $20k for the experience.\n\nAll I'm trying to say is, if you and your colleague could only think of blaming George Bush, which one of you is Kanye?\n"}