{"doc_id": "1135", "name": "2017_04_humanities_student_major_1982_architecture", "namespace": "we1sv2.0", "metapath": "", "pub": "architecture", "title": "2017-04-humanities-student-major_1982_architecture.txt", "pub_date": "2017-04-17T00:00:00Z", "Sentiment": "0.053", "Subjectivity": "0.395", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "262", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65zq62", "Reddit_id": "dgem4yu", "Subreddit_id": "t5_2qhae", "Commenter": "sdavis08", "length": "1449", "content_scrubbed": "I don't know your situation or how much a B. arch will cost you personally, but the B. Arch is typically a 5 year program, so your already looking at spending 20% more for that degree than you would for a non-accredited 4 year degree such as a BS of Architecture. If you are not planning on getting licenced than I see little reason to get a B. Arch.\n\n Architecture  is a vast field and there are many many different facets so I don't think getting a degree in architecture is a waste of time, however it[.] a pretty demanding major that requires a much larger time comittment than almost any other major. Overcoming The challenges can be quite fulfilling but I honestly don't think I would have made it through if I didn't  really want to be an architect. \n\nSome of my peers graduated with a B. Arch and now work in related feilds. A bunch went directly into construction management, a few to VR / gaming and a couple actually became product sales reps for various building material vendors. There are definitely people who leave with the degree and never practice or become licensed. I think what happens is people don't really know what they are getting themselves into and by the time they realize it[.] not for them they are already to heavily invested to walk away without a degree. \n\nIf I were you I'd try to find something a bit more broad, like a general liberal_arts degree and then take a wide variety of  classes until I'd found what suits me."}