{"doc_id": "1172", "name": "2017_04_humanities_student_major_2340_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2017-04-humanities-student-major_2340_UofT.txt", "pub_date": "2017-04-20T00:00:00Z", "Sentiment": "0.039", "Subjectivity": "0.559", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "285", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66mrt4", "Reddit_id": "dgjqatt", "Subreddit_id": "t5_2rbaq", "Commenter": "drgirlfriend_", "length": "1580", "content_scrubbed": "I'm not in a STEM program, but I can tell you that the walk from Victoria College to the other side of campus really isn't really that far - about 10-15 minutes depending on the weather. It[.] actually pretty nice in the fall and the spring, I find it quite peaceful. However, in the winter when Toronto turns into a hellscape, it can be pretty brutal. \n\nAlso, about class locations - I'm a History major going into fourth year and the majority of my classes have been in STEM buildings, so I don't think there[.] a bonafide guarantee that you'll have all your classes on the side of campus closest to New College. \n\nRegarding scholarships, I was under the impression that Victoria[.] scholarships were mostly humanities-realated, so I'm not sure they'll be much help to you in STEM. \n\nOne last thing, New College is closer to late night, cheap, junk food kind of places - if you're out late and wanna grab something to eat. Victoria is kind of a dead zone for that kind of stuff since it[.] next to Yorkville - which is a really ritzy, high-end neighbourhood. It[.] a lot of designer boutiques and expensive sit-down restaurants. \n\nUnfortunately, I don't have much personal experience with residence life at either college since I'm at St. Michael[.] and I commute. But, I will say that my one big U of T regret is not considering college choice more carefully when I enrolled - so I wish you the best of luck and I hope I helped a bit! \n\nEDIT TO ADD: If you do decide to switch over to New College, make sure you look up their transferring policy, because every college is different. "}