{"doc_id": "420", "name": "2017_10_humanities_student_major_1768_savedyouaclick", "namespace": "we1sv2.0", "metapath": "", "pub": "savedyouaclick", "title": "2017-10-humanities-student-major_1768_savedyouaclick.txt", "pub_date": "2017-10-19T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.412", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "468", "Permalink": "http://reddit.com/r/savedyouaclick/comments/77deyc/barron_trumps_leaked_iq_shocks_the_nation_i_shit/dolsj7k/", "Threadlink": "http://reddit.com/r/savedyouaclick/comments/77deyc/barron_trumps_leaked_iq_shocks_the_nation_i_shit", "Parent_id": "t1_dolrygb", "Reddit_id": "dolsj7k", "Subreddit_id": "t5_323r3", "Commenter": "PaperCutsYourEyes", "length": "3416", "content_scrubbed": " these people all graduated. Do you think they bought grades too?\n\nThey don't have to. High grade are included in the price of admission. \n\n there'd be fifty whistle blowers for every family trying to buy their kid a degree.\n\nThere are. Here are some of the many, many, *many* articles doing exactly that. \n\nHarvard[.] student newspaper recently reported that its median grade for undergraduates is A- and its most frequently awarded grade is A. The story produced a media hullabaloo, but grade inflation is neither new nor surprising. College student grades in the U_S have been rising steadily since the 1960s. In 1969, 7 percent of undergraduates had grades of A- or higher in contrast to 41 percent now. Similarly, grades of C or less have dropped from 25 percent to 5 percent.\n\nhttps://www. washingtonpost. com/news/answer-sheet/wp/2013/12/20/why-grade-inflation-even-at-harvard-is-a-big-problem/\n\n [Harvard] undergraduates weren't required to show up at a single lecture or section; they could score in the teens on the final and still pass. The professor[.] basis for leniency, they said, was that \"they pay too much tuition for us to fail them.\"\n\nhttps://www. washingtonpost. com/news/posteverything/wp/2017/09/19/how-harvard-helps-its-richest-and-most-arrogant-students-get-ahead/\n\n Harvard graduate and professor Harvey Mansfield is a longtime vocal opponent of grade inflation at his alma mater. In 2013, Mansfield, after hearing from a dean that \"the most frequent grade is an A\", claimed to give students two grades: one for their transcript, and the one he thinks they deserve. He commented, \"I didn't want my students to be punished by being the only ones to suffer for getting an accurate grade\"\n\nhttps://en. wikipedia. org/wiki/Grade_inflation#Harvard_University\n\n Grade inflation — no, hyperinflation — is running rampant in American higher education.  At Yale, where I have been both a student and an instructor, the average GPA has risen considerably over the past 50 years. And my alma mater is not unique. A recent study revealed that 42 percent of four-year college grades are A[.], and 77 percent are either A[.] or B[.]. According to Inside Higher Ed, \"At four-year schools, awarding of A[.] has been going up five to six percentage points per decade and A[.] are now three times more common than they were in 1960.\" At Yale, 62 percent of grades were in the A range in the spring of 2012. That figure was only 10 percent in 1963.\n\nhttps://www. pbs. org/newshour/economy/making-sense/column-how-an-epidemic-of-grade-inflation-made-as-average\n\nThe waters of Lake Wobegon have flooded U_S college campuses. A[.] — once reserved for recognizing excellence and distinction — are today the most commonly awarded grades in America. That[.] true at both Ivy League institutions and community colleges, at huge flagship publics and tiny liberal_arts schools, and in English, ethnic studies and engineering departments alike. Across the country, wherever and whatever they study, mediocre students are increasingly likely to receive supposedly superlative grades.\n\nhttps://www. washingtonpost. com/opinions/the-rise-of-the-gentlemans-a-and-the-gpa-arms-race/2016/03/28/05c9e966-f522-11e5-9804-537defcc3cf6_story. html\n\nRich kids' grades are rising faster, and intelligence probably isn't the reason why\n\nhttps://qz. com/1058476/grade-inflation-is-the-worst-at-rich-private-schools-disadvantaging-poor-students/"}