{"doc_id": "971", "name": "2017_04_humanities_student_major_513_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-04-humanities-student-major_513_politics.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.026", "Subjectivity": "0.322", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "740", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfvoi28", "Reddit_id": "dfvr715", "Subreddit_id": "t5_2cneq", "Commenter": "mlw4428", "length": "4277", "content_scrubbed": "I'll address each point:\n\n1) Most professional child cares are involved with education to some degree. Obviously an educator should, themselves, have some formal type of education. I'll further this later on down in the points.\n\n2) Ugh. Just... no. I don't even know what a daybook is (check book?) and I won't look it up at this point. Why would someone need to understand what the red numbers on a tape measure look like? Why is this an expectation to have learned this out of high school? For the record, my old ass tape measure has black numbers and black lines, if there[.] red text, I've never had to read it. It works well enough for the minimal amount of use it gets. And trades are great, until they're not. Every single trade very sensitive to economic changes. Everything from HVAC to plumbing to electrical. Furthermore, for the pay, it[.] back breaking labor, there[.] a \"good ol' boys club\", and the apprenticeship can, in some cases, last as long as a traditional 4 year college program. And I'm not saying trades are bad (farming is never included as a trade, but I think it should be... it takes a lot of skill and is critical to the functioning of society as is the other trades), but:\n\nA) America doesn't compete with trades. A global economy requires a lot more in the way of engineers and IT skills than it does plumbers and electricians.\n\nB) There[.] only so many trades people needed. A city can only support so many electricians and plumbers. But scientists? Programmers? Doctors? Nurses? We can't get enough of these people. There is an endless amount of work that you can throw at them.\n\n3) You're stereotyping a lot here. Yes, some socialization occurs (drinking or otherwise). Colleges aren't the originators - it[.] just what young people who get out on their own do. And it[.] healthy - it helps them to develop social skills, life skills, and teaches responsibility. Further - what does partying have to do with education? Last I checked, no college student could party 24/7, not do their work, and get a degree. Colleges still require you to actually pass the classes - and if you can do that while enjoying youth - well more fucking power to them.\n\n4) Blame boomers. They demanded everyone have at least a high school diploma for even the most remedial of jobs. There is also a stupid idea, conned up by Republicans, to punish schools who fail children (whom you admit shouldn't pass) by taking away funding, which hurts all children. Most teachers I know, were not afraid to fail students, I've received Fs in classes before. I struggled with Geometry. Unfortunately, the school didn't have a lot in the way of resources for one-on-one tutoring. Why? Money. It was a Republican county and giving out tax breaks to factories where some fucking poor shmuck turns a bolt for $10/hr took precedence over my future. I still hate geometry.\n\n5) Fair enough (although I'd say the \"average\" standard has then shifted), but not everyone is going to be a raging genius and what should we demand of our future generations? Republicans don't even care to have an answer. They're content with allowing taxpayer money to go (via vouchers) to religious schools that teach bullshit religious crap. They're content with trying to force history books to ignore (or rewrite) parts of history where we as a nation looked shitty. They're content with not teaching evolution or teaching intelligent design as a scientifically viable alternative.  They want kids to know how to recite the Pledge of Allegiance, but fuck all for something like who the current French President is.\n\nLastly, we as a society are changing. We need to have more scientists, engineers, programrs, and thinkers. We also shouldn't disparage the arts and philosophy. They contribute to society by various means - and know it[.] not always in a \"fiscal\" manner, but not everything we do has to be measured in dollars and cents. As such, we should be pushing EVERYONE we can to higher learning and making the massive social and fiscal investments. Yes, some people will fail. Some people will be dead weight. And yet, other 1st world nations are doing it AND they're doing JUST FINE. They're catching up or passing us as a result. \n\nTrades don't help us in a global economy. College educated people do."}