{"doc_id": "391", "name": "2017_10_humanities_student_major_1590_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2017-10-humanities-student-major_1590_RPI.txt", "pub_date": "2017-10-17T00:00:00Z", "Sentiment": "0.132", "Subjectivity": "0.368", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "244", "Permalink": "http://reddit.com/r/RPI/comments/76zekj/prospective_parent_here_we_visited_campus_on/doikm3s/", "Threadlink": "http://reddit.com/r/RPI/comments/76zekj/prospective_parent_here_we_visited_campus_on", "Parent_id": "t1_doi5v1o", "Reddit_id": "doikm3s", "Subreddit_id": "t5_2rg3u", "Commenter": "ElizabethA23", "length": "1323", "content_scrubbed": "The male entitlement at RPI was through the roof. Day one of orientation, and guys are coming up to me, telling me that women get in easier. It wasn't a great welcome. They had never met me before and didn't know what I was capable of. They didn't know about my test scores, high school coursework, or that I'd written a 300 page fiction book. All they saw was that I was female.\n\nThen there[.] the dating scene. Guys pretty much just whine about not being able to find a girlfriend and don't ask. They creep when they like a woman. You can tell when someone is creeping you because they'll start saying weird things on your Facebook and/or sending weird messages. Guys will tell you to \"lower your standards\" and that you owe it to the RPI guys to date because of how few women there are. Dude, I was at RPI for academics, not to date guys I wasn't attracted to.\n\nI went to programs with liberal_arts students, and the men from other schools were so different! Friendly, confident, treated you like a person. You felt drawn to them and comfortable, instead of RPI guys who would interact with you so strangely that you cringed. RPI guys believed that you owed them a date because of your gender, not because they were someone who would make a great boyfriend.\n\nObviously, not all guys were like this, but way too many were."}