{"doc_id": "327", "name": "2017_10_humanities_student_major_933_singapore", "namespace": "we1sv2.0", "metapath": "", "pub": "singapore", "title": "2017-10-humanities-student-major_933_singapore.txt", "pub_date": "2017-10-10T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.254", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "270", "Permalink": "http://reddit.com/r/singapore/comments/75g6y6/up_close_yalenus_a_partner_in_name_only/do65nz7/", "Threadlink": "http://reddit.com/r/singapore/comments/75g6y6/up_close_yalenus_a_partner_in_name_only", "Parent_id": "t3_75g6y6", "Reddit_id": "do65nz7", "Subreddit_id": "t5_2qh8c", "Commenter": "Thorberry", "length": "1632", "content_scrubbed": "To be honest, I don't think it'd be that bad if Yale pulled out. Yale-NUS, or whatever its new name would be, is already distinct in Singapore education by providing a liberal_arts education.* To break the ground for this academic model is important -- far more important, I think, than whatever civilizing mission Yale educators had in mind.\n\nIf Yale did pull out, you'd see the prestige of the college decline. You wouldn't get the same caliber of academics. But it[.] not like Yale-NUS[.] faculty was ever anywhere as esteemed as Yale[.]. As a small liberal_arts college, it also decidedly hired a different sort of people -- more teaching-oriented, less research-oriented -- so you couldn't really compare them anyway.\n\n\\* Many people will give you different definitions of a liberal_arts education. To an average Singaporean student, it is most distinct in that you do not specialize from the outset and instead take your time to explore before settling on a major. That comes hand-in-hand, often, with requirements that you take a variety of classes, sometimes with a \"core\" set of diverse classes prescribed by the school. \n\nThe model is supposed to embody a spirit of openness and exploration. As a result, you often see American school administrators talk about it beyond classes; you want a campus culture shaped by that spirit too. That, presumably, is why American educators are so uppity about \"authoritarian\" regimes like Singapore and Abu Dhabi getting their own USA-branded liberal_arts college. The thinking is you can't have that openness and exploration when you're being censored or penalized every step of the way."}