{"doc_id": "928", "name": "2017_04_humanities_student_major_108_physics", "namespace": "we1sv2.0", "metapath": "", "pub": "Physics", "title": "2017-04-humanities-student-major_108_Physics.txt", "pub_date": "2017-04-01T00:00:00Z", "Sentiment": "0.075", "Subjectivity": "0.28", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "324", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_62w67e", "Reddit_id": "dfpvs60", "Subreddit_id": "t5_2qhi6", "Commenter": "themasterderrick", "length": "1796", "content_scrubbed": "1) Find out what you want to do.  \n2) Hopefully you're going to a school that does that.  \n3) Find a professor that does research in what you want to do.  \n\nIf you're going to a research university, this is how its done. If you're feeling shy, you could also go to the equivalent of the \"Undergraduate Course Advisor\" for your department, and ask them to introduce you to the professor you want to work with.\n\nIf you're going to a liberal_arts school where the physics faculty doesn't do research, then that is what REU[.] were designed for. It kind of ticks me off to hear about students who are attending a research university apply/go to REU[.], give the students who don't have the oppertunity to do research a chance!  \n\nAnyway, that is just my two cents. Don't be surprised if some professors say something along the lines of \"Come back to me after you've taken E&M/Quantum/this elective I teach in spring semester,\" especially if you're trying to do theory.  \n\nIn undergrad I did research with two professors: one semester of biophysics, and four of high energy particle. The biophysics was fun, but too much biology for me: most days were spend in the lab doing PCR or other things on E. coli. Apparently what I was doing is a more specific branch of biophysics, but don't ask me to elaborate more, I can't.  \nThe HEP was working on some stuff for the Belle 2 experiment in Japan. Started off learning how to use ROOT, moved on to doing some monte carlo simulations (still in ROOT), and finally did an undergraduate thesis project on the efficiency of the Belle 2 detector to detect a certain decay mode (bb - some D[.] and K[.], if I recall correctly.) Overall I enjoyed it, which is what pushed me to my current work: basically the same thing, but now for the CMS experiment at the LHC."}