{"doc_id": "913", "name": "2017_04_humanities_student_major_18_relationships", "namespace": "we1sv2.0", "metapath": "", "pub": "relationships", "title": "2017-04-humanities-student-major_18_relationships.txt", "pub_date": "2017-03-31T00:00:00Z", "Sentiment": "0.213", "Subjectivity": "0.371", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "482", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfo355j", "Reddit_id": "dfol6eb", "Subreddit_id": "t5_2qjvn", "Commenter": "harkandhush", "length": "2542", "content_scrubbed": "Listen, it[.] great to try things!  A test told you that you might be good for a field, so you tried it out.  If something is difficult, but you love it, then it can be worth the struggle, but it[.] totally okay to try something and realize it[.] just not right for you.  You're not two years into a degree here.  You don't even know what college you'll go to.  Unfortunately there are situations where you can push back and situations where you have to mollify parents and I don't know your life or mother well enough to feel comfortable giving you advice on that, but don't blame yourself for trying things and not liking them or changing your mind or not living up to someone else[.] standards.  All you can do is try your best at the things you want to accomplish and try to figure out what you do want to do with your life.  Most people don't know what they want to do at 15 or they only have a vague idea or they'll change their minds.  I saw in another comment that you said you like biology, so rather than telling your mom that you don't want to do CS, maybe you can frame it as your interests lie more with biology (or something else you choose).  Unless you go to a really specialized school, you can always change your major once you're there, so don't pressure yourself too much when you're still in high school to know what you'll major in.\n\nAs for colleges, I think I was 16 when I was starting to go look at them in person, so 15[.] a good time to start getting at least an idea of what you want as far as region and school size goes.  Figure out things that are important to you.  Do you want a politically active liberal_arts college or a huge university with a ton of big activities and sports?  Do you want something that[.] in the middle and has a little of all of it?  What sort of experience do you picture when you think of yourself in a college setting?  These shouldn't be prioritized over academics, but are definitely a factor that can help you narrow down what schools you might like.  A guidance counselor can also help you figure out what schools you can reasonably expect to get into, but that usually comes when you're closer to applying.  College stuff can be really daunting and a lot of parents want their kids to think that their success hinges on the_right school, but you just have to try your best for yourself and look for the best opportunities for you.  There is not only one right path to success or happiness.  \n\nI hope this helped.  I had a lot of pressure on me about college when I was your age, too."}