{"doc_id": "1078", "name": "2017_04_humanities_student_major_1471_insightfulquestions", "namespace": "we1sv2.0", "metapath": "", "pub": "InsightfulQuestions", "title": "2017-04-humanities-student-major_1471_InsightfulQuestions.txt", "pub_date": "2017-04-12T00:00:00Z", "Sentiment": "0.124", "Subjectivity": "0.336", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "352", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg6ag96", "Reddit_id": "dg6w2wm", "Subreddit_id": "t5_2smsq", "Commenter": "BrotherChe", "length": "2512", "content_scrubbed": "edit: Itt may be taught nowadays in high school, but it was not 30 years ago. It[.] likely discussed in some college courses, where they have more time for the nuances of history, specifically civil rights history.\n\n---\n\nClaudette Colvin was the first to really challenge the law regarding bus seating. Her situation was latched onto by the NAACP and other civil rights groups as a useful tactic. However, they selectively chose to not rely on Colvin. \n\n When asked why she is little known and why everyone thinks only of Rosa Parks, Colvin says the NAACP and all the other black organizations felt Parks would be a good icon because \"she was an adult. They didn't think teenagers would be reliable.\"\n\n(She was fifteen at the time)\n\n She also says Parks had the_right hair and the_right look.\n\n \"Her skin texture was the kind that people associate with the middle class,\" says Colvin. \"She fit that profile.\"\n\nIt[.] tough to find documentation regarding previous events and choices like this in the Civil rights movement, but it[.] highly likely given the actions and choices of movement leaders in the past that they were well experienced in the need of shoring up public sentiment. Undoubtedly character assassination in the past had led them to this point.\n\n David Garrow, a historian and the author of Bearing the Cross: Martin Luther King Jr. and the Southern Christian Leadership Conference, says people may think that Parks' action was spontaneous, but black civic leaders had been thinking about what to do about the Montgomery buses for years.\n\n After Colvin[.] arrest, she found herself shunned by parts of her community. She experienced various difficulties and became pregnant. Civil rights leaders felt she was an inappropriate symbol for a test case.\n\n Parks was the secretary of the NAACP. She was well-known and respected and, says Garrow, Parks had a \"natural gravitas\" and was an \"inherently impressive person.\"\n\nA TV show on Comedy Central network called Drunk History has an easily digestable story about this.\n\nshort clip: https://www. youtube. com/watch?v=m8Occ7XSgQc\n\nfull episode: http://www. cc. com/video-clips/t6l49j/drunk-history-claudette-colvin-and-rosa-parks\n\nhttp://www. npr. org/2009/03/15/101719889/before-rosa-parks-there-was-claudette-colvin\n\nother useful reading if you're interested:\n\nhttp://nationalhumanitiescenter. org/tserve/freedom/1917beyond/essays/crm. htm\n\nhttps://www. gilderlehrman. org/history-by-era/civil-rights-movement/essays/civil-rights-movement-major-events-and-legacies"}