{"doc_id": "320", "name": "2017_10_humanities_student_major_843_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_843_AskReddit.txt", "pub_date": "2017-10-09T00:00:00Z", "Sentiment": "0.002", "Subjectivity": "0.473", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "242", "Permalink": "http://reddit.com/r/AskReddit/comments/759ds0/reddit_what_are_some_college_majors_that_should/do5hbpb/", "Threadlink": "http://reddit.com/r/AskReddit/comments/759ds0/reddit_what_are_some_college_majors_that_should", "Parent_id": "t1_do5almn", "Reddit_id": "do5hbpb", "Subreddit_id": "t5_2qh1i", "Commenter": "ErroneousFunk", "length": "1457", "content_scrubbed": "There[.] no false advertising. Bachelor[.] degrees have \"majors\" they don't have \"onlys\" If you didn't want to learn anything besides what you chose your major in, traditional college was maybe a bad choice on your part. Even the tiniest one-track schools advertise \"well-rounded\" students and sports and opportunities for personal growth (as ridiculous as they may be compared to larger liberal_arts schools)\n\nThere[.] also a big difference between a liberal_arts school with majors, a specialty school (MIT, Juilliard, Babson, or even more focused schools) or something like a trade school. If you want to learn a trade, and only that trade, you go to a trade school. I've never heard of English 101 in beauty school.\n\nI'll admit, there aren't great programs that focus on ONLY one \"higher learning\" topic, if that[.] what you're talking about -- there[.] no trade school for Civil War history, for example. But, generally, we as a society tend to think that if you want to, say, be a Civil War historian you _also_ need some other general skills to succeed in the field (literary analysis, writing, math, world history). It[.] thought that these skills give context to your work and enhance your creative/problem solving abilities in a way that people in trades that require \"less education\" might not need. \n\nI'm not saying that system works for everyone, but that[.] the way it is, and the reasoning behind it. There[.] certainly no false advertising involved."}