{"doc_id": "1269", "name": "2017_04_humanities_student_major_3224_writing", "namespace": "we1sv2.0", "metapath": "", "pub": "writing", "title": "2017-04-humanities-student-major_3224_writing.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.055", "Subjectivity": "0.38", "Score": "49", "Upvotes": "0", "Downvotes": "0", "Wordcount": "891", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_684m4v", "Reddit_id": "dgw3rze", "Subreddit_id": "t5_2qh2n", "Commenter": "michaelochurch", "length": "5146", "content_scrubbed": " The vast majority of my students were hardworking, thoughtful people devoted to improving their craft despite having nothing interesting to express and no interesting way to express it.\n\nThat[.] exactly why I failed at writing good fiction in my 20s. It changes, but it[.] true that most young people haven't read enough and haven't experienced enough to write compelling fiction. \n\n Some people have more talent than others. [...] I can count my Real Deal students on one hand, with fingers to spare.\n\nHere, he goes from the obvious to the extreme. Yes, talent matters. Maybe he taught at a shitty MFA program. Maybe he[.] a bad judge of talent and is having false negatives. Maybe he[.] catching people too young. Hard to say. I would agree that the percentage of mid-20s who can write worthwhile fiction is very low... and let[.] be honest, this country is full of bullshit graduate programs aiming people at jobs that frankly don't exist. \n\n There are notable exceptions to this rule, Haruki Murakami being one. [...] You have to be crazy about books as a kid to establish the neural architecture required to write one.\n\nIt[.] not binary. Most people who \"make it\" also wrote in their teens, but the stuff they wrote as teenagers wasn't any good. It[.] possible to come up fast. However, it is extremely hard to become a good writer, so I'd agree that someone who shows no passion for it when they're young is unlikely to develop it in middle age. That doesn't mean that someone can't go from amateur to being very good quickly, but constitutional changes are rare. \n\nAgain, he[.] taking things that are anodyne and obvious and stating them in an extreme, somewhat abrasive way. I'm OK with this because I do it too, but I'm calling it as it is. \n\n Students who ask a lot of questions about time management, blow deadlines, and whine about how complicated their lives are should just give up and do something else.\n\nI agree, actually. It[.] harder to make it as a professional writer than to get through a bunch of courses. Better to bounce them early before they fuck up their careers thinking they have a shot if they don't. \n\nThis doesn't mean that people with legitimate reasons to need extensions shouldn't get them.\n\nOne of the problems in education right now is that humanities are grade inflated while math/science is not (or, at least, not as much). Consequently, people think they're better at the humanities than in STEM. Here[.] the problem: getting a job as an academic in the humanities is almost impossible. Sending signals that are opposite to the market does students no good... but universities want dreamers' bucks, and people like him end up having to the be The Asshole... or, just as bad, they get chastised for being honest with students who haven't got a chance in hell. \n\n I've had students ask if I could assign shorter books, or—without a trace of embarrassment—say they weren't into \"the classics\" as if \"the classics\" was some single, aesthetically consistent genre. \n\nMost people in school are too young for it and don't know if it[.] what they want, so they have a mediocre work ethic. One consequence of American culture[.] fuckedness is that people take a long time to mature. The other thing is that there are a lot of people in graduate programs because we're in a long_term job recession that shows no signs of ending. \n\n For the most part, MFA students who choose to write memoirs are narcissists using the genre as therapy. They want someone to feel sorry for them, and they believe that the supposed candor of their reflective essay excuses its technical faults.\n\nAgain, I think he[.] just being realistic. Sure, some young people have done interesting things and some are just really good writers (and I'm sure that some of his students are not young) but that[.] not the norm. American Millennials take a long time to grow up, and it[.] mostly not their fault, but 30 now is like 23 in our grandparents' day. The memoir of a typical 24-year-old, when it[.] a first-time novel? What[.] the title? *I Took Courses*? Come on. \n\n I find questions about working with agents and editors increasingly old-fashioned. Anyone who claims to have useful information about the publishing industry is lying to you, because nobody knows what the hell is happening.\n\nI think he[.] on the mark here. Publishers can't forecast sales as reliably as they could. Ergo, advances are smaller and publishers are more risk-averse. Since many publishers have shifted the financial risk and promotional burden to the writer, at least for first timers, self-publication seems a better deal except for those who can get the star treatment from a trade publisher (and that[.] rare and I don't think anyone can or should bet their career on it). \n\nAgain, if this guy was as blunt with his students as he is here, I think that he[.] a hero. People should be discouraged from betting their lives and careers when they're not going to make it. I don't think he should say, \"You don't have the talent.\" I do think that it[.] reasonable to say, \"I don't think you're at a point where you can write full-time, and you're probably 10 years of hard_work away.\""}