{"doc_id": "266", "name": "2017_10_humanities_student_major_328_askphilosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "askphilosophy", "title": "2017-10-humanities-student-major_328_askphilosophy.txt", "pub_date": "2017-10-04T00:00:00Z", "Sentiment": "0.131", "Subjectivity": "0.354", "Score": "35", "Upvotes": "0", "Downvotes": "0", "Wordcount": "308", "Permalink": "http://reddit.com/r/askphilosophy/comments/74d1xs/what_specializations_are_most_in_demand_for/dnxg3nz/", "Threadlink": "http://reddit.com/r/askphilosophy/comments/74d1xs/what_specializations_are_most_in_demand_for", "Parent_id": "t1_dnxfmzs", "Reddit_id": "dnxg3nz", "Subreddit_id": "t5_2sc5r", "Commenter": "TychoCelchuuu", "length": "1889", "content_scrubbed": "In the next 7 years or so, higher education in America will be dismantled as the Republicans continue to control the government and continue to destroy support for things like public education funding, science and humanities research grants, and student loan support. Meanwhile, universities, especially private universities, will continue to erode tenure and unionization for teachers and instead move towards more adjunct teaching, and in addition they will start switching as much as possible to massive online courses in order to enroll even more students. The damage to America[.] prestige and desirability on the world stage due to factors like Trump and Russia fucking everything up, countries like China catching up in wealth and realizing they don't need America because they can drive the world themselves, and the gutting of American jobs by multinational corporations and the deregulation that fuels them, will further reduce the desirability of an American university degree and thus the demand for professors. Everything will go to shit and if you are lucky enough to have a job, it will be adjuncting for two or more universities simultaneously for no money, no health care, no prestige, no time to do research, no opportunity to give your students the attention they deserve, and you probably won't have an office. You'll spend much of your day frantically shuttling from one institution to another in order to make it to your classes on time, lecturing to students who don't care because they just want their business degree so they can earn money for reasons that they haven't thought through beyond knowing that it[.] better to earn more money. Then because you don't have health care and because there won't be universal health care, you'll go broke and die, either in that order, or simultaneously. But yes, I do suspect those specializations will still be near the top."}