{"doc_id": "511", "name": "2017_10_humanities_student_major_2808_saskatchewan", "namespace": "we1sv2.0", "metapath": "", "pub": "saskatchewan", "title": "2017-10-humanities-student-major_2808_saskatchewan.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.144", "Subjectivity": "0.366", "Score": "12", "Upvotes": "0", "Downvotes": "0", "Wordcount": "241", "Permalink": "http://reddit.com/r/saskatchewan/comments/79f7ou/throne_speech_suggests_math_overhaul_for/dp1o27n/", "Threadlink": "http://reddit.com/r/saskatchewan/comments/79f7ou/throne_speech_suggests_math_overhaul_for", "Parent_id": "t1_dp1i3ge", "Reddit_id": "dp1o27n", "Subreddit_id": "t5_2r4dl", "Commenter": "jasontstein", "length": "1368", "content_scrubbed": "All right, math educator (teach high school) here with a fairly decent understanding of math (B. Sc. High Hons). While your concerns are of note, they are not new, have never been new and are common. What this province has is a cultural math problem. I am happy the government is deciding to address it, but until some money and resources are put towards it it[.] not going to change. The education system in the last decade has put numerous resources towards literacy and seen solid results, but we haven't had that push yet in mathematics. Moreover, you need to think about what a mark means in math. The Universities insist on a percentage mark, and most undeclared or humanities students are going to have a fairly low entrance average, say 65%. Now that can mean a lot of things, but usually in high school, that means that when they were studying that particular concept for two-three weeks they may have gotten factoring correct 65% of the time, While studying EVERY day. Now they took the summer off, have a Tues/Thurs class and can't do it, and you're surprised? You need to rethink what your expectations are. You need to make the students aware of this at the University level. I do, but I can't follow my students to University. At some point they need to take responsibility, and telling them to \"Get better\" without reminding them how to is irresponsible."}