{"doc_id": "995", "name": "2017_04_humanities_student_major_669_politicaldiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "PoliticalDiscussion", "title": "2017-04-humanities-student-major_669_PoliticalDiscussion.txt", "pub_date": "2017-04-06T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.342", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "290", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63vx61", "Reddit_id": "dfy0w3u", "Subreddit_id": "t5_2sfmf", "Commenter": "askryan", "length": "1822", "content_scrubbed": "Education. The extremes of bipartisanship within the *electorate*, at least, are a result of misinformation and your average person[.] inability to deal with the vast amount of misinformation — or at the very least, biased information — to which they are subjected on a day to day basis (this is a human problem, not just a dumb people problem). Toss in our propensity toward tribalism, and you have today[.] issues. \n\nCivics and critical thinking skills should be taught as a full subject from first or second grade. Exercises in distinguishing bias or falsehood should be a major part of curriculum through high school. My dream curriculum would split courses into three areas: Humanities, STEM, and History & Current Events. Humanities classes like literature, philosophy, music, and art should be emphasized, and within them should emphasize discussion, debate, and creative work. STEM classes should make issues regarding technology, scientific method, and psychology equal priorities to things like traditional math. History should take a holistic approach to trends, ideas, and chains of cause and effect once students hit about 8th grade. Throughout all this, students would take specific classes on critical thinking in social, professional, and personal areas. At about 10th grade students should start learning practical skills — how to make a budget, how to get health care, how to speak in public, that kind of thing. \n\nPublic education is better than we give it credit for, but it could be a wonderful tool if we focused on producing thoughtful, considerate, well-read citizens. \n\n(I have taught everything from preschool to second grade to high school test prep to college and graduate students. I am currently a professor mainly teaching first  and second year students, so I may be a bit biased)"}