{"doc_id": "417", "name": "2017_10_humanities_student_major_1733_askgaybros", "namespace": "we1sv2.0", "metapath": "", "pub": "askgaybros", "title": "2017-10-humanities-student-major_1733_askgaybros.txt", "pub_date": "2017-10-19T00:00:00Z", "Sentiment": "0.024", "Subjectivity": "0.377", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "346", "Permalink": "http://reddit.com/r/askgaybros/comments/77ejj0/anyone_becoming_more_conservative/dolbpa9/", "Threadlink": "http://reddit.com/r/askgaybros/comments/77ejj0/anyone_becoming_more_conservative", "Parent_id": "t1_dolaeta", "Reddit_id": "dolbpa9", "Subreddit_id": "t5_2vgfw", "Commenter": "rainbowgeoff", "length": "1977", "content_scrubbed": "Mostly the latter, but some of the former.\n\nI moved from working a blue collar job in the country to being on a liberal_arts campus with 25,000 students in a major city. At home, I was considered \"Out there.\" Here, I'm looked at like my name is William F. Buckley or Jesse Helms. \n\nStating an even slightly conservative position in class will get you asked more questions by the teacher to defend your viewpoint, and will instantly get hands shooting up from other students to rebut you. I'm fine with that. That[.] to be expected, and I enjoy defending viewpoints. What I don't like is if I express something conservative and the opinion is derided by others as not well thought out or someone gets offended and thinks I'm bigoted simply for having a different viewpoint.\n\nI'll give an example. I made the point that trans people should not be instantly offended if someone does not call them by their chosen pronoun right away. We meet people and we instantly make assumptions. When you're in line at the bank and thank the teller, you say sir or ma'am on a base assumption, and there[.] nothing wrong with making that base assumption.\n\nYou would've thought I said trans people should be lined up and shot. People instantly started saying it was rude to assume such things, etc. It was a small portion of the classroom, but they were very vocal and to someone with little confidence, they would be discouraged from speaking in class again.\n\nOddly enough, the only actual trans person in the class agreed with me.\n\nSo far in undergrad, I find expressing conservative legal opinions is easier, since those serious about the law actually enjoy debating the law and don't do so in a way where stances are taken personally. The opposite seems to be true with most political or social views. People hold views often times because they are emotionally attached to them in some way, and when someone combats those views, they become offended. The same is true in religion discussions. "}