{"doc_id": "1076", "name": "2017_04_humanities_student_major_1443_uwmadison", "namespace": "we1sv2.0", "metapath": "", "pub": "UWMadison", "title": "2017-04-humanities-student-major_1443_UWMadison.txt", "pub_date": "2017-04-12T00:00:00Z", "Sentiment": "0.079", "Subjectivity": "0.238", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "645", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64zyvg", "Reddit_id": "dg6j2so", "Subreddit_id": "t5_2s97q", "Commenter": "MoeRoids", "length": "3690", "content_scrubbed": "You're a first year student, so there[.] already going to be graduation requirements you still need to fulfill, which include you taking social science, natural science, and literature classes.  If you haven't taken any of them yet, see what ones you need to fulfill the graduation requirements (I think it[.] 12 credits in literature, 12 in social science, 12 in natural science), and take classes that sound fun or interesting to you.  Run your DARS report constantly, especially when you're doing your course enrollments to make sure the classes you picked actually satisfy the degree requirements.  You'd be surprised at some of the classes that count for multiple graduation requirements, and you can run a \"what if?\" report in DARS to see the requirements for other majors, and if the classes you've already taken satisfy any of those requirements.  You have a lot of time to make your decisions, including switching majors, so no need to rush anything.\n\nDon't let C[.] keep you down, because it certainly won't keep you from graduating.  For the large majority of companies that hire people after you graduate, they could honestly care less about your GPA (it could be a bigger issue when you start to factor in grad school or post-secondary education); they want to see the diploma certifying that you met a university[.] standards for graduation in a specific subject.  A high GPA, unless it[.] a requirement for that company, is just a tool to use on your resume to make you a more attractive candidate; leaving it off is your call.  A certificate shows that you have a very basic level of knowledge in a subject, and if you look at job listings, most of them will either have minimum experience requirements, minimum education requirements (usually at least a Bachelor of Science/Arts), or both for the job prerequisites.  That being said, a certificate could be an extra selling point on your resume, and you're trying to make yourself the most attractive candidate possible.  It[.] between you advertising that you have a \"certificate in computer science from the University of Wisconsin - Madison\", or that you \"took a couple computer science courses\".  \n\nIt all depends on what you consider to be a \"good paying job\" as well.  Look up different career options for both your CS degree and for your prospective humanities degree.  Consider other majors as well if you'd like.  \n\nThe important questions to ask yourself are these: \n\n1. What are my interests?  My strengths?\n\n2. Can I see myself in a career related to my interests?  My strengths?\n\n3. Is my career choice a realistic option?\n\n4. What career options will my degree/major choice allow me to have?\n\n5. Are any of these career options related to my interests or my strengths?\n\n6. Am I going to want to go to graduate school?\n\n7. Am I going to need to go to graduate school to remain competitive?\n\n8. Will my growth in my career field be limited if I don't go to graduate school?  Are there any opportunities for growth?  Is the job market for my chosen career path expanding?\n\n9. Can I attend graduate school while I'm working in my chosen career field?\n\n10. Experience can be an important determining factor in getting a job, so how am I going to get the experience I need for my chosen career path while I'm in school?  After school?\n\n11. How much money do I need to make to live comfortably, and will my choice of career allow for this?\n\n12. Are there limited job prospects in my chosen career field where I live?  Will I need to relocate?  Am I willing to relocate?\n\n13. This is the most important question... am I going to enjoy my chosen career field, or is it going to be a chore for me to get up for work every day?"}