{"doc_id": "1288", "name": "2017_04_humanities_student_major_3360_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_3360_AskReddit.txt", "pub_date": "2017-04-30T00:00:00Z", "Sentiment": "0.07", "Subjectivity": "0.272", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "414", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_68dpi0", "Reddit_id": "dgxv9y4", "Subreddit_id": "t5_2qh1i", "Commenter": "Rousseauoverit", "length": "2223", "content_scrubbed": "My father was born in the 1940[.]; abandoned on the side of the street  before he could walk. \n\nHe Grew up in a New England orphanage (that was later investigated for ties to Eugenics experiments funded by the Nazi party), and suffered abuse and alienation beyond what most of us can comprehend. He found solace and meaning, briefly, when he was chosen as an alter boy and soloist by a priest in his Catholic parish-- he was a ward of the state so it was very obvious (in his East_Coast city, at the time, all the wards were given the same government issued clothing) that he had no one to run to or protect him. \n\nHe lived on the streets from the time he was 14 until he could legally join the military. He served prior to Viet Nam, just barely . . . got out and hitchhiked across the country. Despite his past, he had insane ambition, not only to overcome his past/ abuse/ judgements on the surface, but to devote time and interest in being an \"emotionally\" present dad. \n\nHe won a scholarship to Northwestern and graduated with high honors by the time he was 22. Started work cold-calling at a major investment company shortly after and moved his way up to executive, six figure status at 27 (this was in the 70s), then left and started his own investment banking firm. Merged it with another firm, then sold it and got out. By the time I was old enough to remember, he had left the world of investments and followed his passion-- the arts! I got to grow up with a dad who owned companies that centered around what I happened to love most in the world- art, history, music and literature. I got to spend large portions of my childhood traveling, learning about things I was passionate about-- and he was also OKAY being the \"bad guy\" as long as it was in our best interest. \n\nHe went through unimaginable hell and chose to devote his existence to being what he never had; even if it isolates him. If the proverbial \"you\" met him, you'd never have any idea how bad it was, or how much he was able to accomplish in spite of everything.  \n\nTL;DR-- Even this long (above) post is a short version of the horrors that were my father[.] life. He never stopped trying to beat the odds, have a family and be a good pop-pop. \n\n \n\n\n\n"}