{"doc_id": "329", "name": "2017_10_humanities_student_major_963_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_963_AskReddit.txt", "pub_date": "2017-10-10T00:00:00Z", "Sentiment": "0.055", "Subjectivity": "0.394", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "408", "Permalink": "http://reddit.com/r/AskReddit/comments/75jg8u/what_is_the_most_embarrassing_thing_that_ever/do6obwh/", "Threadlink": "http://reddit.com/r/AskReddit/comments/75jg8u/what_is_the_most_embarrassing_thing_that_ever", "Parent_id": "t3_75jg8u", "Reddit_id": "do6obwh", "Subreddit_id": "t5_2qh1i", "Commenter": "Thunder_Farts", "length": "2126", "content_scrubbed": "Okay, so this is my go-to embarrassing story I tell since it usually helps with lightening the mood and helps people unwind a bit.\n\nDuring the spring semester of my freshman year, I had a humanities class on one side of campus, then I had a health class all the way on the other side of campus right afterwards. The walk was about 15-minutes if I picked up my pace, even so I'd arrive late to my health class by about five minutes. Anyways, during finals week I told my humanities professor that I'd be leaving about five minutes early from the lecture so I could get to my final on time. He was cool with it and there were (seemingly) no problems. \n\nSo it[.] the day of my health final and it[.] time for me to leave, so I get ready to depart and as I'm packing up my stuff the entire hall looks at me simultaneously- it was probably a 100-150 person lecture. I should note that at this point in my life I had a pizza bookbag I carried with me everywhere (I still have it, but due to my education courses I use a different one since it[.] more professional). Already I'm sticking out, and I'm rushing to get out so that people can stop looking at me, but lo and behold, the doors had other plans. The. Damn. Doors. Wouldn't. Open.\n\nI kind of stood there for a moment trying to pull the doors open when finally the professor takes note and asks me, \"Having issues?\"\n\nI kind of mumble out, almost under my breath, \"I, I think the doors are locked...\"\n\nThe professor strides over, and almost as if he planned it, ever so gently pushes the doors open. I just kind of stood there dumbfounded, unable to comprehend the fact that I made myself look like a gigantic idiot in front of an entire lecture (that I shared with at least five or six people I knew), when the professor nonchalantly says, \"Well there ya go.\" (Like this was nothing new for him). I just nodded my head and began to walk out, and I don't know what possessed me to do this, I turn around toward the entire lecture hall and give a double thumbs up with a ':D' face.\n\nMy face was so red walking out of that building that you could have mistook it for a baboon[.] ass."}