{"doc_id": "1236", "name": "2017_04_humanities_student_major_2961_history", "namespace": "we1sv2.0", "metapath": "", "pub": "history", "title": "2017-04-humanities-student-major_2961_history.txt", "pub_date": "2017-04-26T00:00:00Z", "Sentiment": "0.132", "Subjectivity": "0.41", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "888", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67lnz7", "Reddit_id": "dgs22v8", "Subreddit_id": "t5_2qh53", "Commenter": "Calorie_Man", "length": "5061", "content_scrubbed": "I guess I'm pretty late to the party, but I'll speak as a history undergrad that takes Philosophy as well as a minor. (Unemployment jokes incoming)\n\nTo be honest from what I read from the rest of your responses I would say your assessment is pretty reasonable for someone that is concern with the more practical facets of life. History isn't something with an immediate or easily calculable pay off like your programming skills. I would say its normally out of interest and fascination but there are other benefits.\n\nFirst off, the study of history helps to develop critical thinking, this isn't just a buzz word that your liberal_arts major uses to justify their degree (which I also find ironically tends to lack focus or academic rigor). It is a misconception, mostly propagated by the education system at history is just learn and then talking about a set of facts. History at its core on a higher level is about identifying causation and it is the differing analysis of the available factors that train the thinking.  For instance is the root cause of an event or the trigger factor a more important? What is the leading cause for something, and why would it be more significant as compared to other factors. \n\nSimilarly, history is the pursuit of truth, hence what most people perceive as facts actually evolve over time depending on the access to more sources or new evidence. This is another core part of history is the analysis of sources we use to make our arguments. Thus this is teaches us how to evaluate the reliability of sources through skills such as cross-referencing with other sources and how to view things with less bias.\n\nOf course most of these skills tend to manifest themselves once you reach a high level of proficiency. However even a seemingly simple and casual debate can hone this ability. Lets now say you and your friend are discussing WWII. One of you argue that it was Hitlers aggression, while the other blames it on the appeasement of Hitler by the Western powers. Both of these opinions have merit as they are causes of the outbreak of the war, the ability to deduce that it was Hitler[.] aggression caused appeasement to be response and thus making Hitler[.] aggression a more important factor is evidence of this thinking. (This is a very simplified and not a nuanced argument for examples sake) This may seem like a simple deduction but the ability to see it in circumstances of greater complexity is not as easy. \n\nGranted I agree this isn't actually a necessity in our world, but it is useful for holistic development. History outside of academia as a means for education is primarily used to teach this mode of thinking which can be applicable to all facets of life although not as apparent or used as consciously as other skills. Facts in history are just the evidence in the argument like ideas from an experiment or laws of physics, in isolation not very useful and at most interesting, combined with the historical or scientific method they unleash a whole other set of conclusions.\n\nSecondly, I would say that history is ultimately a study of the human condition. I doubt you have had many existential thoughts on the nature of humanity and where we as a whole are going or if we a doomed to ruin ourselves. This is not meant to belittle you in anyway, this is perfectly normal for most people and why certain subjects like history don't readily appeal to most. Human behavior, ideals and morals have not actually changed much over the course of history. The same problems of today[.] governments have befallen ancient empires and the existential crisis of if humanity will ruin itself was a constant worry to people 300 years ago. Historical insight into this with training to reduce present day bias helps us to better stand humanity as a whole about why these issues vex us so.\n\nOf course this requires either a great deal of interest or commitment to accomplish. I find that history is more palatable as a narrative as opposed to academic writing so a better outlet then books may be actually Youtube. To your replies about the education system, I come from the British system so I believe what you describe is how history is taught in the US. I honestly also believe that the system there is flawed. normally facts are taught to build foundation by teaching the narrative before starting to teach the basics of the historical method and critical thinking. The US system from what I've heard from my counterparts who took AP History is that is has an overfocus on facts with very little training on thinking at the High School Level. Like I said earlier I think this has coloured a lot of people[.] opinion on the subject and is not an accurate representation of the field or its merit.\n\nOverall, I think it simply may not interest you if the historic narrative bores you. That[.] common and perfectly fine, many of my friends are like that. I guess what is important is that the merit of history is understood and that training modes of thinking are inherently going to be less visible compared to a hard skill. "}