{"doc_id": "942", "name": "2017_04_humanities_student_major_236_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_236_AskReddit.txt", "pub_date": "2017-04-03T00:00:00Z", "Sentiment": "0.016", "Subjectivity": "0.254", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "660", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfqn6uj", "Reddit_id": "dfrl52h", "Subreddit_id": "t5_2qh1i", "Commenter": "Yates56", "length": "4034", "content_scrubbed": "Stop acting like a bully and stop tweeting and stop lying. \n\nWe all can only hope for when someone takes his 1st amendment rights away.\n\nStop issuing executive orders that are unconstitutional.\n\nI guess Kennedy blocking *EVERYTHING* and *EVERYONE* from entering or leaving Cuba was also unconstitutional, during the Cuban Missile Crisis.\n\nWithdraw the nomination of Gorsuch and name Garland to the Supreme Court.\n\nAt least Gorsuch doesn't believe in ignoring the Commerce Claus of the Constitution.\n\nAcknowledge his misogynist and bigoted rhetoric have had a harmful effect on US politics and society and take pains to correct this.\n\nYour rhetoric is old.\n\nRelease his taxes.\n\nRelease your taxes.  No privacy there?  I does seem fair since Trump called out Obama to release his birth certificate, not the U_S one, the Kenyan one. LOL.\n\nHave Melania move into the White House with him.\n\nNaw, have her move in with me, LOL.  I guess you prefer women have no choices.  She preferred to stay as far away from politics as possible, please respect a woman[.] choices.\n\nTake fewer vacations and spend less money on Secret Service. \n\nFor a man that bitched about Obama taking golf trips while disasters are occuring, he is taking quite a few trips himself.  But, If Congress doesn't pass bills, he can't sign them.  Dictators don't wait on Congress, they just write their own laws.\n\nFire all his family members and hire qualified staff.\n\nI like Ivanka, have her move in with me, too.  Stop listening to your family members for advise.\n\nFire the majority of his cabinet and hire qualified personnel.\n\nDefine qualified cabinet in a constitutional context.  They were approved by Senate.\n\nReverse his stance on US energy.\n\nWell, they are already on track to reverse Obama[.] administration, might as well reverse US energy, too.\n\nCommit to the Paris Accords.\n\nAnother feelgood measure that is worthless in implementation..  Shaming is the punishment for not complying.\n\n\nCommit to increasing US reliance on renewable resources and move away from coal.\n\nWell, the irony here is that companies are *not* jumping back in coal.  A resource that made this country great over a century ago is effectively worthless, and we have enough of it to last 500 years.  Less power plants are relying on it now, demand is diminishing, so why jump on a dead end road?\n\nEliminate all funding for his wall on the southern border.\n\nCongress controls the budget, not the president.  Presidents make suggestions of the budget (historically the president[.] budget proposals has never passed intact), then pass or veto it.  So far, congress has not funded \"the wall\".  How do you eliminate something that does not exist?\n\nSecure funding for the arts and women[.] health.\n\nArts, yes, women[.] health, no.  Only a sexist would prefer one gender over another.  It[.] called equality.\n\nIncrease protections for the LGBTQ community.\n\nHow?  We already have a doubling of law colloquially called a \"hate crime\".  You can be prosecuted twice, once for the original crime, again for \"hate crime\".  \n\nDecrease rather than increase spending on the military.\n\nI seem to recall \"the hair\" campaigning on this, but he did ask congress to boost military funding by $58 billion.  I also remember Obama campaigning on closing Guantanamo Bay, but it[.] still open.  Closing down Gitmo and ditching the Zumwalt class craptastic wannabe destroyer might offset this budget hike.  I seem to recall NATO requiring a 2% of GDP spending on defense.  We are at around 3. 6% spending to GDP, well above the minimum requirements, paying our \"fair share\".  Apparently operating on an idea resembling a graduated tax schedule where the rich (countries) need to pay a higher rate.\n\nPush for single payer universal health care coverage.\n\nOh hell no.  Our closest equivalency is the craptastic VA healthcare system with its *still* screwed up wait times in problem areas, such as Phoenix.  Get that fixed (without raising the military spending as you stated earlier), then we will talk universal healthcare.\n"}