{"doc_id": "438", "name": "2017_10_humanities_student_major_2005_blackpeopletwitter", "namespace": "we1sv2.0", "metapath": "", "pub": "BlackPeopleTwitter", "title": "2017-10-humanities-student-major_2005_BlackPeopleTwitter.txt", "pub_date": "2017-10-20T00:00:00Z", "Sentiment": "0.094", "Subjectivity": "0.298", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "440", "Permalink": "http://reddit.com/r/BlackPeopleTwitter/comments/77p1kj/still_nigga/doo1pap/", "Threadlink": "http://reddit.com/r/BlackPeopleTwitter/comments/77p1kj/still_nigga", "Parent_id": "t1_donzac7", "Reddit_id": "doo1pap", "Subreddit_id": "t5_33x33", "Commenter": "A_Naany_Mousse", "length": "2488", "content_scrubbed": "Agree in part. I studied humanities based degrees for various reasons and would not change it. Yet somehow still I ended up in the business world with a solid middle class job and room to grow. I plan on going back for an MBA next year. \n\nHere[.] what I'll say about studying humanities: it is worthwhile, but you need to be realistic. Like you say, I would steer clear of newish social_sciences unless you're dead set on devoting your life to those fields. Probably the same with fine arts. \n\nIf you're just a nerd like me who wasn't ready to study business, and not interested in STEM, look at Philosophy, English, History, Classics, or even things like Anthropology, Linguistics, etc. Things that will enrich your intellect and enlarge it. I truly believe these subjects are valuable to society and will help you wherever you end up.\n\nBut also you need to be prepared for certain realities. \n\n1.  There[.] a strong chance you will not end up in your field of study if you want to make money. Most people I know who studied more liberal_arts/humanities degrees ended up in business, the military, nursing school, or law school (Also be careful about law school. Not a golden ticket to a 6 figure salary like you think). I don't know anyone who became a successful writer, philosopher, historian, linguist, etc. The only people I know who work in their fields are school teachers or academics\n\n2. You're going to have to prove yourself. You're probably not going to be able to walk into jobs that pay the same as your friends with Finance or Engineering degrees. Be prepared to start at the bottom and work your way up. I did, and so did everyone else I know who got non-Business, non-STEM/Med degrees. Took me a little longer to get a solid income, but it was worth it. \n\n3. That said, do NOT get sucked into service jobs like bartending, waiting tables, barista, etc. They may pay a little more than some entry level jobs, but over the long_term they hinder your professional growth. Being a bank teller, secretary, or other semi-mundane professional worker may be less fun and pay less, but it gets you in the door. Tellers often end up becoming bankers. Secretaries end up getting better jobs in their office. And on and on. \n\nSo, long rant, but basically, the world still needs people studying history, philosophy, literature etc. Not everyone can be a STEM major. Not everyone wants to be a STEM major. Those who don't shouldn't be (and usually aren't) thrown onto the garbage heap. "}