{"doc_id": "1062", "name": "2017_04_humanities_student_major_1309_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_1309_AskReddit.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.063", "Subjectivity": "0.288", "Score": "6117", "Upvotes": "0", "Downvotes": "0", "Wordcount": "320", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64vs8k", "Reddit_id": "dg5hiia", "Subreddit_id": "t5_2qh1i", "Commenter": "treboR_the_Great", "length": "1753", "content_scrubbed": "Expelled because my gpa dropped below the competitive level for the engineering school at my college. I was given the option of transferring to a different school (they recommended I go into the humanities) or be expelled.\n\nWell, thankfully I had a job from the previous summer that was willing to hire me on full time before this happened, so I took the expulsion and went to work full time. Since then, I've gotten my certifications and work in the trades doing fairly well for myself... So, yay?\n\n*Edit: Since a lot of people have asked similar questions, I'll answer them up here.\nI left with a 2. 9 gpa. I needed to maintain a 3. 25 in order to stay in the program I was in, as it was also providing a scholarship; couldn't afford school without it.\nI went into hvac in the trades, with an emphasis on programming.\n\nIf people are genuinely curious, I highly recommend looking into the trades. Some people just aren't meant for university (not saying they're not smart; for instance, I graduated high school valedictorian, with a 4. 45 gpa); some brains just aren't set up to be sitting learning in a desk for 4+ years. There[.] a stigma that it[.] a lower class job, but don't let that stop you! I payed of the student debt I had within a year and a half of working, and at 23 am looking to purchase my first house. The trades (assuming you get technical training, or go into a highly sought trade) pay extremely well. I make a little over 48k a year after being in the trades for a little over 3 years. And that[.] still as an apprentice.\n\nAlso, not bashing the humanities one bit. My brother went that route, and he[.] one of the most intelligent people I know. I just have a mechanically inclined mind, and it would've been wasted going that direction."}