{"doc_id": "997", "name": "2017_04_humanities_student_major_681_unitedkingdom", "namespace": "we1sv2.0", "metapath": "", "pub": "unitedkingdom", "title": "2017-04-humanities-student-major_681_unitedkingdom.txt", "pub_date": "2017-04-07T00:00:00Z", "Sentiment": "0.09", "Subjectivity": "0.377", "Score": "36", "Upvotes": "0", "Downvotes": "0", "Wordcount": "450", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63zopw", "Reddit_id": "dfyep79", "Subreddit_id": "t5_2qhqb", "Commenter": "MatrimPaendrag", "length": "2460", "content_scrubbed": "There are all sorts of weird arguments in this thread which have really surprised me cos normally /r/uk likes to jerk hard to the_left.  The main one seems to be that that the much put-upon parents of private school kids *already* pay taxes towards the state school system and so this is a mean double tax on people who are lessening the public burden anyway.   This is an argument I would fully expect to see in the telegraph or other right-leaning places like /r/ukpolitics, but surprised to see it here.  \n\nI went to a private school and I think it is absolutely ludicrous that they have no tax liability.  People are saying that school fees would have to go up to cover the tax increase and that would mean more kids in the state system, but I don't believe that for a second. The vast majority of private schools (and certainly my alma mater) charge fees as high as they can get away with, not the lowest fees they need to cover costs.  My old school has built literally four huge, new buildings since I left.  When I left the vast majority of the place was in very good nick, they've built these buildings because they fundamentally had more money than they knew what to do with and as a charity they can't of course turn a profit.  If a tax came in my old school could keep its fees exactly the same and not have any financial issues whatsoever, unless it[.] run like Kids Company.  I'm no expert on education (or public finance for that matter), but my inclination is that this would be the case for a lot of them.\n\nI think the UK private school system causes a lot of this country[.] divisions.  Eton has a theatre better than a lot of British cities and much of the west end. My school had music facilities that would have made the Juilliard jealous. That[.] just extra-curricular, nevermind all the other incredible advantages kids like me get.  It is no surprise to me at all that many of this generation[.] top actors and musicians are public school boys and girls.  And that[.] the arts, I've not mentioned our last Tory cabinet which had more Etonians than women (IIRC, please don't shout if that[.] wrong).  If people in this country are serious about social mobility, then IMO there[.] no better place to start then trying to bridge the monumental gap in the education of the richest 5% of Brits vs the rest.  A tax on the education of the richest to subsidise food for the children of the poorest seems like a very low-key and sensible way to start."}