{"doc_id": "257", "name": "2017_10_humanities_student_major_262_lostgeneration", "namespace": "we1sv2.0", "metapath": "", "pub": "lostgeneration", "title": "2017-10-humanities-student-major_262_lostgeneration.txt", "pub_date": "2017-10-04T00:00:00Z", "Sentiment": "0.051", "Subjectivity": "0.339", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "849", "Permalink": "http://reddit.com/r/lostgeneration/comments/744t7i/is_generation_z_doing_okay/dnwat6q/", "Threadlink": "http://reddit.com/r/lostgeneration/comments/744t7i/is_generation_z_doing_okay", "Parent_id": "t1_dnw8urj", "Reddit_id": "dnwat6q", "Subreddit_id": "t5_2r40j", "Commenter": "yams777", "length": "4437", "content_scrubbed": "Basically all I am saying is others just don't want it to generalize too much as it could cause a misconception.\n\nHaving even the first year of your master[.] DOES raise your chances more than you think. There is a large swath of the population blocked behind a paywall and therefore do not qualify for the job and give you better odds. Experience should be king but some places will refuse to consider anyone good enough unless they have the paper to back it up as well as the experience.\n\nGetting into STEM is not the worst idea even if you went in blind, but it can come with some serious downsides to those not ready for it. As you said, it isn't meant for everyone and yet we are pushing everyone into it. Those that hate the job but are there because they are being told they either need to get a STEM degree or go homeless are NOT going to end up with the same luck you had when landing a job. They are in fight or flight mode and are there to survive. Like any job in STEM, you know very well that will never work. So this goes back to yet again that pushing everyone into STEM will cause issues. \n\nMost people I know going to college are not there for the immersion. They are there to complete a specific task and are unsure by the time they graduate what to do with it if someone doesn't hire them straight out. They have to work and go to school while taking care of family and trying to find a home to live in. So they never have the time to get into internships and the proper experience. (Those that don't have to do this end up squandering the luxury they had set forth to them and ask why they can't make friends instead.) This is a lot of first time family college graduates who have no knowledge or background into how this will work. Its going to be just as bad as the humanities glut. The only difference now is that it will, in time, cause your wage to go down. \n\nYou may still always have a job, but your future employers will use this excuse of other new graduates as a way to keep your wage lower. This is especially true as they keep setting up more and more outsourcing opportunities. Are the outsource workers not as good? Very possible. Does the company care? Probably not. If they make more money not having qualities goods, I fail to see how they care.\n\nIts also going to get more complicated as we start automating higher end jobs. Banks have already let the cat out of the bag in that they do plan to automate a lot of their higher paying financial positions and no, those are not going to be replaced with better work. Now this won't happen tomorrow but when it does start to come to a head on top of all the other jobs being eliminated, that will cause even higher competition in engineering and other fields. Top this off with people in our generation and those below us will be working into their 70[.], this will soon cause some serious competition. I'd say give it five to ten years to start seeing the start of this trend. \n\nNow does this mean an engineer is going to turn into the next poor fast food worker in 10 years? No. Not by a long shot. However, when it becomes the only limited job option, a lot more people are going to be left out than we think.\n\nTo end this off, as you said, with any line of work if you have a passion for it then this will show. Some that are really good do make it and there is nothing wrong with following one[.] dreams. The issue is more that there is a growing trend to push people in there for the sake of being there. Hence the generalization that Gen Z will do badly with over saturating STEM. It isn't that the best will have problems, its that 'hey if I want to live then I need to be an engineer' mindset is just as bad as the millennial college push. For many, the debt will destroy them. There are Gen X[.] with their lives ruined because they couldn't pay back medical school debt. That doesn't mean being in the medical field was bad, but they didn't have the funds to survive in the field to begin with.\n\nI will say, IF we change how our ongoing education works then maybe there is a chance for Gen Z and Millennials to do do better overall. Its more that our current elitist system is designed to make the majority fail. Keyword on majority but not all. We just can't keep things going as business as usual mode.\n\ntl:dr;\nBeing an engineer is better than flipping burgers. However, it won't change the fact that not everyone in Gen Z will benefit from it."}