{"doc_id": "250", "name": "2017_10_humanities_student_major_216_jobs", "namespace": "we1sv2.0", "metapath": "", "pub": "jobs", "title": "2017-10-humanities-student-major_216_jobs.txt", "pub_date": "2017-10-03T00:00:00Z", "Sentiment": "0.203", "Subjectivity": "0.35", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "269", "Permalink": "http://reddit.com/r/jobs/comments/742ygn/successful_male_webcam_model_for_several_years/dnv7oi3/", "Threadlink": "http://reddit.com/r/jobs/comments/742ygn/successful_male_webcam_model_for_several_years", "Parent_id": "t3_742ygn", "Reddit_id": "dnv7oi3", "Subreddit_id": "t5_2qhnd", "Commenter": "bighark", "length": "1591", "content_scrubbed": "Well, OP, I think you've got two options. \n\nOption 1 is to present yourself as a recent graduate with an A. S. in computer science who has no work experience apart from student projects. That[.] not a bad option. As long as you're prepared to accept an entry-level salary in your field (which, no doubt, will be far less than your web cam income), you can easily go this route. I can see a resume containing your liberal_arts degree, no \"relevant experience,\" and your computer science degree, and I can also see a resume where you just list your latest degree. Both options are viable, though you'd probably have to demur if pressed on what you did between the degrees. \n\nOption 2 involves \"completely owning\" your webcam business. You can list your accomplishments in terms of revenues, viewers, repeat business, or whatever metrics that may seem impressive for the space you're in. I'd imagine there[.] a certain degree of marketing and business development/sales that you'd have to do to reach your level of success. Those are real skills! You might need to spend some time crafting the_right resume language, but including your webcam experience isn't outside the realm of possibility. With a professional sounding, clinical description of the business, you may be able to pull that off. \n\nWhat I wouldn't do, though, is lie about your experience. It[.] possible to describe your webcam business in a way that[.] appropriately professional, but trying to explain what you've been up to for the past 6-7 years with a lie is something I'd avoid. You'll get caught and embarrassed. \n\nGood luck!"}