{"doc_id": "526", "name": "2017_10_humanities_student_major_2907_portland", "namespace": "we1sv2.0", "metapath": "", "pub": "Portland", "title": "2017-10-humanities-student-major_2907_Portland.txt", "pub_date": "2017-10-30T00:00:00Z", "Sentiment": "0.076", "Subjectivity": "0.396", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "238", "Permalink": "http://reddit.com/r/Portland/comments/79jnl8/opinion_professors_like_me_cant_stay_silent_about/dp3gozn/", "Threadlink": "http://reddit.com/r/Portland/comments/79jnl8/opinion_professors_like_me_cant_stay_silent_about", "Parent_id": "t1_dp36aqm", "Reddit_id": "dp3gozn", "Subreddit_id": "t5_2qi2i", "Commenter": "PipsAndPens", "length": "1398", "content_scrubbed": "It is worth noting that the sections of the course on Egypt, Mesopotamia and Persia were added relatively recently in response to previous objections to how \"white\" the course was. The course authors do try to change the course over time in response to student and faculty criticism.\n\nAlso I'm not sure that suggesting Nigel is responsibly for the college[.] commitment to forcing students to take Hum 110 is helpful or true. Hum 110 has been a required course longer than any of the current faculty have been there. In my experience, one of the main reasons that Hum 110 is required is because wealthy and powerful alumni expect it to be. \n\nThere are also significant problems with distributing faculty resources. By requiring everyone to take one specific course as freshman, the faculty goes into the school year knowing that a lot of teaching time needs to be assigned to that course. If they allowed students to choose, they would have to cap the other humanities courses any way and then how do they handle the students who wanted to take Chinese Humanities, but couldn't because there are only three professors at the college qualified to teach it. Not to mention that if they made these other humanities courses open to freshman, they would have to change the structure and expectations for these faculty potentially denying them the chance to teach the subjects they actually want to teach."}