{"doc_id": "1173", "name": "2017_04_humanities_student_major_2347_australia", "namespace": "we1sv2.0", "metapath": "", "pub": "australia", "title": "2017-04-humanities-student-major_2347_australia.txt", "pub_date": "2017-04-20T00:00:00Z", "Sentiment": "0.029", "Subjectivity": "0.345", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "538", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgjr2p8", "Reddit_id": "dgjsdkk", "Subreddit_id": "t5_2qh8e", "Commenter": "MaevaM", "length": "3202", "content_scrubbed": "Most jobs created this century have gone to immigrants.  This is not the fault of individuals, and we have always been an immigration nation, and of course you are welcome. You are not responsible for neoliberalism- but there is no way in hell far too much immigration way above our ability to cope and maintain services, as service are shut down, is not having a terrible effect on the lower and middle classes. \n\n  The more they make it so immigrants must have jobs the harder they make it for ordinary Australians. Our education system has become a mockery as there is no incentive for many employers to participate in it.\n\n Yesterday we had a tech person explaining they could never hire from within Australia.\n\nI believe that business is therefore not suited for Australia and should be closed down until such time as they  can employ Australians or participate in the training of Australians. \n\n If it is an essential service a public service department can take it over.\n\nWe are welfare capitalists, not nursemaids for business unsuitable to Australia. We have primitive low grade tech infrastructure, filthy hospitals, under serviced almost everything, regulatory capture, human right abusing governments with illegal prisons for ordinary people as well as running  concentration camps and government \n deliberate oppression of indigenous ,  have you checked out the hell hole aged care you will be paying top dollar for?  and do not even have reliable mail. IMO.\n\nYeah we are great country, for about fifteen years longer if we do not enact major change.  \n\n\n\nWe do not have the health infrastructure or housing to support lots of immigrants just to let some company employ a failed unprofitable business model that requires  staff not able to be trained locally at our expense as a society. If he cannot make money without busting a gut and training someone, too bad.   If they cannot afford to provide experience/on the job training, they cannot afford to hire someone. Our society exists for Australians not for companies seeking handouts and to be burden on our society in order to maximise profits or pursue failed business models.  \n\n I would prefer a lottery system and family immigration or perhaps simply not letting anyone who can work in. I would make exceptions for academics, scientists, and creative people such as composers singers and artists and artisans who have unique  offerings.  The exact people our government is cracking down on. I would allow NZs to come and have reciprocal welfare etc, and have anyone born in the country be an automatic citizen. \n\n I believe Australia has no future at all as a tech country, the NBN disaster and privatisation of so much infrastructure and stranglehold of global  corporate interests and the extreme numbing down of primary and secondary education has seen to that.  Pretty much our only hope is the arts. We may be able to make a go of science again if the CSIRO is allowed to leave the for profit model and education is made free and merit based and academic tenure etc reintroduced.. so unlikely.  Pigs will fly first in some other country.\n\nThat sucks about the ESL, I wonder if I would pass. \n\nLPT: never be dyslexic, it sucks"}