{"doc_id": "522", "name": "2017_10_humanities_student_major_2879_tulane", "namespace": "we1sv2.0", "metapath": "", "pub": "Tulane", "title": "2017-10-humanities-student-major_2879_Tulane.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.189", "Subjectivity": "0.52", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "991", "Permalink": "http://reddit.com/r/Tulane/comments/79kf8w/convince_me_im_wrong_tulane_is_a_mediocre_school/dp2ylu8/", "Threadlink": "http://reddit.com/r/Tulane/comments/79kf8w/convince_me_im_wrong_tulane_is_a_mediocre_school", "Parent_id": "t3_79kf8w", "Reddit_id": "dp2ylu8", "Subreddit_id": "t5_2s81b", "Commenter": "a_sneaky_hippo", "length": "5770", "content_scrubbed": "As a current Tulane student, there are many elements of your post that are true, that being said I think it[.] way hyperbolic.\n\nFirst off, it seems like a lot of your issues with Tulane come from not liking the students that go there. That[.] fine, but in college you get to choose who you talk to. I find it difficult to believe that there isn't a single group of people at a University as nice as Tulane - I'll get to that in a moment - that don't satisfy your social and intellectual requirements. If that[.] true, that[.] on you (not Tulane), like seriously there[.] some 13,000+ undergrads.\n\nSecond, New Orleans is a beautiful city, with some phenomenal blends of nature and architecture, and many unique cultural aspects (music, Mardi Gras, food) that you really can't just find in any city. For example the public school system in New Orleans has the most market-driven education system in the U_S if not the whole world. New Orleans has a very strong identity, that comes in part from the process of rebuilding after Hurricane Katrina. I actually had to reread your paragraph on New Orleans a few times because I couldn't believe it. \n\nI think it[.] funny that you call New Orleans 3rd world, because it clearly exposes your ignorance to how much of a privilege a Tulane education is. The U_S university system is the best in the world, and many people on this planet would be blessed to have the opportunity to go to an American University for their education. Now, take into account that Tulane has exceptional faculty - much better than many universities in the U_S - and also the small class sizes and amply available professors.\n\nI think you have an insanely perverted view of the purpose of higher education. It[.] called higher education in part because it[.] more specific, another example of your ability to choose things in college. I'm an Econ and Math double major (and I'm doing it in 3 years, so I don't know where you're coming from with the drowning in classes bit) and I haven't had any issues finding an awesome intellectual community among my friends and professors. You mention both how undergraduates have access to research opportunities and how Tulane did a good job of preparing you for graduate school, and you're still calling it a terrible school ffs. \n\nIt seems to me like you don't know what the word intellectual means by the way you use it, like you think the only authentic intellectual community exists in a traditional liberal_arts framework. Math and physics aren't liberal_arts, but they're very intellectual (and interesting) subjects. I don't see how a liberal_arts education would uniquely enlighten me in ways that the aforementioned subjects couldn't. You place this enormous emphasis on liberal_arts but it[.] obvious that STEM is far more important for both practical applications (evidence provided by corresponding higher wages in STEM fields) and innovations that improve quality of life (biomedical engineering is a classic example) while mitigating our own impact on the planet. So remind me why a lacking liberal_arts program makes Tulane a shit school? Seems like you should've done more research during the college application process (applies to NOLA as well).\n\nYour complaints about Tulane students only seeing their education as a means to an end - a job - are NOT unique to Tulane. Employers use a college diploma as a signal of competence/skill, and grant higher and better paid positions to those that hold one. It[.] a natural consequence that many people that are solely interested in money will be focusing on the aspect of education that gets them the money (diploma), which again is not by any means specific to Tulane. David Labaree wrote extensively on that precise topic if you want to learn more about it.\n\nI'm not sure why you're so upset that there are so many \"Ivy League rejects\" at Tulane. You're literally admitting that many of our students were the top of their class in high school... so how is it that none are intellectual enough for you?\n\nJust because 95% of people agree on a topic of discussion doesn't mean there[.] no \"free thinking.\" You mention that others are too afraid to speak out, how exactly do you know that? Regardless, the proportion of people on any side of a given argument shouldn't even factor into your individual decision-making (Nazis were a majority in many places) so if anything it seems to me like you're stifling your own free thought by dwelling on the considerations of others.\n\nYou go on about some hypothetical counterfactual self that went to any other American university, that is apparently better off than going to Tulane. All this in the same paragraph admitting that many Tulane students go on to respected graduate programs. I had to reread that paragraph too. Again, I attribute this glaring discrepancy to your personal view of the purpose of higher education.\n\nIf you feel like you didn't get a well-rounded education, that is entirely your own fault. I say this because if there[.] one thing Tulane has, it[.] ample resources available to students in the pursuit of education. This goes back to recognizing the privilege to even attend a school like Tulane.\n\nAs for clubs, I agree there are good ones and bad ones, but the important point is that there are good ones... you could also start your own.\n\nPlease don't take personal offense to my writing, but I honestly must say that I think you're being a massive dick. Your post is incredibly disrespectful to so many people in New Orleans and at Tulane. I don't know why you think you're so much better than those people. Personally I'd rather associate with a stupid drunkard with some manners than some pedantic asshole intellectual. Being embittered isn't a free pass for being an asshole.\n"}