{"doc_id": "1265", "name": "2017_04_humanities_student_major_3209_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_3209_AskReddit.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.549", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "577", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgvridf", "Reddit_id": "dgvum53", "Subreddit_id": "t5_2qh1i", "Commenter": "radicannon", "length": "3473", "content_scrubbed": "Oh man I'm pretty big on media portrayal because it[.] a fairly visible and quantifiable measure of modern day sexism. Notice how every person who tells a girl to be more ladylike is wrong/evil? I'm sure it happens sometimes but girls very much try to distance themselves from acting like \"other girls.\" \"I'm just like one of the guys\" is a phrase that usually follows \"I'm not like other girls.\"\n\n\nAdmittedly there are negative male traits that sympathetic women in media never have, like stupidity. While heroines usually don't have to have positive feminine traits, they still have to be wiser than the guys or come off as unfeminist, which is pretty dumb. They also can't be very gritty; almost every story with a male and female MC has a morally ambiguous guy with a rough upbringing and a virtuous girl who[.] had it comparatively easy. The problem here is that the male character is more interesting, and we like him more because we have a thing for underdogs. Also, being cold and calculating is almost always portrayed negatively in women--some sympathetic characters may start off cold, but they always get fixed. But there[.] a lot of wish fulfillment in hyper-smart badasses who don't give a fuck (think BBC Sherlock.) The thing is, all of these traits are okay--even awesome--in sympathetic men and not in sympathetic women, while negative feminine traits (vain/bitchy/etc) aren't okay in either gender. One of my biggest problems with feminists is that they get tricked into thinking flawless badass women are feminist when really they're just a heap of praise for masculinity on top of a horribly boring character. \n\n\nThis of course bleeds into the real world. Because the truth is that cool role models are better than perfect ones. I honestly think this is part of the reason women go into less high-paying jobs--women are NEVER portrayed as cool for being ruthless or unemotional, and many high-paying jobs (business, STEM) are associated with these qualities. Women are pushed into more \"emotionally fulfilling\" jobs like teaching and nursing over jobs that make a ton of money, and I can't help but wonder if it[.] because in media men are awesome if they chase after money while super-girl-power-women are too perfect for that and must take the moral high ground. \n\n\nSpeaking of STEM, though, I get bothered by how people see women in STEM as the ultimate goal, to the point that feminists are often derided for majoring in the humanities instead. Promoting more women into powerful media positions is often overlooked but essential. A quick wikipedia check suggests the numbers are 7/13/20% directors/writers/producers, which is pretty crazy. Media dictates so so much of how we look at things, but there[.] a huge lack of female input, perpetuating a male viewpoint which naturally idolizes masculinity and is scared of femininity. \n\n\nIn real life, obviously, there are consequences for negative male traits. Being violent and reckless is bad, of course, and most people would agree. But I think media says a lot about who people want to be. Being reckless and violent honestly carried LESS of a stigma than it should, because it straight-up hurts people but we all think it[.] awesome. Meanwhile, feminine flaws that are pretty harmless (caring about your appearance) or even beneficial (talking about your feelings) are kind of demonized way out of proportion to their effect. \n\n(I'm sorry this got so long I just really like talking about this subject) "}