{"doc_id": "960", "name": "2017_04_humanities_student_major_435_uiuc", "namespace": "we1sv2.0", "metapath": "", "pub": "UIUC", "title": "2017-04-humanities-student-major_435_UIUC.txt", "pub_date": "2017-04-04T00:00:00Z", "Sentiment": "0.171", "Subjectivity": "0.392", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "530", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63gvqt", "Reddit_id": "dfugks0", "Subreddit_id": "t5_2qkxs", "Commenter": "TheseusAegeus", "length": "3280", "content_scrubbed": "Like any other university, it varies by program. We're a very strong public institution academically overall with plenty of outstanding humanities and social science programs, but I'd encourage you to mention which program specifically you're interested in. After all, Harvard (for example) might be tops in 100 different areas, but if you're interested in 19th century Southern history then you'd probably want to know that the best place to study 19th century Southern history is the University of Kentucky, not Harvard. \n\nTil then, I can speak more specifically to our strengths in history. We're ranked as one of the top public schools in the country for history and have produced or had as faculty some of the most distinguished Americanists of the last century: David Herbert Donald, JG Randall, Allan Nevins, Kenneth Noe, Bruce Levine, Edna Greene Medford, Richard Nelson Current, Theodore Crackel, Cullom Davis, Orville Vernon, Wayne Temple, James Cornelius, among others. We're also particularly strong in Latin American history with one of only two or three centers for Brazilian studies in the U_S, as well as Russian/Eastern European history with over 5 million volumes on the subject in our collection. Oh and we have several specialists in British history, including Antoinette Burton (who is kinda a big deal in British imperial history). It also helps overall that we have the largest public university library in North_America.\n\nOur department is also home to a unique digital humanities initiative called SourceLab which solicits proposals from scholars on campus and as far away as UCLA for students to create prototype digital documentary editions of primary sources. In fact, you can take a seminar devoted to this called Publishing the Past. \n\nOn the whole, the history program here is rigorous but wonderful. Majors can take courses in everything from Slavery in the U_S to History of Latin America through its own Texts to Mexican-American History to History of Prison to Constructing Race in America to Transnational Sexualities. The department is very active and genuinely a community in its own right; it[.] sort of like my second home here on campus. We also have an incredibly kind, devoted advisor who has walk-in hours 4 days a week, sends everyone a weekly history newsletter, and has more than once emailed me directly about internship/employment opportunities that she thinks might interest me. \n\nHistory at Illinois may not quite be Yale (of course, hardly any programs match Yale[.] history department), but it[.] near the top for public schools nationwide. \n\nThe Classics Department is much smaller and much more hands-off with students, but we do have an enormous classics library and some great specialists if you have an independent drive. \n\nSTEM may get all the hype around here (and our STEM programs are great and necessary; in fact, there are a lot of interdisciplinary opportunities that blend humanities and STEM), but they aren't the only show in town. The biggest problem that you'll find at Illinois for the humanities is funding; our state budget ain't what it used to be (in fact, it[.] non-existent at the moment). But that[.] where Friends of History comes in as well as several NEH grants we've gotten recently."}