{"doc_id": "956", "name": "2017_04_humanities_student_major_398_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-04-humanities-student-major_398_ApplyingToCollege.txt", "pub_date": "2017-04-04T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.457", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "579", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_638qas", "Reddit_id": "dftx2u1", "Subreddit_id": "t5_2y2r8", "Commenter": "deixj", "length": "3332", "content_scrubbed": "I was admitted ED and was going to leave this to someone who[.] currently attending, but I'll share an incomplete list with you since no one is really answering.\n\n**Pros**  \n\nOpen Curriculum: Brown gives students the freedom to choose the courses and subjects that interest them. The only requirements are that you receive the proper credits to complete at least one concentration (major) and that you prove that you have worked on your writing—though not necessarily in an English class–at least twice.\n\nS/NC: You can elect to take as many classes as you want Satisfactory/No Credit (S/NC), which is essentially the same as Pass/Fail. If you choose to take a class for a letter grade, any grade lower than a C is automatically given a grade of NC and stays off your transcript.\n\nShopping: The first two weeks of class are known as \"shopping period,\" meaning you can add and drop as many classes as you want with no penalty. This is done so you can attend some classes and see what you're interested in taking.\n\nCampus culture: Brown has a reputation as a very intellectual but very relaxed school. Students are more collaborative and less competitive than at similar schools.\n\nLocation: Providence is a really cool city, and pretty much everything you could ever need is located right by campus on Thayer Street. If Providence isn't enough, Boston is 45 minutes to an hour away, and New_York City is two to three hours away.\n\nRISD: If you're interested in the arts, you can take classes at the Rhode Island School of Design (one of the most prestigious art schools in the world), located right down College Hill, for Brown credit.\n\nStudy abroad: Brown offers its own (very strong) programs in 12 countries, and has approved programs in many others. If there is no Brown-sponsored or approved program that you like, you can petition to receive credit for a different one.\n\nUndergraduate focused: Brown has a smaller graduate program than most other Ivy League schools, meaning the focus is largely on undergraduates and you won't really have to compete with older students for professors' time and resources.\n\nPrestige: As much as I hate to use this as a reason to go to a school, Brown is an Ivy League university, which carries a lot of prestige with it. This makes it easier to find jobs and internships, gives the school the resources to provide a wide array of classes, and encourages people like David Cameron and Dilma Rousseff to come speak.\n\n\n\n**Cons**  \n\nCampus politics: Brown is an unforgivingly liberal school. Though this can be a good or a bad thing depending on you, it[.] important not to get sucked into an echo chamber no matter which side of the political aisle you fall on.\n\nWeather: It[.] in New England. New England is cold, snowy, and damp.\n\nHousing: The dorms are pretty nasty, especially for a school as wealthy as Brown. The housing lottery for sophomores is supposedly a nightmare, and as a freshman, your roommate is randomly selected (a good and a bad thing).\n\nGreek life: I personally see this as a pro, but if you're looking for Greek life, Brown probably isn't the place to find it. It exists, but it doesn't have a very large presence on campus.\n\nSports: Unless you're on a Brown team, you will most likely not be going to many games. School spirit still manifests itself to some degree in other ways."}