{"doc_id": "228", "name": "2017_10_humanities_student_major_28_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2017-10-humanities-student-major_28_AskAcademia.txt", "pub_date": "2017-10-01T00:00:00Z", "Sentiment": "0.212", "Subjectivity": "0.533", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "230", "Permalink": "http://reddit.com/r/AskAcademia/comments/73l93a/is_academia_broken_and_if_so_how_can_we_fix_it/dnr69q7/", "Threadlink": "http://reddit.com/r/AskAcademia/comments/73l93a/is_academia_broken_and_if_so_how_can_we_fix_it", "Parent_id": "t3_73l93a", "Reddit_id": "dnr69q7", "Subreddit_id": "t5_2sakj", "Commenter": "mikowski17", "length": "1287", "content_scrubbed": "The idea of changing countries must be a more European concept. Generally, if you're from the US and get your degrees here, you want to stay here. Some obviously move around as you mentioned but we stay at home mostly. Moving around different jobs in different states or parts of the country would be more accurate for us.\n\n\nI agree that just because you get your degrees doesn't mean you should have a job lined up when you're done. It[.] not an entitlement or right, it[.] a privilege that has to be earned. That said, there aren't as many industry options, especially for the humanities or some other fields I'm sure. In STEM we can work for the government and in fields like chemistry or physics there are certainly private industry options. Personally I'd like to see more early college high schools and those advanced academies for  each subject like math and  science or art  and they could teach there. Sometimes I think that would be a perfect setup for me. Also more PhDs teaching in K12 would alleviate some teaching shortages but for those who never taught at that level, it[.] a horrible option. Once you do it, you find out it[.] a nice change from the apathetic students at the college level. That was my experience at least. I have no solutions, but these are my best ideas. "}