{"doc_id": "1122", "name": "2017_04_humanities_student_major_1870_ucla", "namespace": "we1sv2.0", "metapath": "", "pub": "ucla", "title": "2017-04-humanities-student-major_1870_ucla.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.184", "Subjectivity": "0.414", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "425", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65r75u", "Reddit_id": "dgcsvtf", "Subreddit_id": "t5_2qscu", "Commenter": "WoodcarverQing", "length": "2337", "content_scrubbed": "The jacaranda trees in the sculpture garden should be blooming around this time of year (bright purple blossoms), so it may be worth your while to visit. Other than that, hit all the normal spots: most of north campus, the hill (where dorms and dining halls are located. In specific, outside B Plate you have a great view and beautiful architecture). \n\nIn terms of coffee spots, I've got a few that I enjoy:\n\n* Kerckhoff and the coffee house inside (beautiful, almost gothic architecture). In fact, I'm writing this comment in Kerckhoff. Coffee is located on the second floor. It will most likely be busy on Monday, so be prepared to wait for a table to open up. It[.] a chore, but once you're seated the atmosphere, in my opinion, is unmatched. Busy students, the smell of coffee, stained glass windows. Of all the things I'll miss about UCLA, one of those that I'll miss the most is studying in Kerckhoff during finals.\n\n* Lu Valle (Jimmy[.]). If your major is a north campus major - liberal_arts - get used to Lu Valle. It[.] the hub for philosophy and law students, and is on the walking path for many other majors as well. Jimmy[.] has a different flavor than Kerckhoff: it[.] pretty much on the edge of campus so you don't feel as close to the heart of campus, and the age range tends a bit higher due to grad students and professors hosting office hours. You're much more likely to find a table here, and there is a beautiful outside patio area under some large pine trees.\n\n*  YRL (Young[.] Research Library), as another commenter has mentioned, is another great place to study. Cafe 451 is their coffee shop, and it will be the least busy of the three I mention. YRL is a large library, with a very modern first floor and antiquated 2nd-5th floors. If you like studying alone but want to have coffee close by, YRL is for you. You're pretty much guaranteed a study space in one of the 5 floors.\n\n*  If a south campus major - sciences - check out bombshell. Only studied there once, but it was pretty great.\n\n\nAnother small plug for a personal favorite spot on campus consists in the spot in between Royce and Haines hall. My favorite 100 yards on campus. Also, if you're a nature-y person: On the western border of Andersen Business School, there[.] a small creek area which contrasts nicely with the brick jungle of the rest of campus."}