{"doc_id": "474", "name": "2017_10_humanities_student_major_2420_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_2420_AskReddit.txt", "pub_date": "2017-10-25T00:00:00Z", "Sentiment": "0.129", "Subjectivity": "0.339", "Score": "27", "Upvotes": "0", "Downvotes": "0", "Wordcount": "229", "Permalink": "http://reddit.com/r/AskReddit/comments/78mpfx/students_and_professors_of_reddit_what_moment/dovbno3/", "Threadlink": "http://reddit.com/r/AskReddit/comments/78mpfx/students_and_professors_of_reddit_what_moment", "Parent_id": "t1_dov1g5z", "Reddit_id": "dovbno3", "Subreddit_id": "t5_2qh1i", "Commenter": "PmMeLlamas", "length": "1263", "content_scrubbed": "This quizz is fantastic. The very wrong type of fantastic but still.\n\nPlease select your gender. Why ? Do you have gendered hells ? Might as well have given an \"other\" answer, so they can direct you immediately toward the freak hell.\n\nHave you been known to dress provocatively to attract the attention of the opposite sex? I'm gay.\n\nDo you enjoy violent movies and video games? Yeah, a cinematic adaptation of the passion of the christ.\n\nDo you read scripture? Yeah, pagan scripture.\n\nCan you see yourself engaging in treason against your country?  Nice try FBI\n\nAre you good at telling lies?\n\nRight next :\n\nDo you look at pornography? \n\nIn war, the best idea is to bomb the hell out of the other country. Well, if your goal is to destroy the other country, yes it is. You're going to need to be more specific.\n\nHammering away on scandals is a good way to damage those with whom you disagree politically. Uh, yes, it is a pretty good way to achieve this goal. Should have asked if it was ethical.\n\nMorals are relative. Since someone thought it would be a good idea to give this thing to humanities students, I'm going to answer yes.\n\nWhat happened here ?? I hope the professor got in trouble here (Have you wished bad things upon your fellow countrymen? now yes)"}