{"doc_id": "1063", "name": "2017_04_humanities_student_major_1321_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_1321_AskReddit.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.097", "Subjectivity": "0.406", "Score": "4508", "Upvotes": "0", "Downvotes": "0", "Wordcount": "865", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64vs8k", "Reddit_id": "dg5je38", "Subreddit_id": "t5_2qh1i", "Commenter": "expelthrowaway", "length": "4630", "content_scrubbed": "I was expelled three years ago from a small private liberal_arts university **two weeks** before I was supposed to graduate.  \n\nI was in an upper level algorithms course for my Computer Science major, and instead of a final the professor assigned a large research project on an extremely niche area of the subject. I had other classes to worry about finishing as well, so admittedly I didn't prioritize the paper as much as I should have. Three weeks before it was due, the professor required us to submit a rough draft so he could critique and help us. My topic was so niche that I was only able to find one text on it, but it was a really good source with a very long mathematical proof, like 3 pages worth, so obviously I was going to cite this proof as the fulcrum for my paper --- there was no way I could do this sort of math on my own. I could only find a physical copy of this source from the library, there was no digital copy, so in order to use and cite it in my paper I would have to transcribe 3 pages of mathematical proof by typing it in. That sounds easy enough, but the thing with mathematical papers is they use a *lot* of symbols, it[.] how the math is demonstrated. I used a language called LaTeX, which allows you to input things and make everything look nice, but it[.] time consuming (here[.] a sample cheat sheet of the codes used to generate the symbols: https://wch. github. io/latexsheet/latexsheet-0. png). This took me nearly 4 hours, but I finally had a digital copy of my proof. I didn't have time to write anything more than an abstract for my rough draft, and I cited my source in the works cited section, so I turned in this to my professor as if to say, \"I don't have much, but this proof was hard to acquire and I will be basing my paper around it\".  \n\n He calls me in the next day to inform me he has reported me to the academic affairs council for plagiarism. I am dumbfounded. I explained my reasoning for what I turned in and how I had no intention of plagiarizing work that I clearly cited, *on a rough draft no less*, to which his response was, \"That is for the council to decide\".  \n\nI appear before the Council, try to explain everything in laymen[.] terms, how I had no idea it[.] even possible to be found guilty of plagiarism for an incomplete work, how I would never try to steal intellectual work two weeks before I'm supposed to graduate, how if I had known this was possible I would I have turned in nothing, but they are having none of it. I will never forget how they asked me why I, \"didn't just photocopy the textbook and submit that\".  \n\nGiven that I had a derogatory mark on my record from my sophomore year when I (stupidly) cheated of my friend[.] test, they found grounds to *immediately* remove me from campus. As in, they told me I had 6 hours to pack my things and leave or they would call the police and I would be found guilty of trespassing. I cried as I had to quickly pack my things and move back in with my parents who were beside themselves. I later saw a rumor on the campus YikYak that I had been expelled for rape, which really drove the dagger into my heart. My girlfriend left me later that week and the silence I received from friends was deafening. I had been deeply involved in the campus community, at one point serving as the Vice President of the Student Body, serving on the committee that selected the new University President, and many other groups on campus. I was to be one of the three students who spoke at the graduation ceremony, and I was to carry our class banner as we entered the ceremony.  \n\nThankfully my story has a happy ending (so far). By the time my classmates were crossing the stage, I had already found a job and was gainfully employed. Where I had been myopic about my future after college, I now suddenly had a fire to regain what was taken from me. I'm on track to finish my bachelor[.] this year while also working at a Fortune 500. I've never shared this story with anyone who doesn't know me closely, and I'm hesitant to speak to a professional counselor about my struggles with this and an abusive ex-girlfriend, and perhaps that[.] something I should do. I hope someday I'm able to prove that you can lose everything and still persevere and rebuild. Every year on April 25th, the day they expelled me, I take myself out to a nice restaurant and promise not to let something like that happen again. \n\n**Edit**: The amount of support has floored me. You guys are really great. I just booked my first ever counseling appointment after a ton of you suggested to. Do yourself a favor and have a nice meal on the 25th for me :) Cheers!"}