{"doc_id": "520", "name": "2017_10_humanities_student_major_2866_exmormon", "namespace": "we1sv2.0", "metapath": "", "pub": "exmormon", "title": "2017-10-humanities-student-major_2866_exmormon.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.077", "Subjectivity": "0.305", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "295", "Permalink": "http://reddit.com/r/exmormon/comments/79kh79/i_feel_like_an_anomaly_on_hereim_a_girl_who/dp2p8fa/", "Threadlink": "http://reddit.com/r/exmormon/comments/79kh79/i_feel_like_an_anomaly_on_hereim_a_girl_who", "Parent_id": "t1_dp2oobl", "Reddit_id": "dp2p8fa", "Subreddit_id": "t5_2r0gj", "Commenter": "Word2daWise", "length": "1547", "content_scrubbed": "To me, the word \"confused\" can sound negative. I prefer other ways of looking at it. If you went into a wonderful restaurant and could pick anything off the menu, and there were many things that appealed to you, but you had only a set amount of time to eat and a certain budget, it would be difficult to make a decision at first. If you were allowed to sample several dishes in order to taste them a bit, that would help. Some dishes would not be what you expected them to be. Some would be things you never even considered. Eventually, you'd find what you wanted to eat, and it might be a mixture of things. Nothing wrong with that. \n\nAll teens (at least in the USA, and even more so in the church) are spoon fed the idea that they should plan their futures NOW. They're supposed to pick a college major before they even sign up. For that matter, maybe college isn't the_right thing for some people, but they're pushed into it. It[.] even worse for young adults in the church, because on top of college, the church prefers a specific college (BYU), and pushes people to serve a mission, and get married quickly, and have a ton of kids. Oh, and live by a set of rules that make no sense at all. \n\nEnjoy college. I still take courses and I have several degrees & teach at a university. I could have majored in a ton of things. I also could have followed a profession in the arts (but I had children to support, so I didn't think that would work out). Don't even worry about it for now. \n\nSample the menu until you find what tastes best to you. \n"}