{"doc_id": "357", "name": "2017_10_humanities_student_major_1229_gendercritical", "namespace": "we1sv2.0", "metapath": "", "pub": "GenderCritical", "title": "2017-10-humanities-student-major_1229_GenderCritical.txt", "pub_date": "2017-10-12T00:00:00Z", "Sentiment": "0.045", "Subjectivity": "0.266", "Score": "21", "Upvotes": "0", "Downvotes": "0", "Wordcount": "522", "Permalink": "http://reddit.com/r/GenderCritical/comments/7631lk/the_transgender_dilemma_at_an_allmale_college/doaxp7l/", "Threadlink": "http://reddit.com/r/GenderCritical/comments/7631lk/the_transgender_dilemma_at_an_allmale_college", "Parent_id": "t3_7631lk", "Reddit_id": "doaxp7l", "Subreddit_id": "t5_2yk5v", "Commenter": "heidischallenge", "length": "3222", "content_scrubbed": "SKIP THE ADS\n\n\ntheodysseyonline. com\nThe Transgender Dilemma At An All-Male College\nMegan Keleman\n\n\nIn recent events at Wabash College, a Liberal Arts College for men, a debate in our Student Senate voted on whether or not transgendered students should be allowed admittance into the college. It came down to a unanimous vote against the proposition. The denial of the proposal has caused many moral conversations among students. The funny thing is that we, the students at Wabash College, are not that vocal about our opinions on the issue. Opinions have only been shared on Yik Yak, where opinions are typed down like graffiti in a bathroom stall.\n\nThe transgender issue at Wabash College is sectioned into three groups: conservatives, liberals, and traditionalists.\n\nThe conservative side has rejected the proposition, saying the usual moral guidelines as to why being transgender is wrong.\n\nThe liberal side is saying that the issue proves the college[.] bigotry and that it shows a lack of diversity.\n\nLastly, the traditionalists think nothing of the rising issue, but they wish to uphold the tradition of Wabash being a college for men.\n\nAlthough all sides have their negatives and positives on the table, the issue has become something that it should have not become. It has become political.\n\nThe Yik Yak bathroom stall states, \"Keeping a school for men, for men, amen.\"\n\nA reply that can be seen as leftist stated, \"OP[.] (original poster) rhetoric sounds like that of white men back in the 50[.] when Wabash was an all-white male institution and wanted to keep it like that... this OP goes hard in the bigotry... they don't even understand that sexual preference and gender are completely different.\"\n\nThis back and forth nonsense has infiltrated YikYak and it has made the platform a political forum board rather than bathroom stall humor.\n\nOn the traditional side, one stated, \"Sounds like student senate voted to uphold the nearly 200-year-old tradition of Wabash being a college for men.\"\n\nThis position avoids the political banter that has accumulated at Wabash College. This standpoint does have honor, but it can be seen as bigotry. The one thing that all three sides cannot see is the geographical region where Wabash resides.\n\nWabash College is in Crawfordsville, Indiana, a mostly conservative state which has many protestant views. The admission of transgendered students in the bible belt will not only cause havoc within the community, but it would also cause moral questioning in areas where honoring tradition is evident. Earlier in the fall semester, a group of Christian extremists came to campus. They had the usual hate speech that stirs students stomachs and if Wabash College accepted transgendered students, then those extremists would have more wood to add to their fire. The point is, if the admission of transgendered students is allowed, more extremists may come and the community around Wabash will question the decisions and worth of the college.\n\nAlthough there are positives and negatives to the issue, there are no concrete answers. When the topic of transgender students being admitted into the college is solved without political or moral compromises, then an answer can be reached.\n"}