{"doc_id": "1246", "name": "2017_04_humanities_student_major_3083_okcupid", "namespace": "we1sv2.0", "metapath": "", "pub": "OkCupid", "title": "2017-04-humanities-student-major_3083_OkCupid.txt", "pub_date": "2017-04-27T00:00:00Z", "Sentiment": "0.021", "Subjectivity": "0.38", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "839", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67w57z", "Reddit_id": "dgtv7da", "Subreddit_id": "t5_2rct2", "Commenter": "midnightrambulador", "length": "5181", "content_scrubbed": " brands you have encountered in dating\n\nAs a straight guy in his twenties using OKC and Tinder in the Netherlands, I've encountered the following types:\n\n**INTELLECTUAL**\n\n**The cute quiet bookworm:** Really smart and adorably wholesome. Likes tea, cats, and classic literature. Probably plays a classical instrument. Follows politics well but doesn't have a lot of strong opinions (or is too shy to state them). Sex drive either nonexistent or heavily repressed. Slight overlap with the \"gamer girl\", below.\n\n*What Do:* Message her against my better judgment (adorable as she is, I'm loud and opinionated and I need someone who will be loud and opinionated right back at me) and have a polite, intellectual, but utterly bloodless conversation that quickly fizzles out.\n\n**The debate team champ:** Intellectual, political; sometimes active in the youth organisation of one of the more moderate parties. Snobbish and not ashamed of it. Full of sarcastic wit. Confident to the point of arrogance. Rare in the general population; even rarer on dating sites because she can usually get all the dates she wants from her busy IRL social life.\n\n*What Do:* Go all \"FUCK YEAH FINALLY I'VE FOUND ONE\", which tends to scare her off sometime between the first and the second date. :(\n\n**BASIC**\n\n**The basic bitch:** Wears tacky loose-fitting clothes like \"tit curtain\" tops and those giant shawls that end below the waist. Photos include her smiling awkwardly over a glass of white wine (plate of generic fancy food optional); her smiling awkwardly on a rooftop at night with the lights of some random city in the background. No strong personality or opinions. Huge majority on Tinder (and in the population at large); thankfully underrepresented on OKC.\n\n*What Do:* Roll my eyes at so much blandness, and swipe left.\n\n**The** ***super*** **basic bitch:** Duck faces, Snapchat filters, over-the-top make-up... you know the drill. Usually Arab or Asian.\n\n*What Do:* Accept that these people just exist in a completely different universe, and swipe left.\n\n**The surfer girl:** Slim, blonde, and tanned. Wears straw hats. Has lots of pictures from backpacking trips in tropical countries, and always at least one where she[.] drinking cocktails out of a watermelon/mango/coconut.\n\n*What Do:* If she[.] hot, send a low-effort message and get ignored. If not, scoff and hide her.\n\n**The creepily intense:** Spouts lots of generic emotional statements about \"honesty\" and \"loyalty\" and \"seeing people for what they really are\". Her pictures have her parents or grandparents in them which is all kinds of awkward. Dog person; likes animals in general. Shares cancerous FB posts of the \"like if you love your grandma\" variety. Very often overweight. Probably got fucked over really badly in the past which is what made her so weirdly intense and unstable.\n\n*What Do:* Run like hell.\n\n**IN BETWEEN**\n\n**The gamer girl:** Likes anime, fantasy, video games and LARPing. Dyes her hair purple or blue. Cultivates a \"cute and cuddly\" image, peppering her messages with tildes and kitty-face emojis. Often, but not always, overweight. Usually on the younger end of my age range. One of the two types that was heavily represented on OKC when I joined (~2 years ago) and the site was still very much a niche thing in this country. (The other type was the \"artsy hipster\", below.)\n\n*What Do:* Only message if I'm really desperate for attention (i. e. about 80% of the time).\n\n**The artsy hipster:** Black-and-white photos of her looking bored. Hair in a bun. Profile consists of a few short, faux-deep sentences. Sometimes calls herself \"sapiosexual\". Almost always lives in Amsterdam, though there[.] a small population in Utrecht as well. Was damn near the majority on OKC when I first joined, but as OKC has become more popular in the country its userbase has become more varied. And really the schtick seems to have fallen out of fashion in general.\n\n*What Do:* Roll my eyes and ignore.\n\n**The punk chick:** Wacky hairstyle, piercings. Either overweight or really skinny. Entire life seems to revolve about SJ issues (radical feminism, anti-racism, anti-capitalism, etc.). Probably identifies as \"genderqueer\" or whatever the trendy identity du jour is. Basically a walking stereotype that seems to have stepped right out of a US college town.\n\n*What Do:* Work myself into a fury over the stupidity of her profile, then hide her.\n\n**The hot Southern European:** Spanish, Portuguese, Italian, or sometimes French. Here for work or education. Not intellectual, but certainly *refined* in a way that doesn't really exist in Northern European countries. Likes dancing, wine, and smoothness.\n\n*What Do:* Fantasise about messaging her, then realise she[.] on such a different wavelength from me that I don't have a snowball[.] chance in hell, and give up.\n\n**The hippie:** Wears round sunglasses and baggy pants. Goes to psytrance festivals, which is where all her pictures were taken. Smokes weed. Cuddly and sex-positive, often polyamorous. Some overlap with the \"punk chick\", above.\n\n*What Do:* Message her in hopes of an easy lay, get rightfully ignored after she reads my profile and sees I'm not her type at all."}