{"doc_id": "1040", "name": "2017_04_humanities_student_major_1096_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_1096_AskReddit.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.04", "Subjectivity": "0.32", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "678", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64je9g", "Reddit_id": "dg2we95", "Subreddit_id": "t5_2qh1i", "Commenter": "Lord_Fozzie", "length": "3864", "content_scrubbed": "Absolutely not.\n\nI struggled over this so hard when I was in undergrad and trying to pick a major because-- due to untreated mental health problems and etc.-- I wasn't going to be able to get any degree that involved passing a math class (which even included most of the social science degrees at my school). And I felt like such a goddamn waste because of it.\n\nI thought I was doomed to be a burden on society and my parents-- never making any money and never really being of use to anyone. Like if the zombie apocalypse came, who the hell would pick the art history expert for their survival squad? Yeah... who really cares about the pottery of the Cupisnique when we're all just trying to keep our brains in our own heads long enough to mount a defense?\n\nThe turning point for me was reading \"Zen and the Art of Motorcycle Maintenance\". That book made me realize for the first time that my skills-- \"soft\" skills though some may call them-- were actually as vital to the world as any others. And it helped me realize how to use them to make money in today[.] 'if you can't program-- we really don't care' job market.\n\nTo sum that shit up: basically the world[.] most brilliant surgeon (for example) is still dead useless if that person can't communicate their thoughts well, nor come up with, analyze, research, and learn new skills. That Super Surgeon is also useless without the correct tools for their job, people to support them mentally and physically as they spend their time practicing and doing surgery, a comfortable and efficient environment to do surgery in, and people to help take notes and records and etc. etc.\n\nWe happen to live in a world where we're all pushed to be the super surgeon-- at least so long as we're still in school. Because that[.] a role that[.] considered to be the pinnacle of intellectual achievement. But in the real world Super Surgeon person seriously *does not exist* without a hundred other people-- including everyone from their kindergarten teacher, to their PA, to the industrial designer who designed their scalpel, to the scribe or videographer documenting their work and training, to the paralegal of the lawyer who defends them if they screw up-- supporting their work.\n\n*At least* until society collapses into a zombie apocalypse-- a liberal_arts degree will always be worth *something*.\n\nAnd even after the zombie apocalypse comes, I know I'd want a couple BA[.] on my survival squad. Look at all the Hunger Games peeps! Not a science degree among them! You damn right I'd rather have the Roman history scholar on my team than the Comp Sci bro. Yeah-- you can do a lotta cool shit with Java-- but you can't fix a printer with it and you damn sure can't use it to weld armor plating to your mad max school bus!!! (BTW shout-out to my fellow art historians with a specialty in film history for being able to tell their fellow survivors in obnoxious detail exactly where the armor plating was placed in, say, the Dawn of the Dead remake-- and where the original design[.] flaws were.)\n\nAnd the Cupisnique envisioned their destruction goddess as a giant, flying, fanged, spider-beast that would decapitate people and carry their heads around in her net... So now we know what to paint on the zombie-defense bus too.\n\n_________________\n\nps. even tho I'm being a little silly here-- for real: I have an art history degree but worked as a network tech, then engineer, then network security for about 10 years. I have never in my life even attempted a calculus course.\nIf nothing else, any liberal_arts degree will teach you how to think critically, research, analyze, and coherently express ideas. That[.] stuff that they don't really teach in, say, civil or electrical engineering. Some people will try to say they that they *do*-- but 10 years of \"real life\" experience has taught me those people are dirty, dirty liars.\n\n\n"}