{"doc_id": "921", "name": "2017_04_humanities_student_major_46_criticaltheory", "namespace": "we1sv2.0", "metapath": "", "pub": "CriticalTheory", "title": "2017-04-humanities-student-major_46_CriticalTheory.txt", "pub_date": "2017-04-01T00:00:00Z", "Sentiment": "0.064", "Subjectivity": "0.416", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "436", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_62gsl0", "Reddit_id": "dfp303x", "Subreddit_id": "t5_2tmcb", "Commenter": "Y3808", "length": "2627", "content_scrubbed": " 'It cannot be denied that the university is a place of refuge, and it cannot be accepted that the university is a place of enlightenment. In the face of these conditions one can only sneak into the university and steal what one can. To abuse its hospitality, to spite its mission, to join its refugee colony... to be in but not of – this is the path of the subversive intellectual in the modern university'. \n\nThe above is exactly what I thought of universities the closer I got to finishing my undergrad degree, and the more glimpses I got of graduate school and the working lives of my professors.\n\nThe end result was the conclusion that I wouldn't accept a PhD scholarship if it were offered to me out of the blue, because it would not be so much higher learning as it would be conditioning to submit to an academic lifestyle. I don't think it would be possible to maintain that above quoted attitude for a decade.  The university isn't offering their slips of paper for free, they want your soul for it. Even as a strong-willed person who isn't uncomfortable being the lone voice of disapproval, I would be afraid that they would get it from me eventually.\n\nI am in America, not Europe, for what that[.] worth.\n\nI think this situation is becoming apparent in multiple facets of American society, not just universities.  Each institution or segment of institutions is heading toward an inevitable impasse. \n\nCorporations have hoarded all of their profits outside of the economy that gave it to them in cash to avoid taxation, which results in an untenable long_term economic situation. \n\nThe supposedly 'woke' 60s generation has submitted to the yoke of predatory debt, which has the result of maintaining grossly inflated prices of the staples of the American economy that is beyond the reach of the subsequent generations (houses, cars, etc.)\n\nEven the 'profitable' fields of study (medicine, law, STEM research) are slaves to this system, as their graduates do not get scholarships like the humanities. Their students pay, and the massive amounts of student loan debt those students carry into their professional lives affects the economics of their respective professions as well.\n\nRacial minorities have been exploited for prison profit to the point that they are organizing open revolts against police.\n\nAnd the deluded generation of post-WW2 communist boogey man propaganda thinks that they can magically re-conjure their whites-only 1950s utopia by voting for orange spray tanned fascists and snake handling televangelists.\n\nIt[.] tribalism on a grand scale, and all of the tribes are full of self-destructive idiots. \n"}