{"doc_id": "1222", "name": "2017_04_humanities_student_major_2778_purplepilldebate", "namespace": "we1sv2.0", "metapath": "", "pub": "PurplePillDebate", "title": "2017-04-humanities-student-major_2778_PurplePillDebate.txt", "pub_date": "2017-04-24T00:00:00Z", "Sentiment": "-0.02", "Subjectivity": "0.336", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "504", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgpgikw", "Reddit_id": "dgphn0t", "Subreddit_id": "t5_2ya42", "Commenter": "despisedlove2", "length": "2972", "content_scrubbed": "What you don't understand is the depth of contempt in which social \"science\" was and is held in at my end of the campus.\n\nIn that case, your end of the \"campus\" (because like fuck do I believe you buddy but ok) are bad academics. A good academic understands the purposes and different ways of functioning of the full breadth of the academy, not just their own narrow little corner. Let me guess, you're an engineer?  \n\nFor starters, you aren't my buddy. I am a little choosy in picking friends. What I have seen so far of you doesn't pass muster.\n\nSecond, you do need things like psychology, literature, humanities, etc in academia. For centuries, they have enriched human thought. But ever since they became infected with feminism, they have become actively dangerous to the society.\n\nTake history for instance. In the normal run of things, an extremely important major at any school. Unfortunately, nowadays it is dying in grad school, with all but a handful of programs directed at feminist \"history\" (read grievance politics). Archaeology has suffered a massive funding cut every single appropriations since 2003. At my previous school, which is fairly well endowed, they haven't hired anyone in real history since 2007.\n\nWhat we have seen instead is that instead of scholarship that sheds light on burning questions like antiquities in the middle East, or native American cultures, all of the relatively new hires since the mid 90s across humanities (so going well beyond history here) are busy turning out crap and participating in campus witchhunts against \"unacceptable\" thought. Since I left, two colleagues (one of whom is a dear friend given that I introduced him to his wife) have been attacked, once even physically, by products of feminist indoctrination. His fault? Not talking enough about contributions of women in his class on ancient linguistics.\n\nSo, yes, we had already started holding Departments that are not a part of science, medicine and engineering, in fair degree of contempt back in the day. With safe spaces etc, my former campus has become a place for feminist ninnies to shout their junk unquestioned, rather than what it was meant to be - a place where every idea was questioned and studied if necessary.\n\nYes, I am an engineer and a scientist and design processes for a living here in relatively uninfected India. Why so contemptuous? Hard to mix in female \"issues\" into bioprocess design?\n\nYou and your ilk have practically destroyed academia. No wonder you feel free to attack those of us who still know what academia is meant to be. Don't worry, your infections won't make it in engineering. You see, at our end of the campus, the litmus test, if you will pardon the pun, is that things have to work. And that has very little to do with the specific XYZ gender you are claiming to be that particular week, or even the nature of the physical equipment between your legs. Inconvenient fact for feminists to choke on. Pesky numbers.      "}