{"doc_id": "1075", "name": "2017_04_humanities_student_major_1440_askengineers", "namespace": "we1sv2.0", "metapath": "", "pub": "AskEngineers", "title": "2017-04-humanities-student-major_1440_AskEngineers.txt", "pub_date": "2017-04-12T00:00:00Z", "Sentiment": "0.121", "Subjectivity": "0.233", "Score": "26", "Upvotes": "0", "Downvotes": "0", "Wordcount": "282", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64zfc4", "Reddit_id": "dg6hljw", "Subreddit_id": "t5_2sebk", "Commenter": "fauxscot", "length": "1616", "content_scrubbed": "You can't get everything you will ever use from a 4-year education, more than half of which is non-major stuff (i. e., humanities, language, philosophy, literature, history, physical education, etc) that is usually mandated in any curriculum as \"general college\".\n\nThis applies to everyone.   Every single engineer.   A lot of engineers work on ONE PROBLEM for 4 years.   All aspects of it.  \n\nGiven that, and given the fact that whatever problem is assigned to you, it[.] almost certain you will face personal ignorance of some aspect of it.\n\nIt[.] a matter of degree.  Some things, you'll be quite familiar with.  Others, not at all.\n\nThe thing your degree proved is that you are able to work on a problem and a plan and get it done, eventually.    How fast and accurate you are is a reflection of a lot of things.\n\nYou have to keep this in mind as you self-criticize.  There will always be someone \"better\", faster, smarter, more experienced, etc. and someday, that will be you.  In a few decades, you'll see where you are really weak, and if you are wise, you will attack those weaknesses, if you desire to stay in your line of work.  \n\nIt gets better.  Use this job as your training ground for the next one and look at your work as a self-improvement exercise.  \n\nThis feeling you have is not specific to engineering.  It[.] endemic.  Feeling a little bewildered just comes with the territory sometimes.  It[.] not a character flaw to not have exactly the tool in your kit that you need every second of your life.   \n\nChill, amigo.  It[.] over before you know it, so enjoy it if you can.  Have fun solving problems.  "}