{"doc_id": "946", "name": "2017_04_humanities_student_major_249_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2017-04-humanities-student-major_249_UofT.txt", "pub_date": "2017-04-03T00:00:00Z", "Sentiment": "0.169", "Subjectivity": "0.434", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "719", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_634oc7", "Reddit_id": "dfrshzd", "Subreddit_id": "t5_2rbaq", "Commenter": "TheStudyOf_Wumbo", "length": "3979", "content_scrubbed": "I'm going to go full cookie cutter on this:\n\n i'm starting to like humanities more than STEM because it doesn't burn me out as much\n\n I personally find more personal enjoyment in humanities\n\nHaving done stuff I was not a fan of before doing this degree, you should really begin the switch ASAP... almost... (you will see why later)\n\n i'm majoring in biology if that matters, but I find it more intrinsically enjoyable to do French and other stuff humanities-related\n\nSince I used to do bio, I'd say don't let that one subfield scar you for life for STEM. It[.] IMO the least rewarding of all the science fields, unless you're doing biochem/orgo research where you have a direct effect on peoples lives. You spend all day memorizing stuff and not much to show for it. The exception is biochemical/organic chem because you'll be reasoning out reactions and spending time creating structures to carry out some result. Plus if you cure a disease, that[.] a good feeling.\n\nI've had infinitely more fun in math/CS courses because the proofs you learn make you feel fuzzy and nice inside when you solve them. What[.] even better about CS is you can then build things that solve actual problems in real time. You don't need to spend 10 days growing a cell line in a lab just to see if you succeeded or not, you press \"Run\" and if your project compiles and runs fine, you're good. You can also do math/CS/programming from anywhere on the planet almost.\n\nTherefore don't let some of the negatives of learning biology taint your view of STEM.\n\n perhaps, the humanities are easier to get a pass in, without failing, than the STEM subjects\n\nIMO STEM may actually be easier because there[.] a right answer and you don't get subjectively rated based on how well the TA likes you.\n\n why is this important?: well not only are my parents are a huge influence in my life, but i'm also deciding between pursuing a humanities graduate school or a sciences graduate school\n\nAre your parents by chance people who have done STEM work for a living?\n\nAlso you should be _very_ careful right now on what you want. Unless humanities graduate school is a joke, with STEM you're expected to sell your soul for it. If you have even the thought of \"I'm thinking of grad school\" compared to \"I am going to grad school unless someone shoots me\" then graduate school in STEM is not a good idea IMO. If you don't have this attitude, it can be a pain in the ass to make a career out of it.\n\n would you consider social psychology to be part of the humanities? it seems more so humanities in my opinion than STEM, but at the same time it can involve statistics and empirical data\n\nI draw the line at: Does the person publish novel data? Are they being peer reviewed? Is there some kind of underlying math or biology somewhere along the way? Or better yet, does it follow the scientific method?\n\n---\n\nSome thoughts:\n\nIf you want to do languages, make sure you are ready to do it every day non stop. The world is sadly a shittier place now where you need to work hard and can't just default like the old generation to \"become a line worker if stuff fails and live happily ever after\", and I'd even be worried about specializing in languages because eventually Google Translate will make translators not as useful (or rather the need for them will be so small that my guess is it'll be a horrible struggle unless you've lived in the language).\n\nI consider humanities more of a enjoyable pastime since it can feel very rewarding to read a beautiful book, create music, ponder some beautiful philosophy questions. Math eventually has this too but most people [who never take proof math] never see this.\n\nI also wonder if your parents just want you to find a job with a reasonable salary. I don't know if humanities affords this to you or not. At least in CS currently, I can almost pick up a job anywhere, or move to any tech hub and have no fear of being unemployed. It[.] pretty nice, despite the insane stress of this degree."}