{"doc_id": "1278", "name": "2017_04_humanities_student_major_3296_fencesitter", "namespace": "we1sv2.0", "metapath": "", "pub": "Fencesitter", "title": "2017-04-humanities-student-major_3296_Fencesitter.txt", "pub_date": "2017-04-29T00:00:00Z", "Sentiment": "0.097", "Subjectivity": "0.243", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "326", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_68azxy", "Reddit_id": "dgx34ep", "Subreddit_id": "t5_38fvu", "Commenter": "permanent_staff", "length": "1823", "content_scrubbed": "There[.] no connection between loneliness and not having kids. Yes, there might become a period in your late twenties, early thirties when you could feel left out and rejected when seemingly everyone in your peer group starts popping out babies and disappear. But I assure you that if you are the only one in your friend group who wants and has kids, that same experience applies. Try being a liberal_arts major who wants kids before 25!\n\nI'm a few years older than you, currently single, and I have a decent circle of friends. I hang out with someone at least twice a week and exchange messages with several people every day. I usually find someone to have lunch or coffee with on a relatively short notice. Tomorrow I'm hosting a party for around twenty people. Some of my friends have kids, most don't, and that[.] not really an issue that comes up. My friends are the most valuable thing I have. And I say this as an introvert who isn't even that outgoing. \n\nI don't really expect this to change. I've deliberately built my social life from the ground up, and I know I could do it again should I have to move. There will always be like-minded people, with kids or without, older or younger, who think I'm interesting, dependable and fun to be around. And as someone who doesn't have kids, I have way more time and energy to seek these people out and really invest in my relationships, and I know how to do it. It[.] easier to be a good friend when there[.] no family taking up all your social resources.\n\nAs for the *how* of making friends and building your tribe as an adult, a lot of practical advice could be given, but for now I just want to emphasize that it can be done, and not having kids doesn't mean you'll be lonely, [not even at an older age](http://sciencenordic. com/older-people-just-happy-without-children).\n"}