{"doc_id": "1184", "name": "2017_04_humanities_student_major_2469_90daysgoal", "namespace": "we1sv2.0", "metapath": "", "pub": "90daysgoal", "title": "2017-04-humanities-student-major_2469_90daysgoal.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "0.149", "Subjectivity": "0.392", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "370", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65uuv6", "Reddit_id": "dglq0dm", "Subreddit_id": "t5_2s0sd", "Commenter": "getitgetbetter", "length": "2162", "content_scrubbed": "Good morning!\n\nLast round, some of my major goals were to reincorporate the gym into my life (moderately successful, but highly susceptible to schedule changes), use therapy to kick my ED and depression (I've since stopped therapy, but Really Bad days or behavior-using days are definitely more \"blips\" in my life as opposed to constants--and I'm well over a month purge-free!), read more books (successful), track my food in a healthy way (successful), and find a second job (successful!)\n\nA bit about me: I am a 24-year old combination freelance dancer/performer/choreographer and arts administrator. I work in a box office three days a week, manage a mid-sized dance company as a freelance/virtual office position, an manage a small theater company that I also regularly perform with (and am currently in LA with for a week on a grant) as needed based on our projects. I'm also developing a show that goes up this summer, and performing freelance around the arts-loving city I'm in.  I'm ALSO signed up to complete a Tough Mudder with my partner in mid-July.\n\n**Goals for this round**:\n\n* Up the gym (or exercise--running and/or dance class) to five days a week\n* Follow running schedule to work up to Tough Mudder distance\n* Stop slacking on dance classes (min. 2/week)\n* Continue to track food using visual apps (Rise, Insta)\n* Complete and be bold about marketing my show (opens August 5, so this sprint is beautifully timed!)\n* Continue to use healthy coping mechanisms/therapy exercises to keep depression and ED behaviors in check\n* Develop a weekly schedule for myself to properly juggle all of the jobs and virtual office environments\n\n**For Sprint 1**\n\n* Run 3 days a week (1 short, 1 mid, 1 long) to work \"long runs\" from 4 miles to 7 miles)\n* Pull-up training 2-3 days/week\n* Dance classes 2 days/week\n* Use Rise and Insta daily for food logs; make good food choices\n* Draw and implement a weekly schedule for multiple jobs\n* Finish show script, hold auditions (already scheduled), set rehearsal schedule and begin working with cast 2 days/week\n* Continue to read 1 book/week\n* Binge/Purge Free Streak\n* Dailies: Skin care, read news, tidy/make bed"}