{"doc_id": "430", "name": "2017_10_humanities_student_major_1907_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_1907_AskReddit.txt", "pub_date": "2017-10-20T00:00:00Z", "Sentiment": "0.144", "Subjectivity": "0.274", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "308", "Permalink": "http://reddit.com/r/AskReddit/comments/77ifvp/millennials_what_are_you_sick_of_hearing_baby/domz5v4/", "Threadlink": "http://reddit.com/r/AskReddit/comments/77ifvp/millennials_what_are_you_sick_of_hearing_baby", "Parent_id": "t1_dom4bx5", "Reddit_id": "domz5v4", "Subreddit_id": "t5_2qh1i", "Commenter": "manookings", "length": "1710", "content_scrubbed": "Millennial here:\nCollege is a joke, but one strategy I used to 'adapt' to the rediculous cost is I lived at home and study at a local, state funded University. Cost 4-6k per yr depending on how many classed you took. Did a BS and MS in engineering, was fortunate enough to find a part_time job with a tuition reimbursement program. Walked out with a masters degree and zero debt. Fast forward 6 yrs and i am making just over 130k, own two homes (we rent out one and are able to cover the mortgage and have profit left over from rental income). Have just over 200k i savings (between retirement, personal savings, and college money for kids) and we have paid off all our cars, loans, and everything except the mortgage (give me another 10 yrs and that will be gone too) and i just turned 30. \nI certainly recognize i have been extremely fortunate, but here is my two cents/advice:\n*Dont worry about being a loser living with your parents until the age of 24 (if you are in school)\n*Study at a local, public school (going 100k in debt to study out of state and live on your own isnt worth it).\n*Get a good degree; anything in STEM is good. Stay away from very generalised degrees (communications, liberal_arts,  anything whose degree includes the word [.]tudies')\n*Save something, anything. Even if its 1$ a week. The habit of saving something while you are a poor college student will pay dividends later.\n*Good degrees open up opportunities for paid internships while studying, most companies who have paying internships will pay for your school.\n\nGranted life is much harder for students these days, but that just means you have to adapt. There are options out there, you just have to loom harder to find them."}