{"doc_id": "1053", "name": "2017_04_humanities_student_major_1228_stownpodcast", "namespace": "we1sv2.0", "metapath": "", "pub": "stownpodcast", "title": "2017-04-humanities-student-major_1228_stownpodcast.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.017", "Subjectivity": "0.252", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1388", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg45tgw", "Reddit_id": "dg45ust", "Subreddit_id": "t5_3jiuj", "Commenter": "audio_bravo", "length": "7523", "content_scrubbed": "Part 4\n\n(phone ringing) \n\nBill: Hello?\n\nB: Hi, is this Bill Meyer?\n\nBill: Yes.\n\nB: Hi, um Bill, were you a friend of John McLemore[.]?\n\nBill: Yeah?\n\nB: Um, I'm calling with some sad news that maybe you're aware of, but he passed away earlier this summer.\n\nBill: Who did?\n\nB: John B. McLemore, yeah.\n\nBill: Oh, I didn't know that! I've been uh, writing emails to him and he hasn't uh responded. And I called him I think... oh, what'd he die from?\n\nB: Uh, he actually committed suicide I'm sorry to say.\n\nBill: Oh for god[.] sake. What happened to his mother?\n\nBill Meyer, number 7 on John[.] list. Clearly he wasn't called. Bill was a friend and clock customer of John[.] for decades. He lives in Utah, in a house he describes as being more like a museum than a house. He'd drive from Utah to Alabama sometimes to visit John.\n\nBill: John seems to have made a insurmountable challenge out of living. It[.] so sad to hear that he finally did it. It just, uh, it just makes me so incredibly sad.\n\nMachine voice: Hello. You have reached micros and the escapement maker.\n\nThis is the answering machine of a horologist friend of John[.], in a small town in the pacific northwest, who asked that I not use his name because he[.] very private. He picked up as I was leaving a message. He says Faye did tell him John had died, but only after the funeral.\n\nHorologist Friend: John meant a hell of a lot to me. He meant a hell of a lot to me. \n\nAnd then another Brit from the list, Duncan Grieg. \n\nDuncan: At the moment, I've in front of me got a whole load of letters and photographs that John[.] sent me over the years.\n\nA respected clock restorer from Tonbridge, England, who never met John in person but over more than a decade spent many late-night hours developing a friendship with him on the phone and via letters. I was the one who informed Duncan of John[.] death.\n\nDuncan: Yeah as you can probably tell I'm very sad about it. I think he should have gone on to been a curmudgeonly old gentleman that survived the ravages of time. \n\nTom: The enigma that John McLemore was.\n\nAnd Tom Moore, John[.] chemistry professor in college, now a university chancellor who went on to become a lifelong friend.\n\nTom: One of the most incredi – I'm gonna start crying. I can't help it (crying a bit).\n\nB: It[.] OK.\n\nTom: (teary voice) One of the most incredible people I've ever known.\n\nLike with others, Tom says the town clerk, Faye, did call him about John[.] suicide, but only after he'd been buried. After talking to the seven people at the top of John[.] list, I learn that none of them were at John[.] funeral because none of them were contacted in time, and some not at all. \n\nIt was interesting. Most of these men didn't know each other beyond maybe having interacted once or twice in horological circles over the years. The men talked to me for hours, without batting an eye, even if I'd just called them cold and informed them that their friend had committed suicide. Which, at first I thought was pretty remarkable. But then it occurred to me that they were all friends of John B. McLemore[.]. Which means you are predisposed to having long, rambling conversations on the phone. Of these friends, the one who knew John the longest, since he was a teenager, was Tom Moore, John[.] college professor. John showed up in Tom[.] general chemistry course as a freshman at Birmingham Southern College in the early 80s.\n\nTom: Walk in to a class of 85 to 95 students and look around, and boy, what[.] that kid doing here?\n\nBirmingham Southern is a small, private, liberal_arts college that[.] been around since the 1800s. Tom says at the time when John was there the student body was made up largely of children of professionals: doctors and lawyers. They were preppy. John was not.\n\nTom: Bushy red hair, unkempt, clothing from a different socioeconomic background. He was clearly different.\n\nTom says John didn't make any friends at Birmingham Southern, and he didn't live there. Every night he drove back to his parents' house. Back to his childhood bedroom. Back to Bibb county. And Tom could tell that as much as John didn't fit in at college, he didn't fit in back home either. Tom got the sense that John had been picked on a lot over the years, growing up.\n\nTom: He would do things, uh, as a college student to bring ridicule on himself. I want to say he would wear a red wig, or a green wig to class. \n\nSure enough, Tom says, the other kids would laugh at him. And that was the point.\n\nTom: I took it to be out of, this history that, I'm gonna be made fun of. And I can't stand being made fun of just by being who I am. So I'll do some things that enable me to understand why people are making fun of me, and it[.] not just me being me. It[.] pretty tragic. I saw that in him, and that[.] part of why I reached out to him.\n\nJohn B. McLemore[.] education is the source of some gossip in Woodstock. I have heard that he held multiple degrees: in chemistry, in biology. I have heard that he quit school because he was smarter than the professors. I have heard that he had to leave after blowing up a laboratory. The reality was less dramatic.\n\nTom: He was bad at school.\n\nJohn was a college dropout. He left Birmingham Southern after three years. According to Tom, if John was studying a topic he was interested in, he would learn it exhaustively. Tom spent many afternoons watching John scribble on the blackboard in his office, obscure calculations and theories that were beyond even Tom[.] comprehension. But when it came to stuff the professors wanted him to focus on, John was almost allergic to it. Tom thinks John got a D or maybe a C in his chemistry class. But John spent hours in the lab on his own, outside of class, figuring out techniques he could use in his clock restorations. Tom risked getting in trouble and let John access the lab when he wanted. Remember this?\n\n(sound of pouring)\n\nJ: (whispering) There you go, there you go,\n\nWhen John gold-plated a dime for me in his workshop one afternoon?\n\nJ: I may be dead and gone one day but you'll have a souvenir from Shittown, Alabama.\n\nTyler: A golden penny.\n\nJ: A gold dime! \n\nTyler: Oh!\n\nJ: A motherfuckin gold-plated dime! Shit. \n\nI do still have the dime, by the way. That electroplating process, John worked it out as a student at Birmingham Southern as a way to gild clock pieces that doesn't require burning dangerous amounts of mercury. It uses potassium cyanide instead.\n\nSometimes in college when John came into Tom[.] office in the afternoon for one of their blackboard sessions, Tom says John would seem depressed, to the point where Tom thought, he might be trying to say goodbye for good. Tom says he recommended John to a school counselor, and John saw her for a bit, even went on medication, but according to Tom, John didn't like the way the medicine altered his personality. And he chose not to seek any more treatment. \n\nTom figured out that if he asked John to tell him about a clock he was working on, or some other topic he was studying, he could get John excited and redirect his attitude so that by the end of the session he would seem lifted out of his despair. Though this could take hours. Tom says he can vividly remember sitting in his office with John on a fall day, glancing at the sun while it set outside his window, watching the sky turn colors over campus as he thought about his wife waiting for him at home, but looking back at John and thinking,\n\nTom: That I'm not sure John[.] ready to go yet. \n\nThen listening to John go on, as outside the sky turned dark."}