{"doc_id": "519", "name": "2017_10_humanities_student_major_2864_apstudents", "namespace": "we1sv2.0", "metapath": "", "pub": "APStudents", "title": "2017-10-humanities-student-major_2864_APStudents.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.182", "Subjectivity": "0.545", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "314", "Permalink": "http://reddit.com/r/APStudents/comments/79jy96/how_do_you_feel_about_your_ap_classes_so_far/dp2ogso/", "Threadlink": "http://reddit.com/r/APStudents/comments/79jy96/how_do_you_feel_about_your_ap_classes_so_far", "Parent_id": "t3_79jy96", "Reddit_id": "dp2ogso", "Subreddit_id": "t5_2y9jq", "Commenter": "reedyyeet", "length": "1717", "content_scrubbed": "AP Stats - Really easy and enjoyable. The teacher is easygoing and tells us tons of funny stories. The only con is that I am literally the only junior, everyone else is a senior.\n\nAP Lang - This class is pretty aids. We spent the first 3-4 weeks discussing our summer reading (Grapes of Wrath, and Desert Solitaire by Edward Abbey) and rhetoric in general. Don't ask me why we had summer reading for a Lang class. The next 3-4 weeks we spent reading The Awakening by Kate Chopin and basically just taking reading quizzes on the book and having class discussions. My teacher hates standardized tests I don't think we've  worked on anything that will actually be relevant for the AP test.\n\nAP Gov - I have a great teacher for this class, who actually worked in the Oregon State government in the past. I'm not a humanities person and I really dislike the homework, especially the reading out of the textbook, but I enjoy my time in class for the most part.\n\nAP Calc AB - I love math, so this is my favorite class, one of the few I actually enjoy doing homework for. Plus, the concepts so far have been really easy, which is nice.\n\nAP Physics 1 - I love this class, but am somewhat worried about how my teacher is preparing us for the AP test. We spend one day in class learning how to do a specific type of problem (free-body diagrams for motion on an inclined plane, for example) and then a few days practicing that same type of problem until it becomes mindlessly easy - essentially, plug-and-chug. We don't really go in depth into the actual concepts, which worries me, especially considering how hard the test is for this class.\n\nOverall, I'm glad I took this schedule. It[.] not too hard, but certainly a challenge!"}