{"doc_id": "312", "name": "2017_10_humanities_student_major_713_joerogan", "namespace": "we1sv2.0", "metapath": "", "pub": "JoeRogan", "title": "2017-10-humanities-student-major_713_JoeRogan.txt", "pub_date": "2017-10-09T00:00:00Z", "Sentiment": "0.054", "Subjectivity": "0.361", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "237", "Permalink": "http://reddit.com/r/JoeRogan/comments/754bbz/love_the_podcast_but_does_joe_really_need_to/do4at85/", "Threadlink": "http://reddit.com/r/JoeRogan/comments/754bbz/love_the_podcast_but_does_joe_really_need_to", "Parent_id": "t1_do3n9t7", "Reddit_id": "do4at85", "Subreddit_id": "t5_2s4tv", "Commenter": "skeeter1234", "length": "1366", "content_scrubbed": "For thousands of years 99% of people were slaves or peasants.    \n\nFirst of all let[.] be clear.  For the human race has been around for 200,000 years.  Slaves and peasants have been around for about 5,000 years of that time - essentially they come about in civilization.  You might even say that civiization is synonymous with the existence of slaves and peasants - all the wonders of empire and progress get built by slaves and peasants.  Civilization is little more than a system of exploitation where a tiny minority benefit off the sweat of the majority.  You might say \"civilization\" is synomous with \"system.\"  So is \"this\" system different than \"previous\" ones.  I'd argue that it only is in terms of total amount of weatlh - the masters have much more material wealth, and so do the slaves, but it is still the same system of a tiny minority benefitting off the majority.  \n\nFor 195,000 years of humanities existence there were no slaves or peasants.  We lived in small tribal communities where everyone was essentially equal.  So I guess the question is which is better?  Any human system created so far?  Or the tribal way humans lived for the vast majority of its existence.  \n\nPoint is that humans have only been living in this unnatural way for a tiny sliver of our existence as a species.  Systems of *any* kind have only been around a tiny sliver.  \n\n"}