{"doc_id": "427", "name": "2017_10_humanities_student_major_1867_chicago", "namespace": "we1sv2.0", "metapath": "", "pub": "chicago", "title": "2017-10-humanities-student-major_1867_chicago.txt", "pub_date": "2017-10-19T00:00:00Z", "Sentiment": "0.079", "Subjectivity": "0.331", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "259", "Permalink": "http://reddit.com/r/chicago/comments/77i7vy/university_of_chicago_graduate_students_vote_to/domcuog/", "Threadlink": "http://reddit.com/r/chicago/comments/77i7vy/university_of_chicago_graduate_students_vote_to", "Parent_id": "t1_domb1iw", "Reddit_id": "domcuog", "Subreddit_id": "t5_2qh2t", "Commenter": "Erosis", "length": "1547", "content_scrubbed": "One of my graduate buddies told me that there was going to be some sort of divisional vote. I hadn't heard of that either before they mentioned it, so I don't know the validity of their claim.\n\nAs for evidence, I admit that there is little known about private school unionization to this degree. All of the examples of unionization that I know of are specifically tailored for the teaching aspects of graduate school. This unionization effort seems to cover much more and I would have preferred it to be compartmentalized. However, the lawyers made it into an all-or-nothing event.\n\nMany of the UC scientists rely on fellowships, grants, and stipends that are not linked to teaching. Many already have a more structured workday (with competitive pay) compared to humanities students. Experiments require varying amounts of time/effort that can't possible fit into a standard work week. Of the PIs in PSD, I have only heard of bad working conditions from one professor and they have been reprimanded heavily. I don't know what the situation is in the other departments.\n\nI definitely have criticisms with the administration. Student feedback goes up the chain of command quite slowly (often ignored). Additionally, serious problems with payroll remain unresolved for too long. I'm on my way out, so it doesn't affect me either way. I'm concerned about the future scientists.\n\nYou are a GSU rep, so I know your take is favored toward the unionization effort, but I would like to know if any of my criticisms or complaints are incorrect or misguided."}