{"doc_id": "1033", "name": "2017_04_humanities_student_major_1033_todayilearned", "namespace": "we1sv2.0", "metapath": "", "pub": "todayilearned", "title": "2017-04-humanities-student-major_1033_todayilearned.txt", "pub_date": "2017-04-09T00:00:00Z", "Sentiment": "0.166", "Subjectivity": "0.41", "Score": "56", "Upvotes": "0", "Downvotes": "0", "Wordcount": "370", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg29rkk", "Reddit_id": "dg2ab20", "Subreddit_id": "t5_2qqjc", "Commenter": "jordgubbe_head", "length": "2353", "content_scrubbed": "Yeah. There are 2 colleges in the area (Michigan Tech - a mostly engineering/science/math/business school and Finlandia U - a mostly nursing and liberal_arts school), so as long as your apartment isn't within a 5 block radius of their campuses, it[.] incredibly cheap. My apartment is right across the street from MTU and it[.] still only  $650/month including utilities and a sauna.\n\nMinimum wage is $8. 90/hour right now and is going up to $9. 25/hour as of next January, so that[.] pretty sweet. You can make a living on working a minimum wage job 40 hours/week.\n\nIf you like the outdoors or winter sports, it[.] an amazing area. National forests, lakes, waterfalls, Lake Superior. Hiking, camping, swimming, kayaking, canoeing, mountain biking, skiing, snowboarding, snowshoeing, etc. We get 25 ft (~8m) of snow per year, but it[.] not a big deal since the city takes good care of it. Plus snowplowing is included in a lot of people[.] utilities for apartments. \n\nOur summers are cool (it only gets over 85F for ~2 weeks in the summer) and winters are about the same average temperatures as Chicago. But with windchill, it can get to -40F, also not a big deal once you get used to it. Most people don't care after their first winter. You honestly come to love it, since everyone who doesn't live here thinks you must be a total badass for living in fucking Siberia or something, lol. \n\nThe only downsides are that the nearest mall is 1. 75 hour drive away, but we've got plenty of options here. Lots of local craft and sports shops. Lots of restaurants and bars. A Walmart, Walgreens, Shopko (grocery), Taco Bell, Dairy Queen, Culver[.], Super 8, Country Inn & Suites, Dominos, Pizza Hut, etc. (It[.] a little weird, national brands are actually really good up here. Dominos pizza is fantastic here.)\n\nIf you're looking for a vacation spot this summer, I'd say to give this place a try. You can sublet whole houses from college students during the summer for $500/month or an apartment for $100-150/month when classes aren't in session.\n\nEdit: [Here[.] the google results for images of the town, I can assure you that it is even more beautiful in person.](https://www. google. com/search?q=houghton+mi&client=safari&hl=en-us&prmd=minv&source=lnms&tbm=isch&sa=X&ved=0ahUKEwi-i9bunJnTAhXs5YMKHXsuDKcQ_AUICCgC&biw=320&bih=529)"}