{"doc_id": "1261", "name": "2017_04_humanities_student_major_3186_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_3186_AskReddit.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.032", "Subjectivity": "0.275", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "734", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgv8chp", "Reddit_id": "dgvjltb", "Subreddit_id": "t5_2qh1i", "Commenter": "Swiftzor", "length": "4655", "content_scrubbed": "Okay, lets look at his administration then.\n\n* Donald Trump, President - an over sized oompa loompa with microscopic hands who thinks you can run a country like a business by offering less for more, and trimming the \"fat\" by cutting out essential jobs and departments while buying bigger and bigger sticks.\n* Mike Pence, Vice President - A politician who believes that it is literally possible to \"pray the gay away\" and that we should ingrain religion into our government, literally breaking the first rule of government: the separation of church and state.\n* Rex Tillerson, Secretary of State - Wants less regulation, has ties deep financial ties with Saudi Arabia and Russia, actually supports the TPP (one of the worst trade deals in history), defends Common_Core\n* Steven Mnuchin, Secretary of Treasury - Very punchable face, authored the latest one page tax reform with little to no thought into it, prefers trade deals with individual countries instead of regional partnerships (why make thins so fucking complicated), wants to get rid of Dodd-Frank going back to a pre 2007-2008 collapse banking structure which fucked this country over.\n* James Mattis, Secretary of Defense - While in charge at USCENTCOM wanted to engage in hostilities with Iran and oversaw (a lack of operations) in Syria, doesn't believe ISIS/ISIL and Al Quaeda to be biggest threat in the middle east, doesn't want to collaborate with Russia to fight ISIS/ISIL.\n* Jeff Sessions, Attorney General - Is against immigration both legal and illegal, believes that illegal immigrants get welfare, voted against funding for the VA medical system, for the Iraq War, voted against getting rid of torture (cruel, inhumane, and degrading treatment/punishment), literally wrote COICA, supports civil forfeiture and opposes reform to it, in favor of the Bush tax cuts, doesn't support the humanities and considers NEH spending \"frivolous\", opposes Matthew Sheppard Act, has a 0 rating from the Human Rights Campaign, doesn't support same sex marriage, supports Don't Ask Don't Tell, believes that marijuana is worse than alcohol and refutes scientific evidence to the contrary, believes life beings at conception, opposed ACA and national health care, doesn't believe in climate change, doesn't support the EPA, wants to drill for oil in wildlife refuges, was one of the most vocal supporters of denying Merrick Garland a hearing on a confirmation for Supreme Court nomination thus causing one of the longest vacancies in the history of the Supreme Court and breaking historical precedence.  (whew that was a fun one, probably the worst human being on this list)\n* Ryan Zinke, Secretary of the Interior - Openly against conservation efforts when it comes to coal and oil, \"isn't sure\" about climate change.\n* Sonny Perdue, Secretary of Agriculture - Opposes environmental regulation, has ties to Agg lobbyists, support HPO insurance.\n* Wilbur Ross, Secretary of Commerce - Breached a fiduciary duty and was heavily fined in 2014, doesn't support open trade.\n* Alex Acosta, Secretary of Labor - Hasn't committed to advocate for American workers, refuses to comment on minimum wage increase, increase in overtime eligibility, and increase in vacation time.\n* Tom Price, Secretary of Health and Human Services - Doesn't support federally mandated vaccines, voted against allowing the FDA to regulate tabacco, against abortion and Planned Parenthood, opposes gun control, opposes gay rights, opposes farming regulation, supports the Patriot Act, opposes pulling out of Iraq, wants to reduce discretionary spending outside of the military, against NPR.\n* Betsy DeVos, Secretary of Education - (oh boy, this is gonna be a fun one) Has zero experience in public education, supports voucher programs allowing school choice instead of education reform (effectively turning education into a business), against public education, wants to get rid of the Department_of_Education, has no personal experience with student loans or financial aid, has openly plagiarized the Obama administration on her application, doesn't understand the difference between competency and proficiency, wants guns in public schools to fight against bears, Pence had to tiebreak her vote, Sessions was scheduled after DeVos for confirmation specifically so he could cast a vote in favor of her, claims historically black colleges are \"leaders in school choice\" despite the fact that they arose from racial tensions spawning from segregation, opposes additional funding for schools that are struggling, recently undid borrower protection policies from federal student loans.\n\nThe list goes on, but I think you get the point."}