{"doc_id": "1016", "name": "2017_04_humanities_student_major_896_writingprompts", "namespace": "we1sv2.0", "metapath": "", "pub": "WritingPrompts", "title": "2017-04-humanities-student-major_896_WritingPrompts.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "-0.011", "Subjectivity": "0.208", "Score": "137", "Upvotes": "0", "Downvotes": "0", "Wordcount": "563", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_6490f3", "Reddit_id": "dg0bvbi", "Subreddit_id": "t5_2s3nb", "Commenter": "Periapoapsis", "length": "2876", "content_scrubbed": "I pull my car into the driveway. *What a day.* I huff and puff as I open the car door and step out. All I want right now is to take a nice, warm bath. If only my house will let me. \n\nI can hear commotion in my house as I walk to the front door. *Of course. No rest for me.* I put the key in, but find that it is already unlocked. Fuckin house. I swear to God. What if we get robbed? Not like I have that much to steal, but still. \n\nI push open the door, ready to reprimand whatever ghosts I see. I know that they won't care, but it will still feel good after the day I have had. I immediately see a man in all black clothing, wearing a face mask with three holes in the front. He is carrying my T. V. \n\n\"Ha Ha. Very funny. Why would you unlock the door? Do you want to get robbed?\" \n\nThe man jumps at the sound of my voice. He looks befuddled. I continue.\n\n\"Well? What do you have to say for yourself?\" \n\n\"I... I jus-\" \n\n\"You just what? Need the money to get by? Cut the shit! Why are you like this?\" \n\nThe man looks hurt. \n\n\"You don't have to be ru-\" \n\n\"Shut the fuck up you stupid dead fuck! Do you think you're being funny? I'll have you know that I've had a rough day today, and you're not making it any easier!\" \n\nThe man is still frozen in place. I hear footsteps. I don't turn around. \n\n\"Oh you've got some friends do you? Some other dead pals that you hang around with, get your kicks with by fucking with me?!\" \n\nThe footsteps stop. The man still hasn't moved from fear and confusion. Cabinets start to rattle, as the doors and windows begin to open and slam back shut. The man lets out a whimper. \n\n\"Now you're trying to get me to feel sorry for you?! Wow. You're a real class act, buddy. Can't even take a berating.\"\n\nAnother figure emerges from behind me. A woman in a white dress walks past me, and into the living room. The man looks from her to me. \n\n\"What the fuck is happening?\" he asks. He is clutching onto the T. V like a shield. \n\n\"Like you don't know! I swear to God I am about to go hire an old priest and a young priest!\" \n\nThe woman gets to the man and stands still before him. He whimpers again. \n\n\"Oh! Now you've got a little production going! What were you, a liberal_arts major?!\" \n\nThe woman walks even closer to him. She begins to walk through the T. V. It crackles to life, even though it is unplugged. The man drops the T. V. \n\n\"What the shit?! That[.] gonna cost like, 200 bucks!\" \n\nThe man bolts. The woman and I watch as he runs out the door, screaming. I look back at the woman. \n\n\"Wow. What a fuckin baby that guy was. What did he even die of, seeing a spider?\" \n\nThe woman looks back at me. She does not answer. She walks towards me. \n\n\"Oh boo fuckin hoo. I'm shivering with fear.\" \n\nThe woman seems to shrug as she walks past me. I turn around. She has vanished. \n\n\"Rude.\" I say to myself. \"Now to get that bath going.\" \n\n___\n/r/Periapoapsis "}