{"doc_id": "396", "name": "2017_10_humanities_student_major_1613_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-10-humanities-student-major_1613_ApplyingToCollege.txt", "pub_date": "2017-10-17T00:00:00Z", "Sentiment": "0.137", "Subjectivity": "0.361", "Score": "39", "Upvotes": "0", "Downvotes": "0", "Wordcount": "588", "Permalink": "http://reddit.com/r/ApplyingToCollege/comments/772esv/why_go_to_mit/doitij0/", "Threadlink": "http://reddit.com/r/ApplyingToCollege/comments/772esv/why_go_to_mit", "Parent_id": "t3_772esv", "Reddit_id": "doitij0", "Subreddit_id": "t5_2y2r8", "Commenter": "junyl_yangide", "length": "3335", "content_scrubbed": "Current sophomore in chemical engineering right now. So let[.] break down your question. \n\n1. The work: The problem *isn't* the workload; it[.] the environment. \n\nWhat people usually don't understand about MIT is it has a difficulty setting you can tune, unlike similar places such as Caltech. You can take 4 classes a semester, join 1 club, have some friends, do a bit of internship searching from time to time, and still graduate from MIT with good grades and a shiny resume. MIT classes are hard, I suppose, but you're talking about these kids who took 6-8 hard hard classes in high school on top of all these activities; one can definitely manage with 4 if you take things at a steady pace. One first semester freshman might can take Intro to ChemE (an infamous class with a 12 -20 hours/week courseload, a final, and a project) and grad level Organic Chemistry, or another might take introductory chemistry. Both will graduate from MIT and look good to those outside the MIT bubble, but one will obviously have a much easier time. \n\nBut if you're a student here, you really won't be hearing about these 4-classes-a-semester kids who are just taking it slow, unless they do something groundbreaking in say research or have a cult of personality. What you will hear about are those kids who are taking 6-7 classes a semester, participating on 3 exec boards, publishing papers as a freshmen, and also getting all the great internships, and these kids are the ones who will (unintentionally) make you feel stupid and behind. If you were one of those people who were very involved into the elite college ratrace, or someone who wants to do everything, you're not going to be able to chill even if you want to, and you'll be caught up into all these classes and activities even though you \"know your limits\". This is what I'd say is most toxic about MIT for many people--an environment of ambition and feeling like you have to be doing something always. \n\n2. STEM focus: It[.] a STEM school with great humanities programs and a close proximity to Harvard. Really good at business, and their business school actually gets some degree of traction among the undergrads (probably more than chemistry or earth science, tbh). \n\nIf you're one of those people who want to focus on STEM and are asking because you'd like to minor in something, or have arts/history/etc to work on as well, then MIT is pretty great--lots of classes to choose from, small and well taught offerings (unlike many other things). If you're one of those people who want to major in a humanities that MIT isn't good at, or trying to major in a pure humanities major (eg: not a linguistics major, or someone looking to combine the sciences with say, poli sci), then you're better off looking elsewhere. \n\n3. Student life: There[.] a lot going on at campus. One of my favorite things about this place is that a lot of things are very beginner friendly, and people are super friendly. In other words, if you're willing to learn, people will teach you and take you on. So much stuff going on also means some distance from academic stress. \n\nAs for whether or not you should apply, or if I'd recommend you to go if you get in, you can PM me if you have more questions :o Certain personality types and life goals are definitely happier here. (Also, rip the numbering of this post)"}