{"doc_id": "295", "name": "2017_10_humanities_student_major_563_conservative", "namespace": "we1sv2.0", "metapath": "", "pub": "Conservative", "title": "2017-10-humanities-student-major_563_Conservative.txt", "pub_date": "2017-10-07T00:00:00Z", "Sentiment": "0.132", "Subjectivity": "0.427", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "234", "Permalink": "http://reddit.com/r/Conservative/comments/74v4kg/army_investigates_west_point_grad_professing/do1q656/", "Threadlink": "http://reddit.com/r/Conservative/comments/74v4kg/army_investigates_west_point_grad_professing", "Parent_id": "t1_do1pgyr", "Reddit_id": "do1q656", "Subreddit_id": "t5_2qh6p", "Commenter": "Bossmang", "length": "1302", "content_scrubbed": "Issue here is Yale professorship gets you connections too -and with a way higher likelihood those connections are to billionaires than West Point would. Billionaires come to Yale all of the time to hold talks, friends of mine who have gone have met Elon Musk, Bill Gates, etc. Not to mention all of the international students who attend the school, the vast majority of whom are incredibly wealthy.\n\nYou'd likely clear 145k from the beginning unless you're working in a very small liberal_arts department. I'm not sure how hard it is to get O-5 but I'd assume it[.] comparable to tenure in difficulty to achieve since it[.] right below brigadier general in rank. Once you're tenured you could do a side business and consult, whatever at that point, with a pension as well. You have a great healthcare plan as long as you stay in New Haven you will get treatment at the Yale hospital network -quite literally one of the best hospitals on the planet with some of the brightest doctors in the world working there. \n\nProbably more important than all of these is just the fact that you make more money early on which you can invest into savings which will pay you way more 20 years down the line than the 60k pension would. Plus, of course, your kids and family get free tuition and can take classes at Yale. "}