{"doc_id": "1050", "name": "2017_04_humanities_student_major_1211_tooafraidtoask", "namespace": "we1sv2.0", "metapath": "", "pub": "TooAfraidToAsk", "title": "2017-04-humanities-student-major_1211_TooAfraidToAsk.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.239", "Subjectivity": "0.325", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "305", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64oxmz", "Reddit_id": "dg3ymdp", "Subreddit_id": "t5_2ssp7", "Commenter": "ZotFietser", "length": "1721", "content_scrubbed": "It[.] always worth considering that your dearest doesn't have to dictate what career you go into. The humanities (or liberal_arts if you speak Freedom English) are pretty solid basses for lots of things, and they carry with them a tonne of transferrable skills. \n\nNow, with regards to museum work its worth knowing that it[.] competitive. Super competitive. And there are specific masters courses which lots of employers will look for, but there are also heaps of things you can do which go beyond this. If you start working in or with museums the  you'll have a great network, and they'll be able to vouch. If you don't mind it, Europe is a great place to come for this too - if you pursue postgraduate study (for museum work I'd recommend it) here there[.] lots of places to find work. Any major city will have something going. \n\nNow as an aside I'd just like to impress on you that you're not limited to teaching or museum work as a history graduate. The skills of a historian are broadly applicable to a load of things (transferrable skills, innit). \n\nI went from a history MA (modern and contemporary history with a focus on working class movements in Europe) into publishing because I've got proven ability in written English, research, critical appraisal and aches to data and source material and referencing. I work with history books and the to a joy. I have friends who work in journalism for the BBC after history study too. And I didn't even go to a particularly notable university. \n\nSo, it[.] not easy but if you're willing to invest in yourself, and aren't chasing vast personal wealth then you absolutely can carafe your dream but don't let that be your be all and end all. There[.] a lot out there for you! \n\n"}