{"doc_id": "1081", "name": "2017_04_humanities_student_major_1525_berkeley", "namespace": "we1sv2.0", "metapath": "", "pub": "berkeley", "title": "2017-04-humanities-student-major_1525_berkeley.txt", "pub_date": "2017-04-13T00:00:00Z", "Sentiment": "0.069", "Subjectivity": "0.336", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "340", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_651cxu", "Reddit_id": "dg7kzw2", "Subreddit_id": "t5_2qh9w", "Commenter": "Reneeisme", "length": "1965", "content_scrubbed": "I attended a few different schools and my own experience is that homework/projects are less of a factor across multiple humanities_major than tests.  Tests are rarely going to be less than the majority of your grade.  That[.] true of most universities and most degree programs.  However the spread in grading is often more forgiving than high school, so just because you couldn't have passed a heavily test based class in the past, doesn't mean you can't do so in college.  If you are the sort to get anxious about C[.] or D[.] on tests though, you are probably in for a hard time when test taking isn't your thing, no matter where you go.  It[.] just a fact of life that to grant you a degree, most universities expect you to demonstrate mastery of material via test.  Doing projects, homework and papers shows your work ethic and dedication, but not really that mastery.  \n\nThere are resources on campus to improve your test taking skills.  A lot of times poor test taking boils down to panic under pressure and/or insufficient practice and study. It[.] definitely possible to get better at taking tests, particularly if you can put in the time to make use of things like the Student Learning Center.\n\nTrust the process.  The admissions office is pretty good at determining who can make it at Cal.  They have no interest in admitting people who will drop out and not complete a degree.  The university is not a profit mill.  They want every student to graduate.  If you were admitted, you can almost certainly complete a program.  Be flexible, be committed, and use the resources the university provides (office hours, study groups, tutoring, etc).\n\nLastly, a few degree programs are necessarily more project based than test (English classes I took often didn't even schedule a midterm or final exam, and the grade was entirely based on papers).  If you really can't do well on tests, talk to a counselor about whether a major like that might better suit your skills."}