{"doc_id": "381", "name": "2017_10_humanities_student_major_1432_findapath", "namespace": "we1sv2.0", "metapath": "", "pub": "findapath", "title": "2017-10-humanities-student-major_1432_findapath.txt", "pub_date": "2017-10-15T00:00:00Z", "Sentiment": "0.161", "Subjectivity": "0.443", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "296", "Permalink": "http://reddit.com/r/findapath/comments/76jbm8/college_freshman_and_i_now_realize_i_dont_want_to/dofabgg/", "Threadlink": "http://reddit.com/r/findapath/comments/76jbm8/college_freshman_and_i_now_realize_i_dont_want_to", "Parent_id": "t3_76jbm8", "Reddit_id": "dofabgg", "Subreddit_id": "t5_2wqq6", "Commenter": "HerMajestysReddit", "length": "1671", "content_scrubbed": "Former college prof here and doctorate specializing in work and careers, including in the study of how people figure out what career to embark on. My advice: Follow your passion. It[.] better to make the switch now than to try to make it later. It will be hard Hard HARD to make it later, and given your family situation, may be impossible. You should consider yourself very fortunate that you are realizing this now. It indicates real self-awareness, which is unfortunately sorely lacking among college students today.\n\nPublic policy can be an extremely useful degree, yes, and with a minor in disability studies, you'd be \"niched\" in a way few other people are. If you go that route, make sure to get lots of work and internship and volunteer experience in that field *during college* so that, by the time you graduate, you'll have more than just the degree on your resume.\n\nAlso, let me just put out a warning: A lot of people will tell you to stick with engineering because money. Yeah, statistically speaking, engineering is more likely to get you a high-paying job initially than, say, a liberal_arts degree. But not all engineers make crazy money, and certainly not all of them are happy, and studies show that liberal_arts degrees catch up in salary over time. More importantly, they also show that people who do what they love have higher chances of success. So if you hate engineering, your chances of succeeding in that field are much, much lower than your chances of succeeding at something you love and so are willing to give your all to. That being said, go give disability studies your all—and feel free to PM me if you ever need to talk. :-)\n\nBest of luck!"}