{"doc_id": "932", "name": "2017_04_humanities_student_major_155_space", "namespace": "we1sv2.0", "metapath": "", "pub": "space", "title": "2017-04-humanities-student-major_155_space.txt", "pub_date": "2017-04-02T00:00:00Z", "Sentiment": "0.046", "Subjectivity": "0.516", "Score": "12", "Upvotes": "0", "Downvotes": "0", "Wordcount": "409", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfq7gwf", "Reddit_id": "dfqg7k7", "Subreddit_id": "t5_2qh87", "Commenter": "phytophthoran", "length": "2392", "content_scrubbed": "It is feasible! Just hard.  The major considerations are threefold:\n  1) Reduce atmosphere \n  2) Reduce heat\n  3) Protect from radiation to maintain lower temperature and simulate Earth Magnetosphere \n\nOne is tough, on Earth we are having trouble with a few hundred ppm of CO2.  The atmosphere of Venus is 90 times denser than Earth[.] and almost all CO2.  It has no free oxygen that makes up 20% of our air.  The nitrogen that makes up the rest of Earth[.], is present on Venus.  If we can find a way to remove the CO2, there should be enough nitrogen to provide a starting place for breathable air.  The only solutions I could think of are catalytic, and would require immense facilities working for thousands of years to convert the carbon to organics or diamonds to get it out of the air.  This is no where near feasible with our current technology.\n\nTwo is just as tough.  Not only is Venus hot, but the 90x atmosphere means its massive as well.  More mass, means more heat to remove.  Megastructures and time, seem the only way to solve the problem.  Perhaps a giant sun shield at the F1 Lagrange point could prevent more heat from arriving. While huge heat baffles at the equator reaching to venosynchronous orbit could dissipate some heat to space.\n\nThree seems easy in comparison.  The magnetic shield that was proposed to cover Mars from solar radiation would be needed, because Venus does not have a strong magnetosphere either.  It would probably also require the light shield, to reduce heat getting to the surface/ cloud layer.\n\nObviously these proposals are not in humanities reach any time soon.  Engineering at that scale is impossible on Earth let alone a crushing, lead-melting place like Venus, or space.  But perhaps some of these proposals could be implemented slowly.  And certain things could be used redundantly.  The large heat baffles could also act as a space elevator to get new materials to orbit.  Also perhaps the heat gradient along the baffle could be used to generate energy for future projects.  \n\nI think the technology will eventually exist to undertake these types of projects.  However, societal and political will must also exist.  Part of me fears that even in the distant future, we will not be able to think long_term and conflicts will ruin any attempt to undertake such large scale planetary engineering.  All we can do is work to make it possible!"}