{"doc_id": "254", "name": "2017_10_humanities_student_major_239_batonrouge", "namespace": "we1sv2.0", "metapath": "", "pub": "batonrouge", "title": "2017-10-humanities-student-major_239_batonrouge.txt", "pub_date": "2017-10-03T00:00:00Z", "Sentiment": "0.175", "Subjectivity": "0.373", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "281", "Permalink": "http://reddit.com/r/batonrouge/comments/745eb2/whats_so_great_about_br_where_do_people_go_for/dnvosym/", "Threadlink": "http://reddit.com/r/batonrouge/comments/745eb2/whats_so_great_about_br_where_do_people_go_for", "Parent_id": "t3_745eb2", "Reddit_id": "dnvosym", "Subreddit_id": "t5_2s5z1", "Commenter": "Cuboner", "length": "1497", "content_scrubbed": "First of all, you're going to get a LOT of negative answers in this subreddit when it comes to this topic. The community here is divisive.\n\nI honestly do love BR. I was born and raised here, have traveled plenty all over the US and I always love coming home. It[.] a great size when you spend a lot of time in much bigger cities and much smaller towns. Big enough to find a nice variety of things to do and places to go, but small enough to where you can somehow end up knowing people most major circles.\n\nI'm a sports fan, and this city is kind to sports fans. No matter what I'm trying to watch there[.] a bar with people watching and talking about it. \n\nI like the people. At least the ones I know and see regularly. You'll often see people here talking shit about your average everyday BR citizen, and that[.] fine. A lot of them suck. But sometimes I see people complain and I have to think, \"Why are you even associating with them in the first place?\" It[.] like when people complain about the default subs on reddit. Just curate your subreddits better and it[.] infinitely more enjoyable.\n\nIt[.] not Houston.\n\nBut really, everyone who complains about BR has fair points. But just because they have valid reasons for disliking the city doesn't mean that should detract from my love for it. Sure this city doesn't support the arts like I wish it would, and the commuters can suck a dick, but I still love Baton Rouge. I'm going to be sad when I move away, and I'll be happy to move back eventually."}