{"doc_id": "1097", "name": "2017_04_humanities_student_major_1750_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2017-04-humanities-student-major_1750_college.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.054", "Subjectivity": "0.38", "Score": "40", "Upvotes": "0", "Downvotes": "0", "Wordcount": "300", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgauar0", "Reddit_id": "dgb2264", "Subreddit_id": "t5_2qh3z", "Commenter": "AccountToLearn", "length": "1814", "content_scrubbed": "This is one of the weirder circlejerks for me. Gender studies, like all majors, is applicable to different jobs. Just because you don't want any of those jobs or they don't pay enough for your tastes doesn't mean that it[.] a bad degree. \n\nIf you get a gender studies degree and want to work in corporate finance, then good luck. But, if you get a gender studies degree, and want to work for a woman[.] shelter, college inclusion office, human resources, or something like that, then it[.] not a terrible degree. There[.] also a lot of applicable uses for a gender studies degree in a lot of different academic fields, if you're looking to do a PhD program. I could easily see someone pick up a gender studies major and slide into a history, political science, cinema, anthropology, communications, education, creative writing, english, global health, journalism, etc. \n\nI think the problem with humanities_major is that they give you a skill set (analytical skills, writing, reading comprehension, and knowledge about what you are studying) that doesn't come with a defined career track. People then think that is a failure because \"Oh, Carl was a history major and now he[.] in IT\" or whatever. They see that you aren't doing a history job and assume your major failed you. I don't really see it like that. I imagine people who major_in_the_humanities are picking a major based on liking the subject and the analytical skills that come with it. So, a successful outcome for them is just a job that employs those skills, not one that is necessarily about the content they studied. \n\nI found this somewhat interesting list for Gender Studies majors at Portland State: https://www. pdx. edu/careers/what-can-i-do-degree-womens-studies\n\nDisclaimer: Science major + humanities major (humanities major is not gender studies)"}