{"doc_id": "1200", "name": "2017_04_humanities_student_major_2581_singapore", "namespace": "we1sv2.0", "metapath": "", "pub": "singapore", "title": "2017-04-humanities-student-major_2581_singapore.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.036", "Subjectivity": "0.325", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "632", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_670f7f", "Reddit_id": "dgmzfgj", "Subreddit_id": "t5_2qh8c", "Commenter": "Thorberry", "length": "3612", "content_scrubbed": "Do not let your parents decide for you. If you do poorly afterwards, it will not only hurt your future but also permanently ruin your relationship with them. Make your own decision -- both for your own good and for theirs.\n\nThat said, let[.] look at your options.\n\n1. **Triple Science**: Terrible idea. This usually means you have to include at least ONE science in your L1R5. If you hate science, it is really risky to do this.\n\n2. **Double Science**: A decent compromise. If you somehow do great at one science, you could include it in L1R5. If not, you can just use Maths (x2) + Two Humanities + Mother Tongue. This seems okay, right?\n\n3. **Combined Science**: May be the ideal option for you -- in terms of getting the best L1R5 by spreading your risks with three humanities subjects. Also combined science is chickenfeet. But double science wouldn't be the end of the world either. Fight for this, but double science isn't that bad.\n\nNow here are some things to think about:\n\n1. **Keeping your options open**: Triple science \"keeps your options open\" because uni science requires A-level science, which in turns requires O-level science. This is a terrible argument IMO. It is very unlikely somebody who hates science at sec 2 will somehow start loving science later. And let[.] be clear: MOST double/triple science students **do not** end up in medicine/dentistry or science or engineering in university. Medicine/dentistry is ridiculously selective. Pure sciences are, on the whole, not very prestigious or lucrative or interesting in Singapore. Engineering is alright I guess, but again, if you hate science now, can't imagine you'll wanna do engineering later.\n\n2. **Doing your best at O-level**: People telling you take triple science? They don't understand that it has a real cost. They think very narrowly, as if keeping your options open for later wouldn't somehow damage your current prospects. And your current prospects are a big fucking deal. If your L1R5 is bad, you go to an inferior JC. The top JCs have more resources and opportunities to use, better classmates to learn from, and a better network for after you graduate. How are you gonna get into those JCs if you're forced to take subjects you're bad at?\n\n3. **Dealing with your parents**: Be sure about your own arguments. Be prepared to answer them about any pros/cons of each option. And more importantly, talk to your teachers and principal/vice principal. Make sure they are on your side; they are the best allies in your fight. Enlist them to help talk to your parents. Cite them when you talk to your parents. Persuade them as best as you can, they will likely be empathetic to you.\n\n4. **Know your rights**: If it really comes to it, I'm fairly sure your parents can't evict you without breaking the law. And talk to your principal/teacher -- if your parent says A and you say B, whose subject combination are they obliged to follow? I honestly don't know the answer. Find out.\n\n5. **It[.] not the end of the world**: Your parents seem okay with double science. I think you should be too. It really is a decent, if not ideal, choice. Sucks that your parents wanna choose your JC options for you, but cross that bridge when you get there. Don't get flustered about it now. One battle at a time.\n\n6. **My story**: I was in a similar boat. Took triple science, hated chemistry bitterly. Literally did not show up for the O-level exam. Did have to use Biology in my L1R5. Went to JC, took no sciences (except Maths), did very well. The rest is history. Reach out if you wanna talk; don't let this keep you down. There[.] always a way out."}