{"doc_id": "337", "name": "2017_10_humanities_student_major_1031_badhistory", "namespace": "we1sv2.0", "metapath": "", "pub": "badhistory", "title": "2017-10-humanities-student-major_1031_badhistory.txt", "pub_date": "2017-10-11T00:00:00Z", "Sentiment": "0.094", "Subjectivity": "0.337", "Score": "79", "Upvotes": "0", "Downvotes": "0", "Wordcount": "989", "Permalink": "http://reddit.com/r/badhistory/comments/75oj7w/state_of_the_sub_11_october_2017_moratorium/do7p1y3/", "Threadlink": "http://reddit.com/r/badhistory/comments/75oj7w/state_of_the_sub_11_october_2017_moratorium", "Parent_id": "t3_75oj7w", "Reddit_id": "do7p1y3", "Subreddit_id": "t5_2wo26", "Commenter": "40kfreak", "length": "5989", "content_scrubbed": "There will be a lot of people in this sub calling for drastic action such as moratoriums or outright bans on certain topics in this subreddit. These tools, while certainly justifiable given recent events and the precedent set by the moratoriums on other topics in the past, should be given more consideration before they are deployed.\nI will now attempt to outline the nature of the problem, and afterwards put forth a number of proposals for discussion. \n\n**1: The Nature of the Problem**\n\nAnalysis given of why this phenomenon is occurring has so far been relegated only to its surface features. These are as follows.\n\n1.*Posts that are explicitly aimed at far-right or far-left subreddits*\n\nThe agenda of these posts are easily identifiable from the title alone: \"r/The_Donald commenter says ________\" or \"r/LateStageCapitalism says _________.\"  \n\n2.*These Posts are Short*\n\nThe most recent of these posts to grace our subreddit is certainly one of the longest. Many such posts are lucky to reach 200 words and often only reach that length because they quoted the source. \n\n3.*These Posts are Poorly Sourced and Poorly Argued*\n\nOften these posts will simply point to Wikipedia or common knowledge in leiu of argumentation. Worse still when arguing about something political they won't present a contrasting idea or analyze the source of the badhistory, and simply content themselves will a long-form version of \"Wikipedia says you're wrong\"\nNow that we have identified and defined the problem, many will stop here, saying that we should just ban or temporarily ban far-right/far-left/political posts and be done with it. This is compelling at first, but I believe that looking at the causal mechanisms of what[.] happening will allow us to tailor our response and lower the workload for the mods without losing too many posts or readers.\n\n**2: Underlying Causes of The Problem**\n\nSo we know *what* is happening, that[.] why we're here. But to respond effectively we need to think about what factors caused this and how our response can address those factors without damaging legitimate posts. Below are three causes that I think sum up why we've seen this shift:\n\n1.*Political posts on Reddit are a goldmine of BadHistory*\n\nReddit has always been stupid but good lord, it[.] gotten mighty stupider. Specifically, It[.] gotten stupider in a way that directly impacts this Subreddit. Increased political polarization has created two broad camps that limit substantive discussion when outside the comfort of friendly mods and voters. This means that mistaken ideas about history will propagate without much resistance, and quickly take on racial or ideological features. \nThis, understandably, means you can go into any one of these Subs, find a middling post with a meme or conspiracy based on BadHistory, and make a post about it on this sub. Worse still, if you're pushing your own agenda, you can grab badhistory from the \"other side\" and make a post about it, thereby cloaking your politics in a warm blanket of \"setting the record straight.\"\n\nHowever, it is extremely important that legitimate users of this sub be able to tackle political issues from any of these subreddits. The mobilization of history for political purposes is probably the second most common cause of badhistory behind entertainment, and is much more harmful. The mission of this sub should be to correct people who are wrong in an apolitical way, and banning *everyone* from doing so hurts the purpose of this subreddit and denies us amajor souce of new content. \n\n2.*Our Standards are not as Stringent as AskHistorians*\n\nThe proliferation of BadHistory across Reddit in general is not, in and of itself, bad for this sub. The issue arises when the standards for posts accommodate dogshit responses. One can very easily churn out a low-effort post without the kind of due diligence that accompanies the better posts on this subreddit. \n\nEven so, we shouldn't be hasty to tighten the rules. AskHistorians has many more posters and experts than we do, and even with their considerable resources many questions are left unanswered for long periods of time or will have all the comments deleted. Adopting similar rules would basically make this /r/ByzantineBasileus. \n\n3.*Using Subreddit Names in the Titles of Posts Attract Users with Political Agendas*\n\nWhen you make it explicit that your object is to attack one Sub or another *through* history rather than just correcting the history, you attract people also interested in attacking or defending that sub, *not* people who want to shoot the shit about history. \n\n**3: Proposals to Rectify this Situation Without Cocking it all up**\n\nGiven the nature and causes of this problem, I propose the following measures: \n\n1.*Adopt a Rule Limiting the Word Count of a Post*\n\nNow I know most of us are either in the Humanities or Qualitative Social Science but we're going to have to grit our teeth here and learn how to count. This Rule has the double effect of limiting low-effort posts and pushing more content to the Small BadHistory Threads, which can have no lower bound and should be stickied to the front page. \n\n2.*Give the Mods Greater Latitude to Enforce Rule Three*\n\nHistory should be the focus of a post here. Rule Three specifically states \"Posts that are soap-boxing or pushing a specific ideology may be removed.\" The issue I identified above is that people pushing an agenda can nestle that agenda within the history, such as saying \"those bastards over there are at it again!\" and harping on the sub and its users more than the history itself. Mods should be given the latitude by us to outright remove posts on a case-by-case basis, and reinstate the post should its author put some real effort in. \n\n3.*Promote Title Etiquette*\n\nI'm unsure if these needs an explicit rule or not, however just PUTTING the subreddit in the title is a magnet for non-users of this sub to come in and ruin our lovely smug circlejerks. We should absolutely discourage this. \n"}