{"doc_id": "994", "name": "2017_04_humanities_student_major_664_parahumans", "namespace": "we1sv2.0", "metapath": "", "pub": "Parahumans", "title": "2017-04-humanities-student-major_664_Parahumans.txt", "pub_date": "2017-04-06T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.386", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "510", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63w7ey", "Reddit_id": "dfxy7t4", "Subreddit_id": "t5_2x7ww", "Commenter": "jankybusiness", "length": "3091", "content_scrubbed": "Here[.] some OC I have for two capes in the bay area.\n\nTo give some background information as someone who[.] lived in the bay area since he was 5, the bay area has a highly eclectic culture; San Francisco proper is a complete mess of every culture and subculture imaginable with a recent techie surge. Outside of the city, the various parts of the bay area (North bay, East bay, South bay, and whatever Solano county is) offer subsections of SF. North bay is pretty \"bougie\" and holds a lot of wealth and wine culture. South bay is another techie mecca. East bay is where a majority of the arts and cultures congregate, along with the alternative scenes for the queer/PoC communities. Solano county is basically a geographic lobotomy, but it[.] literally one of the most diverse places on the planet. The people there make do with what they have and there[.] a lot to be appreciated, but only if you can grasp the nuance. \n\nThe thing that really connects these disparate communities together is culture that desires and respects education. There are approximately **thirty** four-year and grad/post-grad universities in the area alone, and even more community colleges. Between this and the huge emphasis on technology, a lot of the capes have themes regarding information, whether it be directly via their powers or what they do with their powers.\n\n**Nullspace**\n\nThinker 8 / Stranger 3 / Breaker 3\n\nNullspace[.] shard involves the understanding and manipulation of what could be described as the void. His thinker categorization is due to his ability to pull from thin air information about practically anything, and further, he[.] extremely skilled at drawing connections between ideas and information.\n\nHis stranger / breaker categorization comes from his ability to enter an undetectable, incorporeal state that allows him to move through physical objects at his leisure. He also blacks out most forms of surveillance through proximity when he[.] out of his breaker state. \n\n**Bard**\n\nMover / Shaker / Breaker / Thinker 5 / Trump 5 / Stranger \n\nTo put it simply, Bard networks with the shards of other parahumans, but only for the categorizations listed above. In doing so, he gains cantrips -- essentially, less powerful forms of their abilities. Brushing up against Taylor might grant him mildly increased multitasking capabilities, for instance, but not the ability to control any insects. This is severely limited by proximity and interaction; being in the same room as another parahuman is sufficient to gain a cantrip, but direct face-to-face interaction is required for it to be any more powerful than a level 1 or 2 categorization. These cantrips fade over time if they're not \"refreshed\" with further contact, although he can focus on some and retain them for an indefinite period of time. The only ability he innately has is a significantly increased knowledge base, but it[.] somewhat sporadic. Since he spends a lot of time with Nullspace (public speculation is that they're a couple), he tends to have a high Thinker rating and similar (but limited) Stranger / Breaker abilities.\n\n"}