{"doc_id": "1026", "name": "2017_04_humanities_student_major_964_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2017-04-humanities-student-major_964_college.txt", "pub_date": "2017-04-09T00:00:00Z", "Sentiment": "0.079", "Subjectivity": "0.448", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "634", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg0szuk", "Reddit_id": "dg16srb", "Subreddit_id": "t5_2qh3z", "Commenter": "SnowblindAlbino", "length": "4028", "content_scrubbed": "Well, of course those schools will have more Rhodes/Truman/etc... they have higher entrance criteria. Small state schools often accept 85% of the applicants. Their students are generally stronger with higher ACT scores. I don't think that makes for any sort of informative comparison to the quality of the school though.\n\nI do actually, because that[.] the one factor research says *is* highly important in terms of impacting outcomes. Selectivity does have an important impact on outcomes, and due to mission comparably-sized privates are likely to be more selective than their pubic counterparts (I'm talking about schools with <3K students, let[.] say).  One challenge in skimming the research on outcomes is that most of the studies focus on straight ROI: [does the increased post-college earnings potential make up for the additional up-front cost?](https://www. theatlantic. com/business/archive/2012/05/does-it-matter-where-you-go-to-college/257227/) I personally hate the idea of measuring college outcomes by salary, because a good many students don't go to college with the simply intent of maximizing lifetime wages-- they go to become teachers, social workers, non-profit directors, poets, and a range of other things that are motivated by things other than salary.\n\nReally, the bottom line is there are excellent and terrible schools in both the public and private sectors. The good ones emphasize teaching, support their students, and have campus cultures that encourage lots of student/faculty contact (including research). The bad ones disregard teaching, leave students to forge their own paths, and relay on TAs or adjuncts to deliver \"course content\" in pre-manufactured chunks while faculty are either off in a lab on their own or simply \"off\" (in the case of those schools where faculty only come to campus when obligated and spend their time elsewhere when not). It[.] been my experience that $$$ private schools tend to invest more in teaching and have more supportive campus climates *because that is their \"product\" and comparative advantage,* while similarly-sized public schools tend to be run on efficiency models that making offering similar services impossible. One simply indicator in adjunct faculty practice: at my private university our faculty is 84% tenure/tenure-track and almost all of the balance are full-time, multi-year contracts. I have a friend who works at a mid-sized public institution where the faculty is about 40% tenure/tenure-track and the bulk of their courses are taught by adjunct/term faculty. That makes a massive difference in the quality of the student experience even if those adjunct faculty are all outstanding teachers, because they aren't there long_term, aren't supported by the institution, and aren't likely to be doing research that keeps them current and informs their teaching. It[.] a matter of resources.\n\nI would not be surprised to see data that suggests that public/private schools of similar size, mission, and resources have identical outcomes. But those key markers often do not align. My point was simply that the frequent claim that \"all degrees are the same\" and that students should attend the least expensive school possible doesn't really make sense if they are concerned with education vs. credentialing. I just went through this with a nephew, who is a top academic performer and a potential D-I varsity athlete. He looked at a bunch of schools and ended up picking a D-II school he liked over a much better D-III school due to athletics... the D-II was cheaper (public) than the D-III (private), but it also has a 42% five year graduation rate vs an 80% *four year* graduation rate. The faculty at the public school are clearly less accomplished, there doesn't appear to be much research going on there, and few of their students go on to graduate school. But it came in about $5K/year cheaper, so that[.] what he picked. I think it was a poor choice, and doubt he will maximize his academic potential in that setting vs the private alternative. "}