{"doc_id": "395", "name": "2017_10_humanities_student_major_1612_pitt", "namespace": "we1sv2.0", "metapath": "", "pub": "Pitt", "title": "2017-10-humanities-student-major_1612_Pitt.txt", "pub_date": "2017-10-17T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.272", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "256", "Permalink": "http://reddit.com/r/Pitt/comments/76uy1w/what_are_on_the_rest_of_cathys_42_floors_any_cool/doithyc/", "Threadlink": "http://reddit.com/r/Pitt/comments/76uy1w/what_are_on_the_rest_of_cathys_42_floors_any_cool", "Parent_id": "t3_76uy1w", "Reddit_id": "doithyc", "Subreddit_id": "t5_2rhsl", "Commenter": "CrazyPaco", "length": "1484", "content_scrubbed": "Between 4 and 36 you have the following...\n\nFloor 4 has a series of classical murals that were discovered under a wall in hallway during a renovation. Floor 4 was the former main library stacks) & is the former McCarl Center study space\n\nFloor 5 has the English Commons Room which displays the original blueprints of the Cathedral. It is also the former main library space  of the university, and still houses the former main lending desk. The library had  different styled rooms and you can note the different styles although it is mostly converted into office space now. You can see what it used to look like \n\nFloor 6 has the Humanities Center. This is the former Darlington Memorial Library. It is colonial in style and has some unique artifacts/antiques. I believe that other rooms on this floor, now offices, also served as reading rooms for the main library prior to Hillman.\n\nFloor 7 has a display of the front control panel of the first computer at Pitt.\n\nFloor 11 houses (or housed) the William Pitt Debating Union[.] trophy case (including its 1981 national championship trophy). I think they are moving to a different floor though.\n\nFloor 12 has the Braun Room, which was the original women[.] student lounge. I believe there was also a large dinning/conference room on this floor but it may have been removed in a recent renovation.\n\nFloor 23 contains the highest classroom.\n\nOf course the honors college is on 35 & 36.\n\nWikipedia has more on some of these spaces.\n"}