{"doc_id": "1015", "name": "2017_04_humanities_student_major_884_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2017-04-humanities-student-major_884_GradSchool.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.055", "Subjectivity": "0.258", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "421", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg022y0", "Reddit_id": "dg07c9d", "Subreddit_id": "t5_2r4r8", "Commenter": "Jurgioslakiv", "length": "2574", "content_scrubbed": "Well, actually it does teach you those things, and you're quite specifically demonstrating a lack of them. Let me explain.\n\nThe implication of my statement was pretty clearly (demarcated by the \"/s\") that the humanities do provide something useful to society and thus deserve some funding (this is derived from the fact that I was responding to your statement about how funding stems from societal benefit/output). So thus far, the argument is as follows:\n\n1. STEM provides benefits (from your statement)\n\n2. Disciplines that provide benefits deserve funding (assumed in your statement)\n\n3. Therefore, STEM deserves funding (your conclusion) (from 1, 2)\n\n4. Humanities provide benefits (from my sarcasm)\n\n5. Therefore humanities deserve funding (assumed conclusion from my sarcasm) (from 2, 4)\n\nSo you see, we have both provided the exact same amount of evidence for our claims. Also, I'm not sure that you understand what a straw man is, because its quite clear that zero straw mans have occurred here. Nothing even remotely resembling a straw man has happened. You might want to take a logic class, because even my freshmen demonstrate a better grasp of basic concepts like that better than you appear to. \n\nAs for the deliverables that the humanities produce, you frame the question from the standpoint of contract hire. Why should we frame the question from that standpoint? Is contract hire the sole purpose of education? Seemingly, that contradicts the argument that you made earlier, in which you were primarily concerned with the societal benefits/outputs that a discipline can produce. If, instead, you are concerned primarily with what makes you most employable in the widest range of jobs, we will need to change both of our above arguments. It seems to me that you are committing what we call a red herring. A red herring occurs when you change the goal posts partway through an argument. So you start by discussing societal benefits, and establish your own argument on that basis, but then when you ask your opponent to present their argument, suddenly it[.] not about societal benefits, but the ability to obtain good contract labor. But certainly we would not equate contract labor with societal benefits. Now I realize that some of these concepts might be new to you, given that since the humanities provide no benefit, you've obviously never wasted any of your precious time taking courses in things like logic or critical thinking. But maybe, just maybe, if you wasted your time taking those worthless classes, you wouldn't make rookie mistakes like these. "}