{"doc_id": "455", "name": "2017_10_humanities_student_major_2230_csun", "namespace": "we1sv2.0", "metapath": "", "pub": "csun", "title": "2017-10-humanities-student-major_2230_csun.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "0.058", "Subjectivity": "0.196", "Score": "15", "Upvotes": "0", "Downvotes": "0", "Wordcount": "261", "Permalink": "http://reddit.com/r/csun/comments/78bq8s/evacuate/dosn666/", "Threadlink": "http://reddit.com/r/csun/comments/78bq8s/evacuate", "Parent_id": "t3_78bq8s", "Reddit_id": "dosn666", "Subreddit_id": "t5_2r6u1", "Commenter": "PoetJustice", "length": "1659", "content_scrubbed": "It[.] not DACA. It[.] about ethnic studies being repealed and consolidated into social_sciences. The humanities department is trying to stage a walkout and protest buying stuff on campus. I'm in ethnic studies and I've sat in on the meetings but won't be participating the walkouts. Feel free to ask me any questions on what[.] going on\n\nEdit: I'll highlight a few things that are going on:\n\n**Who is being impacted**\nMostly humanities courses. From what I read in EO1100, it shouldn't affect Africana Studies but t could be the death of Gendered Woman Chicanx and Asian American Studies. This means there will be a lot less options for freshmen, basically instead of a bunch of courses for history and literature, basically everyone will have to take University 113/114/115 and History 100, which means pretty bad impacting if you still need these classes. \n\n**EO 1100?**\nhttps://www. calstate. edu/eo/EO-1100-rev-8-23-17. html\n\nThis is the premise of these posters. It[.] not a government decision, it has nothing to do with Trump or any of that. It[.] completely a University senate/president/chancellor Decision. \n\n**Long Term Issues**\nBasically many professors may lose their jobs or have to move the English department. Many students will have larger university writing, speech, history and law courses since those are still requisites. Also, with a large minority population, students will prefer to have history courses catered to their race/ethnicity. \n\nEdit 2:\n\nThe reasoning upon much of EO 1100 is to make graduating for transfer students much quicker. Since many of these programs are csun exclusive, it might slow down graduation rates if made mandatory"}