{"doc_id": "505", "name": "2017_10_humanities_student_major_2755_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_2755_AskReddit.txt", "pub_date": "2017-10-28T00:00:00Z", "Sentiment": "0.073", "Subjectivity": "0.386", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "232", "Permalink": "http://reddit.com/r/AskReddit/comments/79aqvt/homeschooled_redditers_did_you_discover_gaps_in/dp0msdp/", "Threadlink": "http://reddit.com/r/AskReddit/comments/79aqvt/homeschooled_redditers_did_you_discover_gaps_in", "Parent_id": "t3_79aqvt", "Reddit_id": "dp0msdp", "Subreddit_id": "t5_2qh1i", "Commenter": "ibbity", "length": "1294", "content_scrubbed": "In terms of everything liberal_arts (history, writing, literature, reading comprehension, research essays etc) my education was *very* definitely a cut above the average high schooler; this was remarked on by quite a few adults including college profs. In terms of science, about average. In terms of math, I'd say I was worse off than the average because neither I nor my mom was great at math beyond algebra 2, but for some reason she never made me do any math courses at the home school association. In terms of technology, lololol. My parents didn't get a computer new enough to support Microsoft office till I was like 16, and the homeschool association was pretty rural, so I knew nothing beyond Microsoft word when I graduated. \n\nI'm about to get a bachelor[.] in history and planning to go on to get my PhD so I wouldn't say it[.] turning out that bad. I'm good at the stuff I like and that was also the stuff my mom was a whiz at teaching. It helps that she had a liberal_arts college education herself, and treated teaching me and the sibs like a full time vocation. Read dozens of textbooks and supplementary material every year and created her own curriculum from scratch from the best available, for every grade level k-12, and updated them as better shit came on the market. Go mom."}