{"doc_id": "267", "name": "2017_10_humanities_student_major_331_askthe_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "AskThe_Donald", "title": "2017-10-humanities-student-major_331_AskThe_Donald.txt", "pub_date": "2017-10-04T00:00:00Z", "Sentiment": "0.146", "Subjectivity": "0.393", "Score": "15", "Upvotes": "0", "Downvotes": "0", "Wordcount": "412", "Permalink": "http://reddit.com/r/AskThe_Donald/comments/74dcro/should_i_go_to_collegeuniversity/dnxh90n/", "Threadlink": "http://reddit.com/r/AskThe_Donald/comments/74dcro/should_i_go_to_collegeuniversity", "Parent_id": "t3_74dcro", "Reddit_id": "dnxh90n", "Subreddit_id": "t5_3fuwj", "Commenter": "Tatertot74", "length": "2381", "content_scrubbed": "Here[.] the deal: if you have a passion for something, you shouldn't let anything stand in your way to prevent you from doing it. If you truly have a desire to be an engineer, you should be able to stand a few years dealing with people who have beliefs other than your own. I'm a liberal, and I attended a predominantly liberal university to study cinema and media studies (my passion). In that way, I was fortunate in that the place I ended up lined up with my political beliefs. But if I was in your situation, and the only college available to me was incredibly conservative... I'd bite the bullet and go there. There are plenty of reasons to consider going or not going to college, but you shouldn't sacrifice your dream career path just because you have a different opinion than the majority at the school.\n\nAlso good news for you: I guarantee you there will be other conservatives at Berkeley. Conservative groups may not be as outspoken as liberal ones, but they do exist. Though my school was incredibly liberal, I still had several friends who were involved in college republicans, and my experience was enriched because of it. Every liberal at Berkeley is not going to be the stereotypical SJW, and you'll likely become friends with a few if you're respectful of their beliefs. Another benefit for you would be that STEM professors are less likely to delve into anti-Trump rants from my experience, the conversation isn't naturally geared towards that in those classes as opposed to philosophy, history, and other humanities.\n\nAll that being said, if you're just going into engineering because you think it[.] a pragmatic decision, and it[.] not something you have a true desire to do, really think about if college is the_right choice for you. Having a college degree will always open up more doors for you, but there[.] the financial consideration to account for and you may be better served at a trade school. I personally think there is much value in going to college beyond the degree you get from it (regardless of your political ideology), but I also understand that not everyone[.] situation is the same.\n\ntl;dr Don't be scared away from following your passions just because you're afraid you might run into people who have differing opinions from you. This is your future, and you should take whatever steps necessary to make it happen. Whatever you choose, good luck!"}