{"doc_id": "441", "name": "2017_10_humanities_student_major_2075_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-10-humanities-student-major_2075_politics.txt", "pub_date": "2017-10-21T00:00:00Z", "Sentiment": "0.035", "Subjectivity": "0.198", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "289", "Permalink": "http://reddit.com/r/politics/comments/77ujxy/devos_rescinds_72_guidance_documents_outlining/dopgmbs/", "Threadlink": "http://reddit.com/r/politics/comments/77ujxy/devos_rescinds_72_guidance_documents_outlining", "Parent_id": "t1_door1wp", "Reddit_id": "dopgmbs", "Subreddit_id": "t5_2cneq", "Commenter": "everred", "length": "1725", "content_scrubbed": "Step one was to cut funding of public schools at the state and local level, and has been going on for decades. The right_wing was forced to acknowledge that separate could never be equal, so they figured they'd get their revenge by making the whole system shitty. Enter private and religious schools, and later the home school and charter school movements. \n\n\"School choice\" is the latest machination to try and kill public schools by starving them of funding. They come up with a mathematical formula that says since we spend X to run the schools in a given district, and that district serves Y students, then each student is worth X/Y= Z dollars, so if they decide that their district isn't meeting their needs they can go to a different district and we'll give the Z dollars to that district instead. Problem is, those Z dollars are a pooled resource, not line item expenditures. A teacher who teaches 7 classes with 30 kids each day, doesn't have an adjustable salary that you can just shrink to 209/210ths of what s/he got paid last year. The building requires the same number of staff, administrators, the same or an increasing amount of maintenance, regardless of minor student count fluctuations. \n\nI also think the shift in the mission of public education has negatively impacted performance and engagement. It seems like secondary schools are turning more into job training facilities, and while that aspect might be beneficial for students who don't aspire to higher education, I think our approach to children[.] education[.] should be more balanced, with an equal emphasis on exposure to liberal_arts such as speech, literature (beyond use as a source for learning language development), music, art, theater, etc. "}