{"doc_id": "400", "name": "2017_10_humanities_student_major_1653_futurology", "namespace": "we1sv2.0", "metapath": "", "pub": "Futurology", "title": "2017-10-humanities-student-major_1653_Futurology.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.029", "Subjectivity": "0.44", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "282", "Permalink": "http://reddit.com/r/Futurology/comments/775rgx/regreening_the_planet_could_cut_as_much_carbon_as/dojra0h/", "Threadlink": "http://reddit.com/r/Futurology/comments/775rgx/regreening_the_planet_could_cut_as_much_carbon_as", "Parent_id": "t1_dojnsq4", "Reddit_id": "dojra0h", "Subreddit_id": "t5_2t7no", "Commenter": "RiskBoy", "length": "1598", "content_scrubbed": "Ya, I see so often people lambasting liberals or environmentalists for not doing more and trying to point it out as some hypocrisy. A few liberal_arts grads reducing their carbon footprint isn't going to do shit. Like I try to minimize what I dispose of, but end of the day it is pretty impossible to not get inundated with plastic every time you buy something. I have plenty of friends who aren't vegetarian, but go meatless for 1/3-1/2 of their meals every week. I would love it if we began taxing and making laws against disposable containers, reduced subsidies for meat, and increased economic incentives for people to live in denser cities that can benefit from public transportation. But unfortunately, we have a political party that consider environmentalism as elitist, and plenty of people in the center (especially on reddit) that will say bullshit like \"we will just invent solutions\" (not nearly fast enough) or that  people in the third world need to stop having kids (when your average third world kid consumes about 1/5 the resources that a first world kid does). Right now, every major nation in the world is willing to commit to sacrifices that will make life more expensive for their citizens in order to protect the planet. Every nation but the US, thanks to 30 years of idiocy led by the Republican party and its hapless constituents. I will keep trying to do my part, but there is only so much I can be asked to do when I understand my contributions will be wiped away by the hundreds of millions of Americans who pollute and the trash the earth like it is their divine right. "}