{"doc_id": "923", "name": "2017_04_humanities_student_major_63_writingprompts", "namespace": "we1sv2.0", "metapath": "", "pub": "WritingPrompts", "title": "2017-04-humanities-student-major_63_WritingPrompts.txt", "pub_date": "2017-04-01T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.384", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "754", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_62suds", "Reddit_id": "dfp9kgl", "Subreddit_id": "t5_2s3nb", "Commenter": "shetellsweetales", "length": "4365", "content_scrubbed": "\"Wow, Darren,\" Miss Mabee smiled wide while handing Darren back his essay, \"This was honestly incredible. I have some notes in there.\"\n\nShe was amazing. Darren had known about Miss Mabee is first time around, but she taught Pre-AP history and he didn't take any advanced classes then. Miss Mabee had a reputation because she was outstandingly beautiful - even first-time Darren would've had the hots for teacher - but it was even worse for second-time Darren. \n\nMiss Elizabeth Mabee was an incredible teacher: dedicated to her job, totally selfless, incredibly intelligent, and adorably witty. Her degree from Northeastern in History hung behind her desk - it was clearly her passion. First-time Darren wouldn't have noticed any of this. Second-time Darren was lovesick. \n\nDarren was 32 when he made the choice to do a second round. He was determined to get it right. Most of it was good, but the social side of things was constantly difficult. Adults are often patronizing and people his physical age easily became annoying. Miss Mabee spoke to him like an equal. It was one of the reasons she was such a good teacher.\n\nHe flipped through his essay. It was covered in compliments. It should be - as far as she knew this came out of a 13 year old. She loved his thesis and thought it was \"incredibly insightful!\" After his conclusion, in her flawless red script she'd written, \"Please see me after class!\"\n\nIt was stupid, but his heart skipped a beat. *Remember, you're 13.* \n\nAfter class, which Darren could hardly pay attention to, he approached Miss Mabee[.] desk. She looked up from some papers and smiled,\n\n\"Hey Darren! Thanks for talking with me, it will only take a few minutes.\"\n\n\"Sure,\" Darren smiled back, \"It[.] really no problem, I don't take the bus or anything.\"\n\n\"Great,\" she motioned to the chair behind him, \"Pull up a seat!\"\n\nHe did, \"So,\" he couldn't help but take the opportunity to start a conversion, \"How'd you like Northeastern?\" He motioned to the diploma.\n\n\"Oh!\" she looked back behind her at the frame, \"I really liked it! Are you considering Northeastern?\"\n\n\"Maybe,\" he shrugged, \"I don't know if I'm cut out for that; I know it[.] tough. I think state school might be more my speed.\"\n\n\"Darren, trust me,\" Miss Mabee said, with a heart-melting side smile, \"You are definitely 'cut out' for any school.\"\n\n\"Thanks,\" Darren felt his face getting hot, he needed to find his footing again, \"You know, I'm honestly thinking of a smaller liberal_arts college. You know, something with a small, progressive campus; good professor to teacher ratio; it just seems like the kind of environment and experience I'm looking for.\"\n\nMiss Mabee looked impressed, \"That sounds great, Darren!\"\n\n\"Yeah, but I would need a pretty good scholarship. I don't want a ton of student loans.\"\n\n\"Well, it[.] very common to take out student loans. With a good degree, you won't have to worry to much about repaying those.\"\n\n\"Right,\" Darren had gotten tired of trying to argue against pre-recession college advice. Without a substantial scholarship, you can bet your ass he was going to a state school.\n\n\"Anyway,\" Miss Mabee pulled a folder out of her drawer, \"I wanted to talk to you about joining the Quiz Bowl team.\"\n\nShe put some papers in front of him to look at. He scooted his chair close to the desk and peered over them. It was a permission slip and an application coupled with a schedule for studying and competing. \n\n\"Darren,\" her voice sent a shock wave down his spine. He looked up to find her leaning over, staring right into his eyes, \"I think you are an amazing young man with incredible potential. You are honestly the smartest kid I've ever taught. On top of that, you're responsible and well-mannered - I've seen you reach out to struggling students. You're just really -\"\n\nShe stopped. Something had happened. \n\nSome terrible concoction of Second-time Darren[.] confidence and adult mind had jumbled up with teenage chemicals and he stood up out of his seat kissed Miss Mabee. \n\nMiss Mabee stood up so abruptly, her desk chair rolled into the black board and went spinning.\n\n\"Darren!\"\n\nDarren[.] heart sank. What the hell was he expecting? There was no way he was going to be with this woman. \n\n\"I'm sorry, but you need to leave.\" Her face was red from embarrassment or anger or both.\n\nDarren attempted to utter an apology and then he made a hasty exit. "}