{"doc_id": "1006", "name": "2017_04_humanities_student_major_812_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2017-04-humanities-student-major_812_AdviceAnimals.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.084", "Subjectivity": "0.361", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "256", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfznlbd", "Reddit_id": "dfzntl1", "Subreddit_id": "t5_2s7tt", "Commenter": "BrianLemur", "length": "1669", "content_scrubbed": "[Please read this comment.](https://www. reddit. com/r/AdviceAnimals/comments/6448m1/i_feel_as_though_my_teachers_lied_about_the/dfzmqy5/)\n\nAnd it[.] cool that you don't care about growing distaste for liberal_arts programs. But when it comes to things like public funding, if everyone around you says \"fuck you, liberal_arts!\" because they think of \"those\" majors (which, by the way, shouldn't be any more expendable than accounting and education, but I digress) don't be surprised when your programs get cut too. These words have meanings. When you perpetuate incorrect ideas about them, you risk facing real life consequences as a result.\n\nTake Planned Parenthood. They're synonymous with abortion in many circles, even though it[.] a very, VERY small portion of the services provided. People want to remove all federal funding, which means things like cancer screenings and important women[.] health services are slashed in the name of fighting a boogeyman federal funds ALREADY cannot support. Most people in liberal_arts are like you. They're doing computer science and mathematics and fields that even the people in this very thread, who seem to have a rage boner against creative arts and big questions, find to be disposable. So when the budget cuts come, and people have the option to defund the liberal_arts college, they very well may do so based on their own ignorance of the subject. WORDS MEAN SOMETHING.\n\nAnd no, I'm not offended that they're bashing liberal_arts. I'm offended that they're bashing liberal_arts *and don't know what they are.* It[.] not distaste for something that offends me. It[.] willful ignorance that reveals itself through shit slinging."}