{"doc_id": "1208", "name": "2017_04_humanities_student_major_2684_matheducation", "namespace": "we1sv2.0", "metapath": "", "pub": "matheducation", "title": "2017-04-humanities-student-major_2684_matheducation.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.108", "Subjectivity": "0.364", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "598", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67653r", "Reddit_id": "dgo2fcs", "Subreddit_id": "t5_2qluz", "Commenter": "eulerianconstruct", "length": "3420", "content_scrubbed": "I can't comment much on the how to apply or what programs to look into part, but I can comment on what you'll need to get on the same level as your colleagues.\n\nThe lack of any proof based courses is what I'd be most concerned about. Math graduate programs are going to be almost all proof-based courses (since, that is what mathematics is after all) and it doesn't seem you have any experience with this, at least just based on course titles. An intro to proof and logical arguments is usually done in a undergrad[.] sophomore or early junior year and are difficult for students since you're being almost? sort of? taught a new method of thinking. Depending on the way your calculus class was run, you MAY have done proof, but I can't comment on that without knowing what your actual calculus class was. Also, I don't know much about econometrics, but perhaps you did proofs in those classes too.\n\nCourses you are usually expected to have taken/some exposure to prior to a math MS program, at least in my experience:\n\n* Advanced calc or some other intro to real analysis course\n* Topology\n* Modern algebra\n* Linear algebra\n* Differential equations\n* Basic understanding of: stats & probability, combinatorics, graph theory, complex variables, and of course logic\n\nI've known a few people (read: less than 5) who came from a liberal_arts background to get a Math MS but they spent a lot of the beginning time loading up on the undergraduate courses listed above before they start on their graduate work. This does of course mean that the program takes a lot longer.\n\nDepending on the program you apply to, you may need to take the Math Subject GRE. In this case, you definitely will need to do a lot of prior studying in the above areas in order to pass. If you only need the General GRE, you'd be able to bypass things like topology or modern algebra, depending on the courses you end up taking. If you're looking to be a data scientist, maybe you would be interested in doing a statistics program? With prior R and Stata experience, that is definitely something in your favor. I don't know about econometrics, but since it seems stat-based, you may find you're more prepared for a statistics program. Is there a reason you want to do just mathematics MS instead of statistics MS?\n\nAt the very least, for data analysis work, you should probably do studies on **real analysis, linear algebra, and stats & prob**. I'd work through Rudin[.] *Principles of Mathematical Analysis* for a real analysis intro--this is a pretty classic book for the subject. For linear algebra books there are many to choose from, but apparently UC Davis actually offers a [free one](https://www. math. ucdavis. edu/~linear/). Can't comment on how good it is, but it is free. Stat & Prob books are also a dime a dozen, so there[.] probably another free one of those out there that is pretty good. Even if you are not taking the Math GRE, having done some studies in these areas will only help you. Depending on how it goes, you may end up wanting to pick up an undergrad text in proofs and logical argument. There[.] a few tools/techniques that mathematicians use over and over and reading through a textbook dedicated to this sort of thing will be useful. Even if you've seen proofs demonstrated in previous classes, it[.] different to construct them yourself. \n\ntl;dr: Get Rudin[.] PMA; read some linear algebra and stats stuff. Good luck."}