{"doc_id": "356", "name": "2017_10_humanities_student_major_1204_auburn", "namespace": "we1sv2.0", "metapath": "", "pub": "auburn", "title": "2017-10-humanities-student-major_1204_auburn.txt", "pub_date": "2017-10-12T00:00:00Z", "Sentiment": "0.014", "Subjectivity": "0.267", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "858", "Permalink": "http://reddit.com/r/auburn/comments/75l4kj/black_lives_matter_can_speak_at_auburn_but/doahr97/", "Threadlink": "http://reddit.com/r/auburn/comments/75l4kj/black_lives_matter_can_speak_at_auburn_but", "Parent_id": "t1_do9s3da", "Reddit_id": "doahr97", "Subreddit_id": "t5_2s54n", "Commenter": "NotFranzKafka", "length": "5582", "content_scrubbed": " Do you disagree that it[.] pathetic when alums try to treat their college football team like it[.] their nation or extended family?\n\nYes. EDIT: Wait, no. Wait, I can't tell what you're asking. I do not think it[.] pathetic.\n\nThe fact that the spring lineup of who will be speaking still isn't available led to my confusion.\n\nIt may not even be running in the spring, they have not made any announcements.\n\n   How am I on the wrong side of the ACLU regarding free speech??\n\nI should have written this differently. Point being, ACLU are not liberals.\n\n  As for who is left-wing and who is not, well Dr. George calls himself a \"conservative\", but he is just an abortion-obsessed, pro-establishment, glorified english_major\n\nDid you base your judgement on political alignment on major? Are only folk of good STEM stock allowed to be conservatives? This reeks of whiny \"RINO cuckservative\" gatekeeping.\n\n  Professor George is a recipient of many honors and awards, including the Presidential Citizens Medal, the Honorific Medal for the Defense of Human Rights of the Republic of Poland, the Canterbury Medal of the Becket Fund for Religious Liberty, the Sidney Hook Memorial Award of the National Association of Scholars, the Philip Merrill Award of the American Council of Trustees and Alumni, the Bradley Prize for Intellectual and Civic Achievement, and Princeton University[.] President[.] Award for Distinguished Teaching. He has given honorific lectures at Harvard, Yale, University of St. Andrews, and Cornell University. He is a member of the Council on Foreign Relations, and holds honorary doctorates of law, ethics, science, letters, divinity, humanities, law and moral values, civil law, humane letters, and juridical science. A graduate of Swarthmore College, he holds J. D. and M. T. S. degrees from Harvard_University and the degree of D. Phil. from Oxford University. In November of 2016 he will receive the degrees of B. C. L. and D. C. L. from Oxford.\n\n^Source: ^https://www. princeton. edu/politics/people/display_person. xml?netid=rgeorge\n\nI'm sure you don't care to read any of that, so I'll just give you the tl;dr version: he has a degree in law, his master[.] degree is in theological science, and he has a doctorate of philosophy. He currently *teaches law at Princeton*. I mean, I guess at some point he *might* have been an english_major..\n\n  I found him more boring than Dr. West (with whom I also found some points of agreement--so much for being \"Literally Hitler\" as you claimed).\n\nI did not call you \"literally Hitler\". In fact, since you have admitted to agreeing with a black person at least once in your life, I am now obligated to award you the Gold Star for Having Defeated Racism Forever.\n\nHowever, I stand by my claim that you probably think anything left of the Third Reich is liberal.\n\n  Low-Energy Jeb\n\n🙄\n\n I looked briefly\n\nI mean, there[.] this article [Inside Higher Ed article](https://www. insidehighered. com/quicktakes/2017/10/05/aclu-speaker-shouted-down-william-mary) which is one of the more popular trade magazines for college management. There[.] [the official statement by the ACLU](https://acluva. org/en/news/aclu-va-statement-regarding-sept-27-event-college-william-mary). There is also the [William and Mary student newspaper](http://flathatnews. com/2017/10/02/black-lives-matter-protests-american-civil-liberties-union/). You don't need to go checking for \"liberal\" sources because you think I'm more likely to accept it, if it[.] a newspaper or magazine in the news section and I can verify it somewhere else then you're fine. I don't really read HuffPo, Slate, Salon, Vox, the Hill, etc. much because I'm really not that big on editorial.\n\nFox would have been fine, too: http://www. foxnews. com/us/2017/10/05/black-lives-matter-shouts-down-aclu-protect-hitler-too. html\n\nIt[.] a news article written by a journalist. My main problem with Fox is not that they're conservative, it[.] that when I get linked to a Fox article I have to go through extra effort to sort out their editorial from their news because they're not as transparent as other news journals.\n\n Interesting poll. They do not include their sampling methodology, which is hugely important.\n\nIt[.] a Plainsman poll, did you expect them to call 800,000 people and calculate the percentage error? Here[.] what they did: they wandered around the Haley Center concourse and Student Center and asked random students what they thought until it was 5 pm. They probably got like 100 people to answer. Sometimes I wonder if you guys even have a single Auburn resident in your membership.\n\n  Why \"less than\" 77%? Well, the Census definition of \"White\" includes middle-eastern peoples like Jews, and also lumps all \"Hispanics\" together as White, both Spanish/European-descended Hispanics, who are White, and Mestizo/Indio \"Hispanics\", who are not\n\nThese statistics are self reported by students, so the census definition doesn't matter. I know you guys believe in arbitrary genetic tests for whiteness, but I believe if people consider themselves white then they are white. It[.] not less than 77%, it[.] 77%.\n\n  \"White\" includes middle-eastern peoples like Jews\n\nI feel like the answer to this question is probably going to make me want to throw up, but would you consider a person of fair complexion who identifies as white and is a fifth-generation American who is Jewish because their parents immigrated here from Poland in 1870 Middle_Eastern? Because that[.] what most of the Jewish people in America are. They're not, like, showing up now all of a sudden in droves coming off a boat from Israel."}