{"doc_id": "1212", "name": "2017_04_humanities_student_major_2697_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2017-04-humanities-student-major_2697_canada.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.013", "Subjectivity": "0.283", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "339", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgo79xi", "Reddit_id": "dgo7m69", "Subreddit_id": "t5_2qh68", "Commenter": "ItsQuietUnderwaterr", "length": "2059", "content_scrubbed": "Aaaaand now you're shifting goalposts. \n\nArguing semantics on it is just morally and intellectually bankrupt.\n\nfacts =/= semantics. You were wrong, dude. 100% wrong. I corrected you. \n\nPhilosophy is the father of science, and many of the greeks were indeed scientist philosophers. I bet you know that, I bet you omit it on purpose.\n\nGreat. It still doesn't change the fact that academia wasn't about scientific progress, like you claimed. \n\nGo back from the 1800[.] to the 1980[.]. Were their liberal_arts? Some, but not really. Psychology was a pseudoscience, so if you want to count that, go ahead. Were there literature programs etc? Yes, but we both know in this context people are talking about the sociologies and gender studies programs, not studying Shakespeare.\n\nHave you gone to university? Serious question. \n\nUniversities have overwhelmingly been science, or the study of history, languages and literature. Not teaching people theories based on feelings, and not fact.\n\nDon't answer my last question, I can see that you haven't. I'll add you to the list of anti-intellectuals who have never set foot on a university campus trying to tell the world how they should operate. The brazen arrogance of the ignorant never ceases to amaze me. All you people do is prance around telling everyone else your opinions on shit and when you get told your wrong, you employ every logical fallacy (which is taught in liberal_arts programs) in order to weasel out of your positions.\n\nYou as me where the liberal_arts are? I say look at every significant political figure in all major liberal democracies around the globe and you will find a liberal_arts major. \n\nYou think Yale, Harvard, Columbia, Oxford, Cambridge, University of Pennsylvania, and all the other top universities in the world were created in the name of science? The majority of the classic North_American universities were founded for ecclesiastical reasons, which are 100% arts based.\n\n\nBut whatever, you're entitled to your opinion.\n\n\nMy opinion is supported by fact, so feel free to quote me. \n"}