{"doc_id": "243", "name": "2017_10_humanities_student_major_139_findapath", "namespace": "we1sv2.0", "metapath": "", "pub": "findapath", "title": "2017-10-humanities-student-major_139_findapath.txt", "pub_date": "2017-10-02T00:00:00Z", "Sentiment": "0.139", "Subjectivity": "0.328", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "308", "Permalink": "http://reddit.com/r/findapath/comments/73w9m1/advice_for_online_mba/dntpfao/", "Threadlink": "http://reddit.com/r/findapath/comments/73w9m1/advice_for_online_mba", "Parent_id": "t3_73w9m1", "Reddit_id": "dntpfao", "Subreddit_id": "t5_2wqq6", "Commenter": "spinaz", "length": "1632", "content_scrubbed": "So, first I will say that I have both an MS and an MBA from WGU. They are a regionally accredited institution, but not specifically AACSB. Is this particular accreditation of vital importance for you?\n\nAnecdotally I will say that I have an undergrad degree with a 2. 7 GPA in liberal_arts. My professional experience is largely in non-profits and educational organizations and in project management. I had begun an MPA from U of Phx many years ago and did not complete my program. I opted to enroll in the WGU MS Management & Leadership program a few years ago and I had the most supportive and engaging mentor (advisor) through the program. I finished in just over a year and near the end of my program my mentor shared with me that I could reenroll for the MBA program and only have to take six additional courses because the MSML and MBA programs have overlap. Six months into my MBA program I was offered a huge promotion at my job and got a 60% salary increase. While I could have spent my time cultivating an MBA program at a State school—the reality is that I have a family and need to work full time. My boss (I work in higher ed) fully supports WGU and knows their model works and works well for working adults and at a fraction of the cost. I have a friend who got an MBA from a prestigious state school locally and struggled to find a job after and is an immense amount of debt. I finished two degrees in 2. 5 years at a fraction of the cost. \n\nI don't think my MBA from WGU is viewed as inferior to say a program at a State school. \n\nI'm available for any questions specific to the program if you'd like to know more. "}