{"doc_id": "1011", "name": "2017_04_humanities_student_major_845_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-04-humanities-student-major_845_politics.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.156", "Subjectivity": "0.424", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "472", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfzndvz", "Reddit_id": "dfzt3sk", "Subreddit_id": "t5_2cneq", "Commenter": "artgo", "length": "2968", "content_scrubbed": " There[.] very, very intelligent people in the republican party.\n\nGermany in 1930 had highly intelligent people. Very hard-working, ambitious, get up early in the morning types who valued difficult labor, highly technical education, strong work ethic, pride in setting records of intelligence, measured and ranked intelligence.  Seriously, study the technology and organization of the society - even the major advances in uniform clothing and it[.] success.  This whole idea that \"intelligence\" means you care about human beings is very misguided here on reddit.  Calling people \"dumb\", \"stupid\", \"idiots\" (which this sub has to post as a rule on every topic as a sticky) has nothing to do with democracy, kindness, reason, caring about all people in the society.\n\nThe marked characteristics of highly intelligent fascists, even the leaders of the Islamic terrorists, is their complete lack of concern for translation of poetry to poetry.  They *refuse* to allow liberal_arts to be translated.  Someone like /r/Malala really angers these highly intelligent action-oriented thinkers.  Liberals inside and outside are trouble, there is a constant condemning of them for their way of thinking and organizing.  Facists are always dreaming of a logically organized and structured world, like digital computing with death or punishment for irregulars.  The same with Vladimir Putin, complex things like homosexuality are too much for their organized systems of thinking - and if they *do come out in public support*, it is a calculated play with lies and deception - a Public Relations play and not human truth... they want to tightly control the complex lies (fabrications, constructions) and not allow them to be trumped by complex truths (homosexuality in real life, experience).  I find one of the most useful ways to study the societies over time is marriage: are different races (skin colors) equally treated in choice to marry? Rich and beautiful marry poor and ugly? Couples who speak different languages? Differences in ages between male and female, and even age of marriage? Attitudes toward in-breeding / future races (Germany in the 1930[.] was very big on breeding, had high concerns for 'intelligence' and [.]uperiority' of offspring).\n\nSurely if you want to kill outsiders and take away their land, homes, food - you can't be doing liberal_arts translation - you can't be saying that your enemy is equal to you with a different set of education and experiences.  You have to encourage confidence and superiority.  The very idea of *equality* is trouble for fascism - as you can't be superior.\n\n*We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the Pursuit of Happiness. That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed;* ... ***Novus ordo seclorum***"}