{"doc_id": "442", "name": "2017_10_humanities_student_major_2098_todayilearned", "namespace": "we1sv2.0", "metapath": "", "pub": "todayilearned", "title": "2017-10-humanities-student-major_2098_todayilearned.txt", "pub_date": "2017-10-22T00:00:00Z", "Sentiment": "0.045", "Subjectivity": "0.201", "Score": "16", "Upvotes": "0", "Downvotes": "0", "Wordcount": "341", "Permalink": "http://reddit.com/r/todayilearned/comments/77zmpe/til_that_harvard_professor_tom_lehrer_was_asked/dopz5hi/", "Threadlink": "http://reddit.com/r/todayilearned/comments/77zmpe/til_that_harvard_professor_tom_lehrer_was_asked", "Parent_id": "t1_dopyrgx", "Reddit_id": "dopz5hi", "Subreddit_id": "t5_2qqjc", "Commenter": "EngineerSib", "length": "1907", "content_scrubbed": "Academia is a world full of archaic bullshit (former academic). This is for the US specific. But Tom Lehrer is an American so doggonit, this is the format we're gonna stick to.\n\nIf you do not have a PhD, most institutions will not allow you to be a professor. There are some that do but they generally are either not properly accredited or private (a lot of religious schools will bestow the title of professor on people without degrees as will a lot of \"institutes\"... chefs don't earn PhDs, they earn Michelin stars).\n\nHowever, in traditional universities it[.]:\n\n* PhD Student when you're admitted to the program (usually after your first set of exams)\n* PhD Candidate when you have an approved topic/research plan (usually after your second set of exams)\n* PhD when you have defended your dissertation (fun fact: master[.] students write a thesis, a PhD candidate writes a dissertation)\n* Instructor or Lecturer if you are not tenure track or do not have a PhD\n* Adjunct Professor if you are not tenure track but do have a PhD (a lot of liberal_arts schools will hire adjuncts... it[.] kinda the worst of all worlds)\n* Research Professor if you are not tenure track and usually you bring your own funding (may or may not have PhD candidates and students working for them)\n* Assistant Professor if you are on the tenure track but have not earned tenure yet\n* Associate Professor is when you've earned tenure \n* Full Professor is some time after you've earned tenure\n* Professor Emeritus is when you're starting to retire (fun fact: at most universities, the path to retirement for a professor is at least 5 years)\n\nAlso, Chair of the department is usually a thankless job that they con people into. It[.] not a fun job. You get to do your old job + put out everyone else[.] fires.\n\nedit: in before some MIT grad tells me \"actually, at MIT...\". We know. You do things differently. You're not a PhD, you're a ScD."}