{"doc_id": "387", "name": "2017_10_humanities_student_major_1521_highereducation", "namespace": "we1sv2.0", "metapath": "", "pub": "highereducation", "title": "2017-10-humanities-student-major_1521_highereducation.txt", "pub_date": "2017-10-16T00:00:00Z", "Sentiment": "0.148", "Subjectivity": "0.354", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "336", "Permalink": "http://reddit.com/r/highereducation/comments/76ua06/moocs_are_dead_whats_next/doh53m4/", "Threadlink": "http://reddit.com/r/highereducation/comments/76ua06/moocs_are_dead_whats_next", "Parent_id": "t3_76ua06", "Reddit_id": "doh53m4", "Subreddit_id": "t5_2r04r", "Commenter": "kantarufel", "length": "2068", "content_scrubbed": "Would anyone else agree with free public higher education (U_S)? At least a technical, vocational, or basic liberal_arts (and, I guess, business) - if not bachelorette - education. It offers the opportunity to create a more educated workforce.\n\nWould anyone else also agree that an important determining factor defining effective education is to associate learning with an experience? Something that makes the lesson memorable. It could be from a conversation or some resounding feedback from a professor. MOOCs are like study guides; resources. It[.] awesome that this amount and kind of information is on the internet! However, perhaps people are not properly motivated without some level of (human) feedback. \n\nOnline education, the kind where a teacher participates in the discussion (maybe records a lecture), grades and offers feedback on assignments, and is available to answer questions, that kind of online education works fine for a lot of people. However, these programs are only available by way of piles of student loan debt. Except for University of the People, of course.\n\nIt is clear that online education is a viable, less expensive business model. Is it outside the scope of our society to establish a government (yes, \"tax payer\")-funded undergraduate online education system? Not only would it potentially offer opportunity to some of the poorest, but who knows, it could be a another way to make public libraries even more useful. \n\nI agree though, unless you're someone who is really self-motivated, it can be difficult to stick with a MOOC. I'm not convinced that the alternative which was mentioned in the article would be any better. Students need teachers. \n\nEdit: found a flaw. Broadband infrastructure in rural areas. Although, I suppose it would only need to be brought to the library...?\n\nWho will find the next flaw? :) \n\nEdit 2: I forgot to make the point that a lot of online professors are adjunct. In this scenario they could be \"government employees\" or something akin. It could be beneficial to a population of educators as well.  "}