{"doc_id": "1177", "name": "2017_04_humanities_student_major_2429_tumblrinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrInAction", "title": "2017-04-humanities-student-major_2429_TumblrInAction.txt", "pub_date": "2017-04-21T00:00:00Z", "Sentiment": "0.056", "Subjectivity": "0.333", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "488", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgla177", "Reddit_id": "dglb87p", "Subreddit_id": "t5_2vizz", "Commenter": "CaptainCrackbaby", "length": "2737", "content_scrubbed": "That first part was a joke. Advocate unschooling and people will lose their shit, almost as if you advocated molestation. I'm not saying it[.] the_right answer, just saying they'd kill you.\n\nThe funny thing is the evil capitalist profit farm colleges are run by people, *sliiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiightly* to the_left of center. \n\nHere[.] just a few bullet points about how I'd change the educational system.\n\n1. **The most important thing is, back in the day college was cheap, you could literally work your way through it. What has changed? This is the most fundamental question, skip everything else I say and focus on this!**\n\n2. As I understand it the answer to question 1 is that it[.] price is artificially inflated by being subsidized. Similar to how insurance companies inflate the cost of healthcare. \n\n3. Focus more of vocational training and less on the arts. More people will make a living, and more workers are needed, who can fix things than do pottery, know who Bach was, or discuss Shakespeare. This is blasphemous as fuck! But look it up more machinists are needed not more artists, and you can do a lot of that stuff elsewhere for cheap or free. \n\n4. Abolish P. E. No, the answer to the obesity epidemic isn't standing around waiting for your turn to attempt a layup. Instead of an hour of PE every other day, every able bodied student begins their day with 30 minutes of calisthenics. Good way to wake em up. Might make it a lifelong habit. P. E. is a waste of time and money and the coaches are worse than the priests IIRC. \n\n5. Abolish school sports. 0. 01% or less of students will be professional athletes, I bet schools spend more than 0. 01% of the budget on it. And before someone balks, kids can play sports for the YMCA or other private little leagues. Local businesses are often happy to sponsor. This goes for colleges especially, it[.] time for tuition to stop subsidizing unpaid farm teams/minor leagues. \n\n6. It[.] the 21st century. Live entertainment is a luxury because we have TV instead of vaudeville. Why do we need a live teacher? Maybe for K-12, maybe only 10? to keep the kids on task and in line. Why should an adult need to watch a teacher teach live? It can be recorded and available for pennies on the dollar. If you need help you can pay for a couple hours of tutoring or just ask questions on forums. You don't need an MBA to know an MBA shouldn't cost 5 figures in a sane modern world. \n\n7. Not a penny of public money spent on useless degrees like gender studies. Or on religious studies, your church ought to give you an interest free loan. \n\nThat[.] all the talking points I got right now. I'm cold and hungry and stuff. I'd like to hear some of your ideas if you have any. "}