{"doc_id": "402", "name": "2017_10_humanities_student_major_1672_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2017-10-humanities-student-major_1672_changemyview.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.056", "Subjectivity": "0.382", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "926", "Permalink": "http://reddit.com/r/changemyview/comments/778mv4/cmv_course_attendance_shouldnt_be_required_except/dok899z/", "Threadlink": "http://reddit.com/r/changemyview/comments/778mv4/cmv_course_attendance_shouldnt_be_required_except", "Parent_id": "t1_dojx0u8", "Reddit_id": "dok899z", "Subreddit_id": "t5_2w2s8", "Commenter": "kittysezrelax", "length": "5387", "content_scrubbed": "I completely agree. But I think that this should reflect in the grading. If taking part in the discussion is important, then taking part in the discussion is important, not just being in the classroom for it. And if the teacher decides to evaluate the students on a class to class basis, I think that[.] great, and a good reason to fail a student who misses every class, but would still be not because the student missed classes, but because they couldn't be evaluated.\n\nBut if the discussion happens in the classroom, being in the classroom is a prerequisite of participation. You literally cannot participate if you are not present. I'm not sure what the norms are in Brazil, but at most US based universities I'm familiar with, attendance is required *and* participation is factored into the final grade [in humanities and social science disciplines, at least]. The reason both of these must happen is so the instructor can evaluate the quality of participation. If I have a student who shows up every class but is never able to contribute to classroom discussion, doesn't pull their weight in group activities, or is actively disruptive of the discourse norms we establish at the beginning of the semester, they have not *earned* the same participation grade as a student who shows up prepared and contributes positively to the learning environment. BUT, they have met the bare minimum of participation I can require (attendance). It would be unfair to students who meet or exceed the expectations that I set if those who did not participate received the same grade, in the same way it would be unfair to those who at least made the effort to be there everyday if those who never showed up received the same grade. Even if you don't participate actively, being there at least gives the *potential* for participation, be it through cold-calling or group work.   \n\nIf someone cannot be bothered to be in the same physical location as the rest of us, they are not only contributing nothing but are actively impeding the education opportunities from both students who were not able to get seats in the class and those who are present and working productively. In short, those students do not deserve credit for the class, as they have not engaged in critical components of the class. They have failed to *earn* credit for a class, because they were not a part of the class.\n\nSome courses are mandatory for a student to have their degree, and if, for some reason, they believe that the course isn't fulfilling their needs, they end up just causing more trouble (by talking in class, or sleeping, or just generally being distracting) than good, for everyone.\n\nThose are classroom management issues. It[.] unreasonable to expect that the university restructure its entire labor system and pedagogical goals around the hypothetical disruptive student. Instead, these situations are best handled individually when they arise as they are not always the same (how I should respond when I have student missing class because they simply don't care and when I have a student missing class because they have a mental health issue are two entirely different situations which demand different responses). If I have an underperforming student, I begin by talking with them about the issue and moving on from there. I've never had a truly disruptive student in a classroom situation before, but I know others who will ask them to leave and count it towards their absences. To me, that is the more appropriate way to handle such a student than making attendance optional, which would create an administrative and pedagogical nightmare. \n\nTwo things tho: one is, just because a person doesn't believe they need the classes from one course or another doesn't mean they should give up on traditional education, it just should be more open: students will always end up watching the classes that they believe are adding to their education. So if I watch 90% of my courses, but just can't get anything useful out of that one professor, it isn't fair to suggest that \"maybe I should try online teaching instead\".\n\nBut what you're proposing would change the entire university system, and would essentially turn it into distance_learning. If distance_learning is not what you want in 90% of the cases, then the more reasonable response would be for you (or the hypothetical student) to suck it up and go to the disfavored class. There is a reason your department thinks this class is important for you to take if you want to have a broad base of knowledge in that field, and if you want to receive a degree in that discipline from that university, you have to either follow their requirements or petition for an exemption. The systemic problems that such a policy change would create vastly outweigh the individual benefits. \n\nOn a personal note: I have had students intimate that they don't care about my class and are only taking it because it[.] required, and honestly: I get it. You can't care about everything equally. But it would be unfair of me to expect less of them than I do of my students who are engaged in the material. Of course I want my students to enjoy and feel invigorated by my class, but a lot of that is out of my hands. What isn't out of my hands, however, and is rightly within my discretion, is to establish expectations for student performance. Attendance is a part of that performance. \n"}