{"doc_id": "244", "name": "2017_10_humanities_student_major_143_tefl", "namespace": "we1sv2.0", "metapath": "", "pub": "TEFL", "title": "2017-10-humanities-student-major_143_TEFL.txt", "pub_date": "2017-10-02T00:00:00Z", "Sentiment": "0.181", "Subjectivity": "0.392", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "304", "Permalink": "http://reddit.com/r/TEFL/comments/73wyoj/elementary_education_major_is_there_a_huge/dnts68l/", "Threadlink": "http://reddit.com/r/TEFL/comments/73wyoj/elementary_education_major_is_there_a_huge", "Parent_id": "t3_73wyoj", "Reddit_id": "dnts68l", "Subreddit_id": "t5_2qq76", "Commenter": "smashing__", "length": "1892", "content_scrubbed": "Teaching abroad in general is a pretty good situation to be in, whether it[.] TEFL or at International Schools. You still typically get paid decently well enough to save/travel, get free housing/allowance, etc. By far, teaching at an International School is better. Better perks, better pay, more opportunities for career-climbing, PD, better housing, and lots and lots of time off (about 12-14 weeks a year). \n\nIf you aren't officially certified, you won't even be considered for a real accredited International School. There are schools in China and in Korea that *call* themselves International Schools, but really they're just private schools for wealthy Koreans/Chinese. You may qualify for those - I have a friend teaching History in a Chinese \"International School,\" despite only having a Liberal Arts B. A., zero teaching experience, and zero certification. \n\nBut In real International Schools, jobs are competitive, and typically they want you to have a real state teacher certification (or equivalent in another country), and few years of certified classroom experience in your home country before you're a competitive or desirable candidate. \n\nSo if you're not certified, the route you're most likely to take will be a TEFL teacher route as an Education Major. This means you're a bit more desirable a candidate than say a recent college grad with no Education degree or specialization in Ed, but you probably aren't as competitive as someone with a CELTA and several years of teaching experience. \n\nIf you aren't getting certified, I would focus on making yourself the most desirable candidate for the TEFL world - this includes a CELTA, perhaps a Master[.] in TESOL, etc. I wouldn't listen to the people saying you're competitive candidate right now - with no actual teaching experience and an Ed Major, you're certainly hireable, but not in the top tier of candidates by any means."}