{"doc_id": "1013", "name": "2017_04_humanities_student_major_864_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2017-04-humanities-student-major_864_slatestarcodex.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.357", "Score": "14", "Upvotes": "0", "Downvotes": "0", "Wordcount": "482", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_647geh", "Reddit_id": "dfzy44n", "Subreddit_id": "t5_30m6u", "Commenter": "werttrew", "length": "3421", "content_scrubbed": "James Walker for *Quillette*: [Conservatives Aren't the Only Voices Silenced by Academia[.] Intellectual Orthodoxy](http://quillette. com/2017/04/04/conservatives-arent-voices-silenced-academias-intellectual-orthodoxy/).\n\n\n The possibility that one might read a manuscript or approach a cultural or philosophical question from a perspective that isn't explicitly political is now often dismissed as either naive or not worthwhile. In this way, the humanities have constructed a sort of ideological prison house for themselves. One of the most compelling features of humanistic study is the inexhaustibility of interpretations—the capacity to engage a text, a cultural practice, or an age-old philosophical question and derive new meanings and new possibilities from it. As the humanities have become subsumed into a larger political project, the possible interpretations that one may entertain have become narrowed to explicitly politicized readings. An education in the humanities risks becoming nothing more than a political education—that is to say, an education that isn't worth pursuing for anyone other than the already-converted activist.\nImagining the lack of intellectual diversity as an exclusively political problem—a mere injustice to conservatives—fails to grasp the real stultifying effect on our collective intellectual life. The consequences of the hyper-politicization of the humanities go much further than the silencing of opposing voices. The understanding of criticism and interpretation as a primarily political act—one that should \"unmask\" the structural machinations of power or inform activism—also precludes readings and perspectives from a much wider spectrum of human experience, most of which (despite the protestations of certain critics) is not inherently political. Some approaches to art and culture, such as the contemplation of a work[.] aesthetic qualities independent of its political or social content, seem to have been retired along with their tweed-clad exponents. Other paradigms, such as an analysis of literature informed by the current scholarship coming from the cognitive sciences, are aborted before they see the light of day.\n\n\nOne definition of fundamentalism is the tyranny of a single interpretation—the insistence upon the exclusive veracity of a single reading of a text, of one lens through which to view the world, or of one way of existing in it. Much of the humanities have entered into a new theocratic age, unable to imagine an intellectual life outside of a narrow set of political concepts. Far from achieving human and artistic emancipation, the fallout of this political turn has resulted in a new captive mind lingering behind the bars of its own ideological commitments, bound by its own lack of curiosity.\n\nThe solution to hyper-politicization involves more than \"affirmative action\" for the Right, in which a Marxist-feminist reading of *Middlemarch* is balanced by a conservative-libertarian reading. Instead, the humanities are in desperate need of a *perestroika* that opens up the possibility for scholars and students to pursue the full range of intellectual interests, political or otherwise, that might lead one to embrace the life of the mind in the first place.\n\n\n\n\n\n-----\n\nAlso from *Quillette,* Irene Ogrizek[.] [Swingers, Feminism and Social Constructionism](http://quillette. com/2017/03/30/swingers-feminism-and-social-constructionism/).\n\n\n\n\n\n\n"}