{"doc_id": "392", "name": "2017_10_humanities_student_major_1598_neoliberal", "namespace": "we1sv2.0", "metapath": "", "pub": "neoliberal", "title": "2017-10-humanities-student-major_1598_neoliberal.txt", "pub_date": "2017-10-17T00:00:00Z", "Sentiment": "0.154", "Subjectivity": "0.434", "Score": "28", "Upvotes": "0", "Downvotes": "0", "Wordcount": "243", "Permalink": "http://reddit.com/r/neoliberal/comments/772b4g/how_do_we_fix_americas_education_system/doin7kf/", "Threadlink": "http://reddit.com/r/neoliberal/comments/772b4g/how_do_we_fix_americas_education_system", "Parent_id": "t3_772b4g", "Reddit_id": "doin7kf", "Subreddit_id": "t5_2sfn3", "Commenter": "Paramus98", "length": "1404", "content_scrubbed": "Stop making school revenue dependent on how much money the locals make and distribute education funds as needed or at least equally among district. \n\nGive new teachers jobs in the best performing districts and incentivize experienced teachers to work on bad districts. \n\nI'm not sure how to accomplish this but I'd really like to see an overhaul in the system where trade schools and apprenticeships are much more viable options than everyone going to college. Along with this I'd like to see high schools cut back on some of the academic classes in favor of more practical classes like home economics, health and communication. Almost all of my friends in high school were clueless when it came to managing finances or taxes or even how to cook food that isn't top ramen. I think we're graduating people with a lot of knowledge, but really stupid practically and they can't handle life in college on their own. \n\nAllow for students to have more autonomy when picking classes so they can specialize in something they might want to do as a career more instead of future engineers taking four years of literature or humanities_major taking three years of math. I get the appeal of have all these requirements, but so many classes I took in high school were a complete waste of time when I could've been taking something that would've given me a lot more useful information that would helped me right now. "}