{"doc_id": "262", "name": "2017_10_humanities_student_major_285_montana", "namespace": "we1sv2.0", "metapath": "", "pub": "Montana", "title": "2017-10-humanities-student-major_285_Montana.txt", "pub_date": "2017-10-04T00:00:00Z", "Sentiment": "0.062", "Subjectivity": "0.256", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "391", "Permalink": "http://reddit.com/r/Montana/comments/744dkk/ge_executive_selected_as_university_of_montana/dnwsg0u/", "Threadlink": "http://reddit.com/r/Montana/comments/744dkk/ge_executive_selected_as_university_of_montana", "Parent_id": "t3_744dkk", "Reddit_id": "dnwsg0u", "Subreddit_id": "t5_2quij", "Commenter": "subversivepink", "length": "2353", "content_scrubbed": "\nUM employee here.  Nothing about this smells right.  But, nothing has smelled right here for a while.\n\nClayton Christian doesn't have an advanced degree, so just based on that the fact that a candidate lacking a Ph. D. is not surprising to me.  Christian is a former UM Business student.  BOR policy was rewritten (they removed the requirement that a Commissioner have an advanced degree) just a few months before he was sworn in as Commissioner.  His position was never advertised.  I have very little confidence in a system that hired Christian using these questionable ethics selecting the UM president in a forthright manner.\n\nI believe Christian and his \"committee\" (at least one of whom has internal connections with him outside of work) set this up from the beginning with intentionally weak candidates to make it an easy hire with Bodnar.    I called it weeks ago when I first found out who the candidates were.  Considering who is on the BOR, all you have to do to find their preferred choice is to compare backgrounds and interests.  Industry interests.  Privilege.  Big Institution Pedigree.\n\nBodnar applied for the Dean position at the School of Business a couple of years ago.  They wanted Bodnar so badly that when they selected their candidates they intentionally chose weak finalists.  They were confident that Bodnar would accept the position.   Bodnar did not because they couldn't offer him enough money.  \n\nMy theory is that the BOR wants to weaken liberal studies by steering focus away from graduate education and focus on undergrad.  What they are really doing in academia across the country is turning higher ed into glorified vocational schools. There is firm sentiment in education, in society, and in government, that social_sciences and humanities are a waste of time.  Never mind the fact that we teach students how to be civically engaged, how to think, write, and speak effectively, and how to be human.\n\nHOWEVER, perhaps this new leadership is what UM needs simply to pull itself out of the financial bog it is entrenched in.  Engstrom and Brown ran UM into the ground because they pandered to the faculty too much.  UM needs someone with energy who won't continue that pattern.  \n\nAnd, students like him because he[.] sparkly and engaging and has shiny things and is YOUNG.  He[.] what they have been schooled to emulate.\n"}