{"doc_id": "984", "name": "2017_04_humanities_student_major_597_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-04-humanities-student-major_597_politics.txt", "pub_date": "2017-04-06T00:00:00Z", "Sentiment": "0.103", "Subjectivity": "0.458", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "349", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfwqt5b", "Reddit_id": "dfwzxfm", "Subreddit_id": "t5_2cneq", "Commenter": "molotovzav", "length": "1911", "content_scrubbed": "I feel the question people should ask, and it might still be kind of offensive to some people is - Why didn't the government at some point invest in trying to get people out of coal mining?  I feel like 15 years ago or more would have been a good time. Its sickening that we just let coal miners talk their sons into going into the same trade, when they lived at a time they didn't have to (not saying college, but some other trade too is possible at this point).\n\nI know there was some investment to reeducate them in other trades, but it didn't go far enough.  I'm not a super socialist* or anything, but I think in times of \"employment transition\" (like HS diploma is not good enough, or this industry is dead a la coal) the government should step in and help people transition into other work.  Especially when the Gov't is complicit in subsidizing or falsely propping up the industry.\n\n*When I say super socialist, I mean this sarcastically, mostly the internet[.] view of socialism. Truly I believe the Gov't should invest in its citizens, but it should be thought about long before, and the goal should be for eventually the investment to pay for itself. An example is Healthcare, it eventually pays for itself in other ways, if most of the population is insured.  \n\nStudent loans are an investment in citizenry, its broken right now, but not from the Gov'ts angle, the problem is how we view education. Too many people not meant for college, enter it, rack up debt, and can't pay it back. Or wages haven't increased in the last 15 years, so you graduate with the debt, and get a job, and can barely pay your loans back, while having to pay to live at the same time. We should push more people to go to Trade School and other higher ed that isn't just Liberal Arts. The way to push people is incentivize with money. When the Gov't practiced things more akin to this, innovative behavior actually went up.\n"}