{"doc_id": "317", "name": "2017_10_humanities_student_major_772_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_772_AskReddit.txt", "pub_date": "2017-10-09T00:00:00Z", "Sentiment": "0.224", "Subjectivity": "0.536", "Score": "17", "Upvotes": "0", "Downvotes": "0", "Wordcount": "265", "Permalink": "http://reddit.com/r/AskReddit/comments/759ds0/reddit_what_are_some_college_majors_that_should/do4u9sr/", "Threadlink": "http://reddit.com/r/AskReddit/comments/759ds0/reddit_what_are_some_college_majors_that_should", "Parent_id": "t1_do4erj0", "Reddit_id": "do4u9sr", "Subreddit_id": "t5_2qh1i", "Commenter": "GreeneGumby", "length": "1594", "content_scrubbed": "Okay, I realize you're far from the only person (especially on Reddit) to have this opinion, but as a Philosophy and Classical Languages double major I feel the need to say something. I think America (maybe other countries too, but I don't know) have an extremely problematic view about higher education. \n\nMost Americans, including you as far as I can tell, have a belief that college is basically job preparation. You go to college so you can have a better job and make more money. Therefore, colleges/financial aid should cater to student aiming for high paying careers. However, (in my opinion) that misses one of the major goals of any good college: to foster critical thinking and create better citizens. Certainly some people will be happier if they make more money and having business/econ/STEM majors is all well and good, but they aren't the only majors worth pursuing. \n\nAmerica as a country suffers from a populace that is incapable of evaluating sources of information, forming their own well reasoned opinions, and problem solving creatively. Now I'm not saying that humanities_major are the only people who are capable of that, but if there is one thing philosophy teaches, it[.] critical thinking. I think all sorts of humanities_major provide practical skills for being a good citizen that are overlooked in the pursuit of money. And in terms of student loans or financial aid, it seems to me that schools and the government should both be concerned with creating educated, intelligent, and free-thinking citizens, without a bling pursuit of profits or ROI. Just my two cents."}