{"doc_id": "452", "name": "2017_10_humanities_student_major_2199_negareddit", "namespace": "we1sv2.0", "metapath": "", "pub": "Negareddit", "title": "2017-10-humanities-student-major_2199_Negareddit.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.432", "Score": "22", "Upvotes": "0", "Downvotes": "0", "Wordcount": "663", "Permalink": "http://reddit.com/r/Negareddit/comments/786irj/they_should_teach_critical_thinking_in_schools/dorzi8a/", "Threadlink": "http://reddit.com/r/Negareddit/comments/786irj/they_should_teach_critical_thinking_in_schools", "Parent_id": "t1_dortd75", "Reddit_id": "dorzi8a", "Subreddit_id": "t5_2vsbl", "Commenter": "Burn_reddit_pbuf", "length": "3844", "content_scrubbed": "I teach both humanities and STEM and I disagree with you.\n\nYour point about incorporating proofs into math has a few issues: at least from where I'm from, that[.] already the case, and students *hate* it. Even I hate them. So they suffer from the same fate you were describing earlier, which is students not caring. Furthermore, proofs present a logical and methodical way of thinking, but within the framework of math. The critical thinking skills associated with math are a different set than the ones associated with sciences (they're similar to math, but just different enough) and they're *very* different than the CT skills associated with humanities. Kids already have a very comprehensive curriculum regarding math and science CT skills, and although it could be better, humanities has an extremely bare-bones approach in most schools.\n\nWhat kids need is activities that enhance these CT skills in humanities. I feel like my high school did a good job in this, as I:\n\n-Participated in Socratic Seminars in English class. These seminars teach you the skills necessary to critically analyze a literary work, use it to build a case, and then defend that in a discussion with your peers. There is no objectively correct answer like in math (although it should be pointed out that there are objectively incorrect answers), and that open-ended and free-flowing discussion is good for CT.\n\n-Completed a project for my civics class where I had to pick 10 articles from 10 different news sources and analyze both the contents of the articles and the validity of the source. It basically taught me how to spot real news vs fake news. This kind of CT skill is probably the most important one for kids to learn, judging by the recent election.\n\n-Participated in debates about contentious historical issues where I was assigned a topic and a perspective and had to defend it, even if I didn't agree with it. This required all students to not only seek out valid historical sources with which to back up their arguments but also put themselves in the shoes of other people with differing perspectives. Another CT skill we desperately need.\n\n-Wrote literary criticism using sources I had to seek out. The skill of academic research is one that really isn't taught until college, and even then only if you're going into English, but it should be taught in high school as it requires you to analyze the validity of sources, read various perspectives on topics involving the human condition, and then use them to make your own point. Much different CT skills than memorizing theorems and postulates and properties. \n\nThere are other instances that slip my mind, but you get my point (it should also be pointed out that all of the above occurred in AP classes). The issue is not that kids aren't receiving a good enough STEM education and if we beef that up students will have the necessary CT skills. Math/science CT is different than humanities CT, as the former is almost only rooted in logic and the latter rooted in both logic and emotion.\n\nI know the reddit circlejerk hates to acknowledge the constant presence of emotion in literally every one of our acts and institutions and way we view the world, but we as a society need to get better at learning the CT skills that involve emotion. When I got my bachelor[.] in a STEM field from a top STEM research university, I graduated and thought \"Wow I took almost no humanities classes and I didn't have to because of AP credit\". The ones I did take, the professors were either terrible or the curriculum was super simple to make sure STEM folk passed or no one cared about it or all of the above (usually all of the above). I didn't walk away with a good education. Sure I can critically analyze mechanical systems, but I couldn't critically analyze institutions, society, people, etc. That[.] the issue."}