{"doc_id": "961", "name": "2017_04_humanities_student_major_452_babybumps", "namespace": "we1sv2.0", "metapath": "", "pub": "BabyBumps", "title": "2017-04-humanities-student-major_452_BabyBumps.txt", "pub_date": "2017-04-04T00:00:00Z", "Sentiment": "0.059", "Subjectivity": "0.282", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "287", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63imzg", "Reddit_id": "dfun3us", "Subreddit_id": "t5_2s7cl", "Commenter": "velcrosocks", "length": "1531", "content_scrubbed": "Are you in a situation where you would consider moving? There are music teacher jobs opening all over in my district and districts nearby and I live in a state that is trying to honor the arts and PE but give it no funding, so essentially they are in a position where they can't cut music art and PE but they don't have money to fund it so they are cutting gen Ed teachers instead and making the classes larger (37-45 students per classroom depending on grade level). It isn't easy anywhere as an arts or PE teacher, I feel for you so deeply. You constantly have to justify a job that is a necessity for society and it[.] the dumbest thing, but the kids and the value to society are worth it. I am at high risk of loosing my job next year and like you, I make more than my husband. In our state though, loosing my job qualifies me and my babies for state health care, child care assistance, electric assistance, rent assistance and food stamps and WIC. Not ideal or fun or productive but the safety net is there to help you find time to get back on your feet. But, like I said if you can move there are music teaching positions opening up all over and the music teacher community is really tight (so small that everyone knows everyone who teaches across the state) which can be beneficial for professional development opportunities. PM me and I can give you a little more info if you're interested. I am basically waiting to hear whether I have a job next year right now (gen Ed) so I completely understand the stress you're under! "}