{"doc_id": "1037", "name": "2017_04_humanities_student_major_1059_enough_sanders_spam", "namespace": "we1sv2.0", "metapath": "", "pub": "Enough_Sanders_Spam", "title": "2017-04-humanities-student-major_1059_Enough_Sanders_Spam.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.365", "Score": "18", "Upvotes": "0", "Downvotes": "0", "Wordcount": "318", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64jftj", "Reddit_id": "dg2kent", "Subreddit_id": "t5_3fmhe", "Commenter": "swerfherder", "length": "1937", "content_scrubbed": "I also finally figured out today why Bernie[.] \"free college for everyone at every public university in the US, no matter if you get As or you flunk out\" plan bugs me.\n\nIt'll do nothing but stratify the classes more. As more and more people pour into public universities, they'll become run of the mill diploma farms for partying, chilling and just passing through. No tuition and people going there anyway-because it[.] free!-will not give schools incentive to better their facilities, add new amenities or bulk up their programs. Public schools will no longer attempt to compete with private schools or each other for one[.] tuition dollars and education as a whole will suffer. More students=enormous class sizes will become the norm, and since the incentive of the poor at these public universities will be to get a career only, the liberal_arts will be completely phased out. Instead of teaching students how to think critically and graduating well rounded, thoughtful people (which is a boon for the workforce) these universities will just churn out unthinking automatons ready to work in STEM, radiology, or whatever US News and World Report says will be the most profitable career of the next decade. But, as these fields get over saturated, unemployment will increase exponentially. These public universities will graduate the unprepared and throw them into a vicious cycle.\n\nMeanwhile private universities will become more and more elite, until they're just for the children of the 1% that Bernie so hates. They'll become the last bastions of the liberal_arts, for people who can \"afford\" to study the politics of gender or anthropology. These people will use this knowledge to get advanced jobs or funnel back into the university system. The gap between the upper and middle classes will only increase.\n\nI truly believe free tuition for all would destroy higher education in this country and make economic inequality even worse. "}