{"doc_id": "274", "name": "2017_10_humanities_student_major_375_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-10-humanities-student-major_375_AskHistorians.txt", "pub_date": "2017-10-05T00:00:00Z", "Sentiment": "0.074", "Subjectivity": "0.358", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1587", "Permalink": "http://reddit.com/r/AskHistorians/comments/74bzpx/what_stopped_italy_from_uniting_and_being_a/dny3xcl/", "Threadlink": "http://reddit.com/r/AskHistorians/comments/74bzpx/what_stopped_italy_from_uniting_and_being_a", "Parent_id": "t3_74bzpx", "Reddit_id": "dny3xcl", "Subreddit_id": "t5_2ssp3", "Commenter": "AlviseFalier", "length": "9972", "content_scrubbed": "There are a number of institutional quirks in Italy which made it particularly well-suited to decentralized power structures; and it was these very power structures which allowed for artistic, economic, and social development. That development, in turn, permitted sustained disunity. In short, a cyclical self-reinforcing cycle. Could it have been broken? Probably not, but not for lack of trying. \n\nThe important point has to do with Italy[.] Roman heritage: it is not a consequence of happenstance that the center of Europe[.] greatest empire is a peninsula characterized by dense urbanization, high agricultural productivity, and strong internal and external trade links. This afforded the two post-Roman kingdoms of Italy (both Lombard and Carolingian) an enormous potential for internal instability: with relatively small power bases, aristocrats could easily challenge the state; while the state, such as it existed, even in times of tranquility could never adequately affirm itself. And let[.] not forget that Lombard Kingdom in particular never even consolidated control of the entire Italian peninsula, with entire corridors connecting major urban/productive areas held by the Eastern Empire. \n\nSo given this structural set-up, when in the tenth century the German Ottonian dynasty found itself in a position to reaffirm some of the Carolingian territorial acquisitions it was understandably much easier to do so in Italy as opposed to the other carolingian breakaway, that is to say France; indeed Otto removed the King of Italy with relative ease. The Ottonian-imposed governmental system didn't change much in Italy; it was in great part dependent on a highly autonomous clergo-administrative structure. In Germany, this this provided for a pragmatic counterbalance against the powerful landed aristocracy. In Italy, this strengthened the urban clergy, who had for centuries already appropriated the old Roman basilicas (a word which we associate with a religious structure, but Romans and indeed medieval Italians would associate with the courts and marketplaces). The Ottonian system was also highly dependent on the Emperor[.] itinerant circuit around his realm to direct the administrative clergy; and it is difficult to do so south of the Alps for all but the most well-supported rulers, creating further administrative and political distance between the two components of the then-new Holy Roman Empire.  \n\nThus, when the last Ottonian Emperor (Henry II) died without designating a clear successor, the German Dukes settled on a compromise-candidate: one Conrad the Salian, a relatively obscure mid-level aristocrat. Although the election had avoided unrest within Germany, its result was a ruler at the center of a delicate balancing act without the resources to bring the Italian portion of his realm in line. Indeed, the very clergo-political administration Conrad[.] Ottonian predecessors put in place came up with the legal argument whereby there is no reason to immediately associate the German succession with the Italian one. From then on, the German Kaiser would have to appear in Italy at the head of an army (or at least prove he had one) in order to be crowned Holy Roman Emperor and claim rule over Italy. \n\nThe urban-centric power structures fostered inclusiveness, enfranchisement, rule of law, and as a consequence, trade and prosperity. A collaborative sort of government emerged, whereby leading dynasties ruled together in \"Communal\" governments. The system was far from our concept of stable, and when the threat of an Imperial military intervention to claim the crown of Italy manifested itself the response was disunited and ineffective in all but the most dire situations. However, these threats were few and far between enough to not warrant a significant deviation from the prosperous but fragmented, urban-centric political system. And this fragmentation further drove competition, efficiency, and a drive by collaborative political institutions to facilitate citizens to be as competitive as possible, pushing wages upwards, accelerating the economy, raising the standard of living, and creating an environment that could support innovation for innovation[.] sake in fields like the arts.\n\nNow, one of my biggest peeves is the word \"City-States.\" Although these polities were urban-centric, many of the Communal Governments ruled over a dense network of interconnected urban, suburban, and rural territories. Although in no way comparable to the German or French duchies of the time, the Italian city-centric governmental system nonetheless brought together urban artisans, rural landed aristocrats, and an entrepreneurial middle class that could be a little bit of both. Some governments, like those in Milan, Verona, Florence, and to a lesser extent, Padua, gained a reputation \"bullies,\" expanding their territory far beyond their outskirts.\n\nWhat starts happening in the thirteenth century, and really kicks in gear in the fourteenth, is the ossification and consolidation of the Italian political landscape. The Communal government is the consequence of convergence of equally matched power structures; when one structure grows more powerful than the others, the system starts to break down. Of course, this isn't universal: Bologna, for example, retained an internal power balance until it suffered a fairly direct intervention from the much more consolidated Viscontean state in Lombardy, to the north (and was eventually integrated into the Papal States, much to the local aristocracy[.] dismay). Venice, famously, never ceased to be a republic. But what is important to understand is that by this point in time, the Italian states were for all intents and purposes early modern polities with well-defined borders. \n\nThe idea of unifying Italy certainly crossed the mind of some pre-early-modern rulers in Italy (let[.] call them pre-modern, even if that might confuse some people). In the first half of the 14th century, poets in Cangrande Della Scala[.] court wrote that if he had wanted to he could unify Italy in a year. It is fair to assume that any sufficiently powerful Italian sovereign might have given a thought or two to crowning himself \"King of Lombardy\" or even \"King of Italy.\" However, the actual unification of Italy involved so many moving parts that the feat proved impossible until the aftermath of the Napoleonic conquest simplified things a bit.\n\nThe first set of moving parts making unification difficult involved the sheer multitude of Italian states: every time it looks like one sovereign might unify Italy, push comes to shove and the largest states prove that they're actually too evenly matched for any one of them to make much headway. In the aforementioned example about Cangrande Della Scala, his state of Verona came to govern the cities of Belluno, Treviso, Vicenza, and Brescia, while Padua was subjected to a form of vassalage, and tight rapports of fealty were struck with Parma, Lucca, and Cividale. However, after Cangrande[.] death his nephew Mastino, no less an able ruler, found that Florence, Bologna, and Venice had struck an alliance to end his dynasty[.] hegemony in northeast Italy. Although initially the Scaliger Veronese state might have survived the conflict with their lands mostly intact (Bologna wasn't in any state to fight a war, Venice was only interested in culling further expansion, and Florence wouldn't realistically be able to project itself past the Apennines) Mastino was presented with a game-changing impasse when Lordoriso Visconti, escaped from his prison after having attempted to usurp the lordship of Milan from his uncle Azzone, sought refuge at his court. Although Lordoriso might have been a useful pawn in a bid to destabilize Lombardy had the Milanese and Veronese been on equal footing, with the Scaligers hounded by nearly all of northern Italy, Azzone was quick use his nephew[.] flight as a pretext to unify the divided Milanese nobility and join the conflict (as well as machinate the blessing of the Pope, and rescue his beleaguered rule). \n\nSimilarly, a generation later Gian Galeazzo Visconti, Azzone[.] descendent who following the Scaliger[.] defeat was hegemon in the north, couldn't proclaim himself King of Lombardy because he died of the plague and his less able successors saw the Milanese state cut down to size by rivals. And if fighting the rest of Italy proved to difficult, what if foreign powers were to get involved? Any claim to the title of King of Italy/Lombardy could easily provoke a war with the Kaiser in Germany, seeing as from the tenth century the crowns of Italy and Germany had been technically united in the Holy Roman Empire. Although Imperial authority was very much dependent on how willing and able the Kaiser was to descend into Italy to keep an eye on things, Italian autonomy had more than once unleashed long conflicts. It had been much safer for Gian Galeazzo to just claim the title Duke of Milan and keep it at that, as it would be for any other ruler in Italy. In fact, one hundred years later Cosimo de' Medici felt it better to raise himself to the title of Grand Duke of Tuscany, one step below calling himself King, even though he very well could have.\n\nOf course, we're dealing with tenuous counterfactuals: both France and Germany were particularly disinterested in Italy at the time of Gian Galeazzo[.] rule, and old Gian certainly had a the largest state ever seen in Italy at his command. Would he have been able to proclaim himself king if he had, say, a decade more tacked onto his life and an adult son to help him? Maybe, the Duchy of Milan was certainly even more formidable than the state assembled by the Scaligers. But keep in mind there hadn't been a Kingdom of Italy four over for hundred years; there was absolutely no apparatus or precedent to support a monarchy. Would the Visconti have been able to build such an apparatus while also fighting a long war on multiple fronts? Probably not."}