{"doc_id": "297", "name": "2017_10_humanities_student_major_572_personalfinance", "namespace": "we1sv2.0", "metapath": "", "pub": "personalfinance", "title": "2017-10-humanities-student-major_572_personalfinance.txt", "pub_date": "2017-10-07T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.343", "Score": "65", "Upvotes": "0", "Downvotes": "0", "Wordcount": "272", "Permalink": "http://reddit.com/r/personalfinance/comments/74xika/recently_came_into_about_50000_im_26_no_college/do1utx1/", "Threadlink": "http://reddit.com/r/personalfinance/comments/74xika/recently_came_into_about_50000_im_26_no_college", "Parent_id": "t3_74xika", "Reddit_id": "do1utx1", "Subreddit_id": "t5_2qstm", "Commenter": "EnviroguyTy", "length": "1534", "content_scrubbed": "If you're worried about the cost of a college degree, you could always go to a community or technical college and get a two year degree. If your area is anything like mine (also mid-sized midwestern city), the cost of a two year degree from a technical college is something like $10k-$15k in total, books included. \n\nThere are plenty of lucrative trades or fields to pursue with a two year degree, and many of these technical colleges have great ties with businesses in the community. I'm currently attending such a school and love it; they're much more flexible with my schedule as far as online offerings go and are more focused on the application of knowledge rather than theory (as many liberal_arts universities are).\n\nOr if school isn't your thing, invest it or put a large sum up for a down payment on a house. However, I do highly recommend at least a two year degree as the return on investment (especially factoring in cost) is usually very high.\n\nEDIT: Also, for reference, I am also 26. One thing I found out when I was no longer considered a \"dependent\" for financial aid purposes was I became eligible for many more grants that I had previously been ineligible for (I received quite a bit more from grants as I got older). Technical and community colleges love returning adults or students a little older than your average college freshman. YMMV though depending on school and other aid offerings for your state (I'm in WI). I hope this helps; I'd be willing to discuss my specific situation in more depth if you'd like."}