{"doc_id": "398", "name": "2017_10_humanities_student_major_1642_utaustin", "namespace": "we1sv2.0", "metapath": "", "pub": "UTAustin", "title": "2017-10-humanities-student-major_1642_UTAustin.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.385", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "305", "Permalink": "http://reddit.com/r/UTAustin/comments/776m1l/why_did_you_choose_a_useless_major/dojn2eu/", "Threadlink": "http://reddit.com/r/UTAustin/comments/776m1l/why_did_you_choose_a_useless_major", "Parent_id": "t1_dojkgai", "Reddit_id": "dojn2eu", "Subreddit_id": "t5_2qy08", "Commenter": "I_Provide_Feedback", "length": "1643", "content_scrubbed": "Immigrant here, pursing a liberal_arts degree. God, I must be an idiot!\n\nThe fear of financial insecurity can actually be the best motivation to grow up and become the person you want to be. I started as an engineering student because I was attracted by the salaries out of college for those students. But, I quickly saw that while I love technology and science, I don't love all the work that happens at STEM jobs, and the field is just not for me. \n\nNow I am in liberal_arts, about to graduate and truly embrace the struggle to make a meaningful wage out of college. I probably won't find a job that pays $70,000+ right away, or even one that pays $40,000+. But as a result, I've already began to work on the side in a field which closely correlates to my dreams, simply because I'm going to want that extra income in the near future. I've gone out of my way to learn things about grammar, copywriting, and writing styles, that are not part of any curriculum here at UT, which not only put me ahead of other students pursuing the same opportunities, but brought me closer to writing my own book than if I waited until later. I never had that same desire to learn more and be curious about my subject as an engineer, and I would have only learned things from my classes.\n\nMaybe it is a good idea to just seek financial security, but I want to be a better, more intelligent person after college. My parents brought me here to have a better life, not just to have more money.\n\nThere is nothing wrong with anyone pursuing their desires, wherever they come from. The world doesn't need to funnel everyone into a well paid position out of college."}