{"doc_id": "252", "name": "2017_10_humanities_student_major_227_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-10-humanities-student-major_227_ApplyingToCollege.txt", "pub_date": "2017-10-03T00:00:00Z", "Sentiment": "0.155", "Subjectivity": "0.323", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "254", "Permalink": "http://reddit.com/r/ApplyingToCollege/comments/741wpv/yale_firstyear_ama/dnve03d/", "Threadlink": "http://reddit.com/r/ApplyingToCollege/comments/741wpv/yale_firstyear_ama", "Parent_id": "t1_dnv3be6", "Reddit_id": "dnve03d", "Subreddit_id": "t5_2y2r8", "Commenter": "CheckMyBrain11", "length": "1450", "content_scrubbed": "I love New Haven! It[.] important to remember that the stereotypes about each school are invented by rich white people, so as a working-class student, I'm not taken aback by the homeless or people at bus stations in the same way that a country club kid would be. \n\nI love the res college system! It[.] very fraternal, but also a great way to banter between each other and make a very wholesome and inclusive place a little more competitive. \n\nMy top three of accepted schools was Yale, Princeton, and ND. ND would've given Yale a run for its money if costs were equal, but ND was about twice as much. Princeton was marginally cheaper, but it was so WHITE. I'm from a state that[.] 93% white and am white myself, but the boat shoes, salmon shorts, and elitism were so manifest that even I cringed a bit. \n\nI applied RD. I can't say on the boost, but if Yale is your dream, SHOOT YOUR SHOT.\n\nI don't think it[.] particularly important, because EC[.] and major don't always match up while in college. A senior I've befriended was just offered by Bain, and the bulk of his extracurricular background is a cappella. Strong EC[.] in general, though, do matter.\n\nNot at all. Computer Science is quickly picking up storm, and the math/stats department is far from empty. Couple that with your traditional engineering/bio/chem/physics major and it[.] definitely still a healthy part of campus. Humanities are stronger than STEM generally but STEM is alive and well. "}