{"doc_id": "440", "name": "2017_10_humanities_student_major_2057_anarcho_capitalism", "namespace": "we1sv2.0", "metapath": "", "pub": "Anarcho_Capitalism", "title": "2017-10-humanities-student-major_2057_Anarcho_Capitalism.txt", "pub_date": "2017-10-21T00:00:00Z", "Sentiment": "-0.141", "Subjectivity": "0.483", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "322", "Permalink": "http://reddit.com/r/Anarcho_Capitalism/comments/77u4fh/the_cult_of_bernie_sanders_is_a_cult_of_complete/dooy2vh/", "Threadlink": "http://reddit.com/r/Anarcho_Capitalism/comments/77u4fh/the_cult_of_bernie_sanders_is_a_cult_of_complete", "Parent_id": "t1_dooxddk", "Reddit_id": "dooy2vh", "Subreddit_id": "t5_2qorf", "Commenter": "Lethn", "length": "1827", "content_scrubbed": "I think there[.] something to be said for the argument about supply and demand with degrees, but there[.] more to it than that, the biggest problem with all of these degrees is they're fucking worthless.\n\nThey had no value to begin with, but all these students have been tricked into thinking they're geniuses for having them when in reality someone like me with no formal educational background can outwit them pretty easily in a basic political argument. Had any of these people gotten some kind of skillset or trade, welding, programming and so on they may have done something with their lives but no, they all chose liberal_arts, history, english literature and so on and then proceed to blame everybody else for it.\n\nI know what it[.] like to have a shit education, but these people piss me off because they are deliberately going out of their way to demonise and attack other people for their problems while unironically claiming that Trump supporters etc. are unfairly demonising migrants.\n\nI even saw this bullshit unfold before my eyes when I got into an argument with a guy recently who told me he had a physics and chemistry degree. He sort of semi-acknowledged it was his degree that was the problem yet the guy kept on fucking insisting it was racists 'rejecting' a black president that ended up causing the economy to fail and meant he couldn't get a job in the fields he was qualified for.\n\nI'm not even making that up, it was over on the MRA sub, then it just devolved into an extremely tedious back and forth between me and him where he was getting defensive and acted like he hadn't said that even though the damn post history is all there.\n\nAnti-capitalists who blame automation and racists for all their woes are no better than the white supremacists they complain about, they're all a bunch of annoying cunts."}