{"doc_id": "1077", "name": "2017_04_humanities_student_major_1456_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-04-humanities-student-major_1456_AskHistorians.txt", "pub_date": "2017-04-12T00:00:00Z", "Sentiment": "0.066", "Subjectivity": "0.36", "Score": "70", "Upvotes": "0", "Downvotes": "0", "Wordcount": "512", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg6nhze", "Reddit_id": "dg6pirk", "Subreddit_id": "t5_2ssp3", "Commenter": "michaelnoir", "length": "3342", "content_scrubbed": "For that you need look no further than the history of the Situationist International, formed in 1957 in the aftermath of the Hungarian Revolution, and taking as their ideal form the workers' councils evidenced in Budapest at that time. \n\nThe idea of the worker[.] councils was related to the historical examples of council communism and informed the student movement of the 1960[.], reaching its peak in the events of May 1968. \n\nA quote from Enrages et situationnistes dans le mouvement des occupations (Paris: Gallimard, 1968) by Rene Vienet: \"The Stalinists, ideologues of the bureaucratic totalitarian form of exploitation, were reduced in France, as elsewhere, to a purely conservative role. For a long time it had been impossible for them to take power, and the international dislocation of the bureaucratic monolith, which is necessarily their frame of reference, had closed this road to them forever. At the same time, that frame of reference, and the practice it entails, made their return to a purely bourgeois reformist apparatus equally impossible. The Maoist variation, reproducing as illusion the ascendant period of Stalinism by the religious contemplation of a revolutionary orient of fantasy, parroted their translations in a perfect vacuum. The three or four Trotskyite sects fought bitterly amongst themselves for the glory of beginning the revolution of 1917 again, as soon as they had succeeded in reconstituting the appropriate party. These \"resuscitated Bolsheviks\" were too fanatical about the revolutionary past and its worst errors even to look at modern conditions. Some of them mixed this historical exoticism with the geographic exoticism of a more or less Guevarist revolution of underdevelopment. If any of them picked up a militant from time to time this was in no way the result of the truth of their analyses or actions, but simply of the decomposition of the so-called communist bureaucracies.\n\nAs for the modernist pseudo-thinkers of the critique of details, these leftovers of militancy who had established themselves in the so-called Humanities Departments and who were thinking for all the weekly magazines, it[.] obvious they were incapable of understanding — let alone foreseeing — anything whatsoever, eclectically weighed down as they were with almost every aspect of the old world[.] camouflages. They found themselves too attached to the bourgeois state, to an exhausted Stalinism, to a revitalized Castro-Bolshevism, to psycho-sociology, and even to their own miserable lives. They respected everything. They lied about everything. And we find them around today, still ready to explain everything to us!\"\n\nRemember of course, that \"the Left\" is not one homogeneous mass but, then as now, is a diverse tendency in political and social affairs, with an authoritarian and libertarian wing as well as a more liberal and more conservative element. It is also plagued by sectarianism and dissension which made reactions to Hungary differ by tendency. \n\nThere are certainly very enthusiastic books written about the Hungarian Revolution by those on the libertarian left, like Andy Anderson[.] [\"Hungary 56\"](https://libcom. org/library/hungary-56-andy-anderson). For the anarchists, the Hungarian Revolution is almost the most important thing to happen in Europe since the Spanish Revolution 20 years before. "}