{"doc_id": "513", "name": "2017_10_humanities_student_major_2822_musictheory", "namespace": "we1sv2.0", "metapath": "", "pub": "musictheory", "title": "2017-10-humanities-student-major_2822_musictheory.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.16", "Subjectivity": "0.345", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "819", "Permalink": "http://reddit.com/r/musictheory/comments/79hg5j/music_theory_is_school/dp1yz4h/", "Threadlink": "http://reddit.com/r/musictheory/comments/79hg5j/music_theory_is_school", "Parent_id": "t3_79hg5j", "Reddit_id": "dp1yz4h", "Subreddit_id": "t5_2qrjj", "Commenter": "65TwinReverbRI", "length": "4650", "content_scrubbed": "Well, the first thing I have to ask is, are you taking a specific Music Theory class at your school that[.] like the same as an English or Math or History class?\n\nOr are you talking about whatever Music Theory you might cover in Band/Orchestra/Choir?\n\nThere is \"so much more to learn\" but you have to understand that a Band Director, for example, needs to prepare for the \"Winter Concert\" so they have to concentrate on very specific things - their goal is to teach what is needed to play pieces they've selected that are appropriate for the ensemble as a whole. You may not realize it, but there is actually a method to their madness.\n\nIf you are taking a \"Music Theory\" class that[.] separate from band, it really should address more, but again there[.] always the possibility that a school system might offer these as a way to reinforce what is learned in ensemble classes and to help support them rather than be a separate thing for people actually interested in theory. It[.] just a logistics thing. Schools only have so many resources.\n\nThere can be some other options for you if your school doesn't provide the knowledge you want. I would recommend:\n\nStudy with a private teacher who knows theory and is willing and able to teach you more about it. Piano and Guitar instructors often have better theory knowledge than most, but you still have to seek out someone with a good reputation for teaching that. It is possible to take theory with a teacher who teaches a different instrument than what you play but it would be far better to learn on your instrument if you can because it can make the concepts immediately applicable.\n\nCheck to see if there are any \"school of the arts\" or \"music school\" type teaching establishments in your area - these are usually \"lessons studios\" that are not just a single piano teacher, but a group of various teachers who all work under one business. You're more likely to find someone there you could be referred to who has a stronger background in theory.\n\nLikewise, you can go to your local music stores - especially if they offer lessons on various instruments, and ask if any of the instructors can help you with theory studies.\n\nWe have a \"Governor[.] School for the Arts\" where I live, which is basically \"advanced\" studies for musicians and artists in our region - it[.] open to all Public High School students. They have to audition, but once in, they basically spend part of their school day there studying music history, theory, their instrument and so on.\n\nSome places call these \"Magnet\" schools. Check to see if your school system has one (or if not in the US, something similar in your country).\n\nSome colleges and universities also offer courses and you might be able to take something as a non-degree seeking student or as a summer course they offer, etc. Our university has a \"subsidiary\" school of music that is basically a way for the general public to study with university instructors (you register through the university) and they do everything from weekly lessons to 6 or 8 week session and so on.\n\nMany students who come through a Magnet style program or this university subsidiary enter college as a freshman with what equates to \"AP Credit\" in Music Theory.\n\nFor students who don't have a resource like that at their own school or can't find a private instructor, this is a very good alternative for them.\n\nOf course, all of these not supported by your public school system will cost you money...\n\nPlease remember though that many people want to be *performers* and music theory for performance is really only needed at the basic level (or not at all in some cases - at least academic training).\n\nIf you're interested in \"Composing\" maybe you need to take Composition Lessons privately. The class at your school may be geared more towards performance aspects (regurgitation rather than creation...). And don't blame them though because it may either be a necessity, what the school system has dictated (i. e. to prepare students for a college audition) or just maintaining a tradition.\n\nBut yeah, if it[.] not what you want, you need to seek out what you do want.\n\nOf course, there[.] always the good ol' learning things online, but there[.] so much information out there that[.] just plain wrong, and so much of it is not \"pedagogical\" - meaning you don't get it in any logical order that helps you learn - much of it useless for now, and you end up with gaps in your knowledge... so if you do take on trying to learn stuff online, realize that everything you read on the internet isn't always true, and always be open-minded as you may have to \"unlearn\" or \"relearn\" things.\n\nHTH and Good Luck"}