{"doc_id": "338", "name": "2017_10_humanities_student_major_1049_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-10-humanities-student-major_1049_politics.txt", "pub_date": "2017-10-11T00:00:00Z", "Sentiment": "-0.003", "Subjectivity": "0.303", "Score": "1221", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1322", "Permalink": "http://reddit.com/r/politics/comments/75pb5b/donald_trump_threatens_to_shut_down_nbc_and_other/do7yp4q/", "Threadlink": "http://reddit.com/r/politics/comments/75pb5b/donald_trump_threatens_to_shut_down_nbc_and_other", "Parent_id": "t3_75pb5b", "Reddit_id": "do7yp4q", "Subreddit_id": "t5_2cneq", "Commenter": "peeinian", "length": "8094", "content_scrubbed": "The 14 Defining Characteristics Of Fascism\n\nFree Inquiry\n\nSpring 2003\n\n5-11-3\n\nDr. Lawrence Britt has examined the fascist regimes of Hitler (Germany), Mussolini (Italy), Franco (Spain), Suharto (Indonesia) and several Latin American regimes. Britt found 14 defining characteristics common to each:\n\n1. Powerful and Continuing Nationalism - Fascist regimes tend to make constant use of patriotic mottos, slogans, symbols, songs, and other paraphernalia. Flags are seen everywhere, as are flag symbols on clothing and in public displays.\n\n2. Disdain for the Recognition of Human Rights - Because of fear of enemies and the need for security, the people in fascist regimes are persuaded that human rights can be ignored in certain cases because of \"need.\" The people tend to look the other way or even approve of torture, summary executions, assassinations, long incarcerations of prisoners, etc.\n\n3. Identification of Enemies/Scapegoats as a Unifying Cause - The people are rallied into a unifying patriotic frenzy over the need to eliminate a perceived common threat or foe: racial , ethnic or religious minorities; liberals; communists; socialists, terrorists, etc.\n \n4. Supremacy of the Military - Even when there are widespread domestic problems, the military is given a disproportionate amount of government funding, and the domestic agenda is neglected. Soldiers and military service are glamorized.\n\n5. Rampant Sexism - The governments of fascist nations tend to be almost exclusively male-dominated. Under fascist regimes, traditional gender roles are made more rigid. Divorce, abortion and homosexuality are suppressed and the state is represented as the ultimate guardian of the family institution.\n\n6. Controlled Mass Media - Sometimes to media is directly controlled by the government, but in other cases, the media is indirectly controlled by government regulation, or sympathetic media spokespeople and executives. Censorship, especially in war time, is very common.\n\n7. Obsession with National Security - Fear is used as a motivational tool by the government over the masses.\n\n8. Religion and Government are Intertwined - Governments in fascist nations tend to use the most common religion in the nation as a tool to manipulate public opinion. Religious rhetoric and terminology is common from government leaders, even when the major tenets of the religion are diametrically opposed to the government[.] policies or actions.\n\n9. Corporate Power is Protected - The industrial and business aristocracy of a fascist nation often are the ones who put the government leaders into power, creating a mutually beneficial business/government relationship and power elite.\n\n10. Labor Power is Suppressed - Because the organizing power of labor is the only real threat to a fascist government, labor unions are either eliminated entirely, or are severely suppressed.\n\n11. Disdain for Intellectuals and the Arts - Fascist nations tend to promote and tolerate open hostility to higher education, and academia. It is not uncommon for professors and other academics to be censored or even arrested. Free expression in the arts and letters is openly attacked.\n\n12. Obsession with Crime and Punishment - Under fascist regimes, the police are given almost limitless power to enforce laws. The people are often willing to overlook police abuses and even forego civil liberties in the name of patriotism. There is often a national police force with virtually unlimited power in fascist nations.\n\n13. Rampant Cronyism and Corruption - Fascist regimes almost always are governed by groups of friends and associates who appoint each other to government positions and use governmental power and authority to protect their friends from accountability. It is not uncommon in fascist regimes for national resources and even treasures to be appropriated or even outright stolen by government leaders.\n\n14. Fraudulent Elections - Sometimes elections in fascist nations are a complete sham. Other times elections are manipulated by smear campaigns against or even assassination of opposition candidates, use of legislation to control voting numbers or political district boundaries, and manipulation of the media. Fascist nations also typically use their judiciaries to manipulate or control elections.\n\n\nhttp://rense. com/general37/fascism. htm\n\nLooks like we can check off item #6 on the list.  By my count, that makes it 12/14 that are easily confirmed.  Congratulations America, you are only 2 traits away from becoming a textbook fascist nation!  I mean, #14 is all but a given, but I'll wait for Mueller to finish before I consider it proven.  \n\n**EDIT**: Since this comment is getting some attention I suggest everyone follow the link and read the book summary on the same page.  It is personal stories from German citizens during Nazi rule.  It was originally printed in 1955, so they are first hand accounts of how fascism slowly took hold.  \n\nHere are some key excerpts that sound all too familiar:\n\n*  \"What happened here was the gradual habituation of the people, little by little, to being governed by surprise; to receiving decisions deliberated in secret; to believing that the situation was so complicated that the government had to act on information which the people could not understand, or so dangerous that, even if he people could understand it, it could not be released because of national security. And their sense of identification with Hitler, their trust in him, made it easier to widen this gap and reassured those who would otherwise have worried about it.\"\n\n\n* \"\"Those,\" I said, \"are the words of my friend the baker. \"One had no time to think. There was so much going on.\" \"Your friend the baker was right,\" said my colleague. \"The dictatorship, and the whole process of its coming into being, was above all diverting. It provided an excuse not to think for people who did not want to think anyway. I do not speak of your \"little men\", your baker and so on;... we were decent people - and kept us so busy with continuous changes and \"crises\" and so fascinated, yes, fascinated, by the machinations of the \"national enemies\", without and within, that we had no time to think about these dreadful things that were growing, little by little, all around us. Unconsciously, I suppose, we were grateful. Who wants to think?\"\n\n* \"To live in this process is absolutely not to be able to notice it - please try to believe me - unless one has a much greater degree of political awareness, acuity, than most of us had ever had occasion to develop. Each step was so small, so inconsequential, so well explained or, on occasion, \"regretted,\" that, unless one were detached from the whole process from the beginning, unless one understood what the whole thing was in principle, what all these \"little measures\" that no \"patriotic German\" could resent must some day lead to, one no more saw it developing from day to day than a farmer in his field sees the corn growing. One day it is over his head.\n\n* \"And one day, too late, your principles, if you were ever sensible of them, all rush in upon you. The burden of self deception has grown too heavy, and some minor incident, in my case my little boy, hardly more than a baby, saying \"Jew swine,\" collapses it all at once, and you see that everything, everything, has changed and changed completely under your nose. The world you live in o your nation, your people o is not the world you were in at all. The forms are all there, all untouched, all reassuring, the houses, the shops, the jobs, the mealtimes, the visits, the concerts, the cinema, the holidays. But the spirit, which you never noticed because you made the lifelong mistake of identifying it with the forms, is changed. Now you live in a world of hate and fear, and the people who hate and fear do not even know it themselves; when everyone is transformed, no one is transformed. Now you live in a system which rules without responsibility even to God. The system itself could not have intended this in the beginning, but in order to sustain itself it was compelled to go all the way."}