{"doc_id": "1093", "name": "2017_04_humanities_student_major_1725_premed", "namespace": "we1sv2.0", "metapath": "", "pub": "premed", "title": "2017-04-humanities-student-major_1725_premed.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.093", "Subjectivity": "0.331", "Score": "14", "Upvotes": "0", "Downvotes": "0", "Wordcount": "541", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65j2oz", "Reddit_id": "dgap8ww", "Subreddit_id": "t5_2rlp9", "Commenter": "applesauce_1212", "length": "3001", "content_scrubbed": "Recently accepted MD/PhD applicant here.  Pretty much what everybody is telling you is spot on.  It is possible to do just be MD and do research, even to have your own lab, but it will still take several extra years to get there, especially to successfully apply for funding.  MD/PhD is a very long road but the training and the tuition benefits set you up to be more likely to be successful (no guarantee you'll be able to make it as independent investigator, even then - funding has been dry and will continue to be dry). Research focus for MD/PhD is more likely to lean towards basic research compared to straight MD.  A few things to think about:\n\n\n1. How competitive of an applicant am I?  Average stats are higher for Md/PhD than for regular MD admissions.  Also, unlike med school, where 99% of students match and the top students match to top programs, pedigree matters quite a bit in academia.  It may not be a good idea to settle for a lesser known, lower quality MD/PhD program because it could significantly affect your outcomes (my opinion, certainly debatable)\n\n2. How much do you want to be a PI? The national grant funding rate is around 9%.  Having a PhD will significantly up your odds of being one of the people who gets it, though of course it guarantees nothing.  This is the route that MD/PhD is designed to  take you.  That being said, even at top programs less than 50% of graduates take the academic medicine route.  Many go into industry, a slice do clinical research, and up to 30% go into private practice, which is generally agreed to be a waste of everyone[.] time and money (even yours - the money saved by taking this route is less than the money earned by working four years in a high-income specialty.)\n\n\n3.  Am I driven by the money/prestige?  If money, see above.  If prestige, yes, people respect you a lot for doing it (if you're male - I'm female, the response has been 50/50 for me).  Graduate school is not easy, and if you don't enjoy it a lot then it sucks. If your thesis project isn't going well, two things might happen:  if you're serious and capable but things just haven't been working, you take one or even two more years, extending your graduation time.  If you've lost interest in research because you were really drawn to the program for other reasons, you get put on a menial labor project designed to just get you out (think 100 drug trials a day- you are a robot being paid to pipette things).\n\n4.  Am I a humanities major?  I met somebody recently who didn't realize this:  not one of the people interviewed with was not a hard_science/engineering major, unless they were applying for PhD in anthro or something, which there may be 10 seats in the country for.  For MD it doesn't matter, and it probably helps to have a different perspective/higher GPA (not hating, based on statistics).\n\nThis got rather long.  Tldr; do I want to be PI?  If absolutely yes, MD/PhD is the way to go.  If not, there are many other, probably better paths, to Rome."}