{"doc_id": "516", "name": "2017_10_humanities_student_major_2830_askphilosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "askphilosophy", "title": "2017-10-humanities-student-major_2830_askphilosophy.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.33", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "601", "Permalink": "http://reddit.com/r/askphilosophy/comments/79gwlc/why_should_very_old_philosophy_still_be_relevant/dp255je/", "Threadlink": "http://reddit.com/r/askphilosophy/comments/79gwlc/why_should_very_old_philosophy_still_be_relevant", "Parent_id": "t3_79gwlc", "Reddit_id": "dp255je", "Subreddit_id": "t5_2sc5r", "Commenter": "ServantOfDiscord", "length": "3958", "content_scrubbed": "Philosophy doesn't necessarily proceed in a straight line. Historical discontinuities exist. The works of Aristotle, for example, were a significant influence on scholasticism and renaissance philosophy, despite the 700 years of intellectual development in the intervening dark ages. His works fell out of circulation after the collapse of the Roman empire and were only recovered between the 12th to 13th centuries.\n\nAfter all that time why didn't the medievals consider Aristotle obsolete? Why would a philosopher writing 1400 years in the past be responsible for a fundamental shift in the world view of medieval thinkers? The answer is rather straightforward, as I see it. The intellectual development of early medievals had fallen into a state of decline, in many respects, compared to the ancients. They failed to understand the actual significance of ancient thought due to their historical amnesia and dogmatic ideology. Such blindspots in their thinking had crippled their progress for centuries.\n\nIn effect, it took the rediscovery of Aristotle to stimulate a genuine qualitative leap in later medieval thought. Without Aristotle, it[.] likely the scientific revolution would have never happened. At least, it would be difficult to imagine how the scientific revolution could have developed without an understanding and critical response to Aristotle. Likewise then for practically all ensuing philosophy after Aristotle. If philosophers thought Aristotle was obsolete, philosophy would not exist as we currently understand it. There would be no Descartes, no Spinoza, no Kant, no Hegel, and certainly no contemporary philosophy. The whole edifice of philosophical thought would either disappear or mutate into something unrecognizable.\n\nThis leads to the larger point that philosophy is historical by its very nature. A purely anti-historical or autonomous philosophy is something of an aberration or fiction. The sorts of things philosophers think about are not based on idle assumptions, frivolous experimentation, or vacuous discoveries. They're based on the discursive rational perspectives of the wise. In a traditional sense, the purpose of philosophy is to perfect this discursive rational perspective from the subject[.] point of view. Philosophical arguments are refined over the centuries to produce better and better philosophical arguments. We can't just ignore earlier arguments or start at the strongest argument. They're all interconnected. In understanding one of the predecessor arguments we can strengthen our grasp of its successors. We lose all the relevant context when we start off with brute propositions, as if these expressed the truth. They don't express the truth. What they express is a derivative, oversimplified, and highly distorted imitation of the truth. One can't understand the actual truth of the argument without knowing its historical connections and permutations.\n\nWith that said, the single greatest reason to study older philosophy, especially modern philosophy, in my judgment, is due to the very real possibility that our contemporary philosophy has fallen into a state of decline, in the earlier mentioned sense. In my perspective, much of what we call analytic and continental philosophy is dangerously disconnected from the philosophical tradition. This disconnect has implications for every area of culture, including the sciences. I don't believe it[.] a minor coincidence, for example, that we have yet to arrive at a unification of classical and quantum physics. I also don't believe it[.] a minor coincidence that the humanities are in crisis. I don't believe a great many minor coincidences. The great majority of issues facing the world today are, to my mind, a rather direct result of our regressive philosophical culture. The single greatest reason I can think of to study older philosophy, therefore, is because I believe the solution to many of our contemporary problems are buried in the past."}