{"doc_id": "1158", "name": "2017_04_humanities_student_major_2155_houston", "namespace": "we1sv2.0", "metapath": "", "pub": "houston", "title": "2017-04-humanities-student-major_2155_houston.txt", "pub_date": "2017-04-19T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.359", "Score": "45", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1540", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66bajh", "Reddit_id": "dghm48b", "Subreddit_id": "t5_2qj1l", "Commenter": "hakimsdream", "length": "8959", "content_scrubbed": "My name is Giorgio. I was one of the architectural designers on White Oak Music Hall. After completing the initial conceptualization and subsequent design/construction drawing work for the project, I've since moved on to work on my own in New_York City.  My opinions herein are my own and represent no one but myself.  \n\nIt[.] been an oddly voyeuristic experience to see White Oak Music Hall built from afar. Being once so close to the project, but now (literally) far away, it[.] frustrating and disheartening to see something I worked on be at the center of a lawsuit. Given it[.] the first construction project I've been a part of as a designer, it[.] an unfamiliar and unsettling feeling to see someone represent something you spent so much time working on in such harsh light. Though I'm sensitive to the concerns of the citizens in question, and understand the frustrations of the development team, I thought it was important I offer a slightly different perspective than what[.] typically been represented in the press. \n\nThe seeds of this project were sewn more than four years ago on an otherwise innocuous gchat conversation I was having with an old childhood friend, Will Garwood. \n\nWill and I grew up together here in Houston. But it had been some time since we had spoken when Will reached out via gchat to get my opinion on a \"crazy\" idea he had. Having not heard from Will in many years at the time, I was both surprised by the call and curious why he was reaching out to me. \n\nWill and I had markedly different post-collegial paths. While Will built a career in finance and started a family...I was touring all over the world in bands through most of my 20s. It wasn't as glamorous as it sounds. Some nights were better than others.  (Sleeping on an inner tube in a studio apartment in Manchester, England during the dead of winter with no heat with a five piece band and the promoter and his girlfriend was a particular low.) But I also got to see the world.  That[.] where I cultivated a keen interest in design and culture, and, more specifically, the relationship between architecture and the city.\n\nMore often than not, the most engaging cities we visited were always the ones that had an overt interest in supporting the arts through built projects. And my art was music. Whether it was playing Primavera Sound in Barcelona on top of the ruins of a strange, failed expo project repurposed to host one of the most popular music festivals in the world; or in a more classical setting like Paradiso Theater in Amsterdam; architectural design was always at the center of the creation of culture. It interested me enough that I wound up quitting the tour life to begin a masters of architecture program at Rice University. \n\nSo when Will reached out to me four years ago with this idea to build an outdoor music venue in Houston, it piqued my interest, to say the least. \n\nBut back to music. Another by-product of touring is that you're always meeting new people. And inevitably you become an unofficial diplomat for your hometown. And to be honest, as much as I loved telling people I was from Houston, it always came with an immediate defensive stance. Keep in mind, it was not so long ago that the idea of Anthony Bourdain coming to town to sing our praises would be considered laughable. To most uninitiated and uneducated, Houston was a forgettable hot swamp (or was it a desert?) filled with cowboys and oil tycoons. But for those of us who grew up here and understood the strange beauty, the eccentricity, the confluence of cultures, the great food and arts scene; it[.] only recently become a vindication. \n\nYes, Houston is cool. Very. \n\nThat said, it is cool precisely because people like Will do very Houston things. Like suddenly deciding to sideline a career and build a world-class music hall.  That[.] a very Houston thing to do. Or building a house made of beer cans. Or starting a parade dedicated to the construction of absurdist vehicles (ahckem—1994 Art Car Parade honorable mention award winner here, no big deal). \n\nAs much as I loved the idea of designing a music venue in Houston, what really interested me about Will[.] proposal is that it came from a place of civic duty. It[.] no secret that Houston has developed rapidly over the past 10-15 years. With this pace of development, the city has seen a hyper-homogenization of construction. As a Houstonian, I might say.... a Dallas-ification. (Shots fired!). For Will, this was unacceptable.  \n\nWe had what was honestly a very unexpected conversation about the crisis of Capitalism and its tendency to re-produce sameness. An architecture grad-school student high on what Koolhaas might call, \"Junkspace.\" But for Will, seeing his city transform into something so pedestrian, so fundamentally un-eccentric, was an unacceptable proposition. Being a person of means and capacity, he saw to it to make a difference. And I'm grateful he decided to reach out to me initially about the project. Because I'm incredibly proud of what we built for the city of Houston. \n\nAs an outsider now, seeing how the narrative has been transformed so much by recent lawsuits from concerned neighbors, it[.] unfortunate that this initial cause has been obfuscated. So I thought it important to do my part to ensure the original narrative of the project as I saw it—the reason I got involved—not be lost to louder, more sensational rhetoric. \n\nHouston is famously a no-zoning city. As a student of architecture and planning, all I can say is that there are few people in my field that see this as a plus. Often Houston presents itself as this Libertarian dream-scape, where anything is possible! No limits! But in this lack of guidelines, in this absence of clear zoning restrictions, exists a never-ending menagerie of legal interpretation. I would argue, in fact, this is actually quite limiting. Where there exists interpretation, there exists unneeded risk. There exists unknowns. And in this creation of risk and unknowns, innovation suffers and sameness wins. In the absence of certainty, sameness is dependable. Sameness is repeatable. Sameness is easy. \n\nWhether it[.] the Ashby \"tower of terror\" high-rise, or Hines' San Felipe development, the nature of Houston planning says, \"you can build anything!\" But also, anyone can sue you at any time and it may or may not work out for you. For Hines, it seems to have. For Ashby, it[.] a failure. Making no value judgments about either of those projects, it[.] all to say, this is no way to develop a city. And in fact, I would argue that the leading factor for the lack of innovative design in the city is precisely because of the schizophrenic nature of Houston zoning. It encourages developers to take the easy route. The tried and true white collar prison apartment complex. Or the strip mall. Indeed, no zoning is no freedom at all.  \n\nI don't pretend to know every single detail of the most recent proceedings between White Oak Music Hall and the neighborhood residents.  And I cannot vouch for every measure taken by the development team as I was not present for its construction. But what I can speak to is the design and intent of the project. This project was built by Houstonians, for Houstonians, to showcase to the world that Houston is a strange and wonderful and singular place. This project was not sameness. This project was not the easy route. The project explicitly sought to create something culturally significant for the city of Houston that could at least celebrate what \"no zoning\" meant, in the best possible sense. \n\nWhat[.] the point of no zoning if you're a city that just builds strip malls and monotonous, non-descript, uninspired apartment blocks? Any city can build that. And in order to actually take advantage of the concept of no zoning, it takes creative developers and designers. \n\nAs far as the neighbors go, the last thing I would ever want to do is be a part of something that deliberately ignored the concerns of the community. All I can tell you is my experience as a designer.  One of the first things we did for this project was to create a design presentation for the neighborhood association to see, before a shovel was ever put in the ground. That design proposal included the outdoor theater that exists today. That is a fact. I can't attest to how the design was verbally presented or how people interpreted it, but the notion that an outdoor stage was snuck in after neighborhood approval is simply not true. It was always in the design. Including a rendering of a band performing on a stage with thousands of people in the audience. \n\nWe held multiple sound tests before any of the construction begun. We literally erected a large outdoor line array speaker tower on multiple occasions to test the sound. And they all passed, even without the benefit of having sound absorption (in the form of the Music Hall itself, which acts as a giant backstop).\n\n(continued below... after my 9 minute time out passes)\n"}