{"doc_id": "975", "name": "2017_04_humanities_student_major_533_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2017-04-humanities-student-major_533_AskAcademia.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.05", "Subjectivity": "0.289", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "368", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63p9hg", "Reddit_id": "dfw0a89", "Subreddit_id": "t5_2sakj", "Commenter": "SnowblindAlbino", "length": "2115", "content_scrubbed": " from what I've read teaching does not take up much time for a professor.\n\nThat depends *entirely* on the type of institution at which you work: mission, quality, culture, and department will all make a difference. I've spent my career in liberal_arts colleges and can tell you that teaching takes up basically all our time plus some... often 50+ hours/week for junior faculty. What time isn't consumed by teaching is eaten up by meetings. There is very little time during the academic year for research, yet there are still significant publication requirements for tenure/promotion (a book or several articles at each stage in our case).\n\nThat said, can you enter a history Ph. D. program without a BA in history? Yes; there were several students in my cohort who had non-history degrees. Will you be a competitive applicant when up against *my* students who do have BAs in history, have written 40-50 page undergraduate theses, have completed internships in museums, and have taken 10-12 courses in history upon which their applicants and LORs rest?  Likely not, and an MBA isn't going to help at all (it may actually hurt, TBH).\n\nThe job market? It[.] terrible and has been since the early 1970s. Only a minority of people who seek tenure-track jobs in the humanities will ever get them, and most of them are from top 20 programs with stellar records. To get a tenure-track job you need to be *outstanding* as you'll be applying in a national market, competing with the top candidates coming from the top programs-- and that[.] true at an R1 or even at a liberal_arts college like mine. (I speak from long experience on search committees on this.)\n\nMy advice? If you have secure employment in finance keep your job and read history books from the library. It will take you ten years (on average) to complete the MA and Ph. D. in history, and then the odds of landing a job are against you. Hell, in ten years there may *be* no more tenure-track humanities faculty at many schools. That[.] a huge risk and not one I would recommend to anyone with marketable skills in another field, much less someone with a steady job."}