{"doc_id": "498", "name": "2017_10_humanities_student_major_2721_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_2721_AskReddit.txt", "pub_date": "2017-10-27T00:00:00Z", "Sentiment": "0.077", "Subjectivity": "0.464", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "558", "Permalink": "http://reddit.com/r/AskReddit/comments/796rjs/antigay_people_of_reddit_why_are_you_antigay/dp00gdy/", "Threadlink": "http://reddit.com/r/AskReddit/comments/796rjs/antigay_people_of_reddit_why_are_you_antigay", "Parent_id": "t1_dozosx5", "Reddit_id": "dp00gdy", "Subreddit_id": "t5_2qh1i", "Commenter": "imyourfather", "length": "3228", "content_scrubbed": "Alright, I'll bite.\n\n They will only go to gay bars and have gay drinks, eat in gay restaurants, gay-friendly gyms, theatre productions must have gay characters and be focussed around gay culture in some way. And so on.\n\nWe need these because everywhere else is straight environment. The mainstream movies will always feature at the forefront heterosexual relationships and traditional nuclear families that we can only partially relate to. The majority of people we meet in our day-to-day lives will always be straight people we cannot date. Casual homophobia will always exist.\n\nWhere else do we go to hang out if not these gay spaces?\n\n All gay men seem to work in the arts, with people or in traditionally female fields. Very few of them seem to have traditional careers.\n\nThis is mostly confirmation bias, and you're only seeing those who stand out. Except for liking different things in the bedroom, we come in all shapes and sizes and live the same varied lives as straight people do. We're among you, you just don't see us because we're outwardly not any different from you. How often do you ask a random guy if he[.] gay, straight, or bi? I'm guessing it[.] not something you ask at all, since that is usually irrelevant information.\n\n Things like \"Pride\" - is that really necessary in 2017? \n\nA [short scene](https://www. youtube. com/watch?v=f6OHCDdlFYo) from the show Sense8.\n\nPride is necessary for as long as there are people like us, whether in other parts of the world or within our own societies, living our lives in fear and secrecy. The march isn't just for those who are there, it[.] for those who aren't there too. It[.] a reminder that the freedom that some of us get to enjoy, a freedom that should have been a basic right, is nothing more than a precarious privilege that can be taken away from us easily.\n\n gender-neutral nonsense\n\nGender identity isn't a new invention. It just hasn't been a focal point. \n\nI agree that there are a lot of bandwagoning and irony in the mainstream, but beyond the noises, there are actual sciences with supporting evidences.\n\nIf you were able to acknowledge the \"T\" in LGBT as a legitimate existence from 10 years ago, then all these other \"+[.]\" are merely expansions and variations to that idea. We're just getting a little bit more precise in defining who and what we are.\n\n kids transitioning when they're 8 years old\n\nIt[.] true, this is an absurd and dangerous option that shouldn't be available to kids, and it[.] problematic exactly because we've always been too narrow and limiting in our definition of genders, and why the \"+[.]\" are well worth exploring, even if just conceptually. What if there really is more that meets the eye?\n\nThe vast majority of us, I and I'm assuming you too given your stance, have gender identities that match our assigned-at-birth sexes, and all these gender identity issues aren't something we even have to think about... but do think about it.\n\nThe funny thing is, you will find many gay people who share your point of view. Even within the LGBT \"community\", there are those who think the \"T\" and \"+[.]\" should be a separated cause. Like I wrote above, we come in all shapes and sizes and live the same varied lives as straight people do.\n\n"}