{"doc_id": "1233", "name": "2017_04_humanities_student_major_2899_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-04-humanities-student-major_2899_ApplyingToCollege.txt", "pub_date": "2017-04-25T00:00:00Z", "Sentiment": "0.169", "Subjectivity": "0.343", "Score": "15", "Upvotes": "0", "Downvotes": "0", "Wordcount": "844", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67k40j", "Reddit_id": "dgr2xk4", "Subreddit_id": "t5_2y2r8", "Commenter": "ImRefat", "length": "4681", "content_scrubbed": "Hey, I've been following your posts on /r/ucla. I get that this is really stressful for you, so I'll try and offer some advice. The truth of the matter is that you'll find a lot of the same things academia-wise between both campuses. A lot of people I know, myself included, have not regretted coming here over Berkeley. That being said, here[.] a list of pros and cons from my experience. I'm a second year biochemistry major so my own experiences major wise will be different but in the same vein \"stem\"-wise.\n\nPros:\n\nGreat place for pre meds. Resources:\n\n- UCLA Ronald Reagan Hospital, UCLA Santa Monica hospital, and Cedar Sinai - all top ranked hospitals, with very strong volunteering departments. Ronald Reagan/Santa Monica have lots of different volunteering programs available - Care extenders, MAPS, Nursing volunteering, and one other that I can't remember at the moment. All have to do with basic patient interaction, so a great opportunity to dip your feet in clinical volunteering (in a huge variety of departments!) I just completed a rotation in a trauma holding ward, and my next rotation will be with the post partum department (mothers with newly born children). This is what I think UCLA does exceptionally better than Berkeley - a lot of the volunteering is integrated into the school system and the resources are so very close by instead of fragmented throughout LA. If you do decide to volunteer beyond UCLA, Cedar Sinai is a popular place because they too have established internship programs and the like. \n\n- Lots of research opportunities, especially as an MCDB major - there[.] a lot of MCDB labs available! A close friend who is MCDB has been doing research for 2 years now at an immunology lab here, and I've done some research at an inorganic chemistry lab here. As a life science major you will find no shortage of research opportunities here - you just need to put yourself out there. \n\n- Clubs, volunteering, etc. are all varied here in their goals and objectives. This is good for you because you have a wide variety of causes to choose from and stick with. Mobile clinic provides assistance to the homeless and underserved In la, SCOPE teaches health and fitness to underserved elementary schools, and EMRA is an emergency medicine association to name a few. Pick what you like and roll with it! As a side note there are tons of other clubs to join that are not career oriented - don't be the guy that[.] 100% all medical! You owe it to yourself to be well rounded. \n\n- Competitive but not competitive: I can't really explain this one too well. Most of the time it[.] not the curve or the professor that screws your over - it[.] your own study habits. Of course you will have to work hard, but it[.] for yourself - not really to \"be number 1\" in a sense. That[.] the mentality of a lot of students here. A good grade is a consequence of your learning, not the sole objective. With that being said you'll find no shortage of people to work together with in your classes. \n\nNon premeddy pros:\n\n- The scene. los_angeles is a vibrant hub of diversity in all facets of life here: the arts, the food, the schools, the activities, the sightseeing, and the people most importantly.  I'm biased because I've lived here all my life in different locales. There is always something new to do here. You are very close to the beach, to downtown LA, to Hollywood (a tourist trap but still lovable in some aspects), to Venice, the list goes on tbh. If you like going to concerts, don't look any further - every big artist stops in LA at least once on their tours. \n\n- The campus. It[.] gorgeous here (as you may have noticed!) and it[.] a fairly small campus too. The hills don't make it feel longer than it is - hills are just hills, you go up one way and come down the other. Plus your legs will be nicely toned :). There[.] something about the general beauty of the campus that just makes me feel relaxed - and everyone I know has a \"spot\" they like to visit on campus. \n\n- People are very chill here. Probably the same at Berkeley too. \n\n- if you live on campus housing, the food is tier 1. You won't find better school foods in a public school. I sometimes can't even properly pronounce the food here.\n\n- There are many school funded events here, and many famous people across all disciplines give lectures here! A$AP Rocky hosted \"office hours\" a while ago, which a LOT of students attended. \n\nCons:\n\nIf I find one I'll let you know. Parking maybe. \n\nIf you have any questions feel free to PM me. No matter your choice, you need to pick the school where you will mentally be OK. The most important thing is your own health - don't forgo it for the \"best education.\""}