{"doc_id": "500", "name": "2017_10_humanities_student_major_2734_waifuism", "namespace": "we1sv2.0", "metapath": "", "pub": "waifuism", "title": "2017-10-humanities-student-major_2734_waifuism.txt", "pub_date": "2017-10-28T00:00:00Z", "Sentiment": "0.084", "Subjectivity": "0.461", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "349", "Permalink": "http://reddit.com/r/waifuism/comments/798mmp/if_your_waifuhusbando_were_a_university_student/dp09yj0/", "Threadlink": "http://reddit.com/r/waifuism/comments/798mmp/if_your_waifuhusbando_were_a_university_student", "Parent_id": "t3_798mmp", "Reddit_id": "dp09yj0", "Subreddit_id": "t5_32aef", "Commenter": "Marimo_and_Me", "length": "1897", "content_scrubbed": "This is a tough one. I'm not 100% sure what Zoro would like to study, but I think he might be better off probably studying externally at home since otherwise he'll get hopelessly lost on campus and wouldn't be able to find any of his classes on time. But then again he'd probably be adamant that he won't get lost and that he wants to attend on campus lectures, so I could just walk him to his classes so he won't be late (and give him a kiss goodbye each time).\n\nHe might like to study exercise and sports science, or something like physiotherapy; something body (workout and training and how to handle when things go wrong there) or sports related (for fixing injuries relating to sports). He'd probably like something like this cause he[.] often working out in his spare time, and I don't really see him as someone who cares for the sort of subjects like law, business, the arts, etc. He'd probably just enjoy studying something that lets him help people when they get injured from working out or from exercise (though he himself often doesn't take care of stuff like that in regards to his own body and just keeps pushing himself harder during training; but I feel that in the context of him being a uni student he'd be a little less hard on himself in that respect since the stakes of our world are a little less extreme than the stakes of his world, but that[.] another topic for another day).\n\nHe'd definately be in a club centered around anything related to swordsmanship; maybe fencing, or kendo. That would probably be his main reason for going- he'd probably win some sports scholarship so that he can do both study and sword stuff. He'd also probably be in a few clubs that let him work out, like some kind of exercise club. If there[.] a club where everyone drinks as many different types of alcohol as they can then I'm sure he would be president of that club, if not the founder of it."}