{"doc_id": "1023", "name": "2017_04_humanities_student_major_940_utdallas", "namespace": "we1sv2.0", "metapath": "", "pub": "utdallas", "title": "2017-04-humanities-student-major_940_utdallas.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "-0.027", "Subjectivity": "0.331", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1439", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg0sb3n", "Reddit_id": "dg0tlav", "Subreddit_id": "t5_2s4is", "Commenter": "MrPockets11", "length": "7691", "content_scrubbed": "I don't know what country I want to go to. I need to get out of the USA though due to medical issues and our complicated overpriced healthcare system (Canada would be a good situation if my immigration application was accepted). I would gladly work $15/hour at a call center 6 days a week at this point in my life if they would take me. I have given it my all. people have not and do not support me for working hard, and they consistently discourage it. I have not fed the negativity, but the people around me have certainly tried to feed me to that beast my whole life. \n\nI had a job that I loved and stayed at long_term until June 2016, when I was fired for reasons that still haven't been clarified (the HR reps couldn't get my name right, and thought I hadn't been working there very long when I in fact worked there for 3 years, and then during the termination meeting and the subsequent unemployment benefits appeal management argued with each other over who I was and why I was being terminated in front of both me and a hearing official). I've since been employed off and on for 10 months through temp jobs and short term contracts. I've interviewed with nearly every company in/and out of town for a position in my field (over the phone sales and customer service), and so far they've all said no after an interview, have decided not to interview me, have stood me up for the interview, or they've brought me on for extremely short term contracts (3 months at most to 3 weeks or less at least) as a temp.\n\nI live in Dallas Texas, I'm white, male, single, straight, 30 years old, I don't smoke, I have 1 bachelors of arts degree, I have 5 professional certificates, an EPA 609 license, and a TXDOT vehicle emissions and safety inspection license, 6 years customer service experience, 2 years employee management experience. I have interviewed with Toyota at their call center and they weren't interested and I have to wait 6 months from the date of interview before I can re-apply, same story with Bank of America, State Farm, Geico, At&t, Spectrum high speed internet, QT gas stations, Home Depot, racetrac gas stations, pizza hut, etc.\n\nI went to a 4 year private liberal_arts college, it cost me $117k for 4 years. My parents mandated I go to school there even though they had a very limited list of majors. At the end of my freshman year I got stabbed by some people I thought were my friends. The school did literally nothing to help me regarding this and local police ceded authority to campus police (due to local legislation) who ceded authority to the vice president of student life (due to school policy) who didn't respond to the attack or my case until the end of my senior year. During my sophomore year I looked into transferring to another college... And none of the credits I already had would transfer at all (schools in Texas are still sort of like this but less so now a days because they talk to each other more now). So at $30k into a 4 year education my parents and I decided we'd wait for the school to make a disciplinary decision, which they didn't. Long story short the vice president of student life really screwed up, the guys who attacked me wrote me death threats for 4 years, and when I made complaints to school officials higher up, due to a lot of evidence the school lost or failed to document in the first place, they were unable to do anything and instead mandated that I had to post a formal written apology to my attackers around campus and online for committing an act of slander against my attackers. It was bullshit and a terrible experience. They didn't offer a major I wanted, and had a limited selection to begin with, so I wound up with a BA in philosophy, and a really screwed up transcript that has caused problems pursuing further education. I have no senior level courses in my degree because the school didn't offer them, and I have more courses in my minor than my major, and my minor isn't even listed on my transcript. This has caused major problems pursuing a masters degree, and has caused major problems pursuing a second bachelor[.] degree.\n\nI have written my college a bad review on Google, yelp, etc... And that has caused the vice president of student life to call and harass me a number of times since graduating 8 years ago (he calls me once every 3 months to once a year). He[.] hostile on the phone, and sometimes makes vague threats of physical violence. I've changed my phone number a few times, and I've recorded some of the phone calls. I've submitted everything to the police local to my area of Dallas as well but what he[.] doing doesn't meet the legal definition of harassment due to time scale issues, and his threats of violence are too vague for the police to prosecute him. I even went as far as to make a complaint to the FBI, who also couldn't do anything to help due to problems defining what he is doing as harassment and problems with his threats being too vague to allow them to pursue him. \n\nI wish my parents had been less dead set on the school I went to, they wish they hadn't been so dead set on it as well, my mother has developed an alcohol problem as a coping mechanism since graduating (for, according to her \"damaging [her] kids before college and during\"), I wish the credits had been transferable, I wish the school offered a computer science degree when I went to school there (they started that post 2006), and I wish there had been a less violent student body at the college I went to, and most of all... I wish I didn't have a little round hard lumpy scar on the side of my torso from being stabbed, because it itches sometimes still and every time I scratch at it, it[.] a constant reminder of the awful traumatic events I've been through.\n\nIn January 2017 I started taking classes at UTD which I barely got into due to issues with my transcript from my BA that I got at said other college (no senior level classes related to my degree, more classes in my minor than my major, and my minor isn't indicated on my transcript or diploma) in February I dropped all of the classes I was taking at UTD for a long_term, full time job offer that I received in writing, only to start as a new hire and to be told by HR that they didn't mean to hire me and that they meant to hire someone else, so they immediately fired me (there was also a week of their HR manager who didn't know me pulling me out of training to yell at me about how I was \"a bad, negative person\" and that \"[I] should be fired\") thus wrecking both my academic transcript and my resume and costing me a lot of money. At this point UTD doesn't want me back, because they think I can't cut it there and that I'm just messing around, plus they still really don't like my transcript from my BA.\n\nI have applied to several of UTD[.] masters programs as well, and they still aren't interested due to the transcript from my BA. UTD currently wants me to take 2 years of community college before they will accept me for a 2nd BA, and then they'd want me to spend an additional 4 years working on that 2nd BA, and then I could potentially move on to a masters degree.\n\nI can't drive for Uber or Lyft as both of my cars have 2 doors and one is 22 years old.\n\nI'm currently applying to jobs that involve driving 18 wheelers, but most companies don't want to even interview me for that. At this point, if a company says they're interested and they want to interview me, I will gladly wait for them to interview me, and at this point I don't know what else to do. If UTD wants me to go to school there, I will also gladly do that, and in fact long_term that would be my preference. \n\nI have gone all out, there[.] no arguing against that. "}