{"doc_id": "432", "name": "2017_10_humanities_student_major_1947_tumblrinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrInAction", "title": "2017-10-humanities-student-major_1947_TumblrInAction.txt", "pub_date": "2017-10-20T00:00:00Z", "Sentiment": "-0.023", "Subjectivity": "0.312", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "242", "Permalink": "http://reddit.com/r/TumblrInAction/comments/77l3l5/here_is_what_you_learn_in_gender_studies/dondexe/", "Threadlink": "http://reddit.com/r/TumblrInAction/comments/77l3l5/here_is_what_you_learn_in_gender_studies", "Parent_id": "t1_doncd18", "Reddit_id": "dondexe", "Subreddit_id": "t5_2vizz", "Commenter": "ANGR1ST", "length": "1430", "content_scrubbed": "Many of those are different.\n\nElectricity is covered by physics anyway.\n\nWe take Biology in highschool, although requiring an additional class on biology in some manner isn't an awful idea for a well rounded College education either.\n\nBiology also covers the high level \"drugs can be good, mmmmmkay\" that you should have some inkling of when taking an aspirin.\n\nChemistry is an important subject too that most students would benefit from some knowledge of. All concede not all.\n\nYes. You should totally have a class in finance at some point. That used to be taught in highschool, but not anymore. You're already required to take math and learn how to add and subtract.\n\nYou don't need a class in automotive repair, but again, having some knowledge of how to turn a wrench comes in handy *often* in the outside world.\n\nLiberal arts majors (like English) are always trying to make the point that \"going to college is about broadening your horizons and learning about the world, not just learning skills for a job\". \n\nWe require that engineers and hard_science majors take humanities classes to become \"well rounded\". I don't see how requiring an English major to take some science classes for the same reason is a problem. Maybe not \"it must be physics\", but *something*.\n\n\nIt[.] the Gender Studies and Racial bullshit classes that need to be struck from the requirements as there[.] *no* good argument for their relevance to reality."}