{"doc_id": "1150", "name": "2017_04_humanities_student_major_2075_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2017-04-humanities-student-major_2075_canada.txt", "pub_date": "2017-04-18T00:00:00Z", "Sentiment": "-0.009", "Subjectivity": "0.413", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "693", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgg5a7g", "Reddit_id": "dggepmf", "Subreddit_id": "t5_2qh68", "Commenter": "Ad_Hominemus", "length": "4018", "content_scrubbed": " Well all women on the pill are as if they're not ovulating, so it[.] possible that a lot of the antipathy that exists right now between women and men exists because of the birth control pill. The idea that women were discriminated against across the course of history is appalling.\n\nHow exactly is that not respectful? You can disagree with his conclusion, but he isn't insulting, nor is he condescending.\n\nIf you're not a student of history, its easy to misunderstand Petersons conclusion. You, perhaps unintentionally, cut off a lot of context in that response of his:\n\nI don't think women were discriminated against, I think that[.] an appalling argument. First of all, do you know how much money people lived on in 1885 in 2010 dollars? One dollar a day. The first thing we'll establish is that life sucked for everyone. You didn't live very long. If you were female you were pregnant almost all the time, and you were worn out and half dead by the time you were 45. Men worked under abysmal conditions that we can't even imagine. When George Orwell wrote The Road to Wigan Pier, the coal miners he studied walked to work for two miles underground hunched over before they started their shift. Then they walked back. [Orwell] said he couldn't walk 200 yards in one of those tunnels without cramping up so bad he couldn't even stand up. Those guys were toothless by 25, and done by 45. Life before the 20th century for most people was brutal beyond comparison. The idea that women were an oppressed minority under those conditions is insane. People worked 16 hours a day hand to mouth. My grandmother was a farmer[.] wife in Saskatchewan. She showed me a picture of the firewood she chopped before winter. They lived in a log cabin that was not quite as big as the first floor of this house. And the woodpile that she chopped was three times as long, and just as high. And that[.] what she did in her spare time because she was also cooking for a threshing crew, taking care of her four kids, working on other people[.] farms as a maid, and taking care of the animals. Then in the 20th century, people got rich enough that some women were able to work outside the home. That started in the 1920s, and really accelerated up through World War II because women were pulled into factories while the men went off to war. The men fought, and died, and that[.] pretty much the history of humanity. \n\nWith that in mind, his response makes more sense: All people were discriminated against in pretty much equal amounts. The only people who were not, were the very rich and powerful men, a tiny subgroup of people.\n\n\nYour source doesn't have many articulations of formal errors in reasoning. Take for instance this:\n\nI find Peterson[.] vilification of the figure of the SJW particularly hysterical because he relies on so many biblical images and stories from Jesus, who in many ways is the ultimate advocate of social justice in the Western imagination.\n\nI would hardly identify Jesus with any of the SJW types you see today, with their screeching interruptions, narcissistic hijinks and snowflake sensitivity to mere words. \n\nOr this:\n\nMore fundamentally, why does Peterson get to claim that certain terms are ideological, like islamophobia and special pronouns—and that certain terms are not ideological—like SJW or PC? Pejoratives like these are indeed profoundly ideological.\n\n*Of course* SJW and PC are ideological terms. They have the words of politics right in their names. Thats sloppy writing, this reads more like a hit piece than anything, and I find the writers anonymity disturbing. \n\nThe piece seems to largely be upset with how Peterson characteristizes much of social science and the humanities. The issue is, a lot of what he says is correct: Marxism and Post-Modern theory have created a rot within much of these disciplines, one which is anti-intellectual, anti-science and anti-male. All you have to do to realize this is read their texts, listen to their lectures, and see the end products in their students. "}