{"doc_id": "284", "name": "2017_10_humanities_student_major_475_darkfuturology", "namespace": "we1sv2.0", "metapath": "", "pub": "DarkFuturology", "title": "2017-10-humanities-student-major_475_DarkFuturology.txt", "pub_date": "2017-10-06T00:00:00Z", "Sentiment": "0.015", "Subjectivity": "0.248", "Score": "14", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1421", "Permalink": "http://reddit.com/r/DarkFuturology/comments/74pcho/pulitzerprizewinning_journalist_chris_hedges_on/do029bs/", "Threadlink": "http://reddit.com/r/DarkFuturology/comments/74pcho/pulitzerprizewinning_journalist_chris_hedges_on", "Parent_id": "t1_do027yc", "Reddit_id": "do029bs", "Subreddit_id": "t5_2vva3", "Commenter": "pseudo_mccoy", "length": "8819", "content_scrubbed": "\nNow, it may be that the deep state - the shadowy world of the security and surveillance bureaucracy, the arms industry, Wall Street, Silicon Valley, and corporations that actually rule the country - disturbed by Trump[.] impulsivity, irrationality, and incompetence will move to replace him. This was certainly the idea when the organs of internal security used a wiretap to discredit and remove Michael Flynn and it is what is happening now with the leaks about the Attorney General[.] two meetings with the Russian Ambassador. But the ascendancy to the White House of Michael Pence, a more polished and disciplined politician who will vigorously advance the agenda of the Christian Right, will not make things better and indeed they may make things worse. Those being placed now into power are agents of destruction. Betsy DeVos is moving to defund our system of public education and use government vouchers to expand corporate charter school chains and those run by the Christian right. Scott Pruitt is dismantling the Environmental Protection Agency. He has already called for a 25% reduction in the EPA[.] budget, the elimination of 3000 jobs, and the slashing of numerous programs including a 70% cut to its climate protection program that oversees cutting emissions of greenhouse gases. Bannon was the dark hand behind the ban on Muslims entering the U_S from seven Muslim-majority countries, a ban you can expect to see extended if the Trump administration is successful in removing a stay issued by a district court or issuing a new executive order. Bannon was behind the order to the Department of Homeland Security to draw up lists of Muslim organizations and individuals in the U_S that in the language of that executive order \"have been radicalized\" and \"provided material support to terrorism-related organizations in countries that pose a threat to the U_S.\" Such lists will be used to criminalize Muslim leaders and the institutions and organizations they built. Then, once Muslims are dealt with there will be new homeland security lists that will allow the government to target the press, activists, labor leaders, dissident intellectuals, and the_left.\n\n\"Lennon wanted to destroy the state and that[.] my goal too,\" Bannon told the writer Ronald Raddash in 2013. \"I want to bring everything crashing down and destroy all of today[.] establishments.\" This culture of destruction was launched four decades ago by corporate forces. The corporate elites terrified by the mobilization of the_left in the 1960[.] by what the political scientist Samuel Huntington called \"America[.] excess of democracy\" built and funded counter-institutions to delegitimize and marginalize critics of corporate capitalism and imperialism. They bought the allegiances of the two main political parties. They imposed obedience to the neoliberal ideology within academia and the press. This campaign laid out by Lewis Powell in his 1971 memorandum titled, \"Attack on American Free Enterprise System\" was the blueprint for the creeping corporate coup d'etat that 45 years later is largely complete.\n\nThe dismantling of democratic institutions, places where the citizen has agency and a voice, is far greater than the ascendancy to the white house of the demagogue Trump. The coup destroyed our two party system. Labor unions are a spent force. The press is corporatized. Universities have been purged of dissidents and independent scholars who criticize neoliberalism and decry the decay of democratic institutions and political parties. Public broadcasting and the arts, places where voices not beholden to corporate power should find a sanctuary, have been defunded and forced to beg for corporate money which comes, of course, with corporate censorship. And it is expected that what little money the government gives to public broadcasting and organizations such as the NEA will soon be eliminated under Trump. The courts have been stacked with judges whose legal careers were spent serving corporate power, a trend in appointments that continued under Barack Obama. Money has replaced the vote which is how someone as unqualified as DeVos can buy herself a Cabinet seat. And the Democratic Party rather than sever its ties to Wall Street and corporations is naively waiting in the wings to profit from a Trump debacle.\n\nThis coup destroyed more than our democratic institutions. It destroyed the very credibility of liberal democracy. Self-identified liberals such as the Clintons and Obama mouthed the words of liberal democratic values while making war on those values in the service of corporate power. And the revolt we see rippling across the united states and much of the globe is a revolt not only against a corporate system that has betrayed workers but also, for many, the ideas and values espoused by a bankrupt liberal class. This is very dangerous. The discrediting of liberal democracy will allow the radical right to cement into place in America and much of Europe and other parts of the globe a form of fascism. Presidential adviser Stephen Miller, an ardent white supremest, in an interview on Face the Nation on CBS was quite blunt about what to expect.\n\n\"We have a judiciary that has taken far too much power and become in many cases a supreme branch of government,\" he said. \"Our opponents, the media, and the whole world will soon see as we begin to take further actions that the powers of the president to protect our country are very substantial and will not be questioned.\"\n\nHistory may not repeat itself but it echoes. The framers of our Constitution, steeped in the history of ancient Greece and Rome, attempted to provide checks and balances to keep the American republic from falling like their ancient counterparts into oligarchy and tyranny. This knowledge of the past, dismissed as frivolous by our consumer culture and business elites, allows us recognize the familiar warning signs on the road to tyranny. If we studied the collapse of ancient Greece, Rome, the Weimar Republic, or even the former Yugoslavia we would be far more alert to the current march towards despotism. Thucydides, who wrote that the tyranny Athens imposed on others had finally imposed on itself, is a better guide to our future than Milton Friedman or Ayn Rand. \n\nThe historian Fritz Stern in \"The Politics of Cultural Despair,\" his book on the rise of fascism in Germany, warned repeatedly of the danger of a bankrupt liberalism. Stern who saw the same dark irrational forces at work today that he watched as a boy in Nazi Germany argued that the spiritually and politically alienated are the prime recruits for a politics centered around cultural hatreds and personal resentments. And Stern told me that in Germany there was a yearning for fascism before the word fascism was invented. \"They attacked liberalism,\" Stern wrote of the fascists emerging at the time in Germany \"because it seemed to them the principal premise of modern society. Everything they dreaded seemed to spring from it. The bourgeois life, Manchesterism (which is laissez faire capitalism) materialism, parliament, and the parties, the lack of political leadership. Even more they sensed in liberalism the source of all their inner sufferings. Theirs was a resentment of loneliness. Their one desire was for a new faith, a new community of believers a world with fixed standards and no doubts. A new national religion that would bind all Germans together. All this liberalism denied. Hence they hated liberalism, blamed it for making outcasts of them, for uprooting them from their imaginary past, and from their faith.\"\n\nIt turns out 45 years later that those who truly hate us for our freedoms are not the array of dehumanized enemies cooked up by the war machine - the Vietnamese, the Cambodians, Afghanis, Iraqis, Iranians, or even the Taliban, al-Qaida, or ISIS. They are the financiers, bankers, politicians, public intellectuals and pundits, lawyers, journalists, and businesspeople, many cultivated in elite universities and business schools who served as Matt Taibbi says, \"as the guardians of the orthodoxy of neoliberalism and empire.\" In the twilight phase of capitalism wealth is no longer created by producing or manufacturing. It is created by manipulating the prices of stocks and commodities and imposing a crippling debt peonage on the public. Our casino capitalism has merged with the actual gambling industry. This is an economic model designed to prey on the desperate: young men and women burdened by student loans; underpaid workers crushed by credit card debt and mortgages; bankrupt towns and cities forced to borrow to maintain municipal services and sell off municipal assets - from sewers and water treatment plants to their parking authority - to corporations.\n"}