{"doc_id": "1060", "name": "2017_04_humanities_student_major_1305_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-04-humanities-student-major_1305_politics.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.054", "Subjectivity": "0.342", "Score": "80", "Upvotes": "0", "Downvotes": "0", "Wordcount": "656", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64t8uv", "Reddit_id": "dg5gy6z", "Subreddit_id": "t5_2cneq", "Commenter": "Fizjig", "length": "3564", "content_scrubbed": "I am a Gen Xer. Growing up, all I heard from the baby boomer adults around me is that we all had to study hard, get good grades, and go to college otherwise you would never get a good job as an adult. \n\nBack then, the tech industry was a new concept. Cell Phones and home internet were non-existent to the average consumer. In high school, there were no computers. The first home computers became affordable 2 years after I graduated high school. \n\nSure enough, many of us listened to that advice, went out and got a degree, or more. \n\nI know people like to claim that everyone who struggles must have gotten a liberal_arts degree, or something equally worthless. Most of my peers got business degrees, engineering degrees, or other practical schooling. Once again, because our baby boomer parents told us that is what we needed to do.\n\nEveryone from our parents to the student councilors said, \"Just take out loans. Everyone does it. Don't worry about the cost! You have 10 years to pay it back!\"\n\nMeanwhile, no school I attended ever discussed real world concepts like interest, or inflation, or job markets. There was never an \"Adulting 101\" course made available to us.\n\nWe did all those things because we listened to the \"wise\" advice of those that came before us. \n\nWhat they failed to mention is that those loans, which seem so innocent, and necessary at the time would end up costing 10[.] of thousands of dollars, and that in many cases your only choice was to go deeper in debt after school trying to pay them off and live, or to give up on dreams of buying a home, taking any time off, or having any sort of a normal life without financial struggles.\n\nThen the tech boom hit, and those degrees we worked so hard for and invested so much in became obsolete. Just when we came to grips with that the tech bubble burst, the housing bubble ballooned and burst before we could recover and we were left with the fallout.\n\nNow people blame us for it. They say shit like, \"Pull yourself up by the bootstraps. Life isn't fair!\"\n\nThat rhetorical shit pours from the mouths of the same people who never had to deal with $60,000+ in inflated college debt. \n\nMost of those same peers I know with degrees were left stuck, working for $10-$12 an hour in fields that were not their focus in school. Barely making ends meet without their parent[.] help.\n\nAll the while being told by those same baby boomers that they are lazy, with no work ethic. \n\nThey still live in the 2 story house they bought in 1978 for $40,000 and bitch at us when we cannot afford the $600,000 to buy a similar house in a worse neighborhood on top of our student debt we are still paying today.\n\nThey are so out of touch with today[.] reality that it[.] hard to not be insulted by their complete lack of understanding. We did everything they told us we should and they don't have a clue why we can't make ends meet the way they did. \n\nNow they are voting in the same out of touch, inexperienced cronies that fail to understand the world that we live in today. They still think it[.] 1965 and they act like it. \n\nFossils like Betty Devos, Jeff Sessions, and Orinn Hatch think they know what[.] good for people in this day and age, but they don't have a fucking clue. They have been stuck in neutral for the past 3 decades pushing the same failed, bullshit policies that didn't work then, and still won't work now. \n\nIt is time for their generation, and the baby boomers after them to retire, move on to Florida, or Arizona, and let the rest of us fix the mess they left behind for us to clean up.\n\n\n \n\n"}