{"doc_id": "1247", "name": "2017_04_humanities_student_major_3085_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-04-humanities-student-major_3085_politics.txt", "pub_date": "2017-04-27T00:00:00Z", "Sentiment": "0.066", "Subjectivity": "0.291", "Score": "478", "Upvotes": "0", "Downvotes": "0", "Wordcount": "310", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgtws5v", "Reddit_id": "dgtxlyr", "Subreddit_id": "t5_2cneq", "Commenter": "I_have_no_mercy", "length": "1750", "content_scrubbed": "Taxation is theft. I shouldn't have to pay for your health care problems. Just sell your smartphone and buy health insurance. Work a summer job to pay for college, and during the school year too, even if that leaves you less time to study. Or get into a trade. College is a scam. Johnny the plumber makes 100k at 22 and has a house and a car paid off because he got lucky finding the_right apprenticeship, and works 80 hours a week. Don't study liberal_arts: who needs culture and arts anyway? Study computer science or engineering like everybody else and raise venture capital to start your own firm. Or just get into consulting. It[.] not hard. Just use your network. Why should I pay taxes to feed hungry kids, clothe the poor and provide clean air and clean water to the downtrodden? If they wanted food, clothing and clean air and water, they'd just move. I don't like to reward failure. Crime and homelessness may be higher than every single other industrialized country, but that[.] because we pay to defend those countries and they use the savings to pay for social programs. Tens of millions of Americans have mental health problems because they work too hard for too little and can't move up the social pyramid? I don't care, because I'm a proud libertarian and *I* owe you NOTHING. I get my information from Fox News, because it[.] the only unbiased media out there. Liberal shills want to take my money to help the poor and college students (what[.] the difference anyway haha)? Even though I belong to the 97th percentile? Haha, use your bootstraps, losers. That[.] communism. Why can't you succeed if I succeeded? Just take a loan from your parents, or start flipping rental homes for extra income, or get a full scholarship. It[.] easy.\n\n#/s"}