{"doc_id": "229", "name": "2017_10_humanities_student_major_40_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2017-10-humanities-student-major_40_explainlikeimfive.txt", "pub_date": "2017-10-01T00:00:00Z", "Sentiment": "0.151", "Subjectivity": "0.453", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "500", "Permalink": "http://reddit.com/r/explainlikeimfive/comments/73m0s0/eli5_why_does_the_education_system_seem_so/dnrd8jr/", "Threadlink": "http://reddit.com/r/explainlikeimfive/comments/73m0s0/eli5_why_does_the_education_system_seem_so", "Parent_id": "t3_73m0s0", "Reddit_id": "dnrd8jr", "Subreddit_id": "t5_2sokd", "Commenter": "gwenthen", "length": "3146", "content_scrubbed": "When someone learns something new, neural passageways are opening in the brain and synaptic connections are being made. When someone learns long division or algebra, the neural passageways that are opening are not useful just for long division or algebra, but for problem solving skills generally. Learning math makes the brain more efficient in logical thought and better at solving rational problems. Most math majors do not work in math specifically, but in problem solving jobs primarily in business administration, insurance, finance, and engineering because their problem solving skills are coveted by these industries. The same is true with any other subject. If you read Charles Dickens in school, the neural passageways opening in the brain as a result of that reading are not just relevant for reading Charles Dickens. Reading is applicable to many other areas as well, some are probably so far reaching due to the interconnectivity of specialized parts of the brain that we don't even know fully the extent to which these educational exercises impact human development.\n\nFurthermore, if society is going to produce engineers, computer programrs, accountants, actuaries, and other \"useful\" professionals, the math, science, reading, and other skills needed to provide a foundation for these career paths need to be established early in life. \n\nThe main party responsible for preparing a child for adulthood is the parents. Educational institutions are just there to supplement the parent[.] efforts in a way that benefits society as a whole. Society has an interest in making sure young people have access to developing their mental faculties to be efficient problem solvers and good readers and speakers. And while I think schools should teach kids how to do taxes and home economics (and I'd challenge anyone to find a single public school that doesn't teach these skills), these things are so simple and easily taught and learned that they fall under the purview of the parents in my opinion.\n\nWhat does \"effective productivity skills\" mean? Effective for what end? Productive for whom? And for \"fact checking\", what does that mean? Kids should certainly learn what an argument is and is not and should learn how to think critically, but this is not something that can really be taught in a class. One would have to learn epistemology, post-modern deconstruction, and other aspects of philosophy through all kinds of different approaches in philosophy, psychology, economics, political science, the arts, etc. Learning what is true and what is false is more of a life-long journey than something that can be taught in a semester. Schools can help provide a good foundation for for that life long journey, but many people are not susceptible to crank theories and crackpot beliefs because they are unable to formulate arguments. Other factors, such as economic and psychological problems come in to play. Families, religious institutions, the government, non-profits, sports, leagues, and in general-the entire community has a role to play-each in their own way-in shaping a child to be a happy, healthy, centered, responsible adult."}