{"doc_id": "404", "name": "2017_10_humanities_student_major_1681_socalr4r", "namespace": "we1sv2.0", "metapath": "", "pub": "SoCalR4R", "title": "2017-10-humanities-student-major_1681_SoCalR4R.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "-0.06", "Subjectivity": "0.327", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "258", "Permalink": "http://reddit.com/r/SoCalR4R/comments/774aqs/21_w4m_los_angeles_looking_for_las_most_eligible/dokasgp/", "Threadlink": "http://reddit.com/r/SoCalR4R/comments/774aqs/21_w4m_los_angeles_looking_for_las_most_eligible", "Parent_id": "t1_dok3rut", "Reddit_id": "dokasgp", "Subreddit_id": "t5_2tzxi", "Commenter": "MFHE", "length": "1590", "content_scrubbed": "If you're just like everyone else, why go out with you? What do you bring to the table.  \n\nThere[.] nothing objective about that article. It[.] poorly written. Incomprehensible drivel. Copywriters writing clickbait to get paid to write more clickbait. I wasn't aware anyone took LinkedInTM articles in earnest.\n\nOur generations' Dali will never blossom. He works at uproxx photoshopping retarded dogs reacting to the Gigi Hadid/weeknd break up. \n\nKazuo Ishiguro won the noble prize for short stories in 2017. Our generations' Ishiguro is busy captioning GIFs for buzzfeed. Scott Disik punches the air in a karate suit. He is reacting to the news. Khloe[.] pregnant. \n\nOur generation[.] Pablo Neruda writes for the vulture. Clickbait commentary about Buzzfeed[.] commentary about a Huffington post article from the New_Yorker[.] original opinion article on what the Kardashians mean for our time. The vulture[.] commentary is that the buzzfeed article is being sexist. Scroll till your thumb falls off. The comments go down and down and down. Click to see 157 more replies. Team Khloe and team Kendall saying why they hate each other. Old people who ended up there from Facebook asking how to thumb down the page. Liberal arts majors shocked at buzzfeed[.] angel. Team Kendall reacting to a GIF laden 900 word essay like the guy covering the fucking mei lei massacre. \n\nlike share and subscribe. read it and get mad. share it on your facebook. get your friends mad. clickbait to write more clickbait for more revenue dollars. meanwhile someone links an uproxx article alongside the word \"objective.\" "}