{"doc_id": "333", "name": "2017_10_humanities_student_major_983_youtube", "namespace": "we1sv2.0", "metapath": "", "pub": "youtube", "title": "2017-10-humanities-student-major_983_youtube.txt", "pub_date": "2017-10-10T00:00:00Z", "Sentiment": "0.062", "Subjectivity": "0.313", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1717", "Permalink": "http://reddit.com/r/youtube/comments/75kbdp/is_youtube_lost/do6yc4y/", "Threadlink": "http://reddit.com/r/youtube/comments/75kbdp/is_youtube_lost", "Parent_id": "t3_75kbdp", "Reddit_id": "do6yc4y", "Subreddit_id": "t5_2qh44", "Commenter": "amoral_crackpot", "length": "9606", "content_scrubbed": "Platforms like YouTube are only what you make of it.\n\nSponsors pay the bills. They provide the revenue stream to keep the lights on--not me, not you, and not Philip DeFranco. The sponsors are needed for the platform to exist at all. It[.] why there are no real YouTube alternatives--it[.] just way too expensive and way too easy to fail. If YouTube can barely make it work, why would Coke or any other major company invest sinking money into a guaranteed to fail venture?\n\nThe Adpocalypse was the inevitable result of YouTubers being given too much rope for too long. Eventually, they hung themselves (and the platform) with them. It wasn't YouTube or the sponsors to blame. It was YouTubers with questionable content and their \"communities\" who brought this down on all of us.\n\nPeople think cord cutting is this massive thing that[.] happening and that YouTube is somehow the future--it isn't. YouTube (and similar platforms) is the latest version of public access television. Only instead of a tiny local audience, we're dealing with a potentially global one.\n\nBut that isn't a *bad* thing. If anything, it[.] a good thing. It[.] easy enough to predict. You can figure out where and how you can grow an audience. You can manage generating revenue without the long, drawn-out process of drudging up your own sponsors to pay you to produce your shitty TV show.\n\nYou also have things like SEO and major search engines that fit you into algorithms that you can exploit to reach even more people, thus increasing your value in the eyes of sponsors. YouTube does all the heavy lifting on that side of the equation, thus leaving you free to focus specifically on programming and marketing.\n\nThat said, what people are realizing now is that much of the content they've been creating is, unfortunately, worthless. It[.] not worth the servers they're stored on. There[.] only so much money and way too many people creating identical content that competes for a fairly limited audience--an audience with viewing habits and tastes that are changing at a much faster rate than ever before. These viewers chase the next big thing, and there[.] a new one almost daily for them to turn to. It[.] an incredibly competitive market.\n\nThink about the usual content on YouTube, like all the vlogs, pop-culture news, and drama. None of that is evergreen. It lives and dies in hours, maybe days depending on how hot the topic is. These videos burn bright but then instantly go out. They generate a lot of revenue real quick before they're making nothing ever again. Everyday these channels have to generate content that meet certain expectations simply to continue existing. Their audience can literally dry up overnight should a better alternative appear, one with a better schedule or personality or whatever. For any reason, at any time, everything can go away.\n\nAnd it makes sense. The algorithms feed this behavior. It[.] more profitable in the short term to chase after this sort of audience.\n\nBut it also blinds people to their need to expand beyond a singular project and platform. TV series get canceled all the time. Some don't even make it a full season. Some last several seasons before they're abruptly canceled. YouTube is no different. The money can and does dry up without warning. That[.] how entertainment works. You're supposed to be prepared for that. You're supposed to line up new projects. You're supposed to grow and expand and look towards other opportunities that the initial popularity and fame and money affords you.\n\nA few questions every content creator has to ask themselves include (and listed here in no particular order):\n\n* Who is my target audience, and how large is it?\n* How can I compete for their attention and *retain* a notable number of these potential viewers?\n* What are the risks involved with this sort of audience and programming? (Is the audience finicky? Is there a lot of competition?)\n* What sort of merchandise options are there to generate additional revenue?\n* How long will anything I produce be of value to my audience, both new and old?\n* What will I do once I see diminishing returns?\n\nEntertainment is not an easy business. It[.] not the most lucrative business across the board. But it can be a manageable one that provides a decent living for the many who figure out how things work and can make it work for them.\n\nPeople really need to have an honest conversation with themselves about whether or not their content is actually viable, both in the short and long_term. Because most are going to realize that they don't have much to offer. And that sucks. But that[.] the reality of the world, not just entertainment. Not everyone is cut out to be a leading man or a producer. Entertainment isn't a business for everyone.\n\nAnd if you do stick around but don't like being beholden to corporate sponsors for all your income, then you need to figure out a way to turn every viewer into a potential revenue stream--merch, a patreon, whatever. Ad revenue should never, ever be your singular source of income. Actors at least know how much they're making per episode or movie. At least some of their money is guaranteed thanks to contracts. But as an independent entertainer, you're going to get stiffed every now and again. Your pay is going to be shit for a long time before it gets better (if it ever does). And even then, it can go right back to bad or even nonexistent should gigs dry up (and they often do)\n\nYou've got to pay your dues and build an audience that will support you for the long haul. Not everyone can do that. And a lot of YouTubers are finding that out the hard way because they've had it way too easy for way too long and weren't prepared for reality to bite them in the ass. They're not used to working in \"entertainment\".\n\nThe entertainment industry loves rebels and flashes in the pan just as much as it loves predictable, safe investments. It[.] a matter of what you're willing to do for that job, for that paycheck. Will you play nice with sponsors and their expectations? Or will you go full punk rock, tell the sponsors to fuck off, and then do things your way with only your fledgling (likely nonexistent) fan base to lean on? Either one works. But in either case, you've got a lot of work to do to *make* it work.\n\nBecause whatever corner of arts, crafts, and entertainment you fall into--a comic, a pro wrestler, an actor, a painter, a writer, a YouTuber, whatever--you are not guaranteed anything for all your work. That[.] the risk you take. You're risking the steady pay of a 9-to-5 job against the opportunities in the field you would rather be in. And a lot of the time it simply does not pan out. And a lot of the times that happens, it[.] because those people weren't equipped for the struggles and pains of the business.\n\nComedian Marc Maron just did an AMA today on Reddit. Someone asked him about the opportunities for a college graduate with a desire to not work a typical 9-to-5.\n\n What unique advice would you have for a recent college grad English major who wants to avoid the mundane 9-5 day to day week at all costs?\n\nHis answer was as simple as it was insightful:\n\n How do you feel about homelessness?\n\nI've been in one corner of the arts and entertainment industries for over a decade at this point. If not for my loving wife and some great friends I've made along the way, I wouldn't have had the opportunities or the mental and emotional and spiritual willpower necessary to keep at it. I've made very good money with my writing. I've signed autographs. I've been paid to travel the country and work. I've been mentored by a literal billionaire business man. I've been praised by actors with real movie and TV and video game credits for my writing and vocal work. But I've also performed for almost no one. I do stand up in bars. I've had several concussions simply training for the chance to perform for an audience. I currently make just under a dollar a day for the work I publish on YouTube, though my audience is steadily growing. I write a lot of stuff that people apparently like but doesn't get a lot of traction (and certainly makes me little to no money right now).\n\nBut I've seen over the years--through all of my twenties and now in my early 30s--that I can't live doing anything else. I've tried it. Me and \"work\" don't mix well. My wife doesn't want to see me doing anything else. My friends--the few I've kept--want to see me excel at what I do, they're there to guide me and help me (just as I am for them). But it[.] real fucking hard. There[.] a lot more painful moments than there are good ones. Certainly a lot more weeks without much in the way of a paycheck than with. But I know that. I've long accepted it as gospel. And because of that, I keep going and going until I *earn* that paycheck. Until my work pays off, even if it takes weeks or months.\n\nBut I've also proven--not just to myself but to others--that I have developed marketable enough talent to make it happen. I'm just lacking the audience right now to make a stable living. So, I have to keep at it. I have to grind and grind until I level up, one day, some day.\n\nYouTube is a platform to jump off of. It[.] a tool for you to use, not the end goal. Always stay a step ahead of the game. Develop your talents, exploit them to the cultivate a loyal audience. Do all you can think of to create as many opportunities to grow and generate income from your work and talents. But, above all else, do not fall into being a \"YouTuber\". You're just a talented mofo using YouTube to further build your brand, same as you would something like Facebook or Twitter."}