{"doc_id": "982", "name": "2017_04_humanities_student_major_576_columbus", "namespace": "we1sv2.0", "metapath": "", "pub": "Columbus", "title": "2017-04-humanities-student-major_576_Columbus.txt", "pub_date": "2017-04-06T00:00:00Z", "Sentiment": "0.121", "Subjectivity": "0.327", "Score": "14", "Upvotes": "0", "Downvotes": "0", "Wordcount": "660", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63owhv", "Reddit_id": "dfwnlxk", "Subreddit_id": "t5_2r373", "Commenter": "AkronRonin", "length": "4198", "content_scrubbed": "Have spent substantial time in both.\n\n-Both are actually quite \"clean\" places these days, though Columbus probably more so since it never was a true industrial boomtown. The Columbus metro area is definitely a predominately white collar city, whereas the Cincinnati metro area (extending into Northern Kentucky) is a bit of a mix of both white and blue collar jobs.\n \n-Infrastructure-wise, Cincinnati is much older, more urbanized and built-out than Columbus, with all of the road, pipeline, etc. maintenance issues that generally come with being so. At the same time, the city has recently been focused on revitalizing several of its downtown neighborhoods, particularly Over-The-Rhine, and Clifton, where the University of Cincinnati[.] Main Campus is located. As for Columbus, it is and has definitely been in growth mode--upward and outward--over the past few decades. Recently the city proper at least seems to be shifting away from growth through sprawl and annexations, and more so on building upwards along High St., particularly through the Short North and Ohio State[.] University District. Some suburbs, like Dublin and Grandview Heights, have also recently undertaken similar urbanization projects. Others, like Grove City, continue to sprawl out into the countryside.\n \n-Politically, both Cincy and Columbus proper are Democratic strongholds with Dem mayors and majorities on their respective city councils, although the Cincinnati metro itself is famous for being reliably conservative in every way, politically as well as socially, which often has implications for what the city proper tries to get done (e. g. the Street Car). Nevertheless, it would be fair to say that Cincinnati Democrats are pretty conservative themselves, including the current Mayor, John Cranley, who himself was against the street car.\n \nColumbus, meanwhile, has been trending more and more politically and socially liberal over the past few decades in no small part due to the city[.] steady growth, influx of young people, the presence of OSU and other educational institutions/companies, the fashion industry, and an increasingly diverse mix of people. Generally, this is most relevant within the 270 Outerbelt loop, but there has been a notable spillover effect even beyond it into some outlying suburbs and areas, particularly to the North and East, much less so to the South. The city has increasingly been viewed as one of the more socially welcoming places in the Midwest, if not the US itself.\n \n-Medically, Cincinnati, like in most other aspects, is more established, but Columbus has seen a lot of growth and expansion recently, particularly with Ohio State and Ohio Health/Riverside.\n \n-Social/Entertainment/Arts: Cincinnati definitely has more social/entertainment \"hot spots\" than Columbus, from Over-The-Rhine downtown, to neighborhood hubs like Northside, Mt. Lookout, Mt. Adams, Oakley, Hyde Park, etc. In contrast, Columbus has High Street, from the Short North up through the University District, and a few small but growing hubs like Gay Street, The Brewery District, South Clintonville, and Grandview Ave. The arts are comparable in both regions, although Cincy[.] seems more established, whereas the arts scene in Columbus seems to still be evolving.\n \nOverall, I would suggest basing your decision on what you need and are into most. I will say that Columbus is definitely the easier of the two to \"break into\" since there are more entry-level job and career opportunities, as well as the fact that it is younger, with social boundaries/circles that seem to be a more open and flexible as a result. There are also many people here genuinely looking to meet and connect with others, which not surprisingly has contributed to the city[.] growing social and entertainment scene. In contrast, Cincinnati is a lot more provincial, and social boundaries are fixed if not etched into stone since there hasn't been much population growth within the city or region for decades. It[.] actually pretty common for people there to ask you which high school you graduated from. None of this means that you can't possibly connect with people there, but it will likely take much more time to do so than here."}