{"doc_id": "1018", "name": "2017_04_humanities_student_major_916_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2017-04-humanities-student-major_916_college.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "-0.14", "Subjectivity": "0.303", "Score": "23", "Upvotes": "0", "Downvotes": "0", "Wordcount": "615", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64ak00", "Reddit_id": "dg0ou9d", "Subreddit_id": "t5_2qh3z", "Commenter": "MrPockets11", "length": "3328", "content_scrubbed": "I agree with this post.\n\nI went to a 4 year private liberal_arts college, it cost me $117k for 4 years. My parents mandated I go to school there even though they had a very limited list of majors. At the end of my freshman year I got stabbed by some people I thought were my friends. The school did literally nothing to help me regarding this and local police ceded authority to campus police (due to local legislation) who ceded authority to the vice president of student life (due to school policy) who didnt respond to the attack or my case until the end of my senior year. During my sophomore year I looked into transferring to another college... And none of the credits I already had would transfer at all (schools in Texas are still sort of like this but less so now a days because they talk to each other more now). So at $30k into a 4 year education my parents and I decided we'd wait for the school to make a disciplinary decision, which they didn't. Long story short the vice president of student life really screwed up, the guys who attacked me wrote me death threats for 4 years, and when I made complaints to school officials higher up, due to a lot of evidence the school lost, they were unable to do anything and instead mandated that I had to post a written apology to my attackers around campus for committing an act of slander against my attackers. It was bullshit and a terrible experience. They didn't offer a major I wanted, and had a limited selection to begin with, so I wound up with a ba in philosophy, and a really screwed up transcript that has caused problems pursuing further education. I have no senior level courses in my degree because the school didn't offer them, and I have more courses in my minor than my major, and my minor isn't even listed on my transcript. This has caused major problems pursuing a masters degree, and has caused major problems pursuing a second bachelor[.] degree. \n\nI have written my college a bad review on Google, yelp, etc... And that has caused the vice president of student life to call and harass me a number of times since graduating 8 years ago. He[.] hostile on the phone, and sometimes makes vague threats of physical violence. I've changed my phone number a few times, and I've recorded some of the phone calls. I've submitted everything to the police local to my area as well but what he[.] doing doesn't meet the legal definition of harassment due to time scale issues, and his threats of violence are too vague for the police to prosecute him. \n\nIt really sucks and I wish I hadn't gone to college at all, I wish my parents had been less dead set on the school I went to, they wish they hadn't been so dead set on it as well, my mother has developed an alcohol problem as a coping mechanism since graduating (for according to her \"damaging her kids before college and during\"), I wish the credits had been transferrable, I wish the school offered a computer science degree when I went to school there (they do now though), and I wish there had been a less violent student body at the college I went to, and most of all... I wish I didn't have a little round hard lumpy scar on the side of my torso from being stabbed, because it itches sometimes still and everytime I scratch at it, it[.] a constant reminder of the awful traumatic events I've been through. "}