{"doc_id": "390", "name": "2017_10_humanities_student_major_1565_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2017-10-humanities-student-major_1565_RPI.txt", "pub_date": "2017-10-17T00:00:00Z", "Sentiment": "0.148", "Subjectivity": "0.469", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "842", "Permalink": "http://reddit.com/r/RPI/comments/76zekj/prospective_parent_here_we_visited_campus_on/doi5v1o/", "Threadlink": "http://reddit.com/r/RPI/comments/76zekj/prospective_parent_here_we_visited_campus_on", "Parent_id": "t3_76zekj", "Reddit_id": "doi5v1o", "Subreddit_id": "t5_2rg3u", "Commenter": "KoalaHarper", "length": "4974", "content_scrubbed": "So, I've been a student at three schools: a top 5 University, a community college, and RPI. I have a BA and I'm working on a BS.\n\nAs a student, I love the civil engineering department. Great mentoring. Some of the older profs are just here for research or are coasting until retirement, but I've found that to be true at other institutions as well and have had some really great teachers too. My TAs have been excellent even when the prof is checked out. Research opportunities are abundant and you can do cross-disciplinary things too. RPI has also been generous with financial aid. The facilities are not the shiniest  and I'd much rather have new desks than a new sports complex, but RPI has solid basics for student life, a solid network of all kinds of clubs, and decent mentoring from class deans, academic advisors, counselors, student mentors, and so on. \n\nThe one thing your kid is not going to get here is any kind of decent liberal_arts education. There are no language offerings except Chinese, very few literature or sociology classes, and most \"soft\" classes still focus on STEM. Not a great recipe for churning out well-rounded, critically thinking individuals, and my comparative experiences between RPI[.] student body and others' bears that out. Students here are good at critical thinking when it comes to STEM analysis and problem-solving. They are not adequately challenged to think about complex or subtle human ideas and aren't super interested either. \n\nRegarding the campus social scene--there are tons of people outside in warm weather. People play frisbee and stretch out on 86 field, they work at the picnic tables, they play games all over campus on the weekends. Once the cold weather sets in we retreat inside. I wish there were more student spaces, or that RPI would update the ones they do have, but there are still a decent number of spots for studying or hanging out on campus. \n\nIf you've got a daughter (or idk, maybe even a son) applying, you might want her to hang around this page or talk to current students a bit more. There are a lot of decent people on campus and I've never had an issue with the professors, but there[.] definitely an uncomfortable vibe wrt women here. The quote someone posted from a couple years back embodies some of it: there[.] an idea that because RPI is trying to even out the gender ratio that the women who are admitted are somehow less deserving of being here, or took a spot away from a more deserving man, are teacher[.] pets, or are unfairly offered opportunities. Also prevalent is the idea that women are overconfident, cocky, think too much of themselves, unfairly have the upper hand in relationships, and so on. \n\nIn my experience, the women here are no different than any of the female demographics at other institutions I've been a student at. What[.] different is the RPI men[.] expectations and sense of entitlement/resentment. In my time here I've personally come across more Rate That Woman games, rape jokes, women-have-it-easy, and similar stuff than I have at other schools. An undergraduate I know was told that she shouldn't be an engineer because of her feminine qualities (despite being a strong student). Male students say things on the regular that suggest they inhabit a complacent mental paradigm wherein the standards are set for men specifically instead of being human standards geared toward both men and women. That[.] difficult to explain, but it[.] like they don't question for men to be at the center of things (professionally, etc) because the processes to make that happen are normal to them; when the situation shifts toward a woman--with any changes to the process that may come with that--it[.] an odd, possibly suspicious, uncomfortable thing that is easily questioned. This has come up in little conversations, not a huge sexist blow-out, but it[.] worth noting. A male engineering professor here commented on it as well.\n\nLast fall, the school also had issues with white nationalist-friendly posters going up anonymously and anti-women defacement of other posters. \n\nTo be clear, this is my personal experience of things I've heard and seen myself, with the benefit of experiences at two other schools for comparison. Some of my female friends have similar experiences here as well; others have not, especially if they've never experienced a different environment. Many of the people I study and work with are helpful, collaborative men though. It[.] rare to meet a true troll of a person here; most of the experiences that make me feel uncomfortable or unwelcome at RPI came from men who otherwise come off as normal and friendly. \n\nOne last note: It does seem true that RPI is courting women with more scholarship money. Why this is a gripe, I don't know since specialty scholarships have been a thing for underrepresented groups since forever. It[.] a good reason to attend if other schools cost significantly more, but it does feed into the resentment I decribed above. "}