{"doc_id": "521", "name": "2017_10_humanities_student_major_2876_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-10-humanities-student-major_2876_ApplyingToCollege.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.105", "Subjectivity": "0.397", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "618", "Permalink": "http://reddit.com/r/ApplyingToCollege/comments/79kqis/im_a_junior_at_duke_ama/dp2xbum/", "Threadlink": "http://reddit.com/r/ApplyingToCollege/comments/79kqis/im_a_junior_at_duke_ama", "Parent_id": "t1_dp2vbvw", "Reddit_id": "dp2xbum", "Subreddit_id": "t5_2y2r8", "Commenter": "waitwhatever", "length": "3476", "content_scrubbed": "1. Greek/SLG life is a pretty big force on campus - most parties are run through either a Fraternity or an SLG (Soros aren't allowed to have their own parties. Funny story relating to that, if anyone[.] interested). If you're not affiliated, you need to have friends who are to get into the more exclusive parties. But if greek life/partying isn't your thing, there're tons of other options. Duke organizations are always sponsoring events on campus, and though Durham is a little dull to be totally honest, there[.] still some to do in the city.\n\n2. One of my good friends is vegetarian, and it sounds like it[.] not the greatest situation in the world. The food options are obviously more limited as a vegetarian/vegan, and my friend often expresses his boredom with the same dozen things he eats. There are a few places on campus that straight up don't have anything vegetarian/vegan, so that seems like a situation that deserves redress.\n\n3. Definitely collaborative, and it[.] one of my favorite things about the school. Example: I was interviewing for a consulting internship along with eight other candidates, and even though we were directly competing against each other for two spots, several of the other candidates were totally willing to prep together and share case strategies, and they've honestly become friends through that. Of course, some people are super-competitive and will rebuff any offer of working together, but I think they're a minority. Most classes are normalized at least a little (so, if the max score is 95, that becomes an A+ and the rest is adjusted from there), especially the hard ones. Some of the easier intro courses aren't curved at all, and there are a few classes that are curved down just a tiny bit (like, you need a 95 to get an A instead of the usual 93). Some classes (like the legendary Econ 101) are notoriously curved on a pure bell curve, so if you get a 50% but the average is a 30% with a standard deviation of 10%, you get an A+, but on the other hand, if you get a 94% but the average is a 96% with a standard deviation of . 5%, then you get an F.\n\n4. Almost everything at Duke is competitive. Clubs, jobs, whatever, the majority of things don't allow you to just show up and be a member, especially if you want to be a meaningful member of a group. Every extracurricular activity I do, I had to audition, try-out, apply, be tapped, rush, etc. for it. That being said, there are a lot of research opportunities in every imaginable area, for both humanities and STEM, and I've never heard of someone not being able to find research. It just might not be the exact field they want.\n\n5. Interesting question. Transfering between Trinity and Pratt is, in actuality, very easy. It[.] just a little bit of paperwork. In practice, it can get complicated. The Trinity curriculum is very open-ended- you can take almost any classes you want. The Pratt curriculum, on the other hand, is extremely strict. So if you've been taking Trinity classes for a semester or two (or three or four or five), and decide you want to transfer, it will be basically impossible without staying at Duke for an extra year (or two or...). So, if you're planning on applying to Trinity and then switching to Pratt, I would just be extra sure that you follow the engineering track while you're in Trinity so you don't get behind. (Trinity does have a . 1% higher acceptance rate or something like that, so that is like an extra 30 people that get in... maybe)."}