{"doc_id": "483", "name": "2017_10_humanities_student_major_2547_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2017-10-humanities-student-major_2547_AskAcademia.txt", "pub_date": "2017-10-26T00:00:00Z", "Sentiment": "0.089", "Subjectivity": "0.384", "Score": "21", "Upvotes": "0", "Downvotes": "0", "Wordcount": "323", "Permalink": "http://reddit.com/r/AskAcademia/comments/78uhce/im_a_high_school_senior_ive_wanted_a_career_in/dowukw5/", "Threadlink": "http://reddit.com/r/AskAcademia/comments/78uhce/im_a_high_school_senior_ive_wanted_a_career_in", "Parent_id": "t3_78uhce", "Reddit_id": "dowukw5", "Subreddit_id": "t5_2sakj", "Commenter": "CHEIVIIST", "length": "1717", "content_scrubbed": "There are two main paths in academia and most of the news is around the research oriented academia. The first path is to do high end research at a research oriented university, this is where most of the stress exists. The second path is to focus on teaching and do research on the side at a small liberal_arts college (SLAC).\n\nI got my BS in chemistry and went straight into a combined masters/PhD program in physical chemistry which ended up taking me 5 years. I absolutely loved my advisor and the research that I was doing. I graduated at the ripe age of 27 and found a job at a small teaching college where I started teaching full time a month after I defended my dissertation. I have the latitude to develop my classes the way I want and offer them at the times that I want within reason. There isn't an expectation for publications but undergraduate research projects are encouraged. I'm currently in my second year and starting a small research project with 2 students while teaching a full load of classes and I love it!\n\nNot every story about grad school is a negative one but the negative ones tend to make their voices louder (there may also be more of them). Every advisor is different and the trick is to find one who you fit well with. I didn't mesh well with my first advisor and I switched after a year. It set me back a little but my mental health was so much better.\n\nEither route you choose for academia requires a PhD and that can be tough to navigate. All schools should have at least some resources in place to help you out if there are issues though.\n\nIf you are passionate about it, just know that not every story is a sob story and there are people who did well in grad school and enjoyed it."}