{"doc_id": "321", "name": "2017_10_humanities_student_major_853_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_853_AskReddit.txt", "pub_date": "2017-10-09T00:00:00Z", "Sentiment": "0.158", "Subjectivity": "0.364", "Score": "19", "Upvotes": "0", "Downvotes": "0", "Wordcount": "354", "Permalink": "http://reddit.com/r/AskReddit/comments/759ds0/reddit_what_are_some_college_majors_that_should/do5kij3/", "Threadlink": "http://reddit.com/r/AskReddit/comments/759ds0/reddit_what_are_some_college_majors_that_should", "Parent_id": "t3_759ds0", "Reddit_id": "do5kij3", "Subreddit_id": "t5_2qh1i", "Commenter": "SamGlover1256", "length": "2136", "content_scrubbed": "I think this thread is really proof, if nothing else, of the notion that most people have missed the point of college, at least historically speaking. University was never intended for vocational training, it was intended for greater intellectual and moral development. Classically speaking, you finished your early education in grammar, logic, and rhetoric (the trivium) then in the university you moved on to geometry, music, astronomy, and arithmetic (the quadrivium, all of which were at least on some level different from their modern counterpart). When you finished those, called the seven Liberal Arts in classical study, you moved on to the study of philosophy, the liberal art par excellence, or theology (interestingly, philosophy came to be lovingly referred to as theology[.] handmaiden). \nI say all of that to say, no major, assuming that it is intellectually honest and rational, should be considered lesser or inferior. Don't go to college for a job first and foremost, go to a vocational school or go into an apprenticeship of some sort if that[.] your only consideration; there[.] no shame in that. Go to college to become a better and more complete person primarily, and then focus on what may interest you career-wise. By all means, be wise and choose a major that actually interests you and you'd actually want to pursue as a career, but bear in mind that college was never intended as mere vocational training. Become a good person who can apply their education to a trade, not a hollow tradesman. \nEdit: Also, a lot of people apparently don't know the difference between the humanities and the liberal_arts in a  modern university. The liberal_arts in modernity include the humanities (philosophy, art, literature, etc.), the physical and biological sciences, and mathematics. Most of the people here saying \"don't get a liberal_arts degree!\" waxing eloquent about how useless liberal_arts degrees are and how glad they are that they didn't get one likely not only attended a liberal_arts university, but they also got a liberal_arts degree of some sort, the exception being if you got a business degree or the like. "}