{"doc_id": "1240", "name": "2017_04_humanities_student_major_3014_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-04-humanities-student-major_3014_ApplyingToCollege.txt", "pub_date": "2017-04-26T00:00:00Z", "Sentiment": "0.152", "Subjectivity": "0.312", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "303", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67rgvc", "Reddit_id": "dgsu4sz", "Subreddit_id": "t5_2y2r8", "Commenter": "virtualpropinquity", "length": "1833", "content_scrubbed": "Honestly, Swarthmore students don't go out to Philly much at all. The academic environment is intense and the campus such a bubble that students seldom venture out. \n\nI prefer Williams. I didn't apply to Williams when I was applying because I feared the sheer isolation, but it[.] really not that different from other colleges. Most of your time will be spent on campus in a liberal_arts college. Beside, getting to Boston/NY takes like 3 hours or so, and many students do go out for extended weekends or breaks. Williams has the winter study program and the Exeter exchange to give you opportunities to go out of campus. One of my friends went to Egypt to study the historical roots of contemporary Middle-Eastern politics, and was fully funded for it! \n\nWilliams:\n(A) is not as socially stratified as Amherst in terms of athletic social hierarchy; non-athletes fit in just fine. Though athletics are taken pretty seriously\n(B) is well balanced, offering the same quality of distinguished academics as Swarthmore through its tutorial program but also a lot more\n(C) is more balanced in terms of outcomes, whereas most Swarthmore students are interested in academia\n(D) has friendlier, less high-strung students and less of a toxic misery poker culture, though it[.] not easier than Swarthmore academically \n(E) is a school where it is super easy to double major + explore thanks to majors only requiring 10 courses\n(F) has an incredible alumni network and pre-professional outcomes\n\nSwarthmore:\n(A) is more diverse than Williams \n(B) is more politically active/liberal\n(C) is a part of the Quaker consortium, which theoretically gives a more enriched experience... but again, Swatties don't go out of campus much\n(D) has a nicer campus in my opinion; I've been to both. \n(E) has perhaps the most robust intellectual culture of any LAC\n"}