{"doc_id": "1217", "name": "2017_04_humanities_student_major_2761_toronto", "namespace": "we1sv2.0", "metapath": "", "pub": "toronto", "title": "2017-04-humanities-student-major_2761_toronto.txt", "pub_date": "2017-04-24T00:00:00Z", "Sentiment": "0.103", "Subjectivity": "0.238", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "451", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgp4ku3", "Reddit_id": "dgp6cox", "Subreddit_id": "t5_2qi63", "Commenter": "Being_and_Thyme", "length": "2689", "content_scrubbed": " A teacher[.] most basic job is to teach math, sciences/humanities, and languages, in that order.\n\n Only once they can show that they can competently do that, then, maybe, they can incorporate more advanced concepts of post-colonial studies, or whatever else they want, into the curriculum. I would trust them to make that call.\n\nThese concepts are already implicit in many of the humanities and social science based subjects. What you're suggesting is that teachers remain willfully ignorant of significant portions of the material they need to teach for reasons I'm not quite clear on, on subjects that directly effect the lives of students.\n\n So, this leads me to conclude that teachers are currently incompetent, and/or have an agenda to push; they would not benefit from any additional content, at best, or, more likely, do more harm then good with it because they can not be trusted to teach it properly.\n\nThis makes no sense. I know several teachers who have worked in Canada and abroad and in all levels of education and you think falling test scores is a result of the teachers not having enough time to bone up on math or are trying to push an agenda? Rather than perhaps environmental problems relating to class size or digital technology, just as an example?\n\n So, whatever advantages of post-colonial studies may be, and i don't disagree with you that in the_right hands they could be beneficial, provided the material is balanced and not simply 'white man = bad' narrative,\n\nAgain, I ask you for some more information on how well-versed you are in post-colonial studies. I get the distinct impression you have none.\n\n Let me rephrase. On balance, the policy did not work and resulted in more harm, and perpetuation of the very conditions it attempted to eradicate, then it brought benefits\n\nThis is just you rephrasing your already broadly inaccurate claim. On balance the policy DID work in specific areas and on balance the policy DID NOT work in other areas, which is not enough for you to endorse no affirmative action.\n\n Chief Justice John Roberts wrote:\n\n\"The way to stop discrimination on the basis of race is to stop discriminating on the basis of race.\"\n\nWhy are you quoting John Roberts and from what source is this? Why are you not quoting people who actually have experience studying racism rather than a staunchly conservative member of the US Supreme Court? Why not quote someone who understands racism as a particular relation of power that marginalizes based off race through systemic and individual means, as opposed to Roberts apparently (the quote you offer is de-contextualized) uninformed opinion that racism is simply to make a decision based off race? \n"}