{"doc_id": "1087", "name": "2017_04_humanities_student_major_1642_futurology", "namespace": "we1sv2.0", "metapath": "", "pub": "Futurology", "title": "2017-04-humanities-student-major_1642_Futurology.txt", "pub_date": "2017-04-14T00:00:00Z", "Sentiment": "0.091", "Subjectivity": "0.302", "Score": "22", "Upvotes": "0", "Downvotes": "0", "Wordcount": "294", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg9ch38", "Reddit_id": "dg9ctjq", "Subreddit_id": "t5_2t7no", "Commenter": "Dwarf-", "length": "1609", "content_scrubbed": "I'm talking about universities. I actually found university to be a couple of things as a liberal_arts major:\n\n1. Too easy\n\n2. Too expensive\n\n3. Too fraudulent\n\nI distinctly remember asking my liberal_arts professor during my freshman year \"is this really something I can make a living out of?\" He replied \"yes, I do well for myself and I've even had the opportunity to work in many different fields of work including *engineering*[emphasis mine]\"\n\nI knew that degrees were more or less a piece of paper to get a higher pay grade so this news was nice to hear. I imagined that I would be able to slide into a job in my field fairly easily if *he* got a job outside of his field. But the thing is, it wasn't that easy. I got my degree without ever lifting a finger. I made the dean[.] list every semester while skipping classes all the time. \n\nClearly, I joined a \"pay to win\" university despite being fairly large and well known. I trusted that this system of education would return to me a profession. But it didn't. I've been taking night classes for two years since I graduated. Now I do low-income software engineering wherever someone will take me. I always have to put my night classes / online classes *above* my full-fledged degree. I could have saved $60,000 and been earning twice as much if I just went to community college for classes in the tech field. \n\nThe public school system is heavily under funded. I also think that schools that get money based on performance are criminal. But that[.] a lot more typing that I don't want to do right now. Maybe I'll edit this later if I get enough replies. "}