{"doc_id": "1054", "name": "2017_04_humanities_student_major_1244_supersentai", "namespace": "we1sv2.0", "metapath": "", "pub": "supersentai", "title": "2017-04-humanities-student-major_1244_supersentai.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.089", "Subjectivity": "0.329", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "690", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64qwps", "Reddit_id": "dg4gy2s", "Subreddit_id": "t5_2skzg", "Commenter": "NeoMegaRyuMKII", "length": "3982", "content_scrubbed": "I couldn't disagree more. I found the series boring, predominantly unimaginative (pun mostly intended), and overall lacking in so many elements that make Sentai Sentai to me.\n\nI disliked the humor. Too many train puns. I get that that[.] the theme of the series but it[.] like they are taking a hammer to our skull and hitting it saying \"this is about trains we are about trains! Hey! Do you like trains? TRAAAIINS!!!\"\n\nHalf the characters seemed like copypastas from Kyoryuger. \n\n* Red is the hungry guy who could not be corrupted and is best at just going into the fray. However, unlike King, Right didn't seem to think about the threat or specific situations as serious.\n\n* Blue was the klutz goofball\n\n* green was the serious brooding one. \n\nThat said, it is also harder to really pin down their personalities. Or maybe it is that the core 5 have too much more in common than they do different.\n\nI felt like the heroes didn't take the overall threat seriously. Until Akira came in, they basically took the threat only as it came rather than think about the overall situation. Further, for most of the series, the series and heroes \"forget\" that the protagonists' home town was missing. And after the first Shadow Town, the location of their home town became very predictable.\n\nThey did not properly explain the whole \"only children have imagination\" stuff. Jobs in the arts and design and the such exist and take plenty imagination.\n\nI barely saw any character development. Their personalities pretty much stayed all the way through.\n\nThe gimmick of changing into each others' colors only mattered once or twice. Those were some of the better episodes since otherwise the changes seemed like ways to pad out the episode.\n\nI didn't feel any real grandiose from the villains. Further, I hated how the heroes were not the ones to defeat any of the villains. Noir and Schwartz were killed by Zed. Mork and Nero willingly gave their life force to Zed, Grita ended up taking Zed away. Put simply, the heroes simply didn't defeat villains the way they should have been. I could have given some forgiveness if the heroes had actually defeated 2 of the generals and Zed. But they didn't. And there was no good reason for that. \n\nAnd here is the thing: It *could* have been a glorious series. \n\nI didn't see any real existential crisis when they learned they were children in adult bodies.\n\nThe villains were Victorian-themed expansionists who wanted a larger living environment. That[.] fine, except it is fundamentally very similar to any \"we think we are better than everyone so we will conquer.\" Imagine if, instead of having these motives we have all seen before, that they will have all been purely motivated by profit. That the villains' goals are to set up the strongest trade route possible, controlling as many resources as possible. Why Earth? Well because there have been many to have visited (invaded) the planet so obviously if they take it over there will be more coming by and we can be friendly and sell them stuff. The monsters would revolve around certain financial domains:\n\n* Syringe Shadow would try to take over the medical industry (or at least medical production). \n\n* Coin Shadow would do something with banks.\n\n*  Wig Shadow for the hair salons. \n\n* Film Shadow for the film industry.\n\n* Chair and Table Shadows (since they were deployed together) would be the home improvement industry.\n\nOverall I don't think the series balanced the need for humor and a need for serious. It rarely left me begging for more. Often I found myself asking \"so what?\" and not getting a good answer. It didn't give me enough reason to care about the characters. And I watched the entire thing through (I prefer to see things through and was hoping there would be major payoff). But in the end, I was relieved when it ended and was delighted when Power Rangers decided to skip the season.\n\nI will say, though, it did give us [one of the best gifs ever.](http://i. imgur. com/5wRF85j. gif)"}