{"doc_id": "287", "name": "2017_10_humanities_student_major_513_ucr", "namespace": "we1sv2.0", "metapath": "", "pub": "ucr", "title": "2017-10-humanities-student-major_513_ucr.txt", "pub_date": "2017-10-06T00:00:00Z", "Sentiment": "-0.012", "Subjectivity": "0.303", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1278", "Permalink": "http://reddit.com/r/ucr/comments/74j5yb/student_whose_maga_hat_stolen_presses_charges/do0u5ls/", "Threadlink": "http://reddit.com/r/ucr/comments/74j5yb/student_whose_maga_hat_stolen_presses_charges", "Parent_id": "t1_dnz83ud", "Reddit_id": "do0u5ls", "Subreddit_id": "t5_2s3tf", "Commenter": "arethusas", "length": "7669", "content_scrubbed": "Ok, so before getting into this, let me address one thing:\n\n I can't stand **(((Kushner)))**. \n\nC'mon, man. You're better than this. If I were to meet you at campus and talk to you I'm sure you wouldn't be anti-Semitic. Kushner being a terrible person has nothing to do with being Jewish, but rather just his personality. Racism is not cool in real life, and as someone who[.] trying to change people[.] views of Trump[.] racism, you shouldn't be so blatantly racist.\n\n They're all rich but not all are his cronies. Besides, its not corrupt. I was disappointed he put so many Goldman Sachs (((bankers))) in positions of power. President Trump had two choices; Utilize those elites with knowledge of the system (because they're insiders) who were not from the Trump base, or use Trump base that had little knowledge. Trump went with the former. This upset Bannon, me too.\n\nIt is corrupt. These people are not people meant for the jobs, as evidenced by Tom Price. It wasn't just Price using taxpayer money to fund his personal trips, it was multiple members of Trump[.] administration. This is a Republican administration, the party of the US which is supposed to be about cutting down on government waste, cutting down on government spending, cutting down on the federal government, and being fiscally conservative on the whole. Yet the top officials of the administration are throwing away taxpayer money on personal expenses. And appointing Scott Pruitt the head of the EPA? Climate change at this point is a fact. We see the consequences all over the world. The vast majority of scientists worldwide agree on this. But Scott Pruitt doesn't. And he[.] the head of the agency that[.] supposed to protect the environment. He has no scientific knowledge of climate change. He[.] just another corrupt Republican politician in the pocket of oil companies. He[.] an insider in the sense that he doesn't care about the consequences as long as he gets his compensation from the oil and gas industry, which he has close ties with.\n\n the security costs associated with protecting President Trump whether he[.] golfing or working is totally acceptable. Trump cancelled the multi BILLION dollar AirForce 1 contract. He tried to cut Lockheeds F-35 multi billion dollar waste, but I don't know if he succeeded.\n\nPresident Trump donated his first quarterly salary $100K to the National Parks\n\nPresident Trump donated his second quarterly salary $100K to Education\n\nWhy is this acceptable? Trump forces the government to pay for protection for Melania and Barron at Trump Tower in NYC. The Secret Service has to pay for security costs every time his sons fly around the world on business. How many Republicans would have been up in arms if the Secret Service were supposed to pay for security for Obama[.] entire extended family?\n\nHe forces them to pay for transport and security costs to golf at Mar-A-Lago almost every weekend. Remember that Trump [repeatedly attacked](https://www. sbnation. com/golf/2017/3/27/15073086/donald-trump-tweets-barack-obama-golf) President Obama on his golfing during his time in office? I find it especially hypocritical since Trump decided to go golfing during a time when the federal government is desperately needed to help Puerto Rico. It[.] even more hypocritical given that Trump literally said, \"I'm going to be working for you. I'm not going to have time to play golf,\" during the campaign. Can you deny the hypocrisy in this? He said he would be working for us, but instead he[.] using our money to go golfing in a different state, rather than playing close to D. C. to save taxpayer money. The money he donated is almost negligible to the amount of money of the taxpayers he frivolously wastes. It[.] clearly a political grab to make himself look good. But he[.] a billionaire. He doesn't need the money, especially since he saves so much more by **not paying taxes to the government**.\n\nIf you were take all the expenses associated with Trump[.] constant travels to Florida (so much so that it[.] called the Southern White House) we could actually give Puerto Rico all the help they need, fast. But instead we're spending it on Trump.\n\nAs a Republican, shouldn't you want to cut down on spending taxpayer money at the federal level? Why is spending all these millions of dollars on golfing not a bad thing, but spending anything for, say, education, arts, or humanities is a waste?\n\n Doesn't affect me. This isn't corruption. If it bothers you then I think its funny, otherwise i could care less.\n\nC'mon, this isn't a real answer. You know there[.] a reason we expect Presidential candidates to release tax returns. No, it[.] not corruption, but refusing to release them implies that Trump is frightened of what they would reveal, which is implication of corruption. Remember, Trump is a member of a class of Americans who hate paying taxes. Who hide money overseas, who use loopholes they lobbied their congressional puppets to pay less and less as time goes on. You can't agree with this. Taxes are what make this country run. Trump uses roads, first responders, the military, etc just as much as Billy Bob who doesn't have the advantage of being rich to not pay taxes. People not paying taxes should bother you. Because they're taking advantage of people who do pay taxes.\n\n I can't stand (((Kushner))). I wish President Trump would have fired him instead of Bannon. Also should fire his daughter Ivanka. Ivanka used the private email also. Kushner didn't break any law because he supposedly forwarded copies to his official account. Still, he should be fired for being such a dumb ass. Also, I don't trust Kushner at all. He is likely corrupt.\n\nOf course he[.] corrupt. He was schmoozing with Russians during the campaign, that we know for a fact, that is something he admitted. Yes, he should fire Ivanka, because Ivanka has no place in the White House. She lacks any necessary qualification to be a top aide.\n\nMaybe Kushner didn't break any law, but neither did Hillary, apparently. But it[.] still dimwitted and asinine to do in Hillary[.] case, and even more so in Kushner[.] case, after spending more than a year calling attention to Hillary[.] mistake.\n\n  Trump has been wonderful considering the lack of support by corrupt San Juan Mayor Carmen Yulin Cruz. I lived and worked in PR for several months. Nice people, horrible government.\n\nTrump is President of the U_S. The President should be above petty issues, should be above everything except helping the people he swore an oath to protect, those include the people who voted for him and who didn't vote for him. That[.] what being the President means. And it includes Puerto Rico. It doesn't matter who the mayor is or what he says or does. Trump is supposed to ignore it. Only [1/3 of Americans approved](https://apnews. com/4618c08e4de94347b67caa4104e19d5a/AP-NORC-Poll:-Few-approve-of-Trump[.]-Puerto-Rico-response) of his response in Puerto Rico.\n\nBut we all know that Trump is never above petty disputes with anyone. Even you should admit that.\n\n I was assaulted at a Trump rally by some fucking racist Mexicans with LaRaza banners. LaRaza means \"The Race.\" They admit they are racists. Judge Gonzalo Curiel is a LaRaza organzier. Fuck that guy and his racism. Trump was absolutely correct to call him out.\n\nA judge in this country is supposed to be impartial. The case he was overseeing had nothing to do with race politics. Trump bringing race politics into the matter is racist, regardless of whether or not La Raza is racist or not. Unless he had proof of bias by the judge, going in public as a Presidential candidate and saying something like that is childish and obscene."}