{"doc_id": "1056", "name": "2017_04_humanities_student_major_1280_worldnews", "namespace": "we1sv2.0", "metapath": "", "pub": "worldnews", "title": "2017-04-humanities-student-major_1280_worldnews.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.072", "Subjectivity": "0.177", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "503", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg51f1t", "Reddit_id": "dg54j4e", "Subreddit_id": "t5_2qh13", "Commenter": "parscion", "length": "3780", "content_scrubbed": "How on Earth does diversity not work? Is London itself not an example that it works? I don't need to defend whether or not diversity and multiculturalism are viable paths towards humanities development - it[.] literally happening all around us, in the large majority of countries across the world.\n\nHappening != working.\n\nI don't need to defend whether or not diversity and multiculturalism are viable paths towards humanities development\n\nYeah, you do.\n\n[An online poll done in Britain following the 7/7 bombings, for example, showed that more than a fifth of British Muslims felt some sympathy for the bombers' feelings and motives; more than half said they could understand the bombers' behavior; and nearly a third agreed that \"Western society is decadent and immoral and that Muslims should seek to bring it to an end\" by nonviolent means. One incredible Gallup report from 2009 found that 0 percent of British Muslims viewed homosexual acts as morally acceptable.](https://www. nytimes. com/2017/03/28/magazine/can-a-former-islamist-make-it-cool-to-be-moderate. html)\n\n[52% of British Muslims in poll think homosexuality should be illegal](http://www. cnn. com/2016/04/11/europe/britain-muslims-survey/)\n\n[Islamist in Britain has no interest in multiculturalism--Sharia law only.](https://www. youtube. com/watch?v=Vt2WwZtNx7M)\n\n[Young, British Muslims 'getting more radical'](http://www. telegraph. co. uk/news/uknews/1540895/Young-British-Muslims-getting-more-radical. html)\n\nDo you think Japan is worse off for not having muslims and no Islamic terror attacks?\n\nWhat ... ? What are you even talking about?\n\nThe Shiites and Sunnis started conflicting back in 632 AD.\n\nBut this isn't about money or helping ourselves, this is about people[.] lives\n\nOh ok. Then go sell the device you're reading this on and donate your money to the third world. Hypocrite.\n\nMoney is always a question regarding helping others--we don't have unlimited funds to help people.\n\nor you let people suffer and die and then see the people who you refused to help try and get into the wealthier countries.\n\nHow much money should we spend to stop all of this? https://en. wikipedia. org/wiki/List_of_ongoing_armed_conflicts\n\nMuslims and Christians, have been living together and trading with each other for hundreds of years, despite war and aggression on both sides over the ages.\n\nYou just contradicted yourself.\n\nmost diverse and most scientifically and socially progressive empires and societies develop under them.\n\nAnd just think how farther along we could be scientifically if we didn't have religious bullshit in the way.\n\nTo say that multiculturalism doesn't work is ignorant and risible to those of us who actually see what modern day society is like with our own eyes.\n\nYou clearly haven't done any research on this: \n\nhttp://www. npr. org/templates/story/story. php?storyId=12802663\n\nhttps://en. wikipedia. org/wiki/Bowling_Alone\n\nhttp://journals. sagepub. com/doi/abs/10. 1177/0003122415577989\n\nhttp://www. sciencedirect. com/science/article/pii/S0148296311002888\n\nhttp://www. citylab. com/housing/2013/11/paradox-diverse-communities/7614/\n\nAnd since we're talking about England, you can't even celebrate your own fucking heritage in your own fucking country: http://www. bathchronicle. co. uk/bristol-skips-st-george-s-day-celebrations-city/story-29167068-detail/story. html\n\nI suppose you must not see all the different people of various cultural, religious and ethnic backgrounds where you live ... either that, or you don't live around any, which would explain your believes!\n\nOh, no, actually I grew up in a homogenous area and then after living in many diverse areas, looking up statistics, and researching this topic I've found that it[.] a net loss.\n\nYou haven't given *any* evidence for why it[.] a net benefit."}