{"doc_id": "472", "name": "2017_10_humanities_student_major_2399_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2017-10-humanities-student-major_2399_slatestarcodex.txt", "pub_date": "2017-10-25T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.392", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "652", "Permalink": "http://reddit.com/r/slatestarcodex/comments/78lpeo/how_did_new_atheism_fail_so_miserably/dov26vf/", "Threadlink": "http://reddit.com/r/slatestarcodex/comments/78lpeo/how_did_new_atheism_fail_so_miserably", "Parent_id": "t3_78lpeo", "Reddit_id": "dov26vf", "Subreddit_id": "t5_30m6u", "Commenter": "lurker093287h", "length": "4313", "content_scrubbed": "The New Atheists accomplished the seemingly impossible task of alienating a society that agreed with them about everything...\n\n\nI should say that being popular among 'hegemonic' liberal/left culture doesn't equal popularity among the general population or even those on the liberal left, if social [surveys](https://fivethirtyeight. com/features/way-more-americans-may-be-atheists-than-we-thought/) are anything to go by the number of people who call themselves atheists is larger than ever and growing. There could be a much larger population of people who don't believe in god than people who identify as atheists; that could be a comment on the obnoxiousness of new atheism or it could be something more about how they are influencing people but atheists are seen in a negative view by a substantial portion of the population who are religious (or something else obviously). \n\n\nNew Atheists weren't reaching their intellectual opponents. They were coming into educated urban liberal spaces, saying things that educated urban liberals already believed, and demanding social credit for it...\n\nBut also there are obvious disagreements that are the root of this animosity not explored in this ariticle. \n\n* a large faction of athiest culture are sort of right/centrist liberals like hitchens or sam harris and they have major disagreements with more identarian liberals on islam/muslims, on feminism, language and a few other culture wars issues, the harris/hitchens types are also are on the other side to leftists/socialists/progressives on US foreign policy/war in the middle east and on the importance of IQ especially with regard to race/sex and the culture wars.\n\n* The athiest interventions into explaining geopolitics also fundamentally contradict the causality ideas of mainstream leftists, i. e. dawkins makes a point that it[.] religeon holding back the middle east economically, scientifically and socially, I think leftists would say that the economic and political circumstances are causing the conservative religion etc. \n\n So on key issues they're not telling liberal/leftists what they want to hear and disagree with them profoundly. \n\nVarious culture war flame wars like elevatorgate exacerbated this and basically contributed to younger atheists and defining themselves against the kind of liberal/left culture that the baffler and the other articles constitutes. To this there were a new generation of media personalities who called themselves '''[.]ceptics'''' becoming more and more edgy. Often this was generational and fame based, but you can see it in the youtube celebrity 'the amazing atheist' kind of go from making fun of religous christians to 'SJWs' and feminists. \n\n\nThe leftist articles are obvious 'take downs' (I say that as a leftist) and were kind of the result of the charles murry bit, some other drama and some mostly younger [.]ceptical'/athiest youtube celebrities bleeding into 'anti sjw' youtube celebrities like sargon of akad/carl benjamin, armoured sceptic, bunty king, etc. This basically exists on a spectrum that crosses over with the 'alt right' [like this guy](https://www. youtube. com/watch?v=74OokZdK7Hk) who styles himself as a sceptic, a few others and maybe like stephen molynux. \n\n\n**Maybe the New Atheists accidentally got on board just before a nascent Grey Tribe/Blue Tribe split and tried to get Blue Tribe credibility by sending Grey Tribe signals.** At some point there was a cultural fissure between Acela Corridor thinkfluencers with humanities degrees and Silicon Valley bloggers with STEM degrees\n\n\nFrom my experience there is an element of synonymous cultural conflict here; atheist online culture is strong in 'fly over country', especially in cities which are surrounded by highly religious areas, also among sections of mostly men who inhabit social/economic spaces that don't really have much of an overlap with the ones that leftists do. There are obviously social mores about this, the dislike of logic and argument in one of the articles is obviosly part of that just like the 'anti sjw' dislike of emotion and 'lived experience' stuff. \n\nI think the strident STEM superiority of the online athiest stereotype comes into conflict with the the kind of aloof humanities snobbishness of online leftism and there are obviously class elements also. "}