{"doc_id": "401", "name": "2017_10_humanities_student_major_1664_relationships", "namespace": "we1sv2.0", "metapath": "", "pub": "relationships", "title": "2017-10-humanities-student-major_1664_relationships.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.022", "Subjectivity": "0.395", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "337", "Permalink": "http://reddit.com/r/relationships/comments/773p15/update_my_23f_classmates_1825_cheated_on_the/dojy5to/", "Threadlink": "http://reddit.com/r/relationships/comments/773p15/update_my_23f_classmates_1825_cheated_on_the", "Parent_id": "t1_dojnzu8", "Reddit_id": "dojy5to", "Subreddit_id": "t5_2qjvn", "Commenter": "GailaMonster", "length": "1804", "content_scrubbed": "Cheating is what weak people do. Do not let weak people obtain the same degrees that you actually worked for, lest your degrees be associated with their weakness and dishonesty, rather than your hard_work. Nobody actually gives a shit about the grade you got in school in one class - if you think that, you're either still a student or you haven't been working very long.\n\nMUCH MORE important than your grade in your third year CS class is the reputation the alumni of your school create for you in the working world. It[.] not \"oh this guy got an A-, let[.] toss his resume because this other candidate got an A\", it[.] \"oh this guy went to X school, and while X school looks great on paper, we had to fire a guy from X school for incompetence last year, and it was a pain in the ASS - don't know if that was a one-off or what, but good thing we have a DEEP bench of applicants who went to Y school, which is just as good as X\"\n\nDon't let weak people become associated with your education - and by extension, you - in the working world.\n\n*And*, even if you went to the \"best\" school, you either went to my school or the school my school makes fun of. At my school, we viewed cheaters as pathetic and admitting their weakness and lack of confidence in their ability to actually learn the material. I don't know of anyone who would have hesitated to out a cheater, curve or not.\n\nSo I guess you must have attended that other school ;)\n\nUnless your school was ONLY good for engineering and was utterly lacking in quality humanities education... In which case, I would hope that you would at least have a more analytical approach to how another[.] cheating drags you down (even without a curve), since you declined to expose yourself to the discussions of the social impacts of normalized cheating in a society."}