{"doc_id": "265", "name": "2017_10_humanities_student_major_326_asianamerican", "namespace": "we1sv2.0", "metapath": "", "pub": "asianamerican", "title": "2017-10-humanities-student-major_326_asianamerican.txt", "pub_date": "2017-10-04T00:00:00Z", "Sentiment": "0.072", "Subjectivity": "0.388", "Score": "15", "Upvotes": "0", "Downvotes": "0", "Wordcount": "463", "Permalink": "http://reddit.com/r/asianamerican/comments/7481yg/how_conservative_activists_are_using_asian/dnxf6pu/", "Threadlink": "http://reddit.com/r/asianamerican/comments/7481yg/how_conservative_activists_are_using_asian", "Parent_id": "t1_dnxalpp", "Reddit_id": "dnxf6pu", "Subreddit_id": "t5_2rfyw", "Commenter": "Jajamola88", "length": "2794", "content_scrubbed": "What kind of good are we even trying to accomplish here? the removal of AA would put a LOT of other PoC in jeopardy and besides, taking away AA won't even remove all the anti-Asian racism inherent in holistic admissions. The entire American college application process was designed to weed out a different high-achieving but \"undesirable\" minority (Jewish students) and it[.] still being used the same way. \n\nHolistic admissions are rooted in Western ideals of education (quasi-religious dedication, learning for learning[.] sake, the liberal_arts) that run counter to the Asian student who lives in white people[.] heads (incapable of true passion, animalistic priorities, only good at \"hard\" fields like math or engineering). \n\nMost of the admissions strategies you'll see on Chinese-language forums are things like \"do an art portfolio to prove you're creative\" or \"put your kid in a writing camp\". Writing about your family or heritage is totally out of the question because the last thing you need to do is remind the admissions officers that you're a goddamn chink. \n\nI was pretty much raised for the sake of college admissions and I was smack dab in a hyper-competitive school filled with other kids like me. It was a traumatizing, mind-numbing experience. I'm still slowly unlearning all of the self-hatred and paranoia that was ground into me so I could stand a chance against some lazy white bitch who got to have an actual adolescence with family and trips to the mall and romance and whatever people are supposed to do. My parents made it very clear that I was not allowed to relax, ever, because I was Asian and I couldn't afford it. My Asian heritage became nothing more than a speedbump on the road to Harvard. \n\n\n**Affirmative action sets arbitrary numerical hoops that you have to jump through. Holistic admissions teach Asian children that being Asian is a shameful disease.** \n\nGetting rid of AA will do absolutely fuck all to a system that hates us to its core. And if we're gonna go down the \"work with people who hate you uwu\" path, Asian Americans as a community cannot afford to alienate other PoC or reinforce the idea that we're white (no matter how flimsy the reasoning). People are heads-over-heels in love with the narrative of a sniveling, mindless Asian who would do anything for a quick buck. We can't get away with stuff that reinforces that because we just don't have the fucking numbers to create social change on our own, especially when language barriers and the constant erasure of Asian Americans' very existence are still big problems.\n\n**TL;DR affirmative action[.] repeal would mean very little in an admissions system that[.] fundamentally antisemitic/anti-Asian and I don't feel like becoming the rhetorical version of the Asian Nazi at Charlottesville**\n"}