{"doc_id": "1185", "name": "2017_04_humanities_student_major_2482_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-04-humanities-student-major_2482_AskHistorians.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "0.108", "Subjectivity": "0.367", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "477", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66q8gp", "Reddit_id": "dglukrf", "Subreddit_id": "t5_2ssp3", "Commenter": "restricteddata", "length": "3123", "content_scrubbed": "I don't know enough about the decline of the classical humanities educational curriculum to know whether it was really changed by Sputnik. But the other side of the question, the push for STEM, is definitely true post-Sputnik. Sputnik was seen as a major \"referendum\" on American education, because the American scientists and policymaker were afraid of a gap in \"scientific manpower\" with the USSR, who supposedly had better ways of identifying promising students and tracking them into careers in science and engineering. There were major attempts at educational reforms meant to streamline STEM paths, like the National Defense Education Act (NDEA). NDEA tried to funnel a lot of federal funding to every level of education in the US, specifically to promote STEM and modern (e. g. not \"dead\") languages. At the elementary school level, scientists attempted to develop more standardized science curriculum that could be taught in rural or poor districts, to increase the base interest in STEM fields. \n\nNow I don't know if that really meant that there were cutbacks in Classics and Latin. It could be. One would want to actually establish that, though. There were definitely strong pushes to steer people towards science and math, though.\n\nOn the educational reforms post-Sputnik, John L. Rudolph, _Science in the Classroom: The Cold_War Reconstruction of American Science Education_ (Palgrave McMillan, 2002) is the standard source. I am also partial to David Kaiser[.] \"[Cold_War requisitions, scientific manpower, and the production of American physicists after World War II](http://web. mit. edu/dikaiser/www/Kaiser. ColdWarReq. pdf)\" (2004), which is all about the field of physics in particular pre- and post-Sputnik. \n\nKaiser[.] work (on physics and other disciplines) notes that there are non-obvious trends in educational history that take a lot of work to make sense of. Humanities degrees, as a share of the total degrees inside the university, [actually went _up_ in the 1960s](http://1. bp. blogspot. com/-DBrJMHffgrI/UbH6bN24UTI/AAAAAAAAEG8/-ItCJtFxZFc/s1600/Temporary+Boom+in+Humanities. png). It then collapsed in the 1970s. Is this a Sputnik, pro-science issue, or is it an issue relating to other factors in the US economy and education system? [Here are some raw numbers from the Department_of_Education on BA degrees in the USA](http://imgur. com/PyhZrhY) — I've only grabbed a few fields, but you can see that the trends are not exactly straightforward, you have local boom/bust cycles, you also have different demographics over this time. \n\nIt would be interesting to do a more in-depth study of this question. Latin and Classics are fields that prospered primarily under a very exclusive, privileged, elite, and very much \"white\" educational system. The trends in US education have skewed away from that over the years, towards more middle class, even lower class, and many non-whites. These sorts of factors are likely at play as well. \n\nIn short, I don't think you can blame Sputnik for all of these trends. Did the post-Eisenhower reforms play a part? Sure. But there[.] probably a lot more going on there. "}