{"doc_id": "1136", "name": "2017_04_humanities_student_major_1988_esist", "namespace": "we1sv2.0", "metapath": "", "pub": "esist", "title": "2017-04-humanities-student-major_1988_esist.txt", "pub_date": "2017-04-17T00:00:00Z", "Sentiment": "0.121", "Subjectivity": "0.401", "Score": "14", "Upvotes": "0", "Downvotes": "0", "Wordcount": "883", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgeect4", "Reddit_id": "dgep0ra", "Subreddit_id": "t5_3irqb", "Commenter": "Northern_One", "length": "5065", "content_scrubbed": "I keep asking myself this question. How did my own mind change so far over a 15 year period? My journey from close minded quasi religious emotionally driven goofball to where I am now shows there is hope for anyone. \n\n I was raised in a christian family, it wasn't taken too serious, but we did go to chucrch now and then. I read my children[.] bible front to back, making me most likely more knowledgable about the bible than anyone in my immediate family. My parents did not have any post-seconary education, and one of my parents never finished high-school. However, books were esteemed, and I devoured them. I should also mention, racisim was never part of my family[.] equation, and neither was looking down on the poor, we were poor. \n\nI clung to my quasi-religious beliefs till I was about 16 when a close friend, a free spirited hipster questioned my beliefs during a regular phone conversation, it planted a seed. He was steadfast, but said \"I can tell you are uncomfrotable so I will stop...\" and offered to let me borrow a book (I forget what it was). It was around this time we covered the Scopes Monkey trial while reading Inherit the Wind. I found it weird how evolution was attacked when it seemed to me that all it proved wrong was a literal intepretation of the bible. The two ideas could coexisit if one took a more symbolic view of the bible. \n\nWhile I enjoyed science, I hated the math, and had no natural talent with it like reading and writing. I happened to get back into karate, which happened to be at a new agey, almost cult like dojo. I became exposed to many new agey ideas (energy therapies/theories etc) as well as Zen, meditation and breath exercises. I was also very happy, and felt I had so much to learn and explore in the world (edit: I want to make it clear that I have separated Zen, breathing and meditation exercises from the other hogwash as I still find them very useful).\n\nAs much as I cringe at some of the stuff I believed then, these new age ideas would act as a bridge to studying other religions, and philosophies as well as an obsessive pursuit of health. I believe I became slightly orthorexic at this point. This study of various religions would help me see  the universal thread  of good and bad that they all seemed to share. \n\nThe next phase, in my early 20[.], which I 'll summarize as my occult/neo-pagan phase. This was primarily fueled by various neo-pagan movements, as well as a new interest in extreme metal. I was studying design during this time, and eating almost exclusively from the natural food section at the grocery store, and may have got dreads. \n\nFast forward a few years, I found myself in a pretty shitty situation employment wise and decided to go back to school. I figured I would shoot for the moon and attempt becoming a doctor. I signed up at the local adult continuing education school where one learned at your own pace. \n\nI spent a year immersed in basic fucntions, pre-calc math along with basic biology and chemistry. It was the first time I followed the prescribed path without question. Earlier, I was too rebellious, \"why do we have to learn this, it[.] pointless\" etc. Something clicked while studying parabolas. \n\nI saw the cartesian plane as this translation from the phsyical world to the abstract mathamatical world, and vice versa. It was a go between, and despite it[.] imperfections, there was great power to be had in this translation, this modeling. \n\nI entered unviersity as a mature student, and pursued an interdisciplinary degrees so that I could continue with my science education, get my pre-med classes as well as continue my love of the arts. My degree specific classes focussed a lot on the philosophy of science, and how to recognize psuediscience, and things came full circle when we studied evolution vs intelligent design. This illusionary world I had been chipping away at shattered as I learned more and more about the scientific method and the power of generating knowledge/data that was beyond my own biases and self (data that is beyind human biases for that matter).\n\nIt so happened that my art education was following a similar path as I was forced to deal with learning about contemporary art (this could be a whole other post). I became very interested in art that was procedurally generated, a favourite  being On Kawara. \n\nI left out a lot of other moments from university that crystalized my current skeptical, reason based viewpoint. The main take away from this is that it was a very organic, drawn out process that had so many seemingly unrelated moments that were completely necessary in the order that they happened. That phone call with the friend was the catalyst. A gentle challenging and prodding by a caring individual. That was the main external \"attack\" on my beliefs. The rest of my transfromation was mainly through self-reflection, reading and doing math at my own pace. \n\nI should also say, having access to a free adult continuing education facility was a massive factor in this transformation. \n\nEdit: spelling, grammar, clarity\n\n\n"}