{"doc_id": "1141", "name": "2017_04_humanities_student_major_2008_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2017-04-humanities-student-major_2008_UofT.txt", "pub_date": "2017-04-18T00:00:00Z", "Sentiment": "0.086", "Subjectivity": "0.454", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "436", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_660193", "Reddit_id": "dgf1prz", "Subreddit_id": "t5_2rbaq", "Commenter": "Saigyouji", "length": "2613", "content_scrubbed": "Depends on what you mean by useful. Like most university degrees, there is no obvious or easy path to meaningful employment after graduating with it. And like a lot of humanities degrees, merely obtaining a passing grade is not too difficult if you're not worried about your GPA, making it possible to get through it without learning much or developing as a person.\n\nI studied philosophy in undergrad and was one half-credit short of a specialist in the end. The quote that I think best reflects the benefit of the rigorous study of philosophy is this:\n\n\"Philosophy does not serve the State or the Church, who have other concerns. It serves no established power. The use of philosophy is to sadden. A philosophy that saddens no one, that annoys no one, is not a philosophy. It is useful for harming stupidity, for turning stupidity into something shameful. Its only use is the exposure of all forms of baseness of thought. Is there any discipline apart from philosophy that sets out to criticise all mystifications, whatever their source and aim, to expose all the fictions without which reactive forces would not prevail? Exposing as a mystification the mixture of baseness and stupidity that creates the astonishing complicity of both victims and perpetrators. Finally, turning thought into something aggressive, active and affirmative. Creating free men, that is to say men who do not confuse the aims of culture with the benefit of the State, morality or religion. Fighting the ressentiment and bad conscience, which have replaced thought for us. Conquering the negative and its false glamour. Who has an interest in all this but philosophy? Philosophy is at its most positive as critique, as an enterprise of demystification.\"\n\nIn terms of actual skills I think it depends a lot on what you put into it. Beyond the obvious, I found that it greatly improved my ability to articulate myself, which is an invaluable skill no matter what you do. Constantly being forced to critique my own position/perspective also turned that into a habit, which proves extremely useful both for catching errors before I make them, and simply understanding opposing perspectives even if I don't agree with them.\n\nIt definitely did not help directly with employment (i. e. from what I've seen, no one[.] looking specifically for philosophy majors) though some employers did say that they liked that I studied it. e. g. when talking to a startup founder for a virtual reality company, he thought it was cool that I studied philosophy. Then again, maybe he just wanted to say something nice to someone he already decided not to hire. "}