{"doc_id": "418", "name": "2017_10_humanities_student_major_1735_gradadmissions", "namespace": "we1sv2.0", "metapath": "", "pub": "gradadmissions", "title": "2017-10-humanities-student-major_1735_gradadmissions.txt", "pub_date": "2017-10-19T00:00:00Z", "Sentiment": "0.126", "Subjectivity": "0.381", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "885", "Permalink": "http://reddit.com/r/gradadmissions/comments/76vkhw/humanities_phd_advice_excellent_hard_stats_but/doldxwl/", "Threadlink": "http://reddit.com/r/gradadmissions/comments/76vkhw/humanities_phd_advice_excellent_hard_stats_but", "Parent_id": "t3_76vkhw", "Reddit_id": "doldxwl", "Subreddit_id": "t5_2tn62", "Commenter": "NoPatNoDontSitonThat", "length": "4931", "content_scrubbed": "I know your thread is getting a bit old, but maybe I can offer some perspective. I was accepted into eight English PhD (four of which were top 12) programs two years ago and have three close friends who have gone to law school and become lawyers. \n\nDo I have any shot at a top 10 phd program in the humanities without a crystal clear research topic and stellar writing sample?\n\nIt varies. The University of Michigan for example is very hands off in terms of directing your research and your coursework. They are much more respectful of your maturity as a doctoral student and give you lots of leeway in what courses you choose to take and what kind of projects you want to do. Because of this, it[.] imperative that you know your research interests and have a clear idea of your trajectory before starting the program. If you can't articulate a research problem in your SOP, a school like Michigan might not be possible for you. That[.] not to say that you cannot change your focus once you get in, but they don't want candidates that are still needed survey courses to find a focus. \n\nArizona State - while not a top ranked school but still respectable - actually preferred students to be open to learning more about potential research paths after entering school. They cared more about interdisciplinary research and being open to new, innovative ideas than you coming in with a set interest that just needed money and guidance to complete. They also told me that the writing sample[.] content was important but writing style and \"perfection\" wasn't as they knew writing style could always be improved. \n\nHow dependent are humanities phd programs on soft application materials compared to hard ones?\n\nI'm not totally sure what you mean by soft materials, but I assume it[.] SOP and the like as opposed to GRE scores and research publications. I'd say they care much more about the soft materials than the hard ones. It[.] a common trope for english_major to say, \"I'm terrible at math!\" So getting a 164 on quant might get you through the first hurdle, but I'd be really surprised if anyone considers GRE scores afterwards.\n\nHow important is the difference in quality/ placement between the top humanities phd programs and lower ranked ones?\n\nCrucial. \n\nThere are still plenty of English doctoral programs that are placing people in tenure track jobs. It[.] hard and incredibly competitive. You have to be open to this: You go to a top school - say Berkeley. You live this cool life of being a PhD student with fellow grad student friends and you take trips to San Francisco or Muir Woods or Napa or Vegas. You work your ass off and feel like you'll make important contributions to the field. You get published. You wine and dine with the big names in the field. \n\nYou get hired for a tenure track position. \n\nYou now live in a small village in Montana, make $40k/year, and are teaching five courses a semester. \n\nIt[.] just a reality of the market right now. Maybe you shake enough hands or come up with some really new idea that big programs want or just luck of the draw, but a lot of these schools touting job placements have a list of unknown schools that in less-than-desirable places to live. \n\nBut at least the top ten programs make you competitive for the top 50 universities. \n\nIs it even true that an English phd at a top school could ever be considered a sound decision, or should I abandon all hope and attend law school? \n\nIt[.] not a sound decision unless it[.] something you feel called to do. I personally am struggling to find happiness outside of studying rhet/comp, teaching writing courses, and leading professional development for other instructions in the teaching of writing. It[.] something that I feel I will regret NOT doing for all of my life. \n\nTo give you a comparison, I once decided to finish up my premed courses to go to med school. I was all in. Taking night classes while working a full time job. Making A[.]. Volunteering. You'd think I was working towards my life[.] passion. Decided it wasn't the_right decision for me and my family and I looked for a new path. Honestly, I sometimes forget that I ever considered medical school. I was sincerely interested in it, but it was just a career idea. It didn't really matter to me. \n\nI'll never shake academia from my life no matter what I end up doing. \n\nLaw school is very, very similar to English PhD programs. Sure, you can make a decent living being a lawyer if you go to a mid tier program, but you might struggle to get a job out of school. You'll certainly have big student loans to pay off. You'll find yourself working 60+ hours a week and may never find the path to being a partner at a large firm. \n\nBut from what I understand, if you can get into a top tier law school, that changes dramatically. There is a glut of law graduates in the market, but the ones coming out of Michigan or Harvard or the like are most likely having great careers. \n\n"}