{"doc_id": "1227", "name": "2017_04_humanities_student_major_2825_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2017-04-humanities-student-major_2825_RPI.txt", "pub_date": "2017-04-25T00:00:00Z", "Sentiment": "0.162", "Subjectivity": "0.413", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "263", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgpkz4i", "Reddit_id": "dgq1iwf", "Subreddit_id": "t5_2rg3u", "Commenter": "ElizabethA23", "length": "1555", "content_scrubbed": " never getting grades never hurt. No one needs grades.\n\nYeah, well, state schools wouldn't accept my ungraded HS transcript. So I'm going to disagree with you right there. \n\nEdit: realized I wanted to address more.\n\nCollege of the Atlantic is able to do ungraded, projects based work because they are extremely small and very expensive. Iirc CoA was more expensive than RPI when I was applying to colleges. Most people wouldn't be able to afford that kind of education. In addition, and the reason I didn't apply to CoA, is the lack of professional majors. A basic liberal_arts degree works great for the humanities and sciences. But engineering or architecture? Those need certain coursework. If someone is calling them self an engineer or architect, it[.] important that they have strong knowledge in the areas relevant to their degree. It[.] nice to have bridges and houses that don't fall down or nuclear plants that don't have meltdowns. And in these undergrad courses, there is a sequence that professors need to take you through. Architecture at RPI was actually fairly hands-on, for example the freshman materials class we broke our models for the class. It[.] more than just an independent project, though that was part of most of my classes, whether essay or model. Lectures and earlier projects build you up to being able to do the independent project. \n\nGrades are basically a high pass (A), pass (B), and low pass (C) system. It[.] easier in a large classroom. It doesn't require you to explain the system or have the faculty explain the system. "}