{"doc_id": "264", "name": "2017_10_humanities_student_major_325_foreveralone", "namespace": "we1sv2.0", "metapath": "", "pub": "ForeverAlone", "title": "2017-10-humanities-student-major_325_ForeverAlone.txt", "pub_date": "2017-10-04T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.186", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "285", "Permalink": "http://reddit.com/r/ForeverAlone/comments/74b9km/i_just_need_to_vent_a_little/dnxf39m/", "Threadlink": "http://reddit.com/r/ForeverAlone/comments/74b9km/i_just_need_to_vent_a_little", "Parent_id": "t1_dnx1fig", "Reddit_id": "dnxf39m", "Subreddit_id": "t5_2s3yz", "Commenter": "Cantthinkofaname91", "length": "1498", "content_scrubbed": "Yeah, it really was.  I had one psychology professor deduct 15 points off my grade because people wouldn't let me in their groups.  So, assuming I got every single question right on every assignment, I was already starting out with a low B.  At the school I went to, you had to have a C+ or higher to pass any courses in your major or those you took as electives.  You had to have a C- or higher to pass liberal_arts courses, which were also required to graduate.  I actually had to retake a liberal_arts course because a professor took 35 points off for not working in groups, despite me explaining to her that I had social anxiety and showing her the doctor[.] note to prove it.  That was a failing grade to begin with.  When I appealed to the academic office of appeals, they basically sided with the professor.  I had to take the class again, and I got a C- the second time, even though the professor said academically that I would have had a 98% in the class, had she not taken points off for not working in the group.  No one would let me in their group.  Because of SA, I stutter when I'm really nervous so the people in the class thought I was mentally retarded and didn't want me to bring their grade down.  When I again tried to appeal the grade because I had this in writing about what my grade was academically, the professor said that I was *lucky* to pass because she was *generous* the second time and only took 20 points off for not working in groups.  She still got away with this.\n"}