{"doc_id": "422", "name": "2017_10_humanities_student_major_1824_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2017-10-humanities-student-major_1824_slatestarcodex.txt", "pub_date": "2017-10-19T00:00:00Z", "Sentiment": "0.097", "Subjectivity": "0.298", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "685", "Permalink": "http://reddit.com/r/slatestarcodex/comments/76c3g5/culture_war_roundup_for_week_following_october_14/dolxcg8/", "Threadlink": "http://reddit.com/r/slatestarcodex/comments/76c3g5/culture_war_roundup_for_week_following_october_14", "Parent_id": "t1_doluws9", "Reddit_id": "dolxcg8", "Subreddit_id": "t5_30m6u", "Commenter": "yodatsracist", "length": "3948", "content_scrubbed": "To your point one, I went to an private undergraduate university that was a peer of UPenn and went to grad school (and therefore taught) at another one. In the humanities and social_sciences, class sizes tend to be small, except for maybe a few required classss (101, etc). At my undergrad college, a big lecture in the humanities or social_sciences had 50-100 kids, and those were very rare. Almost all my classes were seminars. My graduate school tended to have slightly bigger classes for undergraduates. \n\nStill, in both situations certain kids are clamoring to talk. In undergrad, we talked about \"that kid\". You might see someone at a party and point him out to your friends, \"see that guy over there? He was *that kid* in my hum class last year.\" I was that kid in a few classes, I'm sure. \n\nThe thing is, classes can easily, easily be dominated by a very few people, especially when the professor doesn't insist on raising hands. Those who are most comfortable with blurting out norms are most comfortable blurting things out. Deborah Tanner, the linguist, has done research on turn taking norms in conversation and it[.] definitely culturally determined (her research is about regions rather than races, though she went on to work a lot on gender).\n\nIn my experience, it had less to do with race than class. Sociologist Shamus Khan has a really interesting ethnography called *Privilege* all about an elite prep school, and one of his big arguments is that what they're being prepped for is being \"at ease\" at all times, in all situations, on all topics. That[.] the modern elite *habiuts*. ([A little more on Khan](https://www. reddit. com/r/ukpolitics/comments/1h3j08/generation_y_why_young_voters_are_backing_the/car9nfs/?utm_content=permalink&utm_medium=front&utm_source=reddit&utm_name=ukpolitics).)\n\nAs a teacher, you see it. The kids from good suburban schools felt much more comfortable doing things like asking for extensions ahead of time. The kids from rough schools tried to suck it up until it was too late, and if they had a problem, might hand in a shitty paper or ask for an extension at the last minute. Kids taught to be at ease came to my office hours, kids not often felt like they were \"bothering me\" or \"wasting my time\". And you saw it clearly in class too: the kids who spoke up the most tended to be well off men most of all, then well off women, then then there were also a couple of kids from poor towns who'd always been the smart weirdos and maybe they didn't have the at ease rules down, but they weren't afraid to talk. I don't think I ever got a sense of a race breakdown, but the classes tended to be mostly white and Asian. \n\nWhen I led class, I'd generally let the usual kids help me start the conversation, but then I'd just try to open it up, call on the people who were maybe shaking their heads at an answer but not raising their hands. A schools like these there are a lot of really insightful students who, nonetheless, might not be eager to speak. When invited to speak specifically, they'll add and (my hope was) gradually learn how to be \"at ease\" in situations like this, before they hit the working world. \n\nTo your point four, I think most of my good teachers did that (or just clearly made the decision \"you guys don't know enough to talk, I'm just going to lecture\"), but by no means all of them. A lot people managed no control over the class and it was a conversation between the professor and three to six students.\n\nNow, I don't think what the grad student did in this case was smart, but I think it is a good lesson to 1) pay attention to who volunteers to speak 2) learn how to elicit participation from classmates (team members, etc) who are engaged but not necessarily vocal. Good teachers, and leaders, do steer the conversation to be inclusive like you mention but I think it[.] something I saw too rarely in college courses, but as a student and as a graduate student TA. "}