{"doc_id": "1169", "name": "2017_04_humanities_student_major_2322_bisexual", "namespace": "we1sv2.0", "metapath": "", "pub": "bisexual", "title": "2017-04-humanities-student-major_2322_bisexual.txt", "pub_date": "2017-04-20T00:00:00Z", "Sentiment": "0.036", "Subjectivity": "0.376", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1268", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgj1l71", "Reddit_id": "dgjaaxc", "Subreddit_id": "t5_2qwnx", "Commenter": "wicks81", "length": "7175", "content_scrubbed": "Sure, I'm going to PM you some of the other stuff, but I think male privilege is one of the things that was super hard for me to understand until later in my life, and I hope talking about it here will help some other people.\n\nFirst, you need to realize that male privilege does not mean there are no downsides to being male, or that these privileges help all men. It[.] not an all or nothing thing, and plenty of guys will have their dreams of being a nurse or teacher squashed by gender roles. Second, you don't actually need to be male to get male privilege (this is controversial). You don't take or ask for privilege, others(society) gives it to you whether you want it or not. This can make it extremely frustrating, because it[.] not really within your control.  You can help with societal change to fix the problem, but you can't just suddenly not have it anymore through some action (even MtF transition!) (this is also controversial, many people believe transgender people do not receive male privilege.)\n\nSo, knowing all that, it[.] also super important to realize it[.] all a probabilities game. You may not have experienced a lot of these things, but you have a higher probability because you are male. \n\nStarting with the beginning, childhood:\n\n1) Boys are more likely to receive toys that revolve around building, science, being a doctor, exploring, or imagining yourself as a hero. There[.] a lot of evidence of this in the toy aisle at Target or Walmart. Girls toys tend to focus around homemaking, horses, princesses, and [shopping](http://www. shopkinsworld. com/)(seriously, this stuff is [awful](https://www. youtube. com/watch?v=hChxBoel04w), could you imagine GI Joe doing this?)\n\n2) Boys get more compliments on their accomplishments, for girls, their looks are considered an accomplishment.\n\n3)  If you have a school dress code, most of them are based around limiting your choices to being stereotypically male (short hair, etc), which sucks, but is nowhere near as awful as the girl[.] dress codes, which are focused around both shaming them for showing too much skin and forcing them into a stereotypically female look.\n\n4) Teachers tend to spend more time helping male students than female students. \n\n5) Ever hear the phrase 'boys will be boys'? You are less likely to be told to be quiet, or quit acting excited or 'excessively' happy as a boy. Does it happen? Of course it does, but we're talking probabilities here.\n\n6) You will be much more likely to be pushed into STEM(science, technology, engineering, and mathematics) studies than women. The other hand sucks too, because if a boy wants to study english or humanities you get told you're wasting your time. \n\n7) Boy children are often seen as more valuable than girl children. This is terrible and hurts everyone. In many societies, male children carry on the family name, and receive all inheritance.\n\nI could go on and on, but these are things I've personally experienced and then looking back realized my sister did not get. I got the Legos, doctor play sets, computer programming games, she got the barbies, a playhouse, and cake baking lessons. I got extra studies to do, she helped with the cooking. She was \"cute\", I was \"smart\". I got teased a bit for ill fitting clothing, she got sent home crying because she had grown slightly out of her t-shirt and was showing her belly button. \n\nThis stuff adds up and really heavily influences your later life.\n\nLater on, especially around the start of my transition when I was still sometimes showing up to professional things dressed as a guy, I started realizing how crazy some of this stuff was. This stuff is a lot more personal and recent to me.\n\n1) I am constantly, **constantly** asked if I know what I am doing as a computer technician. It is inconceivable to some people that a woman knows her shit with computers. When people thought I was a guy, it was super rare, and only happened if I showed a lot of hesitation or a lack of confidence in my work. This is starting to get better, but I think it[.] because now everyone is expected to know computers. The flip side of this is it can be harder for a guy to get help if he needs it. I'm sure this is not limited to computers/programming.\n\nThe day this really, **really** hit me hard was a series of interviews I had during transition. The first company knew my by my male (dead) name, and I was nervous about coming out as trans to them so I wore a suit and tie. I gave my spiel and was told I was too technical for the position and that I should apply elsewhere in the company. The second company knew me by my current (real) name.  I went in for the same position, wore a nice blouse and women[.] business pants, make-up, etc. I was told I was not technical enough for the position and that I should consider customer service. I changed absolutely nothing but my name on the resume, and the gender I presented as. I was asked almost the same questions at the two companies even. I was absolutely floored. I was also strangely proud of the fact that I had been treated female, as it was really early in my transition, haha.\n\n2) Everyone wants to help me at the comic book stores. I swear, it seems nice at first until you realize it[.] because either they want to have sex with you (this gets dangerous sometimes for me as they suddenly decide I'm 'not a real girl'), or because they assume you know absolutely nothing and are there to buy something for someone else. I've lost count of the times I've had this happen to me and it got to the point to where I stopped going to gaming/comic book stores. In my experience this is heavily influenced by the local society. I don't get this much in Seattle, I get it like crazy in Virginia and Ohio.\n \n3) People stopped giving me shit (and encouragement) about being unemployed after I transitioned. Nice for my self esteem, but possibly really bad for my motivation for getting a new job. My Mom was the worst here, she went from asking me if I'd applied for jobs recently to asking me if I had cleaned my house!! I love her and she[.] very supportive of me, but this is an incredible example of those gender roles screwing things up.\n\n4) I didn't deal with this, but the whole value of virginity thing is [scary as hell](http://www. huffingtonpost. co. uk/2014/06/11/purity-ball-father-daughter-christianity-pledge-virginity-marriage_n_5484341. html). Being teased by jerks for not having had sex sucked, but I heard the girls being teased for not having sex by their peers too, and they had to worry about their family disowning them if they had sex or worse got pressured into it or even raped.\n\n*edit*  5) I almost left this out! I get followed now. Let me repeat that. PEOPLE I DON'T KNOW FOLLOW ME. This shit is scary as fuck, is it cause I'm trans? is it cause I'm female? Maybe because my purse is a target? I don't know, I'm sure as hell not going to ask them. The closest I ever came to this shit before transition was some weirdo pinching my cheek. Now I've got people who stare me in the eyes (or worse, at my boobs) and then follow me around staring.\n\naaaand I think that[.] plenty for one post. Expect some edits. I don't proofread well."}