{"doc_id": "987", "name": "2017_04_humanities_student_major_608_assyriology", "namespace": "we1sv2.0", "metapath": "", "pub": "Assyriology", "title": "2017-04-humanities-student-major_608_Assyriology.txt", "pub_date": "2017-04-06T00:00:00Z", "Sentiment": "0.15", "Subjectivity": "0.31", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "227", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63tocy", "Reddit_id": "dfx3s2r", "Subreddit_id": "t5_2vzwn", "Commenter": "badscribe", "length": "1452", "content_scrubbed": "Anthropology is good area to study. You get exposed to many anthropological concepts that will help you think about texts differently, whether it be through sociolinguistics, archaeology, political economics, etc. It very much gives you a holistic view and a wide-range of perspectives that you could possibly use in studying texts and the ancient Near East.\n\nWhen I was doing undergrad, I focused on archaeology, which definitely helped me look at texts beyond a philological study.\n\nAnother possibility is Computer Science. There[.] a growing importance of the digital humanities in cuneiform research. Many cuneiform projects are utilizing digital tools to piece together information from large sets of textual data. Majoring in computer science also means you will have a lot more opportunities and access to funding (outside your major area of study) upon entering grad school. Not only this, but you can also develop a professional background and be involved in multiple projects. It[.] definitely better to have people that understand both texts and the digital world.\n\nI'm not too sure about other fields. There[.] linguistics, which is definitely useful if you want to have a better philological background.\n\nI encourage you that whether you major in Anthropology or Computer Science or whatever, that you spend time taking courses in other you didn't choose. Meaning, if you choose Anthropology, take some coding classes as well and vice-versa. "}