{"doc_id": "314", "name": "2017_10_humanities_student_major_732_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_732_AskReddit.txt", "pub_date": "2017-10-09T00:00:00Z", "Sentiment": "0.145", "Subjectivity": "0.401", "Score": "18", "Upvotes": "0", "Downvotes": "0", "Wordcount": "419", "Permalink": "http://reddit.com/r/AskReddit/comments/755iwh/if_your_college_major_had_an_honest_slogan_what/do4h4d6/", "Threadlink": "http://reddit.com/r/AskReddit/comments/755iwh/if_your_college_major_had_an_honest_slogan_what", "Parent_id": "t1_do4ee9w", "Reddit_id": "do4h4d6", "Subreddit_id": "t5_2qh1i", "Commenter": "Bonfire0fTheManatees", "length": "2468", "content_scrubbed": "I know you're probably not seriously asking, but I do have a real answer that might not be obvious to non-humanities people or people who didn't major in weird shit. The most obvious was that I was applying to schools with 7-13% acceptance rates, so choosing an \"out-there\" major like Slavic Lit (and doing research on their Slavic Lit programs and faculty) made me stand out in applications, much more than if I'd said I intended to major in English or Creative Writing. I heard that advice consistently and, as an ambitious high schooler, decided to specialize early on. And if you're going to specialize in literature, man, Russian literature is super great. Chekhov, Dostoevsky, Turgenev! Dudes can write!\n\nOnce I got to undergrad and started taking classes in Slavic Lit, I liked my decision and stuck with it. Loved the classes and professors, and I was one of only two Slavic Lang & Lit majors in my class, so I got virtually unlimited access to faculty and time with my advisor. It was very much like having a grad school experience as an undergrad, including really easy access to university funding (for study abroad, a language immersion camp, and a few short research projects for my thesis) because my applications were unique and stood out for funding committees. I ended up getting somewhere around $12,000 in grants from my institution in four years, which wouldn't have happened if I'd been doing less specialized research. \n\nPlus I believed (and still believe) that the heart of a four-year liberal_arts education is spending time exploring diverse subjects and making connections between new ideas and fields. The major was small in degree requirements and left me time to double-minor in creative writing and linguistics, both of which I went on to do graduate work for and both of which I use directly in my current career, teaching lower-division writing to multi-lingual undergraduates. I always knew I was going to either go into academia or go to law school, so I felt no pressure to major in anything in particular, and choosing a smaller and more specialized major than English gave me the intellectual freedoms that I was looking for in my college experience. \n\nTL;DR: If I hadn't majored in Slavic Lang & Lit, I would have majored in English or something similarly generic, but my weird major made me more attractive to colleges and gave me all the advantages of a degree in English, plus extra time, faculty attention, and money. "}