{"doc_id": "366", "name": "2017_10_humanities_student_major_1273_europe", "namespace": "we1sv2.0", "metapath": "", "pub": "europe", "title": "2017-10-humanities-student-major_1273_europe.txt", "pub_date": "2017-10-13T00:00:00Z", "Sentiment": "0.156", "Subjectivity": "0.289", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "227", "Permalink": "http://reddit.com/r/europe/comments/763y9k/victims_of_kosovo_war_before_during_and_after_the/dobyhn5/", "Threadlink": "http://reddit.com/r/europe/comments/763y9k/victims_of_kosovo_war_before_during_and_after_the", "Parent_id": "t1_dobd7mb", "Reddit_id": "dobyhn5", "Subreddit_id": "t5_2qh4j", "Commenter": "bureX", "length": "1528", "content_scrubbed": "They protested since 60[.] for equal rights\n\nThey also protested for better ties with Albania and Enver Hoxha-style communism. This was not compatible with the \"brotherhood and unity\" policy of Yugoslavia and Tito at the time. Nationalism of ANY kind wasn't allowed. Doesn't matter what your ethnicity was, if you went against the idea of a united Yugoslavia, you could get a really nice slam on the head by the police as a token of the state[.] appreciation. This policy was not aimed at Albanians specifically.\n\nThe University of Pristina was the starting point of the 1981 Kosovo student protests. Kosovo[.] cultural isolation within Yugoslavia and its endemic poverty resulted in the province having the highest ratio of both students and illiterates in Yugoslavia. A university education was no guarantee of a successful future; **instead of training students for technical careers, the university specialized in liberal_arts, in particular in Albanology, which could hardly secure work except in bureaucracy or local cultural institutions, especially outside of Kosovo. This created a large pool of unemployed but highly educated, and resentful, Albanians – prime recruits for nationalist sentiment.**\n\nIn addition, the Serb and Montenegrin population of Kosovo increasingly resented the economic and social burden incurred by the university[.] student population. **By 1981, the University of Pristina had 20,000 students – one in ten of the city[.] total population.**\n\nhttps://en. wikipedia. org/wiki/1981_protests_in_Kosovo\n\n"}