{"doc_id": "290", "name": "2017_10_humanities_student_major_530_germany", "namespace": "we1sv2.0", "metapath": "", "pub": "germany", "title": "2017-10-humanities-student-major_530_germany.txt", "pub_date": "2017-10-07T00:00:00Z", "Sentiment": "-0.0", "Subjectivity": "0.294", "Score": "108", "Upvotes": "0", "Downvotes": "0", "Wordcount": "533", "Permalink": "http://reddit.com/r/germany/comments/74todu/how_are_academics_structured_in_german/do1274w/", "Threadlink": "http://reddit.com/r/germany/comments/74todu/how_are_academics_structured_in_german", "Parent_id": "t3_74todu", "Reddit_id": "do1274w", "Subreddit_id": "t5_2qi4z", "Commenter": "blackjackbull", "length": "3291", "content_scrubbed": " Because of no tuition are professors less available to help students?\n\nYou kind of found one of the biggest differences in the student \"experience\" here: There is much, much less support or \"handholding\" from the univeristy in general and the professors specifically. Although universities are now starting to establish student tutoring or mentoring systems, that wasn't a thing in the past and the professors usually hold their lectures and that[.] it.\nThey have perhaps an (yes, one) office hour per week, but it[.] pretty normal to leave university with a bachelor[.] degree and never have had a one-on-one conversation with a professor. \n\nI wouldn't relate this to the lack of tuition, but rather a cultural difference. In Germany, university students are considered adults who are expected to manage their studies by themselves. \n\nIf you need your professor to tell you how to manage your workload, which individual chapters you need to learn for an exam or what kinds of advanced courses you should take, you probably aren't ready for universtiy.\n\n Is there no graded homework, projects, papers, or quizzes? What are exams like?\n\nWe have all those, but the bulk of your grade typically typically consists of one big exam/paper at the end of your semester. If you fail, you can usually repeat it but there is a limit of how many times you can try before you fail for good and automatically drop out.\n\n I know that engineering and computer science courses have the highest failure and drop out rate, but how does this compare with other STEM disciplines and in the humanities?\n\nAlthough STEM do have the highest drop-out rates, the rates for other subjects are also generally higher than in other systems.\n\nExcept in competitive subject like medicine or psychology, getting into university is not that hard in Germany. Staying in university is considerably harder and is supposed to be harder.\n\nEspecially in bigger courses where many people have been admitted and lectures are attended by a few hundred people, exams after the first few semesters are designed to \"weed out\" the bottom third (approximately). Since the university does not get tuition money from individual students, they have little incentive to \"pull through\" a student who lacks the academic skill to actually graduate.\n\nAnother big difference and is how universities work in general:\n\nGerman unis lack most of the extracurricular infrastructure of US unis: There are no university sports teams or stadiums, there is little \"university life\" outside of lecture halls and cafeterias. University is where you got to study, just like other people go to work. Your life, parties, friends happen elsewhere (although you might find your friends at university, of course).\n\nAnother big difference is that, unlike in the US, German universities don't have dorms or other student accommodations. Students live by themselves or, more commonly, they live in privately rented flat-shares.\n\nAll in all, I wouldn't really say that studying is more \"relaxed\", mostly because academic failure is more likely and that can be quite stressful at times, but cost of living certainly is more manageable, especially since students from low-income families can get government assisted loans that in many cases only need to be partially repaid."}