{"doc_id": "459", "name": "2017_10_humanities_student_major_2239_the_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "The_Donald", "title": "2017-10-humanities-student-major_2239_The_Donald.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "0.084", "Subjectivity": "0.317", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "714", "Permalink": "http://reddit.com/r/The_Donald/comments/789kk7/katie_hopkins_dear_sadiqkhan_how_could_the_police/dosqae0/", "Threadlink": "http://reddit.com/r/The_Donald/comments/789kk7/katie_hopkins_dear_sadiqkhan_how_could_the_police", "Parent_id": "t1_dosjzs1", "Reddit_id": "dosqae0", "Subreddit_id": "t5_38unr", "Commenter": "neighborhoodbaker", "length": "4205", "content_scrubbed": "Mercuric chloride, the person attributed to its discovery is Jabir ibn Hayyan, hes apparently considered an early father of chemistry. He didn't understand the chemical make up of the substance, but knew how to create the substances. The actual chemical makeup was discovered in the 1800s by an Englishmen (the periodic table was not yet invented until much later).  \n  \nCryptanalysis is interesting, never heard this one. He was tasked with translating the ancient greek texts for the caliphates. As a result of translating them, he became fascinated with greek and ancient persian sciences, logic, philosophy, and math. Then he wrote a book about ciphers and whatnot, so he was heavily influenced by the greeks, romans, and persians whom were discussing similar things 2000 years before he was born, but sure he invented it. Also the chinese were discussing these things hundreds of years earlier also.  \n  \nBoth are impressive in their own right, but like with most things relating to Islam and science I don't trust that they were islamic considering the way in which islam subverts the choke points of history, education, and politics in everything they do. They destroy 1000 year old historical statues, destroy historical text, and erase events from history. For example, if asked how many battles occurred and how long did the crusades last, one would prolly answer with the Battle of Tours, the fall of constantinople, and one other im forgeting and that the whole thing was just a small 50 year thing that happened between the christians and muslims. When in reality their was a total of 480+ battles over the course of 400-500 years in the time period called the dark ages, throughout most of Europe. Islam ('the moors', this is how they hide it, when they look bad or are defeated, its no longer islam or muslim its whatever the locals called them in this case 'moors', also the Khwarizm empire which was utterly annhilated by Ghengis Khan aren't called a muslim empire, or islamic empire), conquered most of Northern Africa, most of spain, silicy, the turks, half of france, and were pushing towards taking all of Europe. They conquered these lands the same way they are conquering them now, through subversion of the chokepoints of thought and will. Once in power they treated christians as 2nd class citizens whom could never hold office, enslaved the poor, and ruled with impunity. Imagine if Hilary Clinton won the Presidency when she was 30 and she was president until she was 85. Thats the type of rulers spain, northern africa and the rest had to endure. It took Spain 500 years to finally kick them out, but NOOO the christians are the bad guys.  \n  \nThe most impressive aspect of Islam is the way in which the ideaology can subvert a country from within. Whenever 10% of the country becomes islam, the country institute sharia law. Its because they dont create jobs, they dont invent new things, they dont bother with science, the arts, or engineering, they only live to subvert. They try to get into the government so they can start taking over on the inside (see dearborn michigan, or london), if they are smart they try to get into a chokepoint job, like network admin (awan brothers). The entire thing is a big inside joke almost, the majority of them in London are on welfare (like 80%) and the rest work as uber drivers (which is how they kidnap women, so much so london has had to ban uber). So they show up in a country, live off the state, bitch and moan about injustice against them so they should get more rights, pretty soon, sharia law starts popping up, until next thing you know the entire country has stopped using the regular law and switched to sharia.  \n  \nIslams greatest invention is psychological, political, spiritual, and mental full spectrum warfare. The reason islam promotes pedophilia and barbiarc evil shit is because those things destroy your conscience, destroy conscience you destroy free will, destroy free will and you got the perfect cultist slave who has no problems strapping explosives to himself to kill 10 year old innocent children. The koran was doing mkultra mind control for a 1000 years before the cia invented the term and perfected it. "}