{"doc_id": "1034", "name": "2017_04_humanities_student_major_1039_debatereligion", "namespace": "we1sv2.0", "metapath": "", "pub": "DebateReligion", "title": "2017-04-humanities-student-major_1039_DebateReligion.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.291", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "511", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64g6e3", "Reddit_id": "dg2dqm2", "Subreddit_id": "t5_2snuc", "Commenter": "ShakaUVM", "length": "3225", "content_scrubbed": "I think, Theology is not actually a distinct field of research or a discipline at all but more \"study of fiction that is believed to be non-fiction\". \n\nThe one doesn't follow from the other. English, even Literature with an emphasis in fiction writing (which I specialized in in college in addition to some other things), is an academic discipline despite not being *science*.\n\nThe fruits of its labor seem to be nothing more than one[.] thoughts and opinions of segments of an anthology of books which is believed to have divine authorship (either directly or inspired) but cannot demonstrate such.\n\nWelcome to the humanities, I guess?\n\nThis isn't to say that humanities people make arguments unsupported by evidence, but that you don't have the ability to, say, put a book under a microscope and have the meaning of it revealed to verify your literary criticism essay.\n\nThe narrowness of \"Theology\" seems to only really lend focus to the Christian worldview (due to demographics) which invariably seems to be more akin to the philosophy of \"Christian apologetics\" \n\nJews don't study theology? [News to me.](http://jewishencyclopedia. com/articles/14362-theology) What about Islam? Buddhism and Hinduism both have very long histories of writing and debating theology as well.\n\nMuch of the existence of God and the historicity of religious scriptures remain unfalsifiable\n\nAgain, welcome to the humanities.\n\n and indemonstrable.\n\nI dispute this. If I disagree if Christians should drink wine, we can both point to the Bible and argue our differences.\n\nWithin religious scripture we have no mechanism for being able to reliably identify\n\nYes, religion isn't science. Science isn't religion. \n\nSo what? \"Academic discipline\" is not a synonym for science. Hell, the majority of people in college aren't in STEM fields, IIRC.\n\nOften when questioning certain verses or scripture, sometimes seemingly straight forward/literal verses are asserted to not actually be literal but must be interpreted, the means by which this is identified seems randomly post-hoc.\n\nIt[.] almost certainly your perception here that is wrong.\n\nHow can I tell the difference between the results of theology being nothing more than pure speculative opinion and there actually being something demonstrably true about the results of its processes? I am not referring to interpreting a verse by ignoring the literal meanings of the words used, into something completely different in order make it mean something that we can relate to, because you can do with literally anything.\n\nBecome familiar with the source material and the debate yourself, read lots of papers on the subject, and make up your own mind.\n\nThere[.] not always a shortcut in life, I'm afraid.\n\nShould Theology actually be a discipline offered by Universities rather than just a subject as a part of other philosophy papers?\n\nYes. Academic Discipline isn't a synonym for science.\n\nDue to the Christian dominated element to Theology or \"Philosophy of religion\" in most universities being largely steeped in what seems to be \"classical theism\" does this not limit the scope of Theology? \n\nThere[.] a wide diversity of views in Theology, as there are in Philosophy, so your premise here is wrong.\n\n"}