{"doc_id": "425", "name": "2017_10_humanities_student_major_1841_asksocialscience", "namespace": "we1sv2.0", "metapath": "", "pub": "AskSocialScience", "title": "2017-10-humanities-student-major_1841_AskSocialScience.txt", "pub_date": "2017-10-19T00:00:00Z", "Sentiment": "0.112", "Subjectivity": "0.328", "Score": "14", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1498", "Permalink": "http://reddit.com/r/AskSocialScience/comments/77hi48/why_is_classic_sociologic_theory_seemingly/dom1o1m/", "Threadlink": "http://reddit.com/r/AskSocialScience/comments/77hi48/why_is_classic_sociologic_theory_seemingly", "Parent_id": "t3_77hi48", "Reddit_id": "dom1o1m", "Subreddit_id": "t5_2sml9", "Commenter": "timeimmemorial", "length": "9982", "content_scrubbed": "I posted a reply to a similar question on r/sociology a while back which seems relevant to your concerns. The question asked why old theories were still used when we have newer theories to work with.\n\nThe best answer I can provide for you is that \"theories\" are quite nebulous things in sociological research, which are used, refuted, and constructed in quite different ways not only depending on one[.] general epistemological stance or methodological approach, but also depending on what one sees to be the major purpose of sociological inquiry. One way to think about this is to look at [this](http://imgur. com/a/PDtBh) diagram from Jeffrey Alexander[.] work *Theoretical Logic in Sociology*. It attempts to capture the thought that scientific logic does not just revolve around the construction of propositional theories of the purely formal kind – or, to use the language of the chart, in the propagation of laws, complex and simple propositions, and so on – but also involves more abstract levels of thinking which are in principle less amenable to empirical study and thus to empirical falsification. So, in many respects, when individuals use or draw upon classical theories, or circumvent contemporary developments in such theories, they are doing so in a way that targets these more general aspects of the scientific continuum, using them for inspiration and orientation rather than extracting specific propositional laws from the texts. On can think, in this case, of a theoretical paradigm like Marxism, whose general analytic assumptions (about man, about society, about work, etc.) continue to inspire social research despite many of Marx[.] concrete definitions, propositions, and laws (e. g. the labor theory of value, or the tendency of the rate of profit to fall) being falsified or amended by present research.\n\nTo give you some more concrete examples, we can think of \"theories\" as involving, one the one hand, laws and theoretical propositions – i. e. statements which interrelate certain concepts or variables, like f=ma in physics, or Golden[.] law in sociology (as industrialisation increases, so does literacy) - and, on the other, general models, concepts, and analytical assumptions, like the assumption, within sociological systems theory, that it is feasible to study social phenomena using concepts derived from systems science. This latter assumption is, however, basically an article of faith, and social research using this theory is not generally addressing the question of whether social systems actually exist, but rather whether interpretations of social phenomena based on the supposition that they do exist have some kind of utility at other levels of the scientific continuum. The major point here is that while specific theories are quite often superseded and replaced by more complex theories on the level of laws and propositions, theoretical paradigms, which contain a range of general metaphysical assumptions, have greater staying power, for the simple reason that they are more removed from the empirical environment. To quote Alexander:\n\n\"General theoretical elaboration is normally dogmatic and horizontal rather than sceptical and vertical. Theoretical formulation does not proceed, as Popper[.] empiricism would have it, according to the law of the \"fiercest struggle for survival,\" basing generalizations only on positions which have not yet been empirically falsified and subjecting such formulations in a completely open-minded and purely sceptical manner to critical empirical attack. To the contrary, when a general theoretical proposition is confronted with contradictory empirical evidence that cannot be ignored, it proceeds to develop ad hoc hypothesis and residual categories in order to encompass and \"explain\" these phenomena without surrendering its more general formulations\"\n\nOr, in other words, it is quite rare for the empirical falsification of a proposition to lead to a simple refutation of a \"theory\" more abstractly understood. Instead, what one most often sees is the either a) the formulation of auxiliary hypotheses which protect the core assumptions of the theory or b) reformulations of theoretical propositions at a higher level of abstraction. This is, I should add, especially true in the social_sciences, where theories are more likely to be constructed in a loose, discursive manner, rather than through well operationalized concepts and formally articulated hypothesis. One can thus always debate what the theorist 'really meant.' Because of this, theory in the social_sciences often tends towards the \"metaphysical\" side of the scientific continuum, rather than the empirical side, which not only makes it hard (but by no means impossible) to see the development of sociological theory as a progression of understanding and insight, but also may help to explain why sociology retains a higher degree of interest in classical thinkers than other, more empirically sophisticated sciences. \n\nWhile more positivistically minded theorists have made the argument that the endless interpretation of the classics is an issue, and reflects the immaturity of the discipline in comparison to fields such as psychology and economics, others argue that sociology is simply unsuited to the formal mode of theory construction.  Alexander, for example, argues that sociology will always occupy a unique place between the sciences and the humanities, and will never have the status of a cumulative, empiricist science, for the following reasons:\n\n1.  In contrast to the physical sciences, social_sciences study objects which are either mental states or conditions in which mental states are embedded. This creates quite different conditions of validity and verification. Alexander notes, for example, that \"the possibility for confusing mental states of the scientific observer with mental states of those observed is endemic.\"  One might also here think of Giddens' famous concept of the \"double hermeneutic\" - the idea that sociologists have to interpret objects which interpret themselves. Social scientific knowledge always re-enters into the world which it describes, and this naturally limits its capacity to formulate objective, law like descriptions of social phenomena. This is a significant obstacle for cumulative growth in sociological knowledge.\n\n2. These differences allow for disagreements to emerge as to what constitute the basic empirical referents or elemental units of social_science. One may think, for example, of the continued debate about the concept of society. These disagreements are often exacerbated because  social scientific knowledge has a distinctly evaluative component. Its descriptions of the world carry \"significant implications for the desirable organization and reorganisation of social life,\" which naturally leads to quite vociferous arguments within the field.  \n\n3. Because there is a relatively low level of consensus about the basic empirical referents of sociology as a discipline, there is likely to be even less consensus about the abstractions which are drawn from these referents. You may contrast this with a discipline such as physics, or even economics, in which the meaning of basic theoretical terms is relatively stable. For Alexander, this places significant limitations on the degree to which theoretical knowledge in sociology can be expressed in a quantitative form, and as scientific consensus is often dependent upon mathematization this has a fragmenting effect. In his view, efforts to create formal, quantitatively expressed laws in social science are simply \"efforts at disguising or promoting particular points of view,\" and are thus unlikely to gain much support in the discipline.\n\nFor Alexander, these various issues mean that *discourse* (\"modes of argument which are more consistently generalised and speculative than... normal scientific discussions\") is bound to remain a major feature of the social_sciences, and that as such sociological knowledge will always be differentiated into a plurality of competing traditions which draw on their classical heritage. Discourse is, as explained above, not cumulative or progressive in nature. It is not simply assessed as right or wrong but is rather evaluated in light of a range of indistinct criteria, including \"logical coherence, expansiveness of scope, interpretive insight, value relevance, rhetorical force, beauty, and texture of argument.\" These are all things which individuals appreciate in classic texts, and it helps to explain their enduring appeal and relevance within the discipline.  \n\nOf course, this is only one position. As I mentioned, various movements within the discipline have sought to upset the hegemony of discursive theories and to encourage, in their place, more formal models of theory construction which take predictive capacity to be the sole arbiter of \"good\" theory. This kind of orientation would, one assumes, encourage the development of cumulative theory which would eventually render classical texts scientifically obsolete. A good example of work in this vein is Gibbs' text *Sociological Theory Construction.* Whether one finds these efforts persuasive depends quite heavily on personal proclivities and tastes. I recommend you read widely on the issue and see what model you believe has the most utility vis-a-vis your own goals as a student or researcher.\n\nFor more information see:\n\n * Alexander, J (1988) \"The Centrality of the Classics\" in *Social Theory Today* eds. Anthony Giddens and Jonathan Turner. Cambridge: Polity\n\n * Alexander, J (1982) *Theoretical Logic on Sociology. Volume 1: Positivism, Presuppositions and Current Controversies.* Berkeley: University_of_California Press\n\n * Alexander, J (2001) \"Canons, Discourses, and Research Programs: Plurality, Progress and Competition in Classical, Modern and Contemporary Sociology\" in J. C. Alexander (ed.), *Mainstream and Critical Social Theory: Classical, Modern, and Contemporary.* London: Sage"}