{"doc_id": "397", "name": "2017_10_humanities_student_major_1637_jobs", "namespace": "we1sv2.0", "metapath": "", "pub": "jobs", "title": "2017-10-humanities-student-major_1637_jobs.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.019", "Subjectivity": "0.394", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "462", "Permalink": "http://reddit.com/r/jobs/comments/773dop/what_do_you_do_once_youve_realized_that_your/dojjdnc/", "Threadlink": "http://reddit.com/r/jobs/comments/773dop/what_do_you_do_once_youve_realized_that_your", "Parent_id": "t3_773dop", "Reddit_id": "dojjdnc", "Subreddit_id": "t5_2qhnd", "Commenter": "timinator1000", "length": "2639", "content_scrubbed": "I graduated with a degree in political science, which at first glance has limited real-world job applicability, and ended up working a lot of random jobs before landing in a career path I enjoy.\n\nI find the idea of calling a degree \"worthless\" because it denigrates something you worked for for years and have spent a lot of money on. I understand where you're coming from though, and experienced that when I was younger.\n\nFirst off, I'll second what about user suggested which is to try a temp agency. This is what I did with I first started out and it helped to get some solid office experience.\n\nSecond, I think you're in a great position, because you are still a recent graduate, but you have a ton of work experience to go with it. This gives you an advantage over other applicants once you can figure out how to articulate the relevance of this experience to other positions.\n\nThis brings me to my third point which is that I think a challenge facing people in your position (and something I dealt with when I was starting out) is narrowing down what you want in a job, then positioning your experience to make yourself competitive for that job. I spent months and years struggling to find interviews because I was just applying to anything that came along without a very targeted approach to my search. I would spend a lot of time tweaking my resume and drafting original cover letters for each individual position, which was also very time consuming, and increased my frustration when applications didn't pan out.\n\nFor many liberal_arts students there[.] a gap between classes and your major and the real world of work. The challenge isn't that the courses you choose are wrong or inadequate, but rather that you need to bridge that gap and find out what you want to do and what makes you suited for that role.\n\nTo research this, I'd recommend looking at the BLS occupational outlook handbook (OOH) and ONet to find out more about different fields, their requirements, projected growth, and potential salary. ONet has a test you can take that assesses your preferences and recommends potential career paths. I'm on my phone so looking is tough, but these resources should be easy to find with Google.\n\nWhen I was in your position, once I had narrowed down a job title I searched for a few dozen job postings (didn't have to be my geographic area since I was using these for research) and identified the most common duties and requirements. Using this info, I tweaked my resume to include experience that fulfilled these requirements. This reduced the time I spent on applications while increasing the responses I got from employers."}