{"doc_id": "1289", "name": "2017_04_humanities_student_major_3374_mgtow", "namespace": "we1sv2.0", "metapath": "", "pub": "MGTOW", "title": "2017-04-humanities-student-major_3374_MGTOW.txt", "pub_date": "2017-04-30T00:00:00Z", "Sentiment": "0.121", "Subjectivity": "0.225", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "339", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgxypsu", "Reddit_id": "dgy4x55", "Subreddit_id": "t5_2sjgc", "Commenter": "GreatJanitor", "length": "1903", "content_scrubbed": "I went to a two year tech college, graduated in​ 2004.  Women are rare depending on what the major is.  I was in Robotics.  On the Robotics degree plan there were three women when all the Electrical majors had the same entry classes.  After that there were no women in those classes.  However, classes like English, Humanities, Psychology were a good mix of men and women.  My school also had a culinary arts program that was mostly women and the computer science was at least 40% female and the entertainment area (like Digital Media Design, or anything involving film) was at least 50% female.  Blacksmithing and anything where you got dirt, like auto or aircraft mechanic was all male.\n\nThat being said, two year tech schools are designed to get you a job.  They aren't filled with students who want to be life long sheltered children who want to learn useless shit.  So they tend to be filled with a more mature crowd and their parents understand that the school is basically job training.  My core instructors were conservatives who pulled no punches.  My advisor gave us advice on how to improve ourselves.  Not just grades but personal improvements.  I was unshaven most of the time with long hair.  When I graduated clean shaven and professional haircut.  I don't know how some of these kids today would react to an instructor who told a male student to wash out the pink and purple hair coloring, stop identifying as a pony-human hybrid, give up the safe space and crayons, get over the fear of getting your hands dirty and grow the fuck up.\n\nHowever, there will still be liberal minded students, but they will be the minority and in my school, a silent minority.  \n\nIt was one of the best things I did and one of the best eras on my life.  I advocate tech schools over four year colleges.  Best advice is to look in the area you live, see what technician trades are in demand and study that.  "}