{"doc_id": "347", "name": "2017_10_humanities_student_major_1102_ucsd", "namespace": "we1sv2.0", "metapath": "", "pub": "UCSD", "title": "2017-10-humanities-student-major_1102_UCSD.txt", "pub_date": "2017-10-11T00:00:00Z", "Sentiment": "0.09", "Subjectivity": "0.338", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "464", "Permalink": "http://reddit.com/r/UCSD/comments/75tqo5/free_life_consulting/do8z5se/", "Threadlink": "http://reddit.com/r/UCSD/comments/75tqo5/free_life_consulting", "Parent_id": "t1_do8xf58", "Reddit_id": "do8z5se", "Subreddit_id": "t5_2r6sq", "Commenter": "acl073", "length": "2789", "content_scrubbed": "Before I introduce my answer, let[.] focus on the fact that you had a girlfriend sometime in your past. \n\nTry to recall any particular things you did to help take the friendship into a relationship. Integrate those same techniques into today. If it worked before, it doesn't hurt to try again. \n\nI believe the question is not how, but why would you want a girlfriend? Most people want girlfriends because it will satisfy their own needs, be it attention, comfort, or sexual advances. \n\nBut the people who actually earn girlfriends are those who first develop a friendship with someone who just happens to be a female . Don't become friends just because they are female. Again, that won't work out. You are again trying to fulfill your own needs. \n\nWait for the circumstances to make sense. It makes sense when the professor says speak with the person next to you and share your thoughts. It doesn't make sense when you see her hard at work in the library or at her job. People can detect when you are using them. \n\nDo things that help your female friend. or any friend at all, grow as an individual, be it lifestyle change suggestions (try this great restaurant, they offer great food but it[.] also healthy!), course help, or entertainment interests (you like swimming? I read an article the other day about a great way to optimize your freestyle!).\n\nBut unlike normal friendships, which generally stay to more general growth, taking a friendship to the next level requires you to significantly help your female friend reach something she really wants to achieve. Again, try to make sense. Don't do five hours of research about interview etiquette if you hear her say she wants to do well at her interview. \n\nStay by their side, just like you would do for any real friend. \n\nDon't mistake perceived lack of interest as being friendzoned.\nWait for opportunities, and more importantly, take action when they come by. Opportunities don't have to be perfect. Be perceptive and look for openings. \n\nAs you are waiting, invest in yourself, physically, intellectually, career-wise, and strengthen existing family and friend relationships.\nThis will make you more perceptive of these opportunities. \n\nTo answer your question about awkwardness, it[.] one thing to recognize that you are being awkward. It[.] another to accept the fact that you are awkward. \n\nWhy aim to only be less awkward? How about no awkwardness at all? Even yet, how about sheer confidence? That comes from fulfilling your essential needs every day. \n\nFrom most important to least, think about this:\n\nHow you breathe, what you drink, what you eat, what you wear, your living environment, your physical safety, your physique, athleticism in sports, passion for the arts, career development, family, real friends, college courses. "}