{"doc_id": "963", "name": "2017_04_humanities_student_major_455_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-04-humanities-student-major_455_ApplyingToCollege.txt", "pub_date": "2017-04-04T00:00:00Z", "Sentiment": "0.117", "Subjectivity": "0.45", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "273", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63jjsg", "Reddit_id": "dfupu6r", "Subreddit_id": "t5_2y2r8", "Commenter": "Its_Raining_Giraffes", "length": "1497", "content_scrubbed": "Omg dude something like sociology with a concentration in memes would be incredible. It[.] unexplored territory but there is soooo much potential. My school has an interdisciplinary humanities major too where students choose their own focus of study and I know a few people interested in focusing on memes.\n\n1) I don't know, sorry. You'd have to ask someone more knowledge about Wash U[.] specific programs\n\n2) No! No no no! My dad knew someone at MIT in the 80s who was getting a sociology PhD in common sense. Fuck the haters, memes are fascinating. Why do people like them? What do they say about our society? What makes a meme a meme (even if it[.] a bad one)? More specifically, why are some memes better? Memes are just the latest incarnation of a broad category of culture that tries to interpret the world around us and academics have been scratching their heads at that for ages. You could look at it from a sociological perspective or you could look at memes as art or literature. There[.] so much there.\n\nI think this could get you into grad school. Write a good thesis. \n\n3) Honestly I would but I already want to do too many things.\n\nThis would definitely help you with law school, too, (you have to be able to analyze and interpret, even if the source is unconventional) and I honestly don't think this would stop you from getting a job. There is a space in the job market for people who can read and write well, who can analyze, and who know how people work in different sort of ways. \n"}