{"doc_id": "951", "name": "2017_04_humanities_student_major_301_ucla", "namespace": "we1sv2.0", "metapath": "", "pub": "ucla", "title": "2017-04-humanities-student-major_301_ucla.txt", "pub_date": "2017-04-03T00:00:00Z", "Sentiment": "0.087", "Subjectivity": "0.359", "Score": "16", "Upvotes": "0", "Downvotes": "0", "Wordcount": "525", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfse2hk", "Reddit_id": "dfshxmq", "Subreddit_id": "t5_2qscu", "Commenter": "BatManatee", "length": "2873", "content_scrubbed": "My biggest frustration from undergrad is not really UCLA[.] fault but I think it is a valid complaint. UCLA is hard, which I like. Lots of other schools are hard, too. However, private schools like Stanford are notorious for grade inflation. Public schools like UCLA and Cal are much stingier with grades, which again is not a problem in itself. That wouldn't be an issue until I applied for graduate school. My evidence is purely anecdotal, but applying to grad school with something like a 3. 5 or 3. 6 GPA from UCLA is difficult to compete with 3. 8[.] from Stanford. And potentially the more frustrating aspect is competing with students who with to less difficult schools. A friend of mine went to Cal State San Bernadino, got around a 3. 9 and got into basically every school in the country. It felt like I was being punished for going to a difficult school that did not artificially inflate grades. So along those lines, if you are absolutely positive you want to go into medicine or another professional school, going to a lower tier school, getting a perfect GPA, and stuffing your resume with little volunteering type projects is probably an easier route.\n\nAs far as other things I dislike, they're mostly minor. I wish I had a parking permit as an undergrad (or that parking was cheaper as a grad). When I lived in the dorms it was in triples for both years, which is just not enough space. That[.] a side effect of the urban setting that I said I like. Housing is expensive in Westwood. \n\nAs a prospective student: look at the department(s) you're interested in. Check out how they're ranked and look into some of the faculty members. Look at academics. Look at reputations. Consider the city you'd be living in and if it is somewhere you think you could be happy in for 4 years. Consider the costs of the schools you're looking at. At the end of the day, your happiness is IMO the biggest factor. In 10 years it won't matter whether you went to the #15 or #30 or # 50 school in the country (for the most part) so try not to worry more than necessary and enjoy it wherever you end up choosing.\n\nI would say that most of the complaints I am seeing in the thread are not so much about UCLA as it is about school in general. Although one that I've heard before is UCLA teaches more abstract than practical knowledge for some liberal_arts fields (ie the science of business instead of business) which is probably fair. But as someone in the sciences that was never a problem for me.\n\nI guess my advice is just to go with your gut feeling for the most part. And once you make your choice, commit to it. Let yourself get excited. Forget about the \"What if[.]\" and make your choice the_right one. If you have a bad day in your first quarter or semester, don't get bogged down thinking about whatever school you didn't pick. Think about how to make the next day better instead."}