{"doc_id": "360", "name": "2017_10_humanities_student_major_1257_londonontario", "namespace": "we1sv2.0", "metapath": "", "pub": "londonontario", "title": "2017-10-humanities-student-major_1257_londonontario.txt", "pub_date": "2017-10-13T00:00:00Z", "Sentiment": "0.091", "Subjectivity": "0.27", "Score": "34", "Upvotes": "0", "Downvotes": "0", "Wordcount": "254", "Permalink": "http://reddit.com/r/londonontario/comments/764u3z/beal_pulls_plan_to_stage_the_wiz_after_white/dobhwno/", "Threadlink": "http://reddit.com/r/londonontario/comments/764u3z/beal_pulls_plan_to_stage_the_wiz_after_white", "Parent_id": "t3_764u3z", "Reddit_id": "dobhwno", "Subreddit_id": "t5_2rds8", "Commenter": "C4N4D4_420", "length": "1406", "content_scrubbed": "Oakridge did this play in the late 90[.]. It was an amazing production, and yes, it was cast with mainly whites in the roles, as that happens to be the demographic of the neighbourhood.\n\nNo one was harmed, the students in Oakridge got a great experience both in producing the play and learning about it[.] cultural impacts. The people who came to see the play loved it and had a great time.\n\nWest Side Story was done at Beal? Well I'd bet they didn't cast Puerto Ricans in the main roles.... Did the world come crashing down then? Did we devolve into Puerto Rico hating monsters? No, we didn't.\n\nAll male schools and all female schools through the ages have produced plays where they would have to play the opposite gender. In my mind, this is a part of how we develop empathy. We literally put ourselves in others' shoes. However, if I'm not allowed to try and see an experience or better yet EXPERIENCE an experience from a different racial/religious/gender point of view, how in the hell can we ever hope to move past it all?\n\nTo the black folks who have manufactured this crisis regarding a school play, I'd say congratulations. You've ensured that a) the kids at that school don't get to take part in a beautiful part of your culture and b) you've taught these students, that if they're not black, then they don't get to participate in any of the black contributions to the arts or society. \n\nGet a life."}