{"doc_id": "1162", "name": "2017_04_humanities_student_major_2217_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-04-humanities-student-major_2217_politics.txt", "pub_date": "2017-04-20T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.327", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "523", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66gtvz", "Reddit_id": "dgidg6s", "Subreddit_id": "t5_2cneq", "Commenter": "ViskerRatio", "length": "3204", "content_scrubbed": "Keep in mind that cities and states were already footing the bill for Community College - this is them simply footing *more* of the bill.\n\nHowever, it[.] questionable whether this will have the returns they're seeking.\n\nFrom a financial standpoint, attending Community College is a no-brainer - even without such programs, it[.] significantly cheaper because it[.] the 'no frills' version of education.  In a very real sense, general education requirements represent a validation of high school-level education rather than true college-level work, so you might as well cover them in the least expensive way possible.\n\nFrom an educational standpoint, Community Colleges tend to work just as well.  If anything, they're *better* than most top universities because the bulk of courses taken by students are humanities courses and the nature of academic careers is such that professors at top universities are primarily concerned with their own careers (very little of which involves instruction) while professors at Community Colleges do nothing but teach.\n\nFrom a future employment standpoint, the problems emerge.\n\nThe issue is that the modern route to post-college employment passes through paid internships.  However, to *get* those paid internships you need the recommendations of professors you won't even meet until your junior year.  So where students who went directly into 4-year schools have had the opportunity to be serious candidates for years, the CC transfer students only really have a shot at a summer internship as a rising senior - and probably don't have much of a shot at an internship during the year until their senior year.\n\nModern college education reminds me a bit of the 'cargo cult' mentality.  In World War II, planes full of supplies used to land on obscure Pacific islands.  So the natives watched what the soldiers did to land those planes - and, once the war was over, dutifully replicated all the rituals.  They'd lay out landing strips, signal the planes, make all the sounds... yet no planes would come.\n\nCollege education is a bit like that.  You'll hear all about how its vital education for 'critical thinking' or other such nonsense.  In truth, it never was.  For a very tiny fraction of people, college education was a meaningful education because they were ultimately pursuing narrow expertise in a specific field and had the talent/drive to do so.  For the majority, college was about keeping junior underfoot for a few years until he grew up enough to take a position in Daddy[.] firm.\n\nWhen we proclaim the virtues of college education and sending everyone to college, we're making the same mistake those Pacific Islanders did.  We're doing the rituals, but not understanding the reality.  The reality is that college doesn't lead to a great life.  The reality is that college works for a tiny fraction of the intellectual elite and a much larger fraction of children of privilege - and it doesn't work all that well for the remainder because college never was a 4-year job interview in the first place.  Treating it as such just means you're tricking large numbers of young people into debts they can't realistically pay for an outcome they're unlikely to receive."}