{"doc_id": "460", "name": "2017_10_humanities_student_major_2240_milwaukee", "namespace": "we1sv2.0", "metapath": "", "pub": "milwaukee", "title": "2017-10-humanities-student-major_2240_milwaukee.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "0.148", "Subjectivity": "0.439", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "291", "Permalink": "http://reddit.com/r/milwaukee/comments/789geo/msoe_plans_34_million_computational_science_hall/dosqgpn/", "Threadlink": "http://reddit.com/r/milwaukee/comments/789geo/msoe_plans_34_million_computational_science_hall", "Parent_id": "t1_dosboge", "Reddit_id": "dosqgpn", "Subreddit_id": "t5_2r7dt", "Commenter": "bartleby", "length": "1764", "content_scrubbed": "Compared to many institutions, MSOE graduates a lot of its students into jobs with higher than average earning potential. While 200k for a degree is a lot, remember that it[.] still likely to pay off. Also, remember that only a portion of students, the most financially secure students, pay full cost. At most private (traditional nonprofit) universities, there are lots of students getting merit aid or need-based grant aid that substantially reduces the sticker price. Having worked at a couple of private universities (a large research uni and a smaller liberal_arts college), I can tell you that there is basically a cross-subsidy in play. The institution essentially uses tuition dollars from the full-paying undergrads (and occasionally from grad students paying with loans or employer benefits) and redirects that money to the needier undergrad students. It is also one reason that international students are so often welcomed at universities in large numbers. The vast majority of international students are paying full tuition or close to it, which adds to the bottom line. Schools frankly care more about that than about the diversity those international students add.  [At one of the universities I worked for, international students had to submit an affadavit with their application, showing that they had the means to pay for 4 years, either with their family money or with their government paying for them.]\n\nIn a perfect system, no one would be paying 200k for a degree, but when you look at what it costs to have a high quality university with good faculty and the facilities that students expect, the costs are indeed very high. (Especially in STEM fields, you have to pay faculty really well because a lot of them can make more money in industry.)"}