{"doc_id": "965", "name": "2017_04_humanities_student_major_460_worldnews", "namespace": "we1sv2.0", "metapath": "", "pub": "worldnews", "title": "2017-04-humanities-student-major_460_worldnews.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.082", "Subjectivity": "0.53", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "294", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfutbpx", "Reddit_id": "dfutl5f", "Subreddit_id": "t5_2qh13", "Commenter": "vkgfx", "length": "1757", "content_scrubbed": "These things are pretty common though. In high school, I had to write a document based essay in which I argued a point purely based on given supporting articles from 100 or more years ago. It was about womens' suffrage and the only good supporting documents were against it, so people had to write an essay arguing against womens' suffrage given the information they had available without imposing their own bias on it if they wanted to form a well supported essay.\n\nIn college, my ethics in engineering course would have debates on popular issues (software patents, responsibility of a developer for what users do with software, common \"business\" ethics issues, etc.) and you'd be randomly assigned to either side of the issue and have to enthusiastically argue it, even if it was a fairly repugnant position.\n\nThese are all super common parts of education, and if the only impression people get of higher education is Breitbart articles covering what some nonsense some group of students are doing or what some small liberal_arts school is trying to implement, then they're only seeing the extreme examples of campus activism.\n\nAs to a test on deductive logic, we had to pass writing essay exams and mathematics exams to be allowed to graduate high school. I think what you're describing (testing their capacity for cognitive dissonance) is impossible to test in a way that would pass people in any meaningful way. A high school diploma just signifies your satisfactory completion of a basic curriculum of core studies (math, humanities, science, etc.) along with optional elective studies. True deductive logic is not only impossible to measure empirically (or at least it has never been so far), but is unrelated to the meaning of a high school diploma."}