{"doc_id": "301", "name": "2017_10_humanities_student_major_632_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-10-humanities-student-major_632_AskHistorians.txt", "pub_date": "2017-10-08T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.454", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "417", "Permalink": "http://reddit.com/r/AskHistorians/comments/74q415/askhistorians_and_monetization/do2uegh/", "Threadlink": "http://reddit.com/r/AskHistorians/comments/74q415/askhistorians_and_monetization", "Parent_id": "t1_do2q3qi", "Reddit_id": "do2uegh", "Subreddit_id": "t5_2ssp3", "Commenter": "chocolatepot", "length": "2538", "content_scrubbed": "Here is our final statement on the matter of gender relations in the field of history, addressed to all, but particularly /u/EquinoxRises, /u/ivymikey, /u/BronzeIV, and /u/SilverRoyce. Following this, any further arguments must be sent to us through modmail (note: through *modmail*, not PMs to individual moderators), for they will be removed here. We hope that this statement is final enough to make it clear that modmails will not actually change our position, but you do have the_right to register disappointment/disgust privately in any case.\n\nYour data from the American Enterprise Institute (a conservative think-tank) which is more up-to-date is also less specific, blending the arts and all humanities subjects as a whole together to show a very slight majority of female degree earners. That is simply not relevant to the question of women earning doctoral degrees and tenure-track positions specifically in the field of history, and it is disingenuous to pretend that it is.\n\nThe main issue at hand here is that we, the moderators of /r/AskHistorians, see our duty to marginalized populations as including not just monitoring the use of slurs posted to the sub, but in making the sub a more welcoming place to people other than young, white, straight men. In some cases, that means proactively encouraging the participation of other demographic groups; in others, it means taking a definite stance on posts that may not have been typed with malignant intent, but which contain content that is still highly off-putting to women, people of color, and others. In this specific case, that includes comments implying that institutionalized sexism is not as important as unethical business practices, which is problematic regardless of the specific wording. That original comment could have very easily *not* sparked this heated debate if it had been posed to the main post itself, rather than the only specific discussion of sexism in the entire thread. While ignoring our experiences with bigotry and dismissal in order to assume the best possible faith of every comment has been suggested, that really only serves to uphold the status quo and forces each person who faces them to start at the ground floor: it[.] the equivalent of restricting users of the sub to using primary sources when they write answers.\n\nWe are not willing to shift on these points. If posters do not agree with our stance in the issue, they have the choice of either continuing to use the sub while dealing with our policy, or not continuing to use the sub."}