{"doc_id": "331", "name": "2017_10_humanities_student_major_968_motogp", "namespace": "we1sv2.0", "metapath": "", "pub": "motogp", "title": "2017-10-humanities-student-major_968_motogp.txt", "pub_date": "2017-10-10T00:00:00Z", "Sentiment": "0.257", "Subjectivity": "0.458", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "883", "Permalink": "http://reddit.com/r/motogp/comments/75k6a8/when_rossi_met_cox/do6s4ex/", "Threadlink": "http://reddit.com/r/motogp/comments/75k6a8/when_rossi_met_cox", "Parent_id": "t3_75k6a8", "Reddit_id": "do6s4ex", "Subreddit_id": "t5_2r7pg", "Commenter": "motosql", "length": "5273", "content_scrubbed": "#####\t\n\n######\t\n\n####\t\n\n # ['Someone kept pulling my trouser leg... it was Rossi!'](http://s3-eu-west-1. amazonaws. com/crash. net/field/image/Carl%20Cox%20receiving%20Ducati%20Cup%20trophy%20. JPG)\n \n   \n   \n When megastars of the music world cross into motorsport it seems only natural they'd gravitate to the premier levels of Formula 1 and MotoGP but DJ Carl Cox likes to keep things 'grassroots' – but that hasn't stopped him from rubbing shoulders with Valentino Rossi.\n \n Cox, an international DJ and producer by day (and night), has a well-known passion in almost anything with an engine – from drag racing to sidecars to MotoGP – which led him to set-up self-titled Carl Cox Motorsport helping a wide range of teams across the globe which recently hit headlines with a deal to support Michael Dunlop at the Isle of Man TT.\n \n While stars of music and film tend to flash up on the glitzy grid of top level racing before quickly shooting off as the podium champagne is sprayed, Cox is more likely to be found on the national scene supporting the Reeves twins dominating to the British Sidecar championship or relishing previous success in the Ducati TriOptions Cup. But the iconic DJ is no stranger to being in the company of figures at the top of their profession and says he regularly finds inspiration from those mastering the arts of motorcycle racing.\n \n ## Related Articles\n \n [[Image](http://s3-eu-west-1. amazonaws. com/crash. net/styles/medium/s3/original/AU1152632. jpg?itok=Nidw58F9)](/bsb/news/201528/1/legendary-dj-cox-backs-morris-and-hobbs-in-ducati-series)\n \n  \n \n  \n \n  \n \n  \n \n \n \n \n \n \"The thing about Valentino is because of the nature of what I do as a DJ and musician, as an Italian he shared the love and passion for music,\" Cox told Crash. net. \"When you watch Valentino Rossi ride, especially in his early days, it was almost like a ballet how he'd race and overtake people. He made everything look so easy even though he[.] on the limit most of the time. It is fascinating.\"\n \n This inspiration was sparked by a chance meeting with Rossi who sneaked into an Italian nightclub Cox was playing at near the Doctor[.] hometown but the nine-time world champion took covert measures to meet the DJ.\n \n \"There is a club not far from where he lives, I was DJing and some guy was pulling on my trouser leg,\" he said. \"I was trying to shake him off but they kept pulling my trouser leg so I looked down and it was Valentino Rossi!\n \n \"I laughed and asked him what he was doing down there and he said he couldn't get up because if the people saw him in the DJ booth they would tear the place up. He just wanted to let me know that he was in the house, loving the music and said one day I'd see him on the track one day.\n \n \"That one day came when I was in Australia and MotoGP arrived at Phillip Island. It was packed, the weather was beautiful and I got on to the grid to take a picture of the riders. He saw me and said 'Hey Carl!' jumps off the bike, takes off his gloves and shakes my hand. He said he couldn't believe I had made it and hoped I enjoyed the race. I'd never had that kind of attention from anyone in that world.\n \n \"Nicky Hayden was also another I had a really good affiliation with. Cal Crutchlow, Chaz Davies and others know who I am and through the motorsport set-up and what we do they are watching us.\"\n \n But rather than follow the glamour of F1 or MotoGP exclusively, Cox prefers to get hands-on in motorsport, mirroring his work ethic in music, which was developed growing up with a working class background with two parents grafting full-time to support him and his two sisters.\n \n \"I've started small and we are working through the ranks to make sure we can walk before we run,\" he said. \"For me to have the name out there first is important. I like to be more hands on when I can, if someone asks me to pass on a spanner I will pass it on. Whereas in F1 or MotoGP you have to leave that to the team and you just sit there watching them. I'd prefer to be hands-on because a win feels much better because of your input – not just because of the money.\n \n \"I make all the major decisions but Gavin Sokolich has the ability to put everything together. His knowledge of the motorcycle world is extensive and he gets on with everyone in the paddock so having Gavin on board is essential to Carl Cox Motorsport to carry the weight of the project. I'm able to find a good balance now and attend a lot of the races in which we support riders.\"\n \n The project is gathering pace. After success down under and with Michael Dunlop at the Isle of Man TT winning the 2017 Monster Energy Supersport race, the Carl Cox-Motorsport-backed duo of Tim and Tristian Reeves dominated to this year[.] Hyundai Industries British Sidecar title winning 16 out of 16 races.\n \n \"It[.] been a fantastic season for Tim and Tristan, and everyone involved with Carl Cox Motorsport is really proud to have been part of it,\" he said. \"They've really been in a class of their own, facing every challenge to win 16 out of 16 races so far is an incredible feat.\"\n\n  \n  \n  \n- - - - - -\n\n  \n[Owner](https://www. reddit. com/user/gnualmafuerte/) | [Source Code](https://github. com/andreskrey/empleadoEstatalBot) | [Stats](https://motosql. com/newsBot)"}