{"doc_id": "996", "name": "2017_04_humanities_student_major_676_india", "namespace": "we1sv2.0", "metapath": "", "pub": "india", "title": "2017-04-humanities-student-major_676_india.txt", "pub_date": "2017-04-07T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.268", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "256", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64008g", "Reddit_id": "dfybsjd", "Subreddit_id": "t5_2qh1q", "Commenter": "Chutiyapaconnoisseur", "length": "1506", "content_scrubbed": "No clue how I missed this thread. I don't typically look for AMAs, but I'm glad this will be an exception. I feel like the author is hyperqualified, so it'll be hard to think of  questions that won't come off as a dumb to him.. Nevertheless, I'll give it a shot. \n\n1. Why do you think so many authors are focusing on the pre-partition history but always *post*-British invasion? Is it just because records are better from that period? Is it recency bias? Or is it just the fact that it[.] what most people are interested in?\n\n2. How do you view the debate on language? I'm thinking of those who say that English is '[destroying](https://www. nytimes. com/2015/03/22/opinion/sunday/how-english-ruined-indian-literature. html)' the Indian languages. \n\n3. I'm interesting about your journey from fiction to setting up an AI-focused NGO. More so the mental/intellectual journey than the actual (practical) steps. Did you start out as an engineer and then moved into humanities and you're only returning? Or the other way around? I'm asking because one thing I see in India is an overemphasis (in my view) on STEM and a dismissive view of humanities. Someone getting a humanities degree is seen as dumb and/or \"not serious\". Do you share this concern and if so, what do you think can be done to reverse it? I'm not a humanities major myself, and I have little interest in art, have no real talent for writing fiction etc, but I wish more people in India appreciated those who do and don't just dismiss it as fluff. "}