{"doc_id": "1282", "name": "2017_04_humanities_student_major_3320_radforduniversity", "namespace": "we1sv2.0", "metapath": "", "pub": "radforduniversity", "title": "2017-04-humanities-student-major_3320_radforduniversity.txt", "pub_date": "2017-04-29T00:00:00Z", "Sentiment": "0.035", "Subjectivity": "0.17", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "269", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_68cemw", "Reddit_id": "dgxd8z3", "Subreddit_id": "t5_2s4kr", "Commenter": "VTNite", "length": "1538", "content_scrubbed": "Without consulting me, and having to hear about it in class from a Professor I am close with, I learned that Radford University allowed my work to be censored and then removed the piece from my Senior Exhibition. Because the gallery shares a space with a Catholic Church meeting group, they found the partial nudity of a woman to be so offensive to them that they covered it. Radford, a liberal_arts college, did not contact me about the situation and decided to remove the piece in order to keep good standing with the community. They issued a formal complaint to the Catholic group. After breaking ethical codes and guidelines of me as an artist and the museum policy, I rehung it myself as is my artistic right and liberty (hung with a warning sign). I thank those members of the art department staff and otherwise who have approached me today and voiced their support. I however do not thank my advisor and head of the photography department, Andrew Ross, who was one of the advocates of removing my work, despite helping me hang it himself. I encourage fellow students (especially still at Radford) to pursue whatever the hell they want to make, and not listen to close minded and ignorant people.\n\nQuoting the linked post... WTH? At Radford University?? In 2017?? What is this, the dark ages? Are we worried of being excommunicated from the Papacy for immoral displays?? -_- Grow up people, it[.] called art! This is not the Middle_East, people have rights. And for what?? Because a bunch of kids got distracted by some \"boobies\"? \n\n"}