{"doc_id": "1186", "name": "2017_04_humanities_student_major_2486_asktrumpsupporters", "namespace": "we1sv2.0", "metapath": "", "pub": "AskTrumpSupporters", "title": "2017-04-humanities-student-major_2486_AskTrumpSupporters.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "0.047", "Subjectivity": "0.319", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "387", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dglm9tv", "Reddit_id": "dglvpe4", "Subreddit_id": "t5_3cr3o", "Commenter": "Poopshakalaka", "length": "2235", "content_scrubbed": "Okay, I have to be honest with you, when you say this like it should be shocking to me:\n\n One student even said to another student in front of me, \"Ms. Oceanplum is cool, unlike other white people.\"\n\nIt seems absurd.\n\nHave you been around real racism in your life?\n\nI lived in Montana for a long time. The home of Richard Spencer. White high school students casually call people \"nigger\". There were *actual hate crimes* in my city against Native Americans, black people, gay people, Jewish people.\n\nAt the time, it got so bad that my old city launched this program:\n\n https://www. niot. org/niot-video/not-our-town-billings-montana-0\n\nSo, I'm sorry, but when you talk about \"anti-White *sentiment*\" like that should mean something to me, it[.] a joke. Because I've seen racial violence up close. Intimately. A family member who was as close as a brother to me went to prison when I was in college for assaulting a gay man at a bar.\n\nWhat you don't seem to be thinking about is that when black people experience racism, when gay people experience homophobia, when Muslims encounter Islamophobia... that[.] where anti-white, etc. sentiment comes from.\n\nYou say this:\n\n I enjoy teaching ALL of my kids, and am happy to forge relationships with them that don't ignore, but transcend the fact we have different backgrounds. However, I don't forget when I hear those remarks, because we can't ignore it. If we do, we risk racial relations unraveling even more. Racial prejudice should be challenged on all fronts.\n\nYou are proud of forging relationships with students, but then you go on the internet and tell strangers that they're racist. If you think you're one of the *positive* white influences in their lives, why the fuck *wouldn't* they be racist?\n\n**EDIT** By the way, I went to a liberal_arts college too. I live in an extremely liberal city now. I have never heard a liberal friend of mine say they dislike white people. I think it is a myth of conservatism that this is a widespread attitude among liberals.\n\nAnd I want to add that, growing up in the place I did, I was ignorant. I was homophobic. I was racist. I know what it feels like to experience those things. Calling black people \"uncool\" would not even be a blip on the radar."}