{"doc_id": "322", "name": "2017_10_humanities_student_major_854_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_854_AskReddit.txt", "pub_date": "2017-10-09T00:00:00Z", "Sentiment": "0.073", "Subjectivity": "0.325", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "422", "Permalink": "http://reddit.com/r/AskReddit/comments/759ds0/reddit_what_are_some_college_majors_that_should/do5l58f/", "Threadlink": "http://reddit.com/r/AskReddit/comments/759ds0/reddit_what_are_some_college_majors_that_should", "Parent_id": "t1_do5k6ua", "Reddit_id": "do5l58f", "Subreddit_id": "t5_2qh1i", "Commenter": "SamGlover1256", "length": "2499", "content_scrubbed": "You have a woefully limited view not just of the liberal_arts, but also of what is helpful to people. Arithmetic and geometry are both liberal_arts, for example, yet I don't think you really want a world where nobody is capable of understanding either of those disciplines. \nBeyond that, what do you think the liberal_arts are for? Not gender studies, or some thing like that, but the classic Liberal Arts: logic, grammar, rhetoric, arithmetic, geometry, music, and astronomy. Yes, those fields have changed drastically over time, but at least logic, grammar, and arithmetic are themselves foundational to almost every thing you just mentioned. You do not want irrational people with no grasp of even the most basic aspects of reading, writing, and math to be in charge of solving the world[.] problems. Nothing would be accomplished, ever. \nFurther, humanity needs more than just the mechanical know-how to solve those problems, as real as the are. They need a foundation for finding those problems worth solving. You can't have that without an at least semi-developed philosophy of life and a system of ethics that can meaningfully interact with questions like \"why should I care about these problems?\" You might say, \"survival[.] a pretty good reason to do any of those things,\" but even that answer is indicative of your philosophy of life and the lens you view the world through: why should we survive and why should we help other people do so? Apart from the liberal_arts, you have no meaningful point of reference to answer any of those questions or to begin to work on any of the very real issues that people face. The Liberal Arts aren't an art major wasting their time drawing something meaningless to make a C and leave. They're the foundation for all meaningful education and your disdain for them reeks of both historical ignorance of the Liberal Arts and of an elitism that presupposes that only the immediately practical is worthwhile, which is itself self-defeating.\nEdit/addendum: Also, I really don't think you know what the liberal_arts are even in a modern setting. You're mainly focusing on denigrating what are commonly called the humanities, a subset of modern liberal_arts. Math and the biological and physical sciences are also included in the modern liberal_arts. So you might want to rethink your blanket insistence that the liberal_arts can't be used to solve the world[.] problems. If nothing else, at least one of them will be necessary to address what you've brought up. "}