{"doc_id": "509", "name": "2017_10_humanities_student_major_2805_philippines", "namespace": "we1sv2.0", "metapath": "", "pub": "Philippines", "title": "2017-10-humanities-student-major_2805_Philippines.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.009", "Subjectivity": "0.39", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "296", "Permalink": "http://reddit.com/r/Philippines/comments/79f8uo/how_hard_is_it_to_study_in_canada_if_youre_coming/dp1l2mx/", "Threadlink": "http://reddit.com/r/Philippines/comments/79f8uo/how_hard_is_it_to_study_in_canada_if_youre_coming", "Parent_id": "t3_79f8uo", "Reddit_id": "dp1l2mx", "Subreddit_id": "t5_2qjov", "Commenter": "vardonir", "length": "1766", "content_scrubbed": "I don't know much about Canada. I highly suggest looking at all other countries, particularly outside of the English-speaking ones. You're competing with their own citizens (who automatically get priority over you), Chinese students with boatloads of funding, and thousands of talented Indians/students from other countries. I'm not saying forget about it, but you need to be open-minded about this. \n\nFor Bachelors, you need to study in UPD. If you were in Ateneo/DLSU, you'll be screwed hard by the liberal_arts bullshit and it will drag down your grades. (edit: unless you like that shit. Ateneo[.] scientific research is still kinda bad tho; I heard it[.] the same in La Salle. someone might say that UP is still kinda bad but the private unis are worse) You need to rock all of your classes and be active in the research lab. Publications aren't required, but it'll certainly impress people. I think Canadian universities require GRE, too. Start studying.\n\nIf you're going for STEM grad school, besides med, you need to have funding/a scholarship, otherwise you're enrolled in a scam. \n\nIf you're going for Fullbright like someone else here said, you better have straight As and excellent extra-curricular activities and volunteering bullshit and leadership crap and you need to make a good case on how you can contribute to the world and environment and that shit. It[.] open to all nationalities, afaik, and that[.] your problem - you're at a disadvantage, you're competing with people with far far far more opportunities to pump up their applications. I'm not saying that you should forget about it, apply if you want to, but don't be surprised if you get rejected.\n\ntldr: you can do it in the PH but you'll suffer. the suffering is worse in grad school, anyway."}