{"doc_id": "1107", "name": "2017_04_humanities_student_major_1793_truereddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TrueReddit", "title": "2017-04-humanities-student-major_1793_TrueReddit.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.062", "Subjectivity": "0.267", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "348", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgbaxwk", "Reddit_id": "dgbq3t8", "Subreddit_id": "t5_2qyt6", "Commenter": "ClockworkAeroplane", "length": "2050", "content_scrubbed": " Hillary spent too much time with LGBTQ+ issues and how she[.] breaking a glass ceiling and not enough on misplaced workers\n\nBingo. I keep getting in trouble with my liberal friends (all of them) for pointing this out: The LGBTQ community is a tiny percentage of the voting population. Transwomen who don't pass are a minuscule one; who cares about their bathroom privileges? That can be handled case-by-case. And Hillary spent way too much time pointing at her crotch and saying, \"Did you notice? *No penis!* Vote for me!\" It[.] not much of a platform, and, honestly, it[.] pretty insulting to the American people. Palin is beloved by middle America. Lefties like me get all warm and fuzzy inside when we think of Elizabeth Warren. I kinda think the reason we haven't had a female president yet is just that no good ones have run yet. \n\n\"But Hillary was the most qualified candidate in, like, *forever!*\"\n\nThat[.] not actually relevant. Sorry. The president is an executive position. I would never question Hillary[.] diplomatic chops. I think Secretary of State is a good position for someone as tricky and duplicitous and crushingly intelligent as she is. But we don't like those qualities in an executive.\n\nThe Democrats need to look at the demographics of the US again. It[.] still mostly white, and a lot of the darker colors don't vote. And when they do... They aren't liberal. I don't even know where this idea comes from. I grew up around Mexican-Americans, and you couldn't find a more conservative group of people. All the black people I know are liberal... but they are also people with advanced degrees in humanities subjects. We're all liberal up here. I can assure you that urban, church-going black people do not give two shits about transgender bathrooms.\n\nBasically, you need to make sure that middle-class white people feel served by your agenda, or you're fucked. That should kind of go without saying in a country where the majority of people are middle-class white people, and the majority of the voters are middle-class white people."}