{"doc_id": "403", "name": "2017_10_humanities_student_major_1679_jobs", "namespace": "we1sv2.0", "metapath": "", "pub": "jobs", "title": "2017-10-humanities-student-major_1679_jobs.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.069", "Subjectivity": "0.262", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "276", "Permalink": "http://reddit.com/r/jobs/comments/773dop/what_do_you_do_once_youve_realized_that_your/dokabr5/", "Threadlink": "http://reddit.com/r/jobs/comments/773dop/what_do_you_do_once_youve_realized_that_your", "Parent_id": "t3_773dop", "Reddit_id": "dokabr5", "Subreddit_id": "t5_2qhnd", "Commenter": "Riimii", "length": "1532", "content_scrubbed": "You can do a lot with an anthropology degree if you know how to **talk about and sell your skills**.\n\nThe problem is you have students graduating with these degrees and they don't know what the hell they have learned over those 4+ years. They shoot off applications in every direction expecting people to intuit what their skills might be based on the fact that they have a degree in *something* and worked at Taco Bell for 3 years while they were in school. Then, once they find out this approach doesn't work, they immediately go back into retail, fast food, etc. and proclaim that their degree is useless.\n\nThe fact of the matter is, people have to start using common sense and being proactive. You got a degree in liberal_arts field, not a trade, which means you're not going to be able to walk into an anthropologist job without a PhD. But you already knew that when you decided to pursue that degree, so this shouldn't have been a surprise. \n\nWhat you should do is go on google and LinkedIn and see what other successful people are doing with their bachelor[.] degrees. A lot of people in the private sector with degrees in anthropology go into market research, user research, project management, etc. Look at the requirements for entry-level positions in those areas, and see which requirements line up with your skills.\n\nIt[.] easy to throw up your hands and say, \"welp, I guess I fell for the old college scam too\", but the longer you stay in fast food, retail, or whatever else, the harder it will be to get out.\n\nGood luck."}