{"doc_id": "468", "name": "2017_10_humanities_student_major_2343_mcgill", "namespace": "we1sv2.0", "metapath": "", "pub": "mcgill", "title": "2017-10-humanities-student-major_2343_mcgill.txt", "pub_date": "2017-10-24T00:00:00Z", "Sentiment": "0.078", "Subjectivity": "0.257", "Score": "21", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1104", "Permalink": "http://reddit.com/r/mcgill/comments/78jqd4/noah_lew_on_last_nights_ga/doucwmz/", "Threadlink": "http://reddit.com/r/mcgill/comments/78jqd4/noah_lew_on_last_nights_ga", "Parent_id": "t3_78jqd4", "Reddit_id": "doucwmz", "Subreddit_id": "t5_2rhkw", "Commenter": "CatanOverlord", "length": "6501", "content_scrubbed": " My name is Noah Lew. I am a 3rd year undergraduate student at McGill University, and I am Jewish.\n\n At the end of my second year, I applied to serve as a Director of the Students Society of McGill University. I did this because I was tired of the SSMU not serving the best interests of McGill students, and I was upset by the repeated scandals and embarrassments that had been plaguing SSMU. When I applied, an older Jewish student with a great deal of knowledge about SSMU told me that I needed to remove everything related to Judaism and Jewish organizations from my resume, or else I would have no chance of being even considered for the position. This was upsetting to me, and I was saddened that I needed to hide my Jewish identity and affiliations in order to have a chance of being accepted into McGill[.] student government. Nevertheless, I complied, as I knew that the best way for me to facilitate positive change was by getting involved and gaining a platform to speak. The SSMU Board of Directors is the highest governing body of the Society, and has final say on all SSMU legal, operational, human resources, and financial matters. Due to my significant experience in student government, in legal and financial matters, and especially the fact that I was at the time and am still currently serving as the elected Vice-President Finance of the Arts Undergraduate Society of McGill, the largest faculty association at McGill, I was chosen to serve on the Board of Directors.\n\n I have served on the SSMU Board of Directors from June 2017 until now. At the beginning of this school year, the SSMU[.] Judicial Board asked the Board of Directors to re-address a decision that they had made over a year prior, but had been ignored by the SSMU Board of Directors for 15 months. The decision was that BDS and similar motions violate the SSMU Constitution because they are discriminatory in nature. At our Board of Directors meeting, I vocalized my support for the ratification of this decision, and voted in favour of ratifying it.\n\n Predictably, the backlash from the McGill BDS Action Network was swift. Shortly thereafter, the McGill BDS Action Network held public meetings where they outlined their planned response. Their plan was a campaign called \"Democratize SSMU.\" Democratize SSMU was a campaign to remove all Jewish and anti-BDS students from SSMU[.] leadership, thinly veiled under the guise of \"democracy,\" \"transparency,\" and \"accountability.\" The description for the Democratize SSMU Facebook event publicly targeted me and two of my fellow Directors simply for being Jewish and having connections to a Jewish organization. My Jewish identity was now public, and a target was placed squarely upon me by the McGill BDS movement.\n\n Democratize SSMU later removed my name from the description of the campaign, and admitted that it had been \"insensitive to anti-Semitic tropes of Jewish people as corrupt and politically powerful.\" Despite removing names, the description remained almost identical, and called upon students to attend the SSMU general assembly and take action against us. The SSMU General Assembly ratifies the Board of Directors once they have been chosen based on their qualifications from a pool of applicants. Historically, the Board of Directors had been ratified as a bloc, all 12 at a time. In an unprecedented move, the BDS/Democratize SSMU campaign supporters who had shown up to the GA forced a division of the motion to ratify the Board of Directors into 12 individual votes on each Director. My name was the 6th one. The first 5 directors were ratified with not enough opposition to even warrant counting votes. When my name came up, over 100 students raised their placards in opposition to my ratification, and I was not ratified as a Director.\n\n I was blocked from participating in student government because of my Jewish identity and my affiliations with Jewish organizations.\n\n A leader of the McGill BDS movement claimed her rationale for dividing the question had to do with the fact that she did not like a few of the \"names\" on the list of nominations. No justification was offered other than that she did not \"like\" some names. There was not one word of discussion or debate about my qualifications for the position. I was simply voted down. As soon as it was apparent that I was voted out of the position, there was applause.\n\n I have no doubt from the information circulated about me and campaign run against me prior to this vote that this was about my Jewish identity, and nothing more. I was blocked from being able to participate in my student government because I am Jewish, because I have been affiliated with Jewish organizations, and because I believe in the_right to Jewish self-determination.\n\n The BDS movement had accomplished their mission. They had succeeded in barring a Jewish student from participating in McGill[.] student government. After me, two other Directors were voted down as well, because they opposed the BDS movement and because they had attempted to support McGill[.] Jewish students.\n\n Time and time again, we have heard the phrase \"BDS is not anti-Semitic.\"\n\n If BDS is not anti-Semitic, why did a BDS-led campaign name and shame me for my affiliation with a Jewish organization, and call on students to remove me from student government for this reason?\n\n If BDS is not anti-Semitic, why was I barred from participating in student government because of my Jewish identity?\n\n This experience was incredibly upsetting. Yet, as horrible as it has been, I am feeling positive today. I am optimistic because of all the amazing support I have received from Jews and non-Jews, friends and acquaintances alike, telling me that they stand with me against this anti-Semitism. And more than anything, I am happy that McGill BDS has finally come out of the shadows, and proven that they will stop at nothing to impose their agenda upon the McGill student body. I am happy that the discriminatory agenda of BDS McGill that has been swept under the rug for years is finally out in the open, so that we may all come together to defeat it.\n\n More than anything, I am hopeful that McGill can learn a lesson from the events that occurred last night.\n\n I can only hope that I am the last Jewish student at McGill who will be barred from our student government for nothing more than their name and their Jewish identity.\n\n My name is Noah Lew, I am a 3rd year undergraduate student at McGill University, and I am Jewish. This is my story."}