{"doc_id": "1194", "name": "2017_04_humanities_student_major_2538_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2017-04-humanities-student-major_2538_UofT.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "0.161", "Subjectivity": "0.404", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "270", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66zood", "Reddit_id": "dgmk1vt", "Subreddit_id": "t5_2rbaq", "Commenter": "Bea94", "length": "1562", "content_scrubbed": "One of my programs (I'm in 3) is in the social_sciences. I'm not in economics, though. But I can answer your last 2 questions. Any social science, humanities, and life science program is very general. They give you great skills, such as analytical skills, but these skills are also pretty general.  So, when you apply to jobs, you will be competing with so many people with these general skills AND people with practical skills / professional experience. So, the improve your job prospects, focus on gaining experience WHILE doing your undergrad. Volunteer in anything related to what you're studying and do summer internships or work-study positions. Job prospects are good if you focus on gaining experience before you apply to jobs. Because, honestly, work places don't want to spend months teaching you. That being said, you will notice a lot that UofT STRONGLY encourages their students to pursue further education (i. e., a Masters). I mean, like every prof in every class almost expects that we will be doing more education after we graduate. At least in my experience. U of T is a research institution so focuses less on preparing us to work in the \"real world\" and more on pursing a Masters. UofT does have tons of opportunities for undergrads to pursue research, which is great to prepare us if we do want to do further education. I have pursued 5 research projects and will be applying to further my education next year. So short answer, no it[.] not necessary to get a masters. But if you do want good job prospects, focus on gaining that experience :)"}