{"doc_id": "239", "name": "2017_10_humanities_student_major_114_math", "namespace": "we1sv2.0", "metapath": "", "pub": "math", "title": "2017-10-humanities-student-major_114_math.txt", "pub_date": "2017-10-02T00:00:00Z", "Sentiment": "0.128", "Subjectivity": "0.289", "Score": "48", "Upvotes": "0", "Downvotes": "0", "Wordcount": "269", "Permalink": "http://reddit.com/r/math/comments/73tlp5/isnt_there_anyone_that_is_actually_happy_with/dnt7pgd/", "Threadlink": "http://reddit.com/r/math/comments/73tlp5/isnt_there_anyone_that_is_actually_happy_with", "Parent_id": "t1_dnt71ne", "Reddit_id": "dnt7pgd", "Subreddit_id": "t5_2qh0n", "Commenter": "zataks", "length": "1635", "content_scrubbed": "Let me preface this by saying I'm a non-traditional undergrad returning to school after a decade+ in an applied sciences/operations public service career.\n\nFor me, understanding *edit: math* makes everything easier because it is prevalent in all aspects of life.  In science academic courses this should be obvious.  But also in liberal_arts, it[.] application is not lost.  The ability to identify or use logic and argument is fundamental in mathematics in such that things must be \"proven\" regardless of how intuitively we know them to be true.  \n\nI do supplemental instruction for intermediate algebra (precursor to college algebra) at my college and none of my attendees are studying math *edit: as a degree/career pathway*.  The one who will utilize it the most is going into accounting.  But another student manages a fast food restaurant--I explained to her how much easier and faster work life would be if she could calculate change or a full order in her head without *needing* the register/calculator.  That kind of drove it home.  \n\nTangentially related things and calling \"bullshit\" on the things people spew seems to be easier too as I progress with mathematics and become more intimate with the subject.  (A certain amount of this also requires actually listening to people too, though, so attention in general is probably more important than the math side of it).\n\nDoes that explain it at all?  IDK.  Maybe part of it is simply that learning math is hard and by continuing to do something that is challenging and requires that I fail over and over, everything else that isn't so failure-oriented seems easy by comparison."}