{"doc_id": "409", "name": "2017_10_humanities_student_major_1696_buildapc", "namespace": "we1sv2.0", "metapath": "", "pub": "buildapc", "title": "2017-10-humanities-student-major_1696_buildapc.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "-0.012", "Subjectivity": "0.148", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "291", "Permalink": "http://reddit.com/r/buildapc/comments/779lt5/built_and_modded_an_entrylevel_gaming_pc_for_my/dokj15d/", "Threadlink": "http://reddit.com/r/buildapc/comments/779lt5/built_and_modded_an_entrylevel_gaming_pc_for_my", "Parent_id": "t1_doki5di", "Reddit_id": "dokj15d", "Subreddit_id": "t5_2rnve", "Commenter": "LiquorNWeed", "length": "1744", "content_scrubbed": "Hehe, I'm Indian man.\n\nIn my case, it looks like this: sophomore year is a major changing point in your school career. You decide what \"stream\" you take after the soph. (or as we call it: Class 10th) exams. Could be Science (Physics, Chemistry, Biology/Maths, English and a fifth of your choice. A sixt is optional), Commerce (Business Students, Accounting, Economics, English, a fifth of choice, preferably Maths) or Arts (humanities subjects, change with availability at your school).\n\nSo, we give several tests over the year, called assessments, and are graded upon them AND (in the smaller ones, the bigger ones are simple pen and paper tests) some other pointers like class behaviour, assignments, projects, discussions, all that. Now it becomes a /100 statistic. Your marks bracket determines your grade:\n\n* 91-100: A1 (Like A+ for you): 10 grade points\n\n* 81-90: A2: 9 grade points\n\nGoes on this way till E2 (and there[.] a D, singly). Minimum qualifying grade is always D.\n\nOn basis of these grades, over all your Formative (smaller) assessments (4 in a school year) and Summative (pen and paper tests) assessments (2 per year), you're given grade points which are averaged and added. And you get a couple upgradations of grade points too, depending on the fact that you participated in sports/cultural activities or not. This forms a Grade Point Average (GPA) highest is 10. Culminated over the entire year, it[.] Culminated Grade Point Average (CGPA) that were get to show as our final result gauge. \n\nMine was a 10, so that[.] what I was saying. You have 5/6 (a regional language if that[.] applicable) subjects till there too. English, Hindi, Maths, Science (all combined), Social Science. You get no flexibility to choose, by the way. "}