{"doc_id": "461", "name": "2017_10_humanities_student_major_2241_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_2241_AskReddit.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "0.143", "Subjectivity": "0.41", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "239", "Permalink": "http://reddit.com/r/AskReddit/comments/78ca8z/college_studentsfacultystaff_how_prevalent_really/dosr4fe/", "Threadlink": "http://reddit.com/r/AskReddit/comments/78ca8z/college_studentsfacultystaff_how_prevalent_really", "Parent_id": "t3_78ca8z", "Reddit_id": "dosr4fe", "Subreddit_id": "t5_2qh1i", "Commenter": "all_teh_sandwiches", "length": "1486", "content_scrubbed": "Just finished my undergrad at Berkeley (with experience in both STEM and humanities)- I've never seen a designated \"safe space.\" When professors or grad students described their classes/discussions as safe spaces, their intent was always for students to be comfortable airing their ideas without fear of being personally attacked- NOT for students to echo-chamber themselves.\n\nTrigger warnings weren't really a thing- only time I can remember is a professor who showed some pretty knarly pictures of a brain surgery (it was a cognitive neuroscience course), and told us beforehand that it might be upsetting \"to those with delicate stomachs\" \n\nWRT safe spaces and all the paraphernalia of \"millennial culture,\" all I saw at Berkeley was a respect for other people[.] ideas and thoughts, and a desire to be conscious of how the words that come out of our mouths can be indicative of systemic biases we've grown up with.\n\nWhat I've always found ironic is the fact that the Berkeley College Republicans (largely a group of inflammatory assholes) were the ones begging for safe spaces- not the regular students. Most Berkeley students I met were incredibly tough and resilient people.\n\n**TL;DR: My college culture at Cal was nothing like what Fox News or Breitbart would tell you. People are pretty reasonable, and are unafraid to air their own ideas- there is almost no suppression of speech on campus (aside from the crazy radical people advocating violence, or promoting racism/sexism).**"}