{"doc_id": "372", "name": "2017_10_humanities_student_major_1326_aliens", "namespace": "we1sv2.0", "metapath": "", "pub": "aliens", "title": "2017-10-humanities-student-major_1326_aliens.txt", "pub_date": "2017-10-14T00:00:00Z", "Sentiment": "0.123", "Subjectivity": "0.348", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "310", "Permalink": "http://reddit.com/r/aliens/comments/76cxut/i_just_wanted_to_get_something_off_my_chest/dod76sk/", "Threadlink": "http://reddit.com/r/aliens/comments/76cxut/i_just_wanted_to_get_something_off_my_chest", "Parent_id": "t3_76cxut", "Reddit_id": "dod76sk", "Subreddit_id": "t5_2qktn", "Commenter": "Masterreeferr", "length": "1824", "content_scrubbed": "  American political left_wing. Their entire support base is a bunch of minority groups that have been conditioned in identity politics and as a result the majority of them see the world as racist even though the racists and such are a small minority.\n\nThis is a null argument, the point you should be making is that **all** political groups stand in humanities way. The right_wing of American politics runs rampant with corruption. Politicians care more about getting millions of dollars from corporations in \"campaign donations\" to help get them re-elected year after year and in return they do whatever big business asks of them while screwing over the masses. Trump is the perfect example of that. Lower taxes on the rich, raise taxes on the working class, and just recently he cut beneficiaries to millions of American[.] healthcare. I digress as this is not a political discussion; it is *all* governing powers/all elites who do not want things to change. The people sitting at the top with all the power like being exactly where they are. If humanity advances too far too fast society will change forever and they will lose their power. They rely on capitalism, wealth inequality, and ignorant masses for them to have control over an entire planet. If technological advances start to destroy capitalism, start to make it so money no longer holds power over everyone and everything, and people start to see the bigger picture en masse (since those of us who do are the minority) they will be screwed. They need us to advance slow enough that they can effectively plan out how they'll always have the power they desire. Not the \"American_left_wing\" or the \"right_wing\", **all** of them. Billionaires and their puppet politicians alike. However billionaires clearly have more control over the_right than they do the_left."}