{"doc_id": "1038", "name": "2017_04_humanities_student_major_1068_teachinginjapan", "namespace": "we1sv2.0", "metapath": "", "pub": "teachinginjapan", "title": "2017-04-humanities-student-major_1068_teachinginjapan.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.128", "Subjectivity": "0.389", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "606", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64iw5t", "Reddit_id": "dg2mbz2", "Subreddit_id": "t5_3c154", "Commenter": "lunarjs", "length": "3570", "content_scrubbed": "I will give my opinion as someone that works at an international school teaching economics/humanities as well as being involved in hiring / interview panels. but please note these are not necessarily hard and fast rules.\n\nFirstly, if international school teaching is your end game, forget about the masters in EFL. Most students at decent international schools speak fluent or near-fluent English and while your science credentials are solid, international school jobs probably won't touch you without a valid teaching licence in your home country (or somewhere) and 2+ years experience teaching your subject at the appropriate level. Many will also want some IB experience or experience working in an international school. As mentioned earlier, the general rule is 2 years but Japan is much more competitive than places like China and this can often be 5 years or more.\n\nThe most realistic option, but expensive in both money and time is to become qualified in your home country and get some experience in a less competitive international school environment such as the Middle_East or China (although China is becoming quite competitive for any decent school). \n\nYou also say you are from the US and I believe some states (Florida from memory?) have some kind of teaching licence equivalency thing where you can receive a qualification based on your degrees and experience, which might be appropriate for you. I don't have much info on this though, sorry. \n\nEFL teaching will not count towards your subject expertise in science so will generally be disregarded in the whole \"2 years experience minimum\" as they want you to have experience in your subject area, although it will still be considered face to face teaching experience which is beneficial on your CV. \n\nI am relatively inexperienced (4 years in Australia, 1 in Tokyo at a shit school and now my current position) and I consider myself very lucky to have secured a job here when looking at the qualifications and experience of the people I work with. \n\nDuring my job hunt, I worked part_time in a fairly flexible freelancing job while searching for work here and applied for relief teaching positions at all the international schools nearby, managed to turn one of those into a part_time gig and then later full time but it was a sheer fluke. \n\nLastly, if you decide to get a teaching qualification and work in your home country or elsewhere, it[.] a good idea to apply for extra duties. Many younger teachers don't as they think they won't get them but these positions are often thankless and offer little pay incentive so hardly anyone applies. It looks great on your international school resume and can help you secure a job. I was a year level coordinator in my second year as no one else applied for the job and this impressed my interview panel. \n\nSorry for the long post, and if you have any questions please feel free to ask!\n\nEDIT: Also a quick Pros and Cons of my experience in an international school that might influence your decision:\n\nPros:\nExcellent money, Good benefits, free flights twice a year, free housing in brand new building, they even moved me from a 4LDK to a 5LDK when I got married! Plus health care and all that boring shit, easy hours, out before 4:30 most days, no club shit or anything (they have professional coaches), excellent school facilities \n\nCons:\nSpeak English basically all day, total gaijin bubble at work, arsehole parents with ridiculous expectations, entitled kids, holidays are much worse than in Austalia (muh 12 weeks!), pain in the ass to get hired initially "}