{"doc_id": "1058", "name": "2017_04_humanities_student_major_1301_professors", "namespace": "we1sv2.0", "metapath": "", "pub": "Professors", "title": "2017-04-humanities-student-major_1301_Professors.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.092", "Subjectivity": "0.297", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "550", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64jz12", "Reddit_id": "dg5fzxj", "Subreddit_id": "t5_2svhp", "Commenter": "remnbibi", "length": "3151", "content_scrubbed": "I do not like when the government thinks that throwing money at a problem, mainly to gain votes, fixes the problems.  It all seems like a big hustle to me. There are other issues that need to be addressed, and I fear that this is a way of sneakily controlling higher education. Getting too much money from the government makes me nervous, because then they feel entitled to tell you how to spend the money, and colleges become dependent on that money. When the government starts signing the checks, they will have more say in decisions that are none of their business and will start legislating things that are out of their area of expertise. Because they are beholden to the taxpayers now, I wonder if they won't start saying, \"Well, we need to cut the Humanities. Let[.] have more STEM programs.\" Or, \"We want students out of there faster, so you are going to have to lower your standards.\" In Florida, they wanted to get students out faster, so they stopped requiring remedial courses, even for students who really need them. And, they indeed cut some Humanities requirements to get students out faster. This also means that students sometimes end up taking classes two or three times, because they were not prepared for even the most basic courses. If you take a class three times, you pay out of state tuition, which costs for one class the same as an entire semester of full time courses.\n\nBefore they did this, everyone needed to address the issue of lowering the cost of college. Many community colleges are already very affordable, and with scholarships are almost free. This reminds me of the problems with health care. Both are too expensive, not transparent enough for the average person to understand, and too much money goes into administration. The costs are already going through the roof at colleges, like they are with health care, in part because of everyone has been taking out student loans. When you tell people that everyone is covered, and the government writes a blank check before first addressing the costs, then costs go up. Costs go up, taxpayers get angry, and the government interferes more. Colleges need to work on lowering their own costs first from within.\n\nI find that students already play a dangerous shell game with financial aid. Especially students who have little experience in managing their finances. I see dozens of students every semester who get their financial aid, or take out student loans, and treat it like it is free money. They are robbing Peter to pay Paul, but will worry about that later. They attend only enough classes to avoid getting dropped. They avoid buying their textbooks, or buy them with financial aid and sell them for cash to pay their bills. Apparently this new regulation requires students to live in New_York for two years after they graduate, or they will have to pay their tuition back. Who is going to enforce that? It seems that you will have students who get their \"free\" degree, and then four years later, find that they cannot move to where the jobs are, if they are out of state. So, they will find themselves saddled with unexpected costs, or forced to work in New_York."}