{"doc_id": "1149", "name": "2017_04_humanities_student_major_2071_twoxchromosomes", "namespace": "we1sv2.0", "metapath": "", "pub": "TwoXChromosomes", "title": "2017-04-humanities-student-major_2071_TwoXChromosomes.txt", "pub_date": "2017-04-18T00:00:00Z", "Sentiment": "-0.008", "Subjectivity": "0.32", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "352", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgfkrjx", "Reddit_id": "dggcyvc", "Subreddit_id": "t5_2r2jt", "Commenter": "AdasMom", "length": "1823", "content_scrubbed": "Effing rural religious families. I worked my butt off in school, got told every career dream I had was inappropriate for women, was convinced I shouldn't even apply to east coast schools because they were \"too liberal.\" Picked a shit school in the middle of nowhere that gave me a full ride, just to escape somehow. They refused to help me get there, made me go to an Ivy-League priced (but not Ivy ranked) private school 20 minutes from home, and then when I got depressed and nearly flunked out and lost my scholarships told me I'd better stay at that little school even if I had to take out loans because I \"clearly didn't have to confidence to handle a transfer.\" Judged me for dropping pre-med and going into the arts, even though I'd had a lifetime of \"that[.] not appropriate for women\" and \"you'll be taking a job from a man who needs to support a family\" and \"nobody wants a woman who is smarter than they are\" to the point where the only degree I felt no guilt about getting was a \"useless\" degree. Oh and then when I took out the loans to stay where I was convinced I had to stay, \"nobody will marry you if you have student loan debt.\" Then after college when I had a complete fucking nervous breakdown they didn't understand why I didn't move away and \"pursue my dreams,\" why I was stuck doing shit work in my hometown and living at home. I had no faith in myself left. It took me 15 years to get any back.\n\nI got the fucking degrees, though, so fuck them. I'm massively in debt and probably always will be but I FINISHED. AND I'm married. And I can, in fact, work in my field. Will I ever not be angry? I doubt it. \nI am sharing this as a comment on your comment because I admire the way you handled your situation. I know you went through a lot but you did the_right thing. GOOD FOR YOU. I wish I had run away."}