{"doc_id": "316", "name": "2017_10_humanities_student_major_756_askwomen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskWomen", "title": "2017-10-humanities-student-major_756_AskWomen.txt", "pub_date": "2017-10-09T00:00:00Z", "Sentiment": "0.046", "Subjectivity": "0.336", "Score": "35", "Upvotes": "0", "Downvotes": "0", "Wordcount": "491", "Permalink": "http://reddit.com/r/AskWomen/comments/7599df/what_are_your_examples_of_life_working_out_when/do4pgek/", "Threadlink": "http://reddit.com/r/AskWomen/comments/7599df/what_are_your_examples_of_life_working_out_when", "Parent_id": "t3_7599df", "Reddit_id": "do4pgek", "Subreddit_id": "t5_2rxrw", "Commenter": "A5H13Y", "length": "2669", "content_scrubbed": "In college, I switched to a pretty intense major at the end of my freshman year, so I was basically starting a year behind going into my sophomore year. A few people were like \"Oh yeah, you can do it! I did it! Just take 6 classes each semester and you can finish on time!\" Yeah... except that the people who said I could *totally* do that were also among the very very few who could tolerate multiple semesters of 6 courses. I would never have been able to tolerate that, let alone *every* semester.\n\nAnd since I had that first year of random classes that basically filled in my electives/social_studies/humanities, we're talking *all* core courses that were extremely difficult.\n\nIn my first 1. 5 years or so of this new major, I failed a class or two and dropped a class or two and also realized how packing so many classes in was hurting the classes that I should really have done well in as well, simply because I didn't have the time and mental resources to dedicate to them - I had to give most of my attention to the more difficult courses.\n\nI finally decided fuck it, finishing on time isn't worth me literally wanting to kill myself, so I decided I'd stay an extra semester and started just taking 4 classes a semester, which I really really wish I just did earlier (especially since some of those classes were ones I was retaking). I was just able to enjoy life *so* much better...\n\nUntil I realized that my financial aid (for a $62k+ yearly tuition) only covered me for 4 years and I'd have to petition for more financial aid (i. e., write a letter to some board and get letters from multiple professors). Oh, and the board only meets from time to time, and the next time they'd be meeting was in July *after* my class attended graduation, and just a month before I would *maybe* start my \"extra\" semester of classes.\n\nI walked at graduation that May, a few days later had brain surgery for a brain aneurysm, and then proceeded to take 1 or 2 summer classes as well (also stressful because I could barely focus after the surgery, and I was paying out of pocket for classes that I was praying I wouldn't fail)... all while hoping that my financial aid would be approved, and I wouldn't have to either A) not get my degree, or B) essentially *double* the amount of debt I ended up with just for that *one* extra semester (and all of the worrying was *way* more stressful than the brain surgery, btw).\n\nMy financial aid petition ended up being approved, I broke up with my boyfriend that August (who was in no way \"right\" for me), dropped like 20 pounds, met my now-boyfriend... and overall that summer just took a sudden turn and ended up being pretty okay :)\n\n"}