{"doc_id": "241", "name": "2017_10_humanities_student_major_125_academia", "namespace": "we1sv2.0", "metapath": "", "pub": "academia", "title": "2017-10-humanities-student-major_125_academia.txt", "pub_date": "2017-10-02T00:00:00Z", "Sentiment": "0.239", "Subjectivity": "0.405", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "336", "Permalink": "http://reddit.com/r/academia/comments/73slrr/the_academic_job_markets_abysmal_should_i_not/dntez84/", "Threadlink": "http://reddit.com/r/academia/comments/73slrr/the_academic_job_markets_abysmal_should_i_not", "Parent_id": "t3_73slrr", "Reddit_id": "dntez84", "Subreddit_id": "t5_2qwxp", "Commenter": "kidsweekend", "length": "1902", "content_scrubbed": " I would say this, to get a TT job in the humanities, you will need to enter the PhD with a fierce motivation to give it your all.\n\n- /u/Adarga\n\nYou will also a detailed plan for how you can become a competitive candidate when you finish and enter the job market. Luck is often a factor in the hiring process: scholar X likes your work and decides to fight for you to be on the shortlist, scholar Y received some unrelated good news before reviewing your application, etc. But aside from luck, my experience has been that most successful early-career candidates just know how to play the game. \n\nThey follow the same basic formula: \n\n- Finish your studies in 4-6 years;\n- Publish a couple articles in top-tier journals;\n- Write your diss in a way that you can transform it into a book;\n- Teach a couple courses on your own and avoid the adjunct trap;\n- Understand the trends in your field/sub-fields and play to them;\n- Learn how to speak confidently and concisely about your work;\n- Do not waste time on projects that have little value to hiring committees (e. g. organizing conferences in your department, attending so-called 'grad' conferences or submitting to 'grad' publications, writing blog posts instead of publishing in peer-reviewed journals, etc.).\n\nSome people will say that they did not follow this formula and still managed to find a TT position; they are clearly in the minority here. Most of your colleagues in your PhD program won't have a plan and may not even really understand what is required to succeed. Make damned sure you are not one of them.\n\nI followed this formula and got the dream job in my first year on the market. Yes I was lucky. Yes my comment is evidence of survivorship bias. But I also just finished serving on a hiring committee and looking through applications from early- and mid-career scholars and I'm more certain than ever that there[.] value in this formula."}