{"doc_id": "313", "name": "2017_10_humanities_student_major_730_vegan", "namespace": "we1sv2.0", "metapath": "", "pub": "vegan", "title": "2017-10-humanities-student-major_730_vegan.txt", "pub_date": "2017-10-09T00:00:00Z", "Sentiment": "0.035", "Subjectivity": "0.255", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "245", "Permalink": "http://reddit.com/r/vegan/comments/754o6w/i_never_knew_that_some_marijuana_wasnt_vegan_do/do4gg14/", "Threadlink": "http://reddit.com/r/vegan/comments/754o6w/i_never_knew_that_some_marijuana_wasnt_vegan_do", "Parent_id": "t3_754o6w", "Reddit_id": "do4gg14", "Subreddit_id": "t5_2qhpm", "Commenter": "brodoyouevenscript", "length": "1366", "content_scrubbed": "A Prius silently rolls up to a young black gentleman in sweatpants and a durag standing unassumingly under a street light. The neighborhood is dark and quiet except for the soft  scream of sirens far off in the distance in the south side of the city.\n\nIt[.] been a long week for Tyrone. Since his building got the cops called for a fight last week it[.] been hot ever since. His girl has been throwing shade ever since she caught him snap chatting some white chick he was hitting on the side for free weed.  The black gentleman flicks his cigarette to the curb and exhales into the air before popping open the passenger door. \n\nThe driver turns down his vampire weekend Spotify playlist as Tyrone steps in. This collegian white man has rough hair and a round nose that holds his red Ray Ban frames. His tucked in checkered plaid shirt compliments his glasses.\n\nWithout a word Tyrone reaches into his sweatpants pocket to pull out a dub of his mid level kush. The driver hands him his money but not before clearing his throat to ask a question.\n\n\"Hey, this pot is, vegan, right?\"\n\nTyrone looks looks at him for a few seconds before closing his eyes briefly. Then slowly exhales as he nods his head.\n\n\"Yea.\"\n\nThe liberal_arts student smiles.\n\n\"Good. Cause I'm vegan.\"\n\nThe exchange is complete and Tyrone steps out back out onto the sidewalk to continue his night.\n\n\n   "}