{"doc_id": "1123", "name": "2017_04_humanities_student_major_1878_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2017-04-humanities-student-major_1878_AskAcademia.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.15", "Subjectivity": "0.478", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "328", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65s61j", "Reddit_id": "dgcxsz3", "Subreddit_id": "t5_2sakj", "Commenter": "humanstem", "length": "1867", "content_scrubbed": "Do it. Provided you get it, that is, because my understanding is those can be pretty competitive.\n\nI'd even go so far as to say the 50% research in your postdoc is superfluous.  I applied to the kinds of jobs you're targeting, and even with 15+ papers in good journals the people who beat me tended to have had about 5-7 pubs in good journals. In my STEM field (I assume the \"S\" in SLAC is \"small\" not \"selective\") the ultimate winners were almost uniformly former visiting/non-TT professors at undergrad institutions. A 100% research-oriented postdoc (even if you do all the teaching certificate stuff) gets you nowhere with those kinds of places, even if they say they want researchers. Virtually all undergrad schools say they value research, but not all mean it seriously - you can usually tell by the current faculty publication records.\n\nThat said, there are two caveats. The schools you describe where these positions are, aren't exactly the sort of schools you seem to eventually want to be at. The culture/students are very different at, say, UIUC or BU than at a 90% teaching/10% research liberal_arts school. Maybe at Harvard they are a little closer in terms of student expectations and culture, but it could be the kind of thing where you are relieving a new HHMS grant winner of their teaching load. My sense is you will do much better if you expand your search and can secure a postdoc at a largely undergrad institution with lots of research than at any of the R1 schools you mention (such postdocs exist as faculty at \"research intensive liberal_arts schools\" are increasingly quite competitive for grants). \n\nAlso, the more years of funding this postdoc provides, the better. I see these kinds of postdocs come up from time to time with only a year or so, and after the year is up you don't want to end up in some kind of glorified adjunct position."}