{"doc_id": "1274", "name": "2017_04_humanities_student_major_3272_chromeos", "namespace": "we1sv2.0", "metapath": "", "pub": "chromeos", "title": "2017-04-humanities-student-major_3272_chromeos.txt", "pub_date": "2017-04-29T00:00:00Z", "Sentiment": "0.088", "Subjectivity": "0.356", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "505", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_687gqg", "Reddit_id": "dgwoc8t", "Subreddit_id": "t5_2r1wh", "Commenter": "SnowblindAlbino", "length": "2851", "content_scrubbed": "Humanities prof here and long-time CB users. I would say \"no\" to all of these questions except the multiple browser tabs... and then I'd say go with a 4gb machine. I've been using a CB as a daily driver at home/on the road for 3+ years and it[.] great for web browsing, has 8+ hours battery llfe, decent screen, OK keyboard, etc. (I'm using an HP 14 with 4gb, would not want a smaller screen).\n\nBut for serious writing? I don't think so. I use the CB to write short pieces and drafts, but I would never rely on it for critical work in MS Word format (i. e. for publication or things like a thesis/dissertation) as Docs lacks many useful features and has some compatibility issues once you start formatting things properly. My undergraduates students would tell you the absence of the \"cite while you write\" plugin for Endnote along is reason enough to reject a CB. (I personally write in WordPerfect, which of course isn't available for Chrome either.)\n\nAudio transcription: I've never tried this with a CB and if you're simply looking to play mp3 audio it would be fine. But if you're really doing serious transcription you'll find the related software is mostly written for Windows... and much of the hardware will be windows only as well (i. e. foot pedals). I do interviews for my work and always turn to a windows machine for transcription work, these days after running audio files through software that automatically does voice recognition as well, which gives you a first draft.\n\nWorking with . pdfs will be OK, but you can't run Acrobat Pro on a chromebook. Maybe you don't need it, but I use Acrobat all the time for working with . pdfs (editing them in particular).\n\nUltimately you'll probably need both a CB and a Windows machine. For me this is just part of my professional tools... I have a high-performance Windows desktop at work with dual 25\" monitors and a similar setup at home, a 14\" Chromebook, and a 17\" windows laptop. While I use the CB all the time (am using it now) casually, when I'm seriously writing or deep into research I always find the desktop rig most useful as I can write on one monitor and have spreadsheets, documents, or audio editing on the other.\n\nYMMV but I wouldn't plan on a CB-only approach for any graduate program that requires lots of writing, if only because everyone else (including your professors) will most likely be working in a Windows environment and sharing files between Chrome/Docs and Word isn't always a seamless experience. I've had some undergrads try with their thesis projects (which are only ~50 pages on average) and it[.] been a hassle.\n\nBottom line: if you will be writing all the time and this is your \"job\" you really should get the tool you need, not the cheapest thing available. Find some way to come up with the extra money if need be so your tools don't get in the way of your work.\n\n"}