{"doc_id": "283", "name": "2017_10_humanities_student_major_474_parahumans", "namespace": "we1sv2.0", "metapath": "", "pub": "Parahumans", "title": "2017-10-humanities-student-major_474_Parahumans.txt", "pub_date": "2017-10-06T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.476", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "578", "Permalink": "http://reddit.com/r/Parahumans/comments/74mc8r/lets_playa_game_you_name_a_character_and_ill_give/do027yw/", "Threadlink": "http://reddit.com/r/Parahumans/comments/74mc8r/lets_playa_game_you_name_a_character_and_ill_give", "Parent_id": "t1_dnzhmpu", "Reddit_id": "do027yw", "Subreddit_id": "t5_2x7ww", "Commenter": "izoughe", "length": "3328", "content_scrubbed": "Major spoilers ahead for Night Angel Trilogy.\n\nKylar Stern is a wetboy (magical assassin).  Normally he[.] a baseline human, albeit one who has trained extensively since the age of 6 in the arts of hand-to-hand combat, poison, and stealth.  He[.] proficient with pretty much every weapon. He usually carries an unbreakable sword, several knives, a hand crossbow, and a blowgun, as well as any number of hidden weapons and several deadly poisons.\n\nHe is an expert at self-modification through body magic.  He can improve the speed, strength, or durability of any part of his body at will.  He[.] used this to punch through a thick wooden wall with no damage to his own body, to jump off a castle tower into a river and remain unharmed, and to easily jump from ground level to the roof of a one-story building.\n\nHe can also use body magic to turn himself invisible, change his body (either with illusions or actually turning into someone else), heal rapidly (he heals a fatal stab wound in under a minute), grow wings and turn his bones hollow to fly, and almost limitless other applications.  Changing his body to someone else[.] or growing wings requires several minutes of concentration, and he needs to spend a year or two in a given body before he[.] used to it[.] quirks and completely coordinated.\n\nAll this body magic isn't free; it uses up his internal reserves of magic.  However, he almost never runs out, because he can recharge this reserve by absorbing energy sources around him.  This includes heat, light, and magic, and this absorption happens fast enough that he[.] effectively invulnerable to attacks composed solely of magic (or energy).\n\nHis body is home to a sentient magical symbiote.  When outside his body, it takes the form of a little black ball of metal.  While it[.] inside him, it senses through his senses, communicates telepathically, and points out details about a situation he may have missed.  When he actively uses it, it becomes completely amorphous and can exit his skin anywhere.  It[.] caustic and eats through metal and flesh alike, although Kylar is immune to this effect.  It can form tools or small weapons for Kylar to use, and has even temporarily replaced a lost hand with a fully functional copy.  It[.] most common use is either coating Kylar[.] skin, masking his appearance and giving him minor resistance to physical attacks, or coating his unbreakable sword, making it unnaturally sharp (sharp enough to easily cut through bone) and causing it to penetrate all magical protections.  Any wound caused by this symbiote (or a weapon coated in it) cannot be healed by magic (probably not relevant in Wormverse).  It also grants him the ability to look into someone[.] eyes and see all the sins they've ever committed.\n\nOn top of all that, Kylar is effectively immortal.  If he dies while the symbiote is present inside his body, he will ressurect up to a week later.  If his body is still intact, it will heal and raise from the dead.  If it[.] not, a new one will be spontaneously created out of natural materials (such as a rotting log).  Every time this happens, it causes the unavoidable death of someone who cares for him, although this can be delayed by up to a month or so.\n\nHe can die only if he runs out of people who care for him or if he[.] separated from the symbiote and then killed."}