{"doc_id": "270", "name": "2017_10_humanities_student_major_350_engineeringstudents", "namespace": "we1sv2.0", "metapath": "", "pub": "EngineeringStudents", "title": "2017-10-humanities-student-major_350_EngineeringStudents.txt", "pub_date": "2017-10-05T00:00:00Z", "Sentiment": "0.097", "Subjectivity": "0.381", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "543", "Permalink": "http://reddit.com/r/EngineeringStudents/comments/74c7jj/fundamental_theorem_of_engineering/dnxph0a/", "Threadlink": "http://reddit.com/r/EngineeringStudents/comments/74c7jj/fundamental_theorem_of_engineering", "Parent_id": "t1_dnxewxt", "Reddit_id": "dnxph0a", "Subreddit_id": "t5_2sh0b", "Commenter": "gypsydrifter", "length": "3087", "content_scrubbed": "Hi there,\n\nWhen I first went to school, I had a trade (I used to fly airplanes for a living) and used that to pay for college.  I took all the classes I wanted, I took math classes, I took anthropology, I took Russian language classes (I had been an exchange student in Ukraine previously, so this was kind of synergistic).  Eventually, I ended up just taking several classes in aviation to finish off a degree in that.  Consider that the equivalent of a business degree where someone had taken a bunch of weird other upper divisions along the way.  Anyway, later in life (i. e. now) I'm a math major, and am planning grad school in something \"STEM-y\" (i. e. physics or engineering or something).  Having seen both sides of the undergrad world - I think I may have a somewhat unique perspective.\n\nI found that the humanities courses I took - in particular the anthropology courses - to be particularly more challenging than any math classes I've taken thus far (I graduate in the spring).  \n\nIt[.] not that the STEM classes aren't hard - they absolutely are - rather, the type of thinking you do writing a paper on what the ethnohistorical context within which modern Tlingit story-writers root their narratives is a totally different way of thinking than say, mechanically solving an arbitrary problem.  In Math at least, big results grow out of tiny axioms and ideas.  In the humanities on the other hand, you start with big picture thinking and do some weird gradient descent into the context that defines an individual at a given time.\n\nThis way of thinking requires a significant amount of critical thinking - however, unlike math, where you can always find some axiom that what you're learning can be built from, in anthro, logical thinking might actually stand in the way of making necessary intuitive leaps.  For instance, the Tlingit believe that they have always been in the world and that men were birthed from the ice of calving glaciers (I'm paraphrasing, but bear with me).  As a rationalist, I *know* that this is not \"true\" in the same sense that gravity is true.  However, if I assume that they are right, how does the world look?  How do they view history today?\n\nAn ethnohistorian in Juneau took this standpoint, and assumed that this was the case and has a compelling case for migration by kayak along the outer coast.  A \"good\" anthropologist has to be able to recognize their own cultural baggage, and work scientifically while also understanding that the institution of science has biases that can limit how far research can truly understand the particulars of an event or idea.  I've been reading a ton of different math books lately for school - a lot of them are dry and I have to read the same bit a couple times to figure out what they mean, or scribble some other related theorem or picture in the margin to \"get it.\"  I read a bunch of Foucault in connection with those courses almost a decade ago.  The Foucault was 10 times harder to digest than the math.\n\nSTEM is certainly challenging - but don't be so quick to assume that it[.] easier in the humanities.  "}