{"doc_id": "503", "name": "2017_10_humanities_student_major_2749_6thformcirclejerk", "namespace": "we1sv2.0", "metapath": "", "pub": "6thformcirclejerk", "title": "2017-10-humanities-student-major_2749_6thformcirclejerk.txt", "pub_date": "2017-10-28T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.309", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1499", "Permalink": "http://reddit.com/r/6thformcirclejerk/comments/79b8pb/btec_is_worth_4_a_levels_a_masters_and_2_years_of/dp0kzg7/", "Threadlink": "http://reddit.com/r/6thformcirclejerk/comments/79b8pb/btec_is_worth_4_a_levels_a_masters_and_2_years_of", "Parent_id": "t3_79b8pb", "Reddit_id": "dp0kzg7", "Subreddit_id": "t5_3piyh", "Commenter": "pmyournudes444", "length": "9484", "content_scrubbed": "A BTEC (Latin Baccalaureus Scientiae, B. S., BS, B. Sc., BSc, or B. Sc; or, less commonly, S. B., SB, or Sc. B., from the equivalent Latin Scientiae Baccalaureus)[1] is an undergraduate academic degree awarded for completed courses that generally last three to five years, or a person holding such a degree.[2]\n\nWhether a student of a particular subject is awarded a Bachelor of Science degree or a Bachelor of Arts degree can vary between universities. For example, an economics degree may be given as a Bachelor of Arts (BA) by one university but as a BS by another, and some universities offer the choice of either.[3] Some liberal_arts colleges in the U_S offer only the BA, even in the natural sciences,[4] while some universities offer only the BS even in non-science fields.[5] Georgetown University[.] School of Foreign Service awards Bachelor of Science in Foreign Service degrees to all of its undergraduates, although many major in humanities-oriented fields such as international history and culture and politics.\n\nThe London School of Economics offers BSc degrees in practically all subject areas, even those normally associated with arts degrees, while the Oxbridge universities almost exclusively award arts qualifications. In both instances, there are historical and traditional reasons. Northwestern University[.] School of Communication grants BSc degrees in all of its programs of study, including theater, dance, and radio/television/film. University_of_California, Berkeley grants BS degree in Environmental Economics and Policy in College of Natural Resources (CNR), BS degree in Business Administration in Haas School of Business and BA degree in Environmental Economics and Policy in College of Letters and Science (L&S). Cornell University offers a BS degree in Computer Science from its College of Engineering and a BA degree in Computer Science from its College of Arts and Sciences.\n\nThe first university to admit a student to the degree of Bachelor of Science was the University of London in 1860.[6] Prior to this, science subjects were included in the BA bracket, notably in the cases of mathematics, physics, physiology and botany.[7]\n\nContents  [hide] \n1\tInternational differences\n1. 1\tChile\n1. 2\tArgentina\n1. 3\tAustralia, New Zealand, and South Africa\n1. 4\tBritain and Ireland\n1. 5\tNorth_America\n1. 6\tContinental Europe\n1. 7\tCzech Republic\n1. 8\tGermany\n1. 9\tBrazil\n2\tTypical completion period\n2. 1\tThree years\n2. 2\tFour years\n2. 3\tFive years\n2. 4\tSix years\n3\tSee also\n4\tReferences\nInternational differences[edit]\nChile[edit]\nIn Chile, the completion of a university program leads to an academic degree as well as a professional title. The academic degree equivalent to Bachelor of Science is \"Licenciado en Ciencias\", which can be obtained as a result of completing a 4–6 year program.[8] However, in most cases, 4 year programs will grant a Bachelor of Applied Science (Spanish: \"Licenciatura en Ciencias Aplicadas\") degree, while other 4 year programs will not grant to an academic degree.\n\nArgentina[edit]\nIn Argentina most university degrees are given as a license in a field or discipline. Degrees are specific to a field and are usually 5–6 year programs including a 1 to 1. 5-year mandatory internship, which starts after students have completed 70-80% of the courses required. Degrees are term licenses in the field of study or profession. i. e., biology, nutrition, physical therapy or kinesiology, etc.\n\nAustralia, New Zealand, and South Africa[edit]\nIn Australia, the BSc is generally a three-four year degree. An honours year or a Master of Science (MSc) is required to progress on to the Doctor of Philosophy (PhD). In New Zealand, in some cases, the honours degree comprises an additional postgraduate qualification. In other cases, students with strong performance in their second or third year, are invited to extend their degree to an additional year, with a focus on research, granting access to doctoral programs. In South Africa, the BSc is taken over three years, while the postgraduate BSc (Hons) entails an additional year of study. Admission to the honours degree is on the basis of a sufficiently high average in the BSc major; an honours degree is required for MSc level study, and admission to a doctorate is via the MSc.\n\nBritain and Ireland[edit]\nCommonly in British Commonwealth countries and Ireland graduands are admitted to the degree of Bachelor of Science after having completed a program in one or more of the sciences. These programs may take different lengths of time to complete.\n\nA Bachelor of Science receives the designation BSc or BS for a major/pass degree and BSc (Hons) or BS (Hons) for an honours degree. In England, Wales and Northern Ireland an honours degree is typically completed over a three-year period, though there are a few intensified two-year courses (with less vacation time). Bachelor[.] degrees (without honours) were typically completed in two years for most of the twentieth century. In Scotland, where access to university is possible after one less year of secondary education, degree courses have a foundation year (simply known as the First year) making the total course length four years. In Ireland, the former BS. was changed to BSc (Hons) which is awarded after four years. The BSc (Ord) is awarded after three years.[9] Formerly at the University of Oxford, the degree of BSc was a postgraduate degree; this former degree, still actively granted, has since been renamed MSc.\n\nNorth_America[edit]\nIn Canada, Mexico & the U_S, It is generally a four-year[10] undergraduate degree typically used in engineering, computer science, mathematics, economics, and the natural sciences. Many universities are starting to offer accelerated 3-year BS programs.[11][12]\n\nContinental Europe[edit]\nMany universities in Europe are changing their systems into the BA/MA system, and in doing so also offering the full equivalent of a BSc or MSc See Bologna Process.\n\nCzech Republic[edit]\nUniversities in the Czech Republic are changing their systems into the Bachelor of Science / Master of Science system, and in doing so also offering the full equivalent of a BSc (Bc.) or MSc (Mgr./Ing.).\n\nGermany[edit]\nIn Germany, there are two kinds of universities: Universitaten and Fachhochschulen (which are also called University of Applied Sciences). Universitaten and Fachhochschulen – both also called Hochschulen - are legally equal, but Fachhochschulen have the reputation of being more related to practice and have no legal right to offer PhD programs.\n\nThe BSc in Germany is equivalent to the BSc(Hons) in the United Kingdom. Many universities in German-speaking countries are changing their systems to the BA/MA system, and in doing so also offering the full equivalent of a BSc.\n\nIn Germany the BA normally lasts between three and four years (six to eight semesters) and between 180 and 240 ECTS must be earned.\n\nBrazil[edit]\nIn Brazil, a Bachelor of Science degree is an undergraduate academic degree and is equivalent to a BSc (Hons). Could takes from 4 to 6 years (8 to 12 periods), is also more specific and could be applied for Scientific Arts courses (like Engineering, Maths, Physics, etc.), somewhat is called Human Art courses in Brazil (like History, Portuguese and Literature and Lawyer studies for example) as well as for Health Arts (like Medicine, Nursery, Zootechnique, Veterinary and Biology for example). To be able to start the bachelor[.] degree in Brazil the candidate must to prove proficient in different disciplines and have at least the accumulated Preliminary, Medium and High School degrees accomplished with the minimum merit of 60% to 70% of the degrees and a correspondent study period that can vary from 10 to 12 years minimum. The Bachelor of Science courses in Brazilian Universities normally have the first 1 to 2 years (first 2 to 4 periods) of basics fundamental disciplines (like for example Calculus I, II, III and IV for some engineering courses, Geometry basics and advanced, Analytical Laboratories experiments in Mechanics, Optics, Magnetism, etc.) and the last 2 to 3 years disciplines more related to the professional fields of that Bachelor of Science (for example Units Operations, Thermodynamics, Chemical Reactors, Industrial Processes Kinetics for Chemical Engineering for example). Some disciplines are prerequisite to others and in some universities, the student is not allowed to course any discipline of the entire next period if he was unsuccessful in just one prerequisite discipline of the present period. Usually, the Bachelor of Sciences courses demand a one-year mandatory probation period by the end of the course (internship in the specific professional area, like a training period), followed by relatively elaborate written and oral evaluations. To get the certification as BSc most Universities require that the students achieve the accomplishment of 60% to 70% in all the \"obligatory disciplines\", plus the supervisioned and approved training period (like a supervisioned internship period), the final thesis of the course and in some BSc. the final exam test. The final exam also is required so far. To be able to be a Professor, a Bachelor of Sciences is obligate to get a Licenciature degree, which lasts on top of the periods already studied until getting the BSc. (Hons), more 2 to 3 periods (1 to 1. 5 years). With a master[.] degree (MSc) is also possible, which takes 3 to 5 periods more (1. 5 to 2. 5 years more)."}