{"doc_id": "1170", "name": "2017_04_humanities_student_major_2332_anime", "namespace": "we1sv2.0", "metapath": "", "pub": "anime", "title": "2017-04-humanities-student-major_2332_anime.txt", "pub_date": "2017-04-20T00:00:00Z", "Sentiment": "0.077", "Subjectivity": "0.357", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "458", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgjekem", "Reddit_id": "dgjl8vz", "Subreddit_id": "t5_2qh22", "Commenter": "MegamanZen", "length": "2662", "content_scrubbed": "Study abroad and how it fits into your major really depends from university to university. I'm a computer science student (at UT Austin for any one that does care) and it[.] very rare for CS students here to manage to fit a liberal_arts study abroad program into their degree. CS study abroad programs are mainly at European countries for us. You should see if your university offers different tracks for your major as some may allow for more liberal_arts courses like the BSA degree track at my University. Alternatively, if your university is blessed to have study abroad programs that give you actual credit for your degree (mine were basically electives and core requirements), then check out those.\n\nSome universities also have language requirements and reference requirements in order to study abroad. You should check your program website or as a study abroad advisor (not your academic advisor since they usually know nothing). For me, it[.] 2 semesters, and for those 2 semesters, I was just a good boy in class with perfect attendance so those professors gladly wrote my recommendation.\n\nYou'll typically have to plan a year ahead to actually study abroad. The application process is long, but during that time, you should do your best to apply for scholarships like the Gilman international scholarships if you're a us citizen and have financial need and take the time to work. In general, your current aid and easy to get study abroad scholarships should be more than enough. If you are not a US citizen, check and see if your country has exchange scholarships.\n\nWill 2 semesters be enough? No, not really. I had 3 semesters and it tended to be that I had to make an effort for 2 months in Japan before I even \"felt\" improvement in my Japanese. Try hard and make Japanese friends no matter what. If you want to reduce this transition, practice speaking as much as possible. See if you can meet exchange students at your university. There[.] nothing better than actually speaking with a Japanese person for practice aside from being in the country. Classes will pretty much get you to kindergarten level LUL\n\nFor preparing in general, since you're on r/anime, you might want loads of merch. Bring an empty suitcase or something. Aside from that, you might live in a place where it[.] more common to have air dried clothes so get used to crusty jeans. Also, if you prefer certain toiletries, bring extras. It[.] kind of hard to find your favorite bar soap and maybe strong enough stick deodorant. Also make sure to exchange money at your bank, and consider opening a bank account at either Capital One or Citibank to avoid annoying foreign transaction fees."}