{"doc_id": "1197", "name": "2017_04_humanities_student_major_2568_40klore", "namespace": "we1sv2.0", "metapath": "", "pub": "40kLore", "title": "2017-04-humanities-student-major_2568_40kLore.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.137", "Subjectivity": "0.559", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "276", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_670ijr", "Reddit_id": "dgmvia4", "Subreddit_id": "t5_2zdqr", "Commenter": "Ricky_Robby", "length": "1638", "content_scrubbed": "Humanity would be extinct in 40k if not for the Emperor. Humans are essentially under a single government right now, while that isn't true of all humans there are pockets that aren't under the Imperium[.] rule the vast majority are. \n\nA disjointed humanity could not possibly fight against all the threats that exist. Humanities best advantage is the ridiculous numbers it has over most factions, and to have those numbers a leader was necessary to pull them all together. This was the Emperor, arguably the best human to exist in history, granted he was extremely flawed, but that is just more evidence of his humanity. \n\nThe idea the better leaders would have spawned is possible, but not one that would surpass Him or his children, as fucked up as they were/are. However that being said humanity has created great heroes after the Emperor presented him self to the Galaxy. Countless people have risen as legendary figures in service to humanity. \n\nBack to my original point, the non imperium humans would at best be similar in scale, unlikely tech, of the Tau. There would be numerous factions of humans battling each other, Chaos, and Xenos. This would ultimately spell their doom. The Tyranids would run all over them, Necrons would run through them, the Orks would slaughter everyone, Chaos would pillage through civilization after civilization, and the Tau would be a lot more stable in the galaxy. \n\nBut the most important reason the Emperor is needed is that the Astartes wouldn't exist without him. \n\nWhat is Warhammer 40k with no space marines, non universal hate of Xenos, and no fanatical worship. Can we all say blam please? "}