{"doc_id": "523", "name": "2017_10_humanities_student_major_2882_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-10-humanities-student-major_2882_ApplyingToCollege.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.236", "Subjectivity": "0.311", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "230", "Permalink": "http://reddit.com/r/ApplyingToCollege/comments/79kqis/im_a_junior_at_duke_ama/dp30547/", "Threadlink": "http://reddit.com/r/ApplyingToCollege/comments/79kqis/im_a_junior_at_duke_ama", "Parent_id": "t1_dp2yqym", "Reddit_id": "dp30547", "Subreddit_id": "t5_2y2r8", "Commenter": "waitwhatever", "length": "1313", "content_scrubbed": "Yeah, I would agree with your assessment that Duke is very focused on the pragmatic- from engineering and math to finance or politics, it[.] all about developing your skills in your chosen field, and ultimately, going on to success in that field.\n\nBut, I don't think that means we can't be humanistic as well. Some of my courses in English have, and I don't believe I'm exaggerating, changed the way I look at the world and my place in it. There[.] a lot of room for insightful discussion, and I've had more than a few conversations stretch into 3-4 am on topics ranging from utopia, free will, equality, imagination, computer science, music, sports, and so much more. It[.] just such a rewarding intellectual community to be a part of.\n\nHowever, that could be said on almost any school, I think. These kinds of discourse happen at Columbia and at Harvard and Yale and Stanford and Arizona State and Southern Illinois. I don't really believe that any one school represents the perfect fit with any person- you can find a home anywhere you look.\n\nSo I suppose my response to your conjecture is that you're right, but you're also not. Duke is focused on the pragmatic. But every school is focused on the pragmatic. Duke is a wonderful place for the humanities. But most schools are wonderful places for the humanities."}