{"doc_id": "457", "name": "2017_10_humanities_student_major_2236_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_2236_AskReddit.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "-0.011", "Subjectivity": "0.4", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "419", "Permalink": "http://reddit.com/r/AskReddit/comments/78ca8z/college_studentsfacultystaff_how_prevalent_really/dospmto/", "Threadlink": "http://reddit.com/r/AskReddit/comments/78ca8z/college_studentsfacultystaff_how_prevalent_really", "Parent_id": "t3_78ca8z", "Reddit_id": "dospmto", "Subreddit_id": "t5_2qh1i", "Commenter": "fall17account", "length": "2396", "content_scrubbed": "Ok, so I think I'm pretty qualified to answer this. I'm a 5th year student who has been in the college of engineering and the college of liberal_arts at a medium sized conservative-leaning southern state school. I've been far left politically, and now I'm pretty much like.. mid-right. Not far right, not center right, but halfway between. so I've had all the perspectives on it.\n\nHonestly, day to day, it[.] a conservative myth. You barely, barely, barely see it most of the time. I mean, safe spaces are basically every prof[.] office, and there[.] a sticker on the door indicating the same, and I guess they had to waste an afternoon learning about misgendering and such. Oh well, they get paid $$$ so they can deal with some stupid corporate CYA stuff. I've never experienced a classroom that was a \"safe space.\" I've taken a class about Nazi Germany and had the professor steer students away from comparing the regime to the Trump administration, which I guess now that I say it out loud... little victories, guys, little victories. At least they are *discouraged* from literally comparing the fucking PRESIDENT to god damn *Nazis.* it[.] sad that that[.] a victory but it is\n\nTrigger warnings? Never seen 'em\n\nLiterally all of this stuff outside of liberal_arts classes? Nope. Election Day last year I was an engineering major and the extent of it was profs wearing \"I Voted\" stickers and some folks wearing MAGA hats and me wearing a Clinton shirt (I've seen the error of my ways, guys!)\n\nNow, yeah, in liberal_arts classes, there[.] always *those students.* I know maybe... 4 or 5, across all my classes, who will allllways bring up some SJW bullshit, but it[.] rare. And I think they're mostly universally despised. If not for the politics, for stuff like eating chips in class and then just throwing the wrapper casually on the floor (this girl does that EVERY CLASS)\n\nNow, with that being said, did classes get cancelled the day after the election at my sister[.] large SEC school so students could grieve? Yep\n\nDid Antifa descend on my campus and burn cars and hospitalize people? You betcha\n\nDid participants from the protest speak up in class the next day and say part of why they were so angry was that the protests were too quiet, the person whom they were memorializing was a radical anarchist and would've wanted violence? Of course\n\nSo it gets crazy sometimes, but usually, it[.] a myth"}