{"doc_id": "1238", "name": "2017_04_humanities_student_major_2981_masseffect", "namespace": "we1sv2.0", "metapath": "", "pub": "masseffect", "title": "2017-04-humanities-student-major_2981_masseffect.txt", "pub_date": "2017-04-26T00:00:00Z", "Sentiment": "0.041", "Subjectivity": "0.406", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "327", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67okgc", "Reddit_id": "dgsb4z0", "Subreddit_id": "t5_2rc19", "Commenter": "Eurehetemec", "length": "1997", "content_scrubbed": "Some of your points are totally valid, particularly that TIM wasn't on the arks. However, this one - and it[.] not just you has said it, doesn't make sense for TIM:\n\n It makes no sense, if he/Cerberus funded it! They were Pro human, pretty aggressively Pro human to the point of being anti alien.\nConsidering the Andromeda Initiative arks were build in human space, if it was Cerberus/TIM, why would there be an ark assigned to each major race?! Why not 100,000 humans on the 5 arks rather than only 20,000 on one? If this was Cerberus funded this fact alone makes NO SENSE!\n-The massive cost involved with each Ark would NEVER be spent for other races benefit\n-Humanities eggs were all put in one (ARK) basket, rather than being spread amongst five baskets. Considering Cerberus stand point on human domination and survival this makes no sense\n-The entire Andromeda Initiative leadership would be made up/dominated by humans, not a mixture of Salarians/Asari/Krogan/Turian.\n-Pathfinders from different races again makes no sense, this would be Cerberus ACTIVELY empowering alien races to be independent and strong?!\n\nCerberus supposedly were ultra-pro-human. However, having played ME1/2/3, they clearly aren't anywhere near as extremely pro-human as people suggest. In particular, TIM clearly isn't. He[.] \"humans first\", but that[.] literally no different to the Asari, Salarian, or Turian governments, which all put their own species first.\n\nHe[.] perfectly happy to work with a wide variety of races, and to do things that benefit those races. Only once he[.] been Indoctrinated does he go beyond that, into nuttier territory.\n\nSo I agree that it[.] probably not Cerberus/TIM, but helping aliens alongside helping humans is not a good reason to claim that. TIM has always been fine with that. He never criticises Shepard for helping aliens out alongside humans.\n\nI would also say that I think people who assume that the Benefactor is on the same side as whoever killed Garson are probably mistaken."}