{"doc_id": "473", "name": "2017_10_humanities_student_major_2411_yorku", "namespace": "we1sv2.0", "metapath": "", "pub": "yorku", "title": "2017-10-humanities-student-major_2411_yorku.txt", "pub_date": "2017-10-25T00:00:00Z", "Sentiment": "0.028", "Subjectivity": "0.316", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "603", "Permalink": "http://reddit.com/r/yorku/comments/78k2hl/question_are_there_any_conservative_or_more/dov8qzd/", "Threadlink": "http://reddit.com/r/yorku/comments/78k2hl/question_are_there_any_conservative_or_more", "Parent_id": "t1_douqhot", "Reddit_id": "dov8qzd", "Subreddit_id": "t5_2s8jd", "Commenter": "Lamter", "length": "4218", "content_scrubbed": "Maybe you are incorrectly tying the idea of conservatives to anti immigration? Even then it is a huge leap from anti immigration to white nationalist.\n\nI guess my initial assumption was correct... \n\nOk, let me show you how you're making huge assumptions to go from - asking for a more conservative opinion, to - white nationalism. \n\n**OP asks for a broader political perspective in his education**; I personally agree that liberal_arts is filled with much more left_leaning professors due to just the nature of what you're learning. **Based on this, you assume that OP is a conservative** \nMaybe he is? Maybe he just wants to be more educated about politics? Graduating having only heard of one side of the story and getting crushed when you get into the real world like most liberal_arts students do is likely because of their lack of broader education. [Look at this video, whether you agree with Shapiro[.] points or not, you can see how unformulated these liberal art student[.] opinions are and how it[.] likely this is the first time anyone has ever challenged their opinions](https://www. youtube. com/watch?v=aoSv7Tr19S8). Dumb asses can't even argue transgender rights. Do you know why? Because they assume that conservative beliefs are white supremacy and stick their fingers in their ears and scream \"LALALALALALALAL\" like someone else in this thread does. \n\n**Then you link the idea of conservatism to anti-immigration** There are MANY other reasons for people to chose to believe conservative view points. There are taxes, social services, market regulations etc. But fuck all that right? Anyone who is conservative MUST be anti-immigration!\n\n**Lastly, you're trying to link the idea of anti-immigration to racism/white supremacy** There are some with views that immigration fucks with the country[.] national identity, which is what you likely believe to be the only reason against immigration. I'm here to tell you that there are a host of other reasons why people might be anti-immigration!\n\n1) The country might be trying to save money to improve standard of living for their current residents. [Danish[.] strict immigration laws have saved the country plenty of money](http://www. spiegel. de/international/europe/putting-a-price-on-foreigners-strict-immigration-laws-save-denmark-billions-a-759716. html). I'm not saying if this is fair/worth it, but there is clearly evidence that anti-immigration views in this case is not linked to racism but rather saving money. \n\n2) According to [this study](http://discovery. ucl. ac. uk/14315/1/14315. pdf), low-skilled workers can have a reasonable argument against immigration that likely doesn't arise from racism. The study says: \n\n\"Thus, a simple hypothesis of economic self\ninterest suggests that lower-skilled workers will be opposed to inflows of low-skilled\nimmigration (Scheve and Slaughter, 2001). On the other hand, high-skilled workers and\nemployers tend to gain if relative wages of less-skilled workers are bid down, suggesting\nthat these groups will be in favour or less-skilled immigrant inflows.\"\n\nThe study does mention that the effects are likely insignificant but \"lower-skilled workers could oppose immigration based on the **belief** that it will lower their economic opportunities.\" See, how it[.] not white supremacy, but people acting on their own self-interest. Again, not saying whether is fair/right, that[.] a whole other discussion.\n\n3) Opinions against/for immigration could also be related to religion. This isn't just a \"white nationalist\" thing. It[.] a natural phenomenon that happens because of how humans work. See [this study](https://www. cambridge. org/core/journals/political-science-research-and-methods/article/brother-or-burden-an-experiment-on-reducing-prejudice-toward-syrian-refugees-in-turkey/3801D8A794F0EE37A7528ABD677F33CA). It highlights the prejudice of Sunni vs Shia Muslims towards each other. You could argue that this is \"racist\" but in reality, every single fucking person will favor those they feel closer to themselves. You'll likely favor your family over my family any day regardless of if your family is black/white. \n\n**Tldr; wanting to have broader perspective in education does not equal white supremacy.**\n\n\n\n"}