{"doc_id": "285", "name": "2017_10_humanities_student_major_478_exmormon", "namespace": "we1sv2.0", "metapath": "", "pub": "exmormon", "title": "2017-10-humanities-student-major_478_exmormon.txt", "pub_date": "2017-10-06T00:00:00Z", "Sentiment": "0.073", "Subjectivity": "0.328", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "280", "Permalink": "http://reddit.com/r/exmormon/comments/74o8j3/cement_and_bom/do03xz3/", "Threadlink": "http://reddit.com/r/exmormon/comments/74o8j3/cement_and_bom", "Parent_id": "t3_74o8j3", "Reddit_id": "do03xz3", "Subreddit_id": "t5_2r0gj", "Commenter": "NearlyHeadlessLaban", "length": "1676", "content_scrubbed": "Something to think about is that from our perspective there is a huge technological gulf between us and first century technologies.  \n\nFrom a late 18th century perspective the technological gulf is not large.   There had been a scientific revolution, but that had little effect on the day to day life of common people.  It was probably much easier for late 18th and early 19th century story tellers to imagine that life in the first century was much like life as they knew it, that the things familiar to them were also familiar to first century.\n\nStudents of the arts know that you can actually see this perspective in the work of some artists who depicted ancient biblical scenes with European buildings and European clothing styles as though there had been virtually no advancement in the way people lived.\n\nIn the early 19th century a young author would be expected to make similar mistakes.  If we make that our theory, then use that theory to predict what kind of mistakes an author might make in producing a book about an ancient society where no archeological knowledge existed, what mistakes can we predict?  Mistakes such as transoceanic vessels. Black smithing.  Concrete production.  A fungible monetary system.  Fine linens and silks.  Widespread commerce of heavy goods such as timber shipping.  Farming, crops and methods.  Weapons.  Transportation.  \n\nFinding that those predicted mistakes do exist in the author[.] work supports the theory, and the more mistakes we find the more the theory is supported that the book is the work of the 19th century author and not the work of an author that actually lived in the ancient time about which the book is written.\n"}