{"doc_id": "469", "name": "2017_10_humanities_student_major_2363_classicalmusic", "namespace": "we1sv2.0", "metapath": "", "pub": "classicalmusic", "title": "2017-10-humanities-student-major_2363_classicalmusic.txt", "pub_date": "2017-10-24T00:00:00Z", "Sentiment": "0.015", "Subjectivity": "0.205", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "272", "Permalink": "http://reddit.com/r/classicalmusic/comments/78kikp/a_rant_about_classical_music_and_race/doumtnh/", "Threadlink": "http://reddit.com/r/classicalmusic/comments/78kikp/a_rant_about_classical_music_and_race", "Parent_id": "t1_doum8hi", "Reddit_id": "doumtnh", "Subreddit_id": "t5_2qhyq", "Commenter": "TheStarryForest", "length": "1681", "content_scrubbed": "1) I grew up on the largely rural east coast of Canada. In my family, \"normal\" was playing the spoons, harmonica, fiddle, piano (to accompany fiddle at first, classical came afterward), later on mandolin, brass instruments, pipe organ... plus either U_S country music or western classical music on the radio. Yes, it was either Loretta Lynn or Glenn Gould, and that was western and \"normal.\" Normal encompasses many regional, ethnic and class differences in the western world, obviously. One brother went to university for a music degree, and learned the \"native\" music and instruments of 17C-19C western Europeans.\n\nNever assume that your own background is a default norm for the other 1 billion people in the Americas, or the 750 million Europeans... all \"western\" I guess?\n\n2)  If someone is a 20-something white American, they've grown up with all sorts of musical and cultural influences, which undoubtedly would inform their approach to music. Tendency to emphasize the back beat? U_S mainstream pop music influence. Etc.\n\nBooking agents: the issue there appears to be commercial, a racist business conundrum... not an artistic matter so much. Marketing. Fact of life in the arts and entertainment field. It[.] unfortunate and unfair, perhaps, but you need to be creative to find a way to get around that obstacle. You have to be up front about the fact that you appear unconventional as a classical Middle_Eastern/Asian musician. There[.] just no way around that. Also, you've said that your range in instruments goes beyond major regions... Persian music, Chinese, etc., that[.] quite a broad scope. It[.] unusual, not that that[.] a bad thing at all... just unconventional.\n\n"}