{"doc_id": "985", "name": "2017_04_humanities_student_major_599_srssucks", "namespace": "we1sv2.0", "metapath": "", "pub": "SRSsucks", "title": "2017-04-humanities-student-major_599_SRSsucks.txt", "pub_date": "2017-04-06T00:00:00Z", "Sentiment": "0.12", "Subjectivity": "0.384", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "362", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfwzcq0", "Reddit_id": "dfx18dz", "Subreddit_id": "t5_2uuwv", "Commenter": "garybuseysawakening", "length": "2083", "content_scrubbed": " Well I doubt the \"smarter\" part but that depends a lot on how you define being \"smart\". You may be smart in maths or science but that doesn't mean you're intelligent.\n\nNo, it really means you are. The average IQ difference of a  computer science major compared to a psychology major is a full standard deviation. Again, 'not necessarily' true for any one individual, but I don't want to pepper this post anymore with pointless banalites like this.\n\nJust look on Reddit, a lot of people who aren't children are allegedly in stem and yet they're unaware of most things\n\nWhat, pray-tell, are they unaware of? This comes across as a dogwhistle. \n\nThey aren't inherently smarter than people choosing liberal_arts and to believe such a thing is quite problematic.\n\nNo, but they typically are more practical. \n\nNot everyone can be good at something, I know many stem grads who would not be able to do law or English and similarly I know law grads who won't be able to do maths so it[.] not a question about who is smarter and who isn't because you can't measure intelligence like that so you aren't smarter for choosing stem over a liberal_arts degree.\n\nGiven what modern \"English\" degrees are, it more-often-than-not is a matter of drive or not blowing your brains out. \n\nI know law grads who won't be able to do maths so it[.] not a question about who is smarter and who isn't because you can't measure intelligence like that\n\nIQ is a damn good measure, far better than the standards of practically all of popular sociology--especially social sociology--and as I said above, what majors one picks is a pretty apt proxy to determine it. \n\nLet[.] say we have a group of people who can either choose English or Engineering, it doesn't meant that going into engineering would mean they're more intelligent, it just means they chose a different path.\n\nRather relativistic. It doesn't 'just' mean they chose a different path, the difficulty curve required Engineering is far more steep. An English degree in the modern day is just an alias for a Communication degree with some Derrida thrown in. "}