{"doc_id": "364", "name": "2017_10_humanities_student_major_1270_kanye", "namespace": "we1sv2.0", "metapath": "", "pub": "Kanye", "title": "2017-10-humanities-student-major_1270_Kanye.txt", "pub_date": "2017-10-13T00:00:00Z", "Sentiment": "0.101", "Subjectivity": "0.304", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1601", "Permalink": "http://reddit.com/r/Kanye/comments/75r499/what_is_kanyes_most_lyrically_meaningful_song/dobsvzs/", "Threadlink": "http://reddit.com/r/Kanye/comments/75r499/what_is_kanyes_most_lyrically_meaningful_song", "Parent_id": "t1_doboceo", "Reddit_id": "dobsvzs", "Subreddit_id": "t5_2r78l", "Commenter": "WatchingTheThronePod", "length": "8973", "content_scrubbed": "How much do you know of Kanye[.] background? \n\nKanye has a fine arts background. As a kid, he used to win painting competitions and awards. Not usually discussed, but he dropped out of college twice. The first time was The Academy of the Arts in Chicago where he had a scholarship for painting. \n\nHis mom was chair of the English department at Chicago State and taught literature, meaning Kanye had a mom whose entire career centered around the analysis and deconstruction of novels. If you've taken an English class, then you know a major emphasis is on studying the subtext of the novel. Identifying themes and motifs. Reading between the lines. So Kanye had a mom who did that shit for a living. They obviously had a close and happy relationship. He was making art and writing stories as a child. It[.] silly to think given her presence in Kanye[.] life and career that she wouldn't instill that kind of artistic appreciation in to her son who was so actively creating art. My mom was a biology professor with a PHD in animal behavior. I know a shit ton more about biology and animal behavior than the average person does simply because of that. \n\nKanye[.] dad? A journalist. Kanye would spend summer[.] with his dad, a lot of them in DC. Their favorite thing to do was to go to art museums. They'd go to multiple museums in a week and look at the art, study the art, talk about the art. If you've ever been to a museum, then you know that almost every piece there has a little information card with it that details all the subtext of the work. How this color represents this idea. How this characteristic is a metaphor for this grand philosophical topic. Almost all art in a museum is admired not just for technical skill but for the nuance of its aspects. \n\nNuance is really the differentiating factor between mainstream creations and those that are deemed more \"artsy\". \n\nLook at movies. Star Wars is one of the most beloved movies ever made, it has mass appeal. But it[.] isn't exactly \"art\". That[.] because there[.] a lack of nuance. It[.] a superficial story. Same with the Fast and Furious movies. Or any blockbuster, really. That[.] because the more nuanced it becomes the easier it is to lose viewers who aren't versed in identifying or interpreting nuance. \n\nHand anyone a copy of Harry Potter and they could start reading it and know exactly what is going on and why. You get plenty of exposition that tells you how you should be feeling and what[.] happening. Millions and millions of people had no issue reading all seven HP books. Hand those same people a copy of Infinite Jest, they might make it three pages before feeling overwhelmed. How many would actually grit through all 1,100 pages? How many would not just finish but understand what happened? How many would not just finish and understand why happened but also know enough about writing to explain the styles and techniques of Foster Wallace?\n\nAgain, we can go back to movies and their popularity. Most people really enjoy the intensity and cat and mouse game of No Country for Old Men. That[.] why it was such a popular movie. But ask most people what the end of the movie means and they will blink and say they don't know, it[.] confusing. That[.] because most people aren't trained in translating the nuance of the ending and unpacking what[.] being said. \n\nHave you ever seen the doc FADE TO BLACK about the making of Jay-Z[.] The Black Album? There[.] a scene where Kanye, all the way back in 2003, pre CD days, plays Jay the beat that would become Lucifer. As Ye[.] introducing the beat, he tells Jay that the track is like a scene from a movie. That instead of this being The Black Album that he should think about it as The Black Movie. That the music is just a score to a movie scene. \n\nThat[.] pretty huge. Kanye, even way back then, is looking at albums as movies. As the individual tracks as scenes in a movie. As the music as a crucial component for the story that[.] being told. This is when he[.] still a young artist who hasn't even made an album yet. \n\nDo you know how long it generally takes to \"master\" a skill? 10 years. So say Kanye had just started thinking about how to make an album that[.] like a movie. We would expect that, 10 years later, he'd be pretty successful at that.\n\nSeven years later, in 2010, as Kanye would have been close to mastering this skill, he released MBDTF. What did we see with MBDTF? Kanye used the album to make the movie Runaway, where the album tracks act as a score for the movie itself. The album also uses a similar structure to The Wizard of Oz, where the opening tracks take place in reality before we descend into a fantastic new world (the All the Lights interlude is the equivalent of the tornado that sweeps Dorothy away). \n\nObviously Kanye was still thinking about the relationship between movies and albums and the idea of making an album a movie. \n\nIf you've read interviews with the famous artists George Condo or Vincent Desiderio, they both talk about how knowledgable and perceptive Kanye is. Desiderio went so far as to say that talking with Kanye felt like talking to a peer. \n\nSo if we look at Kanye[.] background... it[.] the background of someone who would have been well aware of artistic nuance. He demonstrated enough artistic nuance in his own youthful creations to win prizes and awards. We have evidence of him talking about albums being cohesive wholes that tell a story. We have first-hand accounts of accomplished artists saying that Kanye is knowledgable about the craft of art in such a way that he felt like a peer. We have every reason to suspect that Kanye is as capable of putting artistic nuance into his work as any of the millions of other artists who have done so over the centuries. \n\nThen you have me, personally. I've been writing poetry for 16 years (since I was 14). I've been writing fiction for a decade. I've had a novel published and my second comes out this December. I have an English degree from a top 30 college, where I focused in creative writing. I had a creative writing scholarship that I won. I've taken private writing workshops. I attended summer classes at the Iowa Writer[.] Workshop. One of the professor[.] I had at the Writing Workshop worked with me, in private, for a year. I've a dozen books on narrative structure and the art of writing. I started a film analysis site with zero connections to the film industry, filmmakers, or the news industry. My analysis of films was good enough that I built an audience that was large enough to get me industry credentials to the Toronto Film Festival. Then press credentials to Sundance. I've been a working film critic at Sundance, SXSW, Toronto, and a bunch more. I've consulted on films. For three years, I was the head fiction editor for the online literary journal Red Fez. I interview filmmakers. I interview writers. I know filmmakers. I know writers. My entire life revolves around art: assessing it, creating it, discussing it. \n\nSo I'm looking at Kanye[.] work having all the information I have about Kanye. Having all the information I have about writing, art, etc. And this is my assessment based on qualified expertise. I provide examples for everything I state so as to present a solid, logical argument based on an accurate knowledge of artistic systems and how those systems are made. I'm not just making some generic, overblown statement that has no foundation. Like, \"Pablo is Kanye commenting on Schrodinger[.] philosophies.\" When there[.] no mention of Schrodinger. No evidence of Kanye ever having mentioned Schrodinger. And this being in direct conflict with Kanye himself saying on Twitter that Pablo referred to Paul the Apostle. That it was a gospel album. He even referenced in an interview that he thought of the transformation of Mary to Mary Magdalene—prostitute to saint. \n\nAnd none of this is to say that I'm right. I could be really fucking wrong and way off the mark. Kanye himself could read this and say, \"What the fuck? No. None of that is right.\" \n\nI'm just telling you that it[.] coming from a knowledge rather than just random fandom. We've done deep deep line by line analysis of 70 Kanye tracks. We could sit together over some beers and I could take you album by album through his discography and show you his development as a narrative artist. \"Look, he made these choices on College Dropout, but now look at what he[.] doing on Late Registration. So how he[.] moved to more of a traditional three-act structure? Now look at how he[.] doing that same thing on Graduation but outside the individual track, how he[.] doing it with a group of tracks.\" And on and on. If I wasn't able to make arguments for Kanye being this kind of artist, I wouldn't make them. I wasn't a fan of Kanye and decided to ascribe to him this kind of artistic godhood. I'm a fan of Kanye because he[.] this kind of artist. \n\nWith that said, if you have counter points to any of the theory of Wolves. I would love to know what your counter points are. "}