{"doc_id": "1044", "name": "2017_04_humanities_student_major_1132_ukpolitics", "namespace": "we1sv2.0", "metapath": "", "pub": "ukpolitics", "title": "2017-04-humanities-student-major_1132_ukpolitics.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.125", "Subjectivity": "0.374", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "422", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg341ac", "Reddit_id": "dg35hma", "Subreddit_id": "t5_2qhcv", "Commenter": "Xiathorn", "length": "2422", "content_scrubbed": "Factory workers do dirty jobs that nobody else wants to do to offset their lack of talent. Some of them actually are talented and achieve well, despite a lack of education.\n\nHumanities students don't do dirty jobs because they feel they're entitled to more, because they **think** they are in a superior social and economic position. They're not. It[.] almost impossible to maintain a decent social position when you're subjected to HMO on minimum wage, with no prospects of advancement because you refuse to engage with the employer, believing yourself somehow 'above' them.\n\nAnd as for your friends - no, I'm sure they didn't expect to achieve fame and fortune, but tell me - what *did* they expect to achieve? Every kid who went through Blair[.] '50% to university' drive had a careers advisor. They'll have all been told the same thing. They thought they were special and they'd escape the mold, and now that they haven't they're whining about it. **What did they think was going to happen?**\n\nSo yes, the best thing to do with these people is to accuse them of self-importance, to drum into them what they should have picked up on years ago - they're not good enough to stand out, and in the Arts you either stand out or you're a nobody. Pursue it as a hobby all you like, that[.] admirable, but don't turn your nose up at the only avenue of economic prosperity you have left - working-class jobs.\n\nFortunately, those who came from a poorer background are less likely to shirk those rougher, less attractive jobs and will ultimately pull themselves up. They could have done better if they'd picked something more lucrative, but you're right - compared to where they came from, it[.] a win. That same lack of expectation is what will enable them to knuckle down and pull themselves out of the hole that is a wasted degree.\n\nI have no sympathy for those who came from backgrounds that were comfortable, but couldn't rely upon a life of abundance and leisure. They were told, and they pretended they were special. They're not.\n\n(Oh, and as for your expectation of market correction regarding STEM - the shortage of *good* STEM graduates is acute, but there[.] plenty of middling and poor STEM graduates. They still get paid better than an English Lit grad. Even if the numbers were inflated, all that would happen is the UK productivity would skyrocket and we'd have more money to spend on things like *gasp* cultural works.)"}