{"doc_id": "1195", "name": "2017_04_humanities_student_major_2543_childfree", "namespace": "we1sv2.0", "metapath": "", "pub": "childfree", "title": "2017-04-humanities-student-major_2543_childfree.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "0.073", "Subjectivity": "0.31", "Score": "52", "Upvotes": "0", "Downvotes": "0", "Wordcount": "604", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgmm1sp", "Reddit_id": "dgmn1zv", "Subreddit_id": "t5_2qtwb", "Commenter": "LilacUnicorn66", "length": "3591", "content_scrubbed": "I would speak with someone who[.] experienced with low-income and dysfunctional families.  If the counselor can do this, then that[.] a good choice.  However, high school counselors can be pretty stupid, too, so bear that in mind.  \n\nAs for Uni, a couple of things:\n\n1. Research the programs and school catalogue until you know it well.  This will help your tutors and counselors advise you without mess.  I don't know which uni you're attending, but larger schools are notoriously hard for incoming students because you're just a number until your final two years. \n\n2. Declare one major (or better yet, two) and explore other skill certificates.  This is true for Australian and Canadian universities.  But for British universities, since you're normally limited to a program in either natural science or humanities, choose a major that interests you and has a good starting salary at graduation or at the end of a Master[.].  Computer Science or Engineering are very good options.  If you're looking at humanities, try to take some computer or graphics design courses to make you more marketable.  Since money is a concern for you, you're better off researching classes and getting on track from the first year.  \n\n3. Limit the \"drama\" factor.  I can't stress this enough and most unis won't address this in fear of pissing off the parents.  You're not alone in having a shitty family.  In my ten years teaching, I've had at least one student in every class with a dysfunctional family.   I doubt this is unique.  Unfortunately, they tend to be high-risk, mainly because of the control factor.  Like your mum and sister, they control the student (you) so that you *won't* become independent.  Go to the library and *start reading anything and everything.*  If your program has sample syllabi/course programs, start reading the textbooks.  Your education will start a year early and not a year late.  Get a routine; after school, library.  Also, do you exercise?  If not, start walking and/or running.  This is something you need to learn, too.  Uni is stressful and you need a way to relax.  Additionally, your home life is a stressor; exercise helps you find a positive outlet for all of that shit.  These little things are free *and* help you manage your own time.  This is lesson #1 for independence.    \n\n4. Go out and hang with like-minded people.  Meetup is worldwide; join a language group or an activity.  Joining is free and is a great way to meet other people outside of your situation.  I get that you're an introvert -- I am, too -- but you *need* healthy human contact, especially now.  My concern is that you've become isolated to the point where dysfunctional has become normal.  Believe me; your family[.] actions aren't normal or healthy.  \n\n5.  Eventually, you *will* need to find work. This is a more American belief, but I think it[.] the_right one.  Work can give you value, aside from paying the bills.  It gets you productive and it forces you to engage others in a way that is *not* your family.  The reason why I suspect you have difficulty relating to others is because you've learned a particularly fucked up dynamic at home.  Insane = normal.  You've learned to cope by isolating yourself, protecting that little bit of who you are.  However, speaking from personal experience, there will come a time where it will backfire dramatically.  Learning to deal with shit now will help you escape this trend of irresponsibility later.  You have a good head on your shoulders, so don't let their crazy manipulate your inclination that this is a bad situation.  \n\n "}