{"doc_id": "1065", "name": "2017_04_humanities_student_major_1326_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_1326_AskReddit.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.131", "Subjectivity": "0.407", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "419", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg5ijdv", "Reddit_id": "dg5k6j4", "Subreddit_id": "t5_2qh1i", "Commenter": "jralha", "length": "2261", "content_scrubbed": " you also learn it[.] one of the easier jobs you'll ever have in life.\n\nEh... College was a lot harder for me than any positions I took after (or during), even my current position as a paid masters student (research grant).\n\nBut then again, undergraduate degrees down here in Brazil seems to be a lot more hardcore than in the USA/Europe. My major is Geology (in one of the top 3 universities in the country), it[.] a 5 year major and it[.] pretty much accepted that unless you're one of the top 3~5 students in class you'll fail a few classes and need an extra year to graduate, which I did. I graduated with a 6. 2 grade (passing grade is generally 5, with a few courses being 7) and I was still above average and got into grad school easily, the top student in my class graduated with an 8. 0 grade (Which is why the GPA system seems completely crazy to me).\n\nCollege for me was 6 years of having 35+ weekly hours of classes (I've got a few semesters with 50+), plus having to study for those classes and complete assignments. It was a huge pain in the butt, specially considering a lot of the classes, even if interesting, felt like they contributed nothing to my development as a geologist (Nod to my Physics 301 course, which thought me nothing about magnetism and a lot about building circuits). To add to it, some of the harder classes (Like this Physics 301 class) have a ridiculous fail rate, the first time I took that Physics class (and failed), 89% of the students also failed. To top it all off, you're not even getting paid (at least our best universities are publicly funded, so I didn't graduate with debt).\n\nMy work experience has been, get in, work, get out, get paid, not needing to worry about catching up to content or exams is nice.\n\nMy current position as a researcher requires me to take less than 10 credits each semester (one or two classes at most), can work on my research whenever I want. All in all, I have shit tons more free time now than I ever did as an undergrad.\n\nIt[.] pretty much accepted in Brazil that college will be some of the hardest years of your life if you go to a good college (the shitty ones don't care) and your major is in any science or technology related field (Humanities, even Law, are considered pretty easy)."}