{"doc_id": "915", "name": "2017_04_humanities_student_major_23_todayilearned", "namespace": "we1sv2.0", "metapath": "", "pub": "todayilearned", "title": "2017-04-humanities-student-major_23_todayilearned.txt", "pub_date": "2017-03-31T00:00:00Z", "Sentiment": "0.117", "Subjectivity": "0.534", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "365", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfoknzv", "Reddit_id": "dfomlq5", "Subreddit_id": "t5_2qqjc", "Commenter": "Zomnomnombeezy", "length": "2106", "content_scrubbed": "This is absolutely true, and leads into a major misconception about homeschooling. Parents do not teach a child based only off of what they know. The parent (hopefully) instills a love of learning, a passion for the arts, and positive social coping mechanisms while utilizing the resources necessary to educate in any and all areas the child needs. Enrolling in dance, art, music, purchasing WONDERFUL curriculums (ideally state funded) that the child would otherwise have no way to explore, or purchasing different books that explore history and reading them at night, are all ways to teach your child. There are experts in all areas, so help your child get involved with them to learn from someone passionate in their field. If math is just not your thing then find a tutor, who will happily help your kiddo progress at their own level. I realize some people unfortunately don't do homeschooling well and provide a very poor education for their children- that sucks, but that doesn't mean that homeschooling in general sucks. It can be faaaar better for a family then public school. No rush and yell scenario every morning, or learning how to behave socially from a group of crazy, sugar eating children who, quite frankly don't have the best social skills (yes, I'm talking about many kids in public school. I teach about 70+ kids and the ones who are homeschooled are by far the most adept socially.) This was longer than I had hoped but basically, you don't have to know everything! You just have to have a passion for helping your kid achieve all they can in this world. In my opinion that is the most important \"credential.\"\n\nTl;dr : Homeschooling is about giving your kid the best tools possible for the best life long education and love of learning, it has nothing to do with being their only teacher, and using only what you already know. Also stupid people will always do stupid things, and they do not reflect the reality of most any subject, they are simply a bad stain on an otherwise beautiful sofa. The sofa doesn't  suck, Greg does, for always fucking spilling things. Don't be like Greg. "}