{"doc_id": "234", "name": "2017_10_humanities_student_major_74_paranormal", "namespace": "we1sv2.0", "metapath": "", "pub": "Paranormal", "title": "2017-10-humanities-student-major_74_Paranormal.txt", "pub_date": "2017-10-01T00:00:00Z", "Sentiment": "0.06", "Subjectivity": "0.455", "Score": "20", "Upvotes": "0", "Downvotes": "0", "Wordcount": "705", "Permalink": "http://reddit.com/r/Paranormal/comments/73jpam/monthly_discussion_urban_legends_all_hallows_eve/dnscgg8/", "Threadlink": "http://reddit.com/r/Paranormal/comments/73jpam/monthly_discussion_urban_legends_all_hallows_eve", "Parent_id": "t3_73jpam", "Reddit_id": "dnscgg8", "Subreddit_id": "t5_2qjxn", "Commenter": "mrs_mcfly", "length": "4075", "content_scrubbed": "The Grey Lady of Centre College\n\nCentre College, located in Danville, is one of Kentucky[.] oldest institutions of higher learning, and is consistently ranked as one of the top liberal_arts colleges in America. But for several months in 1862, the school was the site of nightmarish spectacle, as it was transformed into a hospital for wounded soldiers during the civil war.\n\nThe battle of Perryville was the only major battle of the Civil War fought on Kentucky soil. The climax of a planned Confederate invasion of Kentucky, Confederate and Union forces clashed at the small town about 12 miles east of Danville on October 1, 1862. In a single day of battle, nearly 7,500 men were killed or wounded.\n\nEven before the battle, Confederate troops had seized several buildings on Centre[.] campus. One of these, the building known as Old Centre, was put to use as a hospital for the many men who had fallen sick during the campaign. Young women from Danville were pressed into service as nurses. Old Centre was already filling with feverish and weary men. But it was after the battle that the real chaos began.\n\nOn October 2nd, wagonload after wagonload of maimed and bleeding Confederate soldiers began arriving in Danville and filling every room on every floor of Old Centre. The halls were heavy with the stench of blood, sweat, and vomit as the Doctors rushed from patient to patient. The air was filled with cries of screaming men, as Doctors performed crude amputations with no anesthetic.\n\nThe Chaos only deepened five days later, when Union forces arrived in town and expelled the vastly outnumbered Confederate forces. Old Centre emptied out, only to fill again with Union wounded. The same townswomen who had been tending only yesterday to Confederate forces now tended Union wounded.\n\nThe toll of human life continued to be collected. Parties of soldiers were stationed on campus with the sole duty of transferring the dead to Bellvue Cemetery for burial. Students, professors, and residents all left behind records noting the horrible sites, sounds, and smells of those days.\n\nThe Union army occupied Centre for several months following the battle, but according to campus legend a legacy of those bloody days can still be seen today.\n\nThe Grey Lady is a figure reported to have been seen numerous times in the vicinity of Old Centre. She is descried a wispy, transparent figure dressed in the heavy hoop skirts of the Civil War era. She is always seen around the grounds of Old Centre. Whenever she is seen, she always also appears to be in a hurry, rushing too or from the former hospital building, apparently on a mission of mortal urgency. Any attempt to intercept or run after her proves fruitless, as she instantly disappears.\n\nWho is this mysterious figure? The story says that she is the spirit of the daughter of a prominent Danville family. This kind and compassionate young woman volunteered to act as a nurse when the Confederate forces arrived. When the Confederates left, she voluntarily stayed to help the wounded Union soldiers, caring more about the humanity of the wounded young men than which side they fought for. She was beloved by both sides for her kindness to the injured and dying men.\n\nBut her compassion came at a price. Because of the unsanitary conditions in Old Centre, she soon caught a fever, but continued to tend to patients and run errands for the doctors, even though her own health was rapidly failing. It[.] said that she met her end running to town on one last errand for one of the Union doctors, when she collapsed at the edge of campus and died.\n\nIs this brave, compassionate soul still trying to help fallen soldiers? Does she run across Centre[.] campus trying to complete the vital mission she was sent on, even though those she sought to help are a long time gone? Centre students who see her say that when she passes by, they feel no fear, but only a great, overwhelming sadness. She is a respected part of life at Centre, the spirit of a woman who reached out to both sides with love and compassion in an awful time of war."}