{"doc_id": "1137", "name": "2017_04_humanities_student_major_1992_languagetechnology", "namespace": "we1sv2.0", "metapath": "", "pub": "LanguageTechnology", "title": "2017-04-humanities-student-major_1992_LanguageTechnology.txt", "pub_date": "2017-04-17T00:00:00Z", "Sentiment": "0.244", "Subjectivity": "0.391", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "409", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgemcsc", "Reddit_id": "dgepsy3", "Subreddit_id": "t5_2rkr2", "Commenter": "LeafAndBus", "length": "2564", "content_scrubbed": "I'll post any links I find interesting in the main thread.\n\nWhat does it take to get a job like mine? Hmm, that[.] an interesting question. I actually wasn't a CompSci major in undergrad, I was a Physics major. My company has people from very diverse backgrounds. In fact, about a third of us N-L-Gineers (lol) weren't CompSci majors in college. We have people with various science/engineering degrees, and one person actually has a liberal_arts undergrad and a masters in Fine Arts! As I think about it, we don't have a single CompSci PhD, but have several PhD[.] of other disciplines. Of course, that[.] not to say we wouldn't hire a CompSci PhD, or that getting one wouldn't help land you a job (because it certainly will).\n\nWe're no fly-by-night operation either, we were recently listed in the [Silicon Valley Pioneer 250](https://www. equities. com/news/westward-ho) and the [CB Insights AI 100](https://www. cbinsights. com/research-ai-100). \n\nEvery one of us has different things that they think are important, but to me the most important prerequisites to working in this (or any) field are:\n1) A track record of constantly challenging yourself intellectually and following through on *thoroughly* learning what interests you\n2) The ability to independently learn and apply complex material outside of a structured environment (like school)\n3) The ability to creatively solve problems that have no single right answer, and then explain your solution, the process that lead to the solution, and most importantly *why* you choose this solution.\n4) You have to not just be able to receive constructive criticism, but *seek criticism out*. It[.] about prioritizing any end results above yourself.\n5) Obviously, you have to have strong programming and/or linguistic skills. You can't just major in art and land a job in this area without any experience somehow, lol. I work with some **very** skilled programrs.  \n\nAs far as day-to-day work? Typically, we will work with product designers to come up with ideas to improve the NLG engine in ways that best benefit our customers. Then, we architect and design those improvements into the system a few at a time. Improvements range from, say, 'implement NP-only syntactic left-compression' to 'add the ability to use more than one adjective attributively'. Much of the time is spent thinking about how to best solve a problem, writing implementation proposals or discussions, writing code, and of course, reviewing and commenting on others' proposals, discussions, and code.\n\nLet me know if you have any more questions!"}