{"doc_id": "429", "name": "2017_10_humanities_student_major_1883_writing", "namespace": "we1sv2.0", "metapath": "", "pub": "writing", "title": "2017-10-humanities-student-major_1883_writing.txt", "pub_date": "2017-10-19T00:00:00Z", "Sentiment": "0.178", "Subjectivity": "0.329", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "599", "Permalink": "http://reddit.com/r/writing/comments/77j60a/advice_needed_taking_a_gap_year_to_learn_writing/domkrj5/", "Threadlink": "http://reddit.com/r/writing/comments/77j60a/advice_needed_taking_a_gap_year_to_learn_writing", "Parent_id": "t3_77j60a", "Reddit_id": "domkrj5", "Subreddit_id": "t5_2qh2n", "Commenter": "crowqueen", "length": "3283", "content_scrubbed": "Agree with /u/novelconcepts but have my own experience to draw on. There[.] a saying, 'If you want something done, give it to a busy person.' I think you'd be much more productive if you went to college and started studying, and treated writing like a serious hobby, and that is from someone who also planned to take a gap year to do something artistic (in my case, take an art foundation course with no intention of going on to do an art degree at university -- I'm in the UK where we start specialising at 16 rather than having the wonderfully broad liberal_arts education in the US).\n\nAssuming you're in the US, you'd be better to start college and take a creative writing course there, to be honest. Taking a year off to learn to write without any structure to it or just using a podcast as a tutor is a recipe for procrastination. I did some writing while I was unemployed, but it was when I went back to work that I actually got the most productive part of my writing done. Because I didn't have acres of free time to mess about, I actually got more focused and strategic as a writer than when I could do it all day if I wanted to. I had to plan a routine and I had to stick to it because I couldn't just go and watch TV when I felt like it. The application that comes from having other demands on your time has made me really try to improve as a writer, rather than just spam words and hope for the best. It taught me the discipline to actually improve.\n\nPlus you have more experiences while working or studying something else that lead to writing something authentic -- even if you're writing secondary world fantasy, novels are fundamentally about the human experience, and getting that interaction is really important. When you're your age -- and I'm looking back 20 years now on my school career -- you don't have that richness of adult experience. It[.] fairly telling that most first-time published authors are in their thirties and forties -- that[.] when you've matured enough to really grasp what speaks to other people, particularly if you're wanting to write adult fiction, and had enough time (starting where you are now) to grasp the basics of what other people want to read. As I said, the English education system makes its academic students specialise in something from early on; that meant I had to choose a degree, and to be honest what I chose (politics) meant I had a good grounding in social intrigue. Doing that will help your content as well as your style.\n\nI think you need to continue with some structure in your life. You need to get your higher education started. Learn stuff that you can write about, otherwise you won't produce much of substance. This isn't coming from someone who[.] never been where you are now, but from someone who actually has experienced being able to write full time without having it as a source of income, and didn't make the same progress as she thought she might until she got some structure back.\n\nI'm sorry to be more conservative on this than others but I think it is wiser (and easier) to learn how to structure and discipline yourself when you have more demands/constraints on your time than fewer. It[.] easy in many ways to write for fun; it[.] harder to maintain that momentum when you have all the time in the world."}