{"doc_id": "399", "name": "2017_10_humanities_student_major_1652_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-10-humanities-student-major_1652_AskHistorians.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.112", "Subjectivity": "0.305", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1609", "Permalink": "http://reddit.com/r/AskHistorians/comments/76yneb/how_many_greeks_lived_in_cleopatras_egypt/dojr929/", "Threadlink": "http://reddit.com/r/AskHistorians/comments/76yneb/how_many_greeks_lived_in_cleopatras_egypt", "Parent_id": "t1_doi3tcj", "Reddit_id": "dojr929", "Subreddit_id": "t5_2ssp3", "Commenter": "cleopatra_philopater", "length": "9929", "content_scrubbed": "Excellent question! Sorry it took me awhile to get to you but I was a bit busy. Bilingualism was certainly present in Ptolemaic Egypt and understanding who was bilingual, why they were bilingual and when this would have been prevalent is one of the more important (and spottily documented) aspects of society in Ptolemaic Egypt.\n\nThe vast majority of the evidence for bilingualism comes from the Egyptian scribal elite who had to learn Greek to interface with the higher levels of Ptolemaic administration. This extends from local village scribes who wrote their Koine Greek records with Egyptian reed brushes before transitioning to the Greek reed pens, to important priests like Manetho who wrote a chronicle of ancient Egypt[.] kings in Greek. Egyptian mythology and literary traditions also strongly impact Alexandrian poetry and influences from Greek literary cycles begin to pop up in Demotic texts towards the later Ptolemaic period which shows that literature from both linguistic corpuses influenced authors from Egyptian and Hellenistic backgrounds during this time. Through these bilingual scribes, notaries and officials, monolingual Egyptians were able to interact with a Graecophone administration by using a combination of Demotic and Greek documentation and both Greeks and Egyptians occasionally used contracts drawn up in either language. Most loanwords from Greek into Demotic are administrative or official terms (although even these are rare) and this attests to the sphere in which these literary systems saw the most diffusion however Demotic remained remarkably distinct during the Ptolemaic period, and although Coptic evidences a recognisable degree of grammatical influence and loanwords from Greek this was a very gradual process. The 2nd Century BCE saw more developments as a 146 BCE edict declared that all Demotic contracts had to be registered in Greek and a few decades later in 118 BCE another royal edict dictated that the language a contract was written in would determine what court would handle it (Greek *chremistai* or Egyptian *laokritai*), and as a result of changes in administrative policy Egyptian households began to use Greek more in business. The problem with using textual evidence like archives and even letters is that we are often uncertain whether the individual who is sending the letter and/or dictated it actually *wrote* it or if a bilingual middleman or professional scribe did, not to mention the fact that literacy was largely restricted to the scribal elite in the Pharaonic and early Ptolemaic periods so extrapolating spoken proficiency levels in the population from literacy is shaky at best. Sometimes it is apparent when the letter was not written by a professional hand as there are obvious errors pointing towards the individual being a native Egyptian speaker with a poor command of Greek, or when the overall lettering and content indicates a non-professional writer (which is one important indicator of female literacy along with vocabulary in dictated letters). Then there are also examples of Greek text written with reed brushes but specifically written in such a way as to mimic script written with a pen which demonstrates how professional scribes attempted to transition towards a new style of writing.\n\nNaturally, in later periods there is increasing evidence of spoken and literary bilingualism among both Grerks and Egyptians but it is important to recognise that bilingualism is not really a \"Yes or No\" subject, some individuals might only acquire a few words in another language so that they can get by, others might become fluent and use them interchangeably at home and in business. We find evidence for all of these things in Ptolemaic Egypt, as some individuals are known to have used Greek exclusively in their dealings with the administration, Egyptian in personal dealings, and a combination of the two in their community or for legal purposes. Greeks often worked as middlemen between Greek landowners and Egyptian tenants by sub-leasing or sub-contracting to them and they would have to be more familiar with Demotic since farm laborers were less likely to know Greek. In one papyri an Egyptian man complains that he is at a disadvantage compared to his peers because he can not \"Hellenise\", he does not know Greek and has a hard time dealing with Greek culture and so he is often treated unfairly by Greeks in business dealings. There are also complaints in personal letters and petitions to officials from Greeks or Egyptians who describe inter-ethnic and inter-cultural relations in the villages, such as the complaint of a Greek man who had a chamber pot emptied over his head while he was walking down the street and when he rebuked the woman responsible he was insulted by her which was made more humiliating by the fact she was *Egyptian*. We also know that intermarriage occurred which would have contributed to bilingualism and that Egyptians acquired Greek language and names for career purposes. Although it seems that males tended to use Greek names or present themselves as Greek for business or career purposes more often than even women in their family, some women did make use of double-naming or Hellenic status in their lives. The case of Apollonia and her husband Dryton is often used as a case study for bilingualism and cultural interaction. Apollonia who, had the Egyptian name of Senmonthis, was legally a \"Cyrenean\" and her father served in the army as a \"Persian of the epigonos\" (meaning he had Persian legal status and was paid as a mercenary) with a double name Greek/Egyptian name although many of her other relatives in her hometown of Pathyris had only Egyptian names. Dryton was a Cretan Greek and a fairly well heeled citizen of Ptolemais who had previously married a Cretan woman from Ptolemais. Dryton and Apollonia had three daughters, all of whom had both Egyptian and Greek names which are thought to have been chosen by Apollonia (Senmonthis) in keeping with Hellenistic and Ptolemaic Egyptian tradition where the naming of daughters was less important from a patrilineal perspective and was often allowed to the mother. Both  were apparently comfortable enough in both languages, and although both show a preference for their own culture, Apollonia conducted most of her business under her Greek name despite the nature of her engagement with financial and legal matters often falling outside the bounds of that which would be permissible for Greek women, Dryton similarly makes use of his wife[.] Egyptian name in later documents and his final will includes several witnesses who were non-Greek speaking and had to sign their names in Demotic.\n\nNaming conventions are one indicator of code-switching, as Hellenised Egyptian names are often unusual by Greek naming conventions but make perfect sense if they are considered the literal equivalents of their Egyptian names, for instance Phibis (The Ibis) references the god Thoth who was often depicted as an Ibis or baboon and due to Thoth[.] relationship to knowledge and medicine he was linked to Hermes, hence \"Hermophilos\" is an appropriate double name. Other double naming patterns indicate tendencies to link names like the Egyptian name Paesis and the Greek name Isidoros, both of which reference Isis.\n\nJust because Greeks did not have the same incentives to learn Demotic does not mean that it did not occur, some learned Egyptian in order to interact with and understand Egyptian culture and religion, others learned it in order to do business with Egyptians who might not know Greek. For instance in the case of the bilingual Greek brothers, Apollonios and Ptolemaios (Ptolemy), who lived around a Memphiite temple and interacted closely with Egyptians, we know that at least Apollonios was literate in Demotic and also occasionally transliterated Egyptian words into Greek. One letter from a presumably Greek woman remarks that the man she is addressing will be able to teach the Graecophone servants of an enema doctor Egyptian medical practice once he has learned Demotic\nOn hearing that you are learning Egyptian letters I rejoiced for you and for myself, because now you may go the city and teach the servants at the house of Phalou .. es, the doctor who uses washes; and you will have spending money for your old age.\n\nAccording to Plutarch, a 1st Century AD Roman historian from Alexandria, Cleopatra VII was the first Ptolemid to learn Egyptian\nshe could readily turn to whatever language she pleased, so that in her interviews with Barbarians she very seldom had need of an interpreter, but made her replies to most of them herself and unassisted, whether they were Aethiopians, Troglodytes, Hebrews, Arabians, Syrians, Medes or Parthians. Nay, it is said that she knew the speech of many other peoples also, although the kings of Egypt before her had not even made an effort to learn the native language, and some actually gave up their Macedonian dialect.\n\nGiven that many of the Ptolemies were patrons of the arts and intellectual institutions this seems to tie into the theme of Hellenistic literature and culture being predominant in Alexandria, but on the other hand many prominent Alexandrian authors evidence a knowledge of Egyptian literature and other Ptolemaic papyri also show a clear cross cultural heritage so it is not this simple. It is possible that the Ptolemies simply never bothered to learn the language as the royal administration dealt in Greek and anything else could be translated. Plutarch also states that they forgot the Macedonian dialect in time so this could be isolation and indolence. On the other hand perhaps Plutarch is overstating Cleopatra[.] oratory skill and linguistic prowess as compared to that of her ancestors so as to make his subject that much more interesting or perhaps he was broadly generalising when he says that none of the previous Ptolemies knew Demotic.\n\n**Continued below**"}