{"doc_id": "1031", "name": "2017_04_humanities_student_major_1010_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-04-humanities-student-major_1010_ApplyingToCollege.txt", "pub_date": "2017-04-09T00:00:00Z", "Sentiment": "0.124", "Subjectivity": "0.391", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "386", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64dejn", "Reddit_id": "dg1wbl3", "Subreddit_id": "t5_2y2r8", "Commenter": "pixie-the-kitty", "length": "2082", "content_scrubbed": "I would be pretty upset about this if I lived in New_York.  \n\nYes, it is a step in the_right direction, but nothing is ever free, so my biggest concern would be how is this going to be paid for.  \n\nIf I make $150k, would I be footing a larger portion of the tuition fees for these students?  If so, this seems extremely unfair considering I would also have to pay full price for my own children to go to college.\n\nMy other big concern is that it does not have any requirements around the majors that qualify.  We need students to major in STEM to keep us competitive with other countries.  Should we be paying for students to major in something they will not be able to get a job in when they graduate?  Do I really care if my server at a restaurant received a four year college degree in art history?  \n\nI grew up up in the lower class and worked extremely hard in high school to receive a full to college.  I specifically chose to major in computer science (instead of psychology or art, which were my other interests) because I wanted to pull myself out of poverty and be able to provide my children with a better life than I had growing up.  Four years out of college, I now fall into the upper middle class, but the majority of my friends from college who majored in \"liberal_arts\" majors are now struggling to get by in jobs that do not use their degrees.  \n\nIsn't part of the problem millennials are seeing is that the market has too many people with bachelor degrees in the first place?   Why not emphasize trade schools over four year colleges when they can provide some students with a better outlook after college?\n\nAlso, it does not look like students have to maintain a certain grade point average to maintain the scholarships.  How long will it take for them to be kicked out of school if they are failing their classes?  My sister received a dose of reality when she lost her scholarships after a year of skipping classes and goofing around.  I would be concerned if there were not safety nets in place to ensure that students do not take their education for granted."}