{"doc_id": "351", "name": "2017_10_humanities_student_major_1155_datascience", "namespace": "we1sv2.0", "metapath": "", "pub": "datascience", "title": "2017-10-humanities-student-major_1155_datascience.txt", "pub_date": "2017-10-12T00:00:00Z", "Sentiment": "0.093", "Subjectivity": "0.47", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "232", "Permalink": "http://reddit.com/r/datascience/comments/75rx4c/transitioning_from_academia_to_data_science/do9qgz1/", "Threadlink": "http://reddit.com/r/datascience/comments/75rx4c/transitioning_from_academia_to_data_science", "Parent_id": "t3_75rx4c", "Reddit_id": "do9qgz1", "Subreddit_id": "t5_2sptq", "Commenter": "LoreScientist", "length": "1342", "content_scrubbed": "I majored in Physics at a small liberal_arts college, got my Ph. D. in physics and then transitioned to a role as a Data Scientist shortly after my defense. \n\nI definitely felt (and still feel) the same way that you do about where I fall short as I had pretty much exactly the same experience with software development. I felt like I wasn't hireable in my current state either. And some places passed because I didn't have knowledge about their particular arena (NLP, Hadoop, etc.).\n\nHowever, I was able to find a position. In order to succeed in that position I've focused on what the company needs and what[.] the simplest way to improve what they're currently doing. Most business problems don't need Google[.] AI team to solve. If you are capable enough to get where you have in your career, you can solve the types of problems you'll most commonly encounter. Moreover, being able to communicate those results to people without any technical knowledge or inclination is more important to success in most cases.\n\nFinally, remember that data science is a lot like physics. You will never know everything in your specialty and likely won't know a ton about things outside of it. It doesn't mean you're a bad physicist. As long as your work is methodologically sound and answers a question that someone is interested in, you're doing it right. \n"}