{"doc_id": "1140", "name": "2017_04_humanities_student_major_1999_bestof", "namespace": "we1sv2.0", "metapath": "", "pub": "bestof", "title": "2017-04-humanities-student-major_1999_bestof.txt", "pub_date": "2017-04-18T00:00:00Z", "Sentiment": "0.079", "Subjectivity": "0.358", "Score": "23", "Upvotes": "0", "Downvotes": "0", "Wordcount": "345", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgemwed", "Reddit_id": "dgeuybu", "Subreddit_id": "t5_2qh3v", "Commenter": "catsandogsandgoats", "length": "1975", "content_scrubbed": "The Arts are, and have always been, for the middle class.  That is, the families who are independently wealthy, generally own their means of production and can attend university without the fear of running out of money.  (not the post regan, US only definition which is really just a rebranded working class).  As such, the job market could handle the small pool of graduates and even if it couldn't... it didn't matter.  A university education was more of a right of passage than anything else.\n\nWhen the rest of us consider four to six years of additional education, we expect an academic experience, and at the same time, a vocational outcome.  It[.] a fantasy, and its very new.  Universities used to only have a few types of degrees, and they where insanely general.  Now they have many specialized degrees to accommodate the new class of students who demand paths to jobs, but its futile.  \n\nI noticed we downvoted a redditor for mentioning his lucrative engineering degree, while at the same time (collectively at least) we seem to be complaining that no one told us that a degree doesn't result in a job.  It[.] like we are all crying that no one told us that we would need to find useful degrees while blocking our ears everytime some tries to tell us where to find useful degrees.  Take some responsibility people!\n\nAnyway going to use a throwaway for this, since I've probably offended the_right with all my talk of social class, and probably offended the_left with my talk of personal responsibility.  OH screw it.. Also don't be American if you are poor and want to study the arts.  Access to tertiary education is pretty much based on merit rather than wealth in every other developed nation.  The problems with unemployable degrees are still there, but at least you don't owe 120k in debt.  Ninety percent of the problems on reddit could be summed up as \"Don't be poor and American\". There now I offended Americans too.   Hope you have all had a good Easter.\n\n\n\n"}