{"doc_id": "1030", "name": "2017_04_humanities_student_major_999_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2017-04-humanities-student-major_999_college.txt", "pub_date": "2017-04-09T00:00:00Z", "Sentiment": "0.114", "Subjectivity": "0.36", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "577", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg0riv8", "Reddit_id": "dg1qpel", "Subreddit_id": "t5_2qh3z", "Commenter": "dorathehexplorer", "length": "3366", "content_scrubbed": " there are ~4,500 colleges in the US and whatever people might say the \"product\" they offer is not consistant across all institutions. Not all colleges are created equal, and not all offer equal educational opportunities. In fact, there is a tremendous gulf between poor/middling/elite schools both in subtance and in outcomes-- in part due to who is in the seats next to you. If you choose to attend a highly selective school you will be in classes with other high-performing students, which raises the bar in almost every way. It is also likely to mean you will benefit from a much better network after college-- who you know is important, and it doesn't require an Ivy degree for that to make a difference. \n\nTo a certain extent, I agree with you. My college[.] STEM department focuses a lot on the communication abilities of its students. That means they heavily emphasize reading and writing articles, as well as talking about one[.] subject in a way that people outside the field can understand. Yes, even in industry-oriented fields like computer science. Meanwhile, I've met plenty of STEM majors at other institutions - including some top ones - who clearly have never taken any writing courses besides AP English and the gut course that satisfies the divisional requirement, and it shows in how incoherent their articles and papers are. \n\nI also wish people would stop touting community college as a perfect solution to everyone[.] educational problems. The sad fact is that a lot of community colleges have sub-par academics and advising, do not prepare you for four-year college, and (this is most important for me) do not honor disability accommodations. \n\nOn a more practical basis, not all students are well suited to all types of schools. Some may do well in a lecture hall setting with 400 classmates, while others will thrive only in small classes (say 20-25) with much more direct attention from the instructor.\n\nAmen. I go to a SLAC and my current classes have no more than 15 students. My brother *wants* to go to a large public state school with huge class sizes. I can't comprehend this mentality, but he[.] much more extroverted than I am and can probably succeed in a place like that. Now I just have to convince his mother... \n\nOP is correct to suggest that many students drop out; graduation rates at many large public schools are <50%. There are also private schools with graduation rates of 85%+\n\nTo be fair, many public schools draw from a larger swath of the population that is *predisposed* to drop out. The same people would have dropped out if they had gone to an elite private college. They go for the default option and can't hack it. People who go to private liberal_arts schools are a minority among high school graduates. \n\nFun fact: for many students an \"expensive\" school can be cheaper than a \"affordable\" one if you are simply comparing sticker price. \n\nI am attending my current SLAC for a cost smaller than that of my home state[.] *cheaper* state schools. A common misconception among low-income students is that private elite schools are completely closed off to them. I was able to apply to a large number of these schools through fee waivers (due to being on free/reduced lunch) and got substantial financial aid packages from many that offered a much better deal than I would have gotten at my state[.] public schools. "}