{"doc_id": "1207", "name": "2017_04_humanities_student_major_2670_megaten", "namespace": "we1sv2.0", "metapath": "", "pub": "Megaten", "title": "2017-04-humanities-student-major_2670_Megaten.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.064", "Subjectivity": "0.317", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "743", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgnvaw5", "Reddit_id": "dgnwt3v", "Subreddit_id": "t5_2sj8i", "Commenter": "Chained_Icarus", "length": "4282", "content_scrubbed": "I like Futaba as a character, but she is hands down the least useful navigator in the series. I'm not talking about her buffs from a gameplay perspective (those are AMAZING).  But the info she is able to give you is barely any better than what Morgana was already giving you and she rarely does anything that requires a real amount of \"scanning.\"  She[.] kind of just there most of the time, spouting out terrible lines like \"MONA-FIDE-BONA-FIDE.\"  I hate that line and it made me stop using Morgana =P\n\nBut honestly, I don't think Makoto SHOULD have joined the Phantom Thieves. At all.  Her entire connection to it is really weak.\n\n**UNMARKED SPOILERS BELOW**\n\nShe is the only person whose palace isn't something they're personally invested in from the start.  Kamoshida ties into the MC, Ryuji and Ann with personal stakes: MC and Ryuji are threatened with expulsion (which also means you're screwed on your probation) and Ann is getting direct revenge for her friend AND how Kamoshida is towards her.  Yusuke was being directly used and abused by Madarame.  Makoto... went after Kaneshiro because he was tricking students at her school and the principal made her?  She only gets personally involved because she[.] snooping on you guys on request of the principal as well.  And then she runs off and gets caught which is when you get that deadline from him.  She[.] there purely on happenstance and circumstance.\n\nYou could argue she[.] personally invested in Sae[.] palace later on - and she even says that is her original goal - but that[.] weak. By that time you're all very heavily invested in going into Sae[.] palace with or without Makoto.  The only truly plot-turning thing she does is steal data from her sister[.] laptop... which honestly Futaba probably could have found a way to do or Makoto could have done as a confidant/NPC.  \n\nMakoto[.] \"Thief\" design also is weak compared to the others.  She[.] a apocalypse biker girl because... why?  Everyone else[.] reflects their personalities.\n\nMC is THE Gentleman Thief - Nice suit, coat, and masquerade mask.\n\nRyuji is the epitome of rebellion against authority and what society deems \"acceptable\" - a Pirate (with some biker motifs).  He uses \"Bruiser,\" \"Enforcer\" or \"Thug\" weaponry.\n\nAnn romanticizes the Femme Fatale archetype (she goes into it more in her Social Link) and embraces her beauty and femininity.  Her catsuit look, use of whips and suggestive taunting (\"ON YOUR KNEES\") play into this as well.\n\nYusuke is a rebel with a flair for the arts and dramatic - His outfit is lavish and stylish and his Persona is the theatrical Goemon.  He uses a Katana because it is considered an elegant weapon.\n\nFutaba is a technophile and conspiracy theorist with a passing belief into the occult.  Her Persona is the Necronomicon and her outfit is the epitome of hacker fanboyism - Tron.  \n\nHaru always wanted to be a heroic rogue much like the Muskateers or Zorro.  She understands that often these figures end up on the wrong side of the law but still remain noble - thus her outfit is still relatively brightly colored and exudes a sense of being a \"good guy\" - something the rest of the cast lacks.  \n\nMorgana, well... endgame [spoiler](#s \"he was made for the specific purpose of creating and guiding the Phantom Thieves, so his situation is moot.\")\n\nAkechi is all white and regal as \"Crow\" because it ISN'T his spirit of REBELLION - It[.] his SPIRIT OF JUSTICE as he tells the party. [Big Spoils](#s \"when he is revealed as the traitor and rebels against his own ideals just to kill you dead, he transforms back into the Black Mask - a dark kamen rider look because he[.] a lone vigilante in his mind.\")\n\nAnd then you have Makoto, who is a biker because...?  Nothing in her personality feeds into it. Nothing in her situation feeds into it.  Her Persona is a woman who pretended to be a male and gained a seat as the Pope - but Makoto isn't struggling with gender identity nor is she especially religious or driven.  HOWEVER...\n\nLook at Hifumi.  She is struggling with Gender Politics (A FEMALE SHOGI PLAYER?!?! WAAAT?!)  She also finds solace in the Church and sees herself as a sort of leader. A -dare I say it- QUEEN of a Kingdom.\n\nIt[.] almost like they just ripped the ideas they had for Hifumi and slapped them onto Makoto."}