{"doc_id": "490", "name": "2017_10_humanities_student_major_2637_kotakuinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "KotakuInAction", "title": "2017-10-humanities-student-major_2637_KotakuInAction.txt", "pub_date": "2017-10-26T00:00:00Z", "Sentiment": "0.061", "Subjectivity": "0.214", "Score": "12", "Upvotes": "0", "Downvotes": "0", "Wordcount": "341", "Permalink": "http://reddit.com/r/KotakuInAction/comments/7901dr/why_are_a_lot_of_college_aged_sjws_full_on/doye4u9/", "Threadlink": "http://reddit.com/r/KotakuInAction/comments/7901dr/why_are_a_lot_of_college_aged_sjws_full_on", "Parent_id": "t3_7901dr", "Reddit_id": "doye4u9", "Subreddit_id": "t5_33726", "Commenter": "Invo_RT", "length": "2047", "content_scrubbed": "Socialist here. In my experience, most of the people I've encountered claiming to be socialists/communists fall into the rhetorical trappings of the US where increasing the welfare state is inaccurately seen as socialist/communist. It[.] not surprising really. I have a feeling that any exposure to these systems happens in the humanities, if at all. I have a minor in economics and there was never any discussion of alternative economic systems, nor are there any courses in the course catalog as of today pertaining to that. I arrived at my position after working for several years post-college.\n\nIgnoring that for the time being, I can commiserate with the logical steps it takes to arrive at that conclusion. Unless you are from a wealthy family, the last few decades haven't been particularly good for most Americans. The emphasis on supply-side economics and the slow erosion of labor protections have been the mantra my entire life. Jobs go overseas, businesses downsize, pay is cut, job security is a hilarious joke. Capitalism does what capitalism does; make money at the expense of every person it can get away with. If that means regulatory capture, understaffing offices, and overworking existing employees, then so be it. People are looking for a change and don't feel like they have many options in the current system. Mix in a little youthful naivete and you've got a blank canvas for a little bit of everything.\n\nI just have no clue why this movement tends to think in a collective\n\nThat tends to be what movements do regardless of their affiliation. There[.] a core ideology that is applied to circumstances. If the core ideology is uniform from person to person, you should generally expect the same actions. \n\nMaybe it[.] because of who tends to fund them (literal Nazi collaborator George Soros)?\n\nCould be. It[.] all one big game of elites trying to influence and push people one way or another. For every Soros, there[.] a Koch pushing op-eds, buying up the media landscape, and sowing discontent to achieve their political ends."}