{"doc_id": "247", "name": "2017_10_humanities_student_major_187_biology", "namespace": "we1sv2.0", "metapath": "", "pub": "biology", "title": "2017-10-humanities-student-major_187_biology.txt", "pub_date": "2017-10-03T00:00:00Z", "Sentiment": "0.087", "Subjectivity": "0.305", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "497", "Permalink": "http://reddit.com/r/biology/comments/73ura5/career_advice_for_someone_wanting_to_work_with/dnuljlj/", "Threadlink": "http://reddit.com/r/biology/comments/73ura5/career_advice_for_someone_wanting_to_work_with", "Parent_id": "t3_73ura5", "Reddit_id": "dnuljlj", "Subreddit_id": "t5_2qhn7", "Commenter": "analyticallysurreal", "length": "3068", "content_scrubbed": "I'm a 4th year PhD student who has done a master[.] prior. Here is what I've gathered from professors, friends, and colleagues regarding academic careers:\n\nYou will need a strong CV (academic resume) starting at the graduate level. This will include publications, conference talks and posters, awards won, etc. Average PhD takes about 5 years to complete. Following that, you'll average two postdoc positions before being conpetitive for tenure track positions. Each postdoc will average about 2 years a piece, sometimes 3. Ideally, you'd want two publications per postdoc, and conference talks are a must. I've only mentioned publications where you must be first author. It'll also be helpful to collaborate with others to land second author publications as well, building your publication record and ability to collaborate. Additionally, grad students and postdocs often train undergraduates for research. Mentoring students who publish makes a good case for your leadership skills.\n\nA major element is acuiquiring grants. There are various grants to apply for at all stages of your career, and make excellent CV fodder. As a research professor, a requirement for getting tenure and funding for research hinges on your ability to acquire funding. \n\nWhat I've listed above is for R1 universities. There are other tiers depending on your goals. Many liberal_arts universities have undergraduate research programs with a focus on teaching for tenure. Your strategy would be different for those positions, making an effort to focus on teaching during grad school, and possibly adjuncting for colleges for experience teaching lectures. While you would be doing research, your startup funding would be small, and you won't be competitive for large grants. \n\nOther academic positions are possible, but others have mentioned it. The track would be similar to shooting for a tier 1 position, but maybe doing one less postdoc. They are quite competitive, as all academic positions tend to be. \n\nIndustry is where I want to go, myself. Grad school does nothing to help you figure out what you need to get in. Some people get in without doing a postdoc, some require postdoc. Making industry connections is often strongly advised. LinkedIn, job fairs, friends on the inside, etc. You will, likely, get paid more and start working younger than the academic route. Position you'd have may vary, often directing a research group on projects desired by the company.  Pay and hours are considered better than academia, but at the cost of research freedom. The latter won't matter as much if you struggle getting grant money to fund passion projects. \n\nMy decision to pursue industry occurred after abandoning one PhD lab for another, as I witnessed the lab folding while I was there. Hours are insane, and number of responsibilities as an R1 professor is beyond my bandwidth. My master[.] advisor was perfectly content with it, but I could tell my first PhD advisor was faltering by wanting more time for family and hobbies. These are my anecdotes, so take it with a grain of salt. \n\n\n"}