{"doc_id": "308", "name": "2017_10_humanities_student_major_680_ornithology", "namespace": "we1sv2.0", "metapath": "", "pub": "Ornithology", "title": "2017-10-humanities-student-major_680_Ornithology.txt", "pub_date": "2017-10-08T00:00:00Z", "Sentiment": "0.204", "Subjectivity": "0.452", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "309", "Permalink": "http://reddit.com/r/Ornithology/comments/755unm/interested_in_learning_more_about_birds_as_a/do3r08s/", "Threadlink": "http://reddit.com/r/Ornithology/comments/755unm/interested_in_learning_more_about_birds_as_a", "Parent_id": "t3_755unm", "Reddit_id": "do3r08s", "Subreddit_id": "t5_2raa7", "Commenter": "RAVENous410", "length": "1820", "content_scrubbed": "I am currently an ecology PhD student focusing on ornithology and conservation - I work with birds in the tropical forests of Panama, which I love! \n\nI got a B. A. from a small liberal_arts college, majoring in biology. It really depends on what you want to do with your degree - there are different options for working in the field. The traditional route is getting into research/academia; if that is something that interests you, going to college and choosing a program where you can get to know your profs and their research, and possibly participate, is important. If you're more interested in conservation or something else, you'll want to find programs that have classes that focus on these areas. The bigger the school, a lot of times the more choices you'll have in classes (for example, my undergrad was very small and course choices were limited to general topics), but oftentimes classes will be bigger and you'll have to take more initiative to get to know faculty (my average class size was around 15 people). \n\nThe big thing is getting practical experience - sometimes, this can mean volunteering or taking low-paying field jobs. If you're in the US, the ideal time for this is in the summers when there are a lot of field jobs open, and perhaps when you're young enough to have fewer bills to pay (health insurance, for example, doesn't come with a lot of these jobs!). I got a lot of great jobs through the [texas a&m wildlife job board](https://wfscjobs. tamu. edu/job-board/). My first ever fieldwork was in college working for the the [Student Conservation Association](https://www. thesca. org/) - I worked with Northern Spotted Owls with the Forest Service, got amazing experience AND got paid! Had a lot of fun, too. Feel free to PM me if you have any more specific questions, I'd be happy to help. "}