{"doc_id": "307", "name": "2017_10_humanities_student_major_676_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2017-10-humanities-student-major_676_UofT.txt", "pub_date": "2017-10-08T00:00:00Z", "Sentiment": "0.196", "Subjectivity": "0.434", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "349", "Permalink": "http://reddit.com/r/UofT/comments/74swe6/why_dont_graduate_admissions_committee_factor_in/do3ouw5/", "Threadlink": "http://reddit.com/r/UofT/comments/74swe6/why_dont_graduate_admissions_committee_factor_in", "Parent_id": "t1_do3mvkg", "Reddit_id": "do3ouw5", "Subreddit_id": "t5_2rbaq", "Commenter": "Teshi", "length": "2101", "content_scrubbed": "While I stand by my comment that factors over GPA are relevant, I would be very, very careful about relying on \"institution hierarchies\" of undergraduate degrees to get you in. There is a chance that if your program is genuinely a well-known and impressive one, graduate admissions committees might (might!) consider you differently.\n\nWhat worried me particularly abotu your comment is that you quoted specific details of a course. Likelyhood that any given admissions member is going to care that this particularly course required x amount of memorization more than a competing course at a different university? ZERO. What might sway them is longer term evidence that students from x program (PROGRAM) are well-prepared for graduate work, have low drop-out rates, and show focus and creativity in their work.\n\nMore likely than \"institutional hierarchies\" to sway a graduate admissions committee is your individual potential as a student: have you demonstrated a strong, clear intention, whether your marks are low or not, did you succeed in the subjects that were important, do you have substantial references, if you're submitting a writing sample, is it of high quality, do you have work experience that might help you, are you mature and able to deal with a heavy workload, do you seem like you would be a contributing member of the department? Any and all of these issues might be more relevant to the department than your institution.\n\nAlthough I can only speak for the humanities, I felt that I would not personally upvote (haha) any random U of T student just because they went to U of T. Judging from my own experience, my history major did not prepare me particularly well for my Masters degree. Looking back, I would characterise my undergraduate education as lackluster at best.\n\nAs a graduate student at U of T I would say that U of T relies too much on its supposed reputation and not enough on actually being a good university providing a really exciting well-thought-out education. For whatever reason, the university doesn't feel like it has to try particularly hard--and it doesn't. "}