{"doc_id": "408", "name": "2017_10_humanities_student_major_1695_seattlewa", "namespace": "we1sv2.0", "metapath": "", "pub": "SeattleWA", "title": "2017-10-humanities-student-major_1695_SeattleWA.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.137", "Subjectivity": "0.263", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "422", "Permalink": "http://reddit.com/r/SeattleWA/comments/77778j/washington_state_sues_devos_for_suspending_rule/dokirdx/", "Threadlink": "http://reddit.com/r/SeattleWA/comments/77778j/washington_state_sues_devos_for_suspending_rule", "Parent_id": "t1_dok8rdm", "Reddit_id": "dokirdx", "Subreddit_id": "t5_2vbli", "Commenter": "karrialice", "length": "2498", "content_scrubbed": "Okay, I just wrote this and I realized I don't really know for sure what you mean by 'new student.' We're in the middle of the application cycle where I worked, so I automatically assumed 'high school senior applying to colleges.' If that[.] not what you meant, my apologies!\n\nMy first piece of advice would be to really thoroughly consider what characteristics are important for you (general you) in a college. \n\nIt sounds cliche, but I was first gen and I never really thought about things like whether I'd be a better fit for a large college or a smaller college (spoiler alert: it was the latter). Things like location, academic programs (not even knowing your major, but knowing if the areas you're interested in are available as academic programs at the colleges you're looking at, and whether the school is a STEM focused/research university, or a liberal_arts college or something in the middle and what the pros and cons are for each of those). \n\nGetting even more in depth (these may be things to consider when you're comparing colleges, especially after you've received admission/finaid offers from colleges), I'd recommend that students look at things like average loan debt, default rate (what percentage of students graduating are actually successfully repaying their loans?), and outcomes. Does the school offer internship grants/paid internships? Do they offer a variety of jobs on campus, and how easy is it to get a job on campus? What are the career center services like? Is there a strong alumni network that actually benefits graduates? How many students get the opportunity to do research on campus (if that[.] something you want to do)? What[.] the retention rate, and what services (academic, medical, social/support) are available to students to help them continue their education? \n\nI would also advise students to apply to colleges even if they think that they're out of reach financially. Like I mentioned, I work for a private college, and a lot of our high-need students are borrowing as much annually to go to our college as I did to go to the UW, even though the UW[.] cost of attendance is roughly half of the COA at the college that I work for. We have institutional funds set aside specifically for need-based scholarship and are able to provide these students with scholarship to offset a lot of the cost, which sometimes means that we're the more affordable option. But you never know if you don't apply. \n\nAnyway, that[.] my second college-focused rant of the day. "}