{"doc_id": "310", "name": "2017_10_humanities_student_major_706_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2017-10-humanities-student-major_706_UofT.txt", "pub_date": "2017-10-09T00:00:00Z", "Sentiment": "0.02", "Subjectivity": "0.258", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "244", "Permalink": "http://reddit.com/r/UofT/comments/756u1p/humanities_at_u_of_t/do46pca/", "Threadlink": "http://reddit.com/r/UofT/comments/756u1p/humanities_at_u_of_t", "Parent_id": "t3_756u1p", "Reddit_id": "do46pca", "Subreddit_id": "t5_2rbaq", "Commenter": "PurrPrinThom", "length": "1426", "content_scrubbed": "Hey, I did humanities through U of T. Firstly, yes, the first year courses can be pretty big and intimidating, but they rapidly get smaller as you get into upper-year courses. This is because there are less first-year courses than upper-year - they make large, general courses to ensure everyone going into history, as an example, has the same basic info down by the time they get into upper-years, but the upper-year courses get more specialised. \n\nThe biggest benefit, in my opinion, for U of T is the choice. Seriously. There are courses on pretty much everything you can think of. Outside of the History department alone, there are numerous departments focusing on specific cultures (Near and Middle_Eastern Civilisations, South Asian Studies, Slavic Languages and Literature, Celtic Studies, etc.) so if you want to focus on a specific geographic location, you can. You can take courses on pretty much anything you want - which simply isn't an option at many other schools.  These smaller departments often have smaller courses as well, especially in upper-years. \n\nMy largest class at U of T was 1500, my smallest was 3. Outside of that, my class sizes tended to be either 60 or <20. As for the impersonal experience, I am a big believer in your experience is what you make it. I got involved in clubs, I went to office hours, I attended departmental events and I, in no way, felt like the experience was impersonal. "}