{"doc_id": "275", "name": "2017_10_humanities_student_major_377_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2017-10-humanities-student-major_377_canada.txt", "pub_date": "2017-10-05T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.3", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "237", "Permalink": "http://reddit.com/r/canada/comments/74ffjq/transcanada_kills_controversial_energy_east/dny40w7/", "Threadlink": "http://reddit.com/r/canada/comments/74ffjq/transcanada_kills_controversial_energy_east", "Parent_id": "t1_dny3758", "Reddit_id": "dny40w7", "Subreddit_id": "t5_2qh68", "Commenter": "thirdfry", "length": "1331", "content_scrubbed": "What are you saying LOL.\n\nEverything you are saying relies on the assumption that Canada would manufacture and export said technology. There are no benefits to manufacturing in Canada. Zero. \n\nWe have zero advantages in future tech. \n\nThe only reason we succeed in oil is because of our vast reserves and proximity to the US. \n\nHow can we be leaders in designing and selling green tech? Who will provide the startup cash? Who will protect the IP from being ripped off by China? \n\nHaving a country full of liberal_arts majors doesnt help in R&D. LOL \n\nMy argument that the oil industry is vital to Canada has nothing in common with the horses v cars argument. I am not bashing green energy at all. \n\nI am saying that green energy has no potential to grow to the size of oil in terms of economic impact.\n\nCanada does not have lithium to make batteries for cars, it does not have much in terms of rare earth metals. \n\nYou cannot make tires, lunricant, plastics, makeups, etc out of sunlight or wind. Even if you could, sunshine and wind are not in uniquely massive supply in Canada. \n\nGreen tech is not a global commodity. Oil is. \n\n\nStop knee jerking at me not blindly endorsing green energy as himanitys saviour. I am not saying green energy is not beneficial, i am saying oil is necessary to Canada[.] economy. That is all. \n\n\n\n"}