{"doc_id": "445", "name": "2017_10_humanities_student_major_2130_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-10-humanities-student-major_2130_ApplyingToCollege.txt", "pub_date": "2017-10-22T00:00:00Z", "Sentiment": "0.26", "Subjectivity": "0.443", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "975", "Permalink": "http://reddit.com/r/ApplyingToCollege/comments/780mmw/what_schools_are_you_applying_to_and_why/doqilla/", "Threadlink": "http://reddit.com/r/ApplyingToCollege/comments/780mmw/what_schools_are_you_applying_to_and_why", "Parent_id": "t3_780mmw", "Reddit_id": "doqilla", "Subreddit_id": "t5_2y2r8", "Commenter": "Captainaga", "length": "6085", "content_scrubbed": "I'm on the verge of/pretty much shot-gunning.  But, I've toured all of the colleges I'm applying to and have spent hours researching each one (over the past six months or so, I've visited over 35 different colleges across the country).  Between July and September, I wrote a little over 50 essays, each one almost entirely differnet and tailored to that school and their programs.  I submitted all of my apps several weeks ago, just to get things off my plate.  \n\n* UChicago: My top choice, I'm EDing there.  Aside from fantastic research opportunities, fantastic programs (econ, poli sci, pub pol studies), The Core (and the ability to just take whatever classes you like), the groundbreaking works of many faculty (and my one-on-one interactions with a number of these faculty members), and a lot more specific opportunities (Oceonoma, for example), the school just has this spunk or attitude to it that I love and can't find anywhere else.  \n* Claremont McKenna: Their interdisciplinary approach to economics and policymaking in general (Philosophy and Public Affairs, PPE majors) is super appealing to me, not to mention their sequences on financial economics and scientific modeling.  Research is also fantastic, as are the resources of the five college system.  I'd consider EDIIing here.  \n* Brown: Open curriculum and fantastic applied mathematics/economics programs.  Need I say more?\n* George Washington: I toured there, and the school just has this very hungry vibe it.  It[.] as if everyone there is super motivated and knows they will be able to make an impact/change the world (not to sound like your stereotypical millennial).  Aside from that, I love that you can double major across schools.  Their communications program is great, as is their economics-centric business program.  The structure of their Latin American Studies program is unrivaled (and would be something that I would consider studying if I went there).\n* Dartmouth: Quantitative Social Sciences, D-Plan, research research research, and the Rockefeller Institute.  Plus, I have legacy.  \n* CMU: I almost fainted the first time I read the descriptions of their Social and Decision Sciences department.  Aside from that, the emphasis on math and CS in their economics program, the policy and politics minor through their DC campus, and the economics and AI statistics programs, all housed in Dietrich, and all super, super exciting.   \n* Union College: This school seems like a tiny gem.  It has the feeling and resources of a major research university, but all of the benefits of a small, liberal_arts education.  Research opportunities are all but unrivaled for its class.  Small class sizes, a great astronomy department, managerial economics, and so many other great programs and facets (such as the Minerva house system) makes it a great fit.  Their administration is also very accessible to students, meaning that there is a lot of room for student-led change and opportunities at the school, something that I love (I've been on ASB all four years of high school).  \n* U Penn (Wharton): This is probably the school I'm least likely to get in to on my list, but whatever.  The approach to the business education (through the BS) is appealing to me, as is the direct opportunities you get regarding research or community-involvement right out of the gate.  The ability to double-major in the College of Letters and Sciences is also cool.  \n* Northwestern: Mathematical Methods in Social Sciences major.  Need I say more?  I will the adjunct degrees, along with the research opportunities on campus are all the more exciting for me!  \n* Colgate: Really cool vibe on-campus in terms of merging theoretical intellectuals with a hint of pre-professionalism.  Great economics/applied math + astronomy.  I like the real world experience you can get in the econ department with the tax returns program they offer for the local community.  \n* Boston University: fantastic business school, great for scholarships, I like their liberal_arts approach to B-school (the BUHub).  \n* Boston College: Again, a fantastic business school with the ability to concentrate in numerous areas.  Good research opportunities as well.  \n* Brandeis: Super interdisciplinary approach to economics and business, which I absolutely love.  Really cool looking research institutes which are available to undergrads, not to mention their study abroad opportunities and other major offerings (like politics, and the overall ability to double and triple major easily, although this is just a naive high schooler talking).  \n* USC: Aside from a great business school, Dornsife has some great interdisciplinary programs.  The Political Economies major, the different variants to IR+Econ, and their minors (such as Photography and Social Change) are all super exciting to me.  Research is also fantastic.  \n* TCU: I did the high school investors challenge this past summer, and it was really, really fun.  The school was great.  The Educational Investment Fund is a great way for undergrad finance majors to gain experience.  I also really got to know some of the faculty members there.  A week after the program, the Dean of the Neeley School sent me an email saying \"we were super impressed with you, we'd love to have you here.\"  I'm applying EA.  \n* Fordham: Business programs look pretty cool.  Plus they give out a lot of scholarships.  I got a fee waiver as well.  \n* Northeastern:  Really cool looking business and economics program (interdisciplinary programs such as the Philosophy, Politics, and Economics major, or whatever, are really cool).  Great co-op and research opportunities.  Fantastic study abroad.  I also got a fee waiver from them.  I'm applying EA.  \n* UC SD: I loved the vibe on-campus when I went to visit.  Their econometrics major looks really cool, although it[.] impacted.  Their IR program (especially with an East_Asian and economics focus) is also really great.  Plus, I'm in California.  \n* UC Berkeley: Great applied math and economics, Haas School of Business.  It[.] local to where I live now too.  \n\n"}