{"doc_id": "1100", "name": "2017_04_humanities_student_major_1762_newzealand", "namespace": "we1sv2.0", "metapath": "", "pub": "newzealand", "title": "2017-04-humanities-student-major_1762_newzealand.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.093", "Subjectivity": "0.444", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "415", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65iag2", "Reddit_id": "dgb9z5c", "Subreddit_id": "t5_2qhma", "Commenter": "winter_limelight", "length": "2432", "content_scrubbed": "My problem with universities solely being about money (either the costs of it now, or the student earning potential) is that it encourages the 'middle-ground'. If we want to move forward as a country, as a society, as people, we need thinkers. Will all due respect to what are undoubtedly some fine minds, a BCom is not about thinking, it is at best an 'applied' subject, it is about execution. I say this as a software engineer with a Masters - my degree is in an applied field too - a great deal of my courses were about how to apply fundamentals (maths, physics, algorithms) and less about understanding those fundamentals in depth.\n\nWithout thinkers we don't consider the mistakes of the past and when and how to make different choices. Without thinkers we don't examine what seemed impossible and eke towards that goal of making it possible. Without thinkers we don't *question* the status quo and that is dangerous because it allows power to consolidate and become abused. \n\nThe original university disciplines, the original 'arts' of two hundred plus years ago, were about thinking. They were about research that moved forward human knowledge in a manner that could then be applied. As a society we probably don't need a huge number of these thinkers. Perhaps the ratio of needed thinkers to do-ers has not changed significantly in one-hundred years. The difference in those hundred years is that university used to be primarily about thinking and less about application (doing) - for which one had applied courses like those at a polytech. Now university is primarily where capable people go for an advanced education, and that is fine, but it[.] important that we understand the distinction and spectrum between thinking and doing, philosophy and application, and make sure we're not trying to apply one model of education and funding for all of it.\n\nTangentially, we also need artists. A society without people who can encourage us to think, experience, and feel is a dull society indeed. And from a purely 'national business' perspective, doesn't provide us with a legacy that may draw people towards us in the future (i. e. think tourists going to Europe for the history and culture). This is best summed up by perhaps my favorite movie quote. It is from Mr Holland[.] Opus: \n Well, I guess you can cut the arts as much as you want, Gene. Sooner or later, these kids aren't going to have anything to read or write about. \n\n"}