{"doc_id": "1280", "name": "2017_04_humanities_student_major_3310_saltlakecity", "namespace": "we1sv2.0", "metapath": "", "pub": "SaltLakeCity", "title": "2017-04-humanities-student-major_3310_SaltLakeCity.txt", "pub_date": "2017-04-29T00:00:00Z", "Sentiment": "0.192", "Subjectivity": "0.448", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "321", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgvp9vw", "Reddit_id": "dgx9spq", "Subreddit_id": "t5_2r7ac", "Commenter": "kissme_cait", "length": "1795", "content_scrubbed": "I realize my last post was a bit sharp, mostly because I was irritated by a vaguely xenophobic comment from another poster. I wanted to elaborate, particularly in regards to this question. \n\nI went to Skyline. Like I said in an earlier post, there is little diversity there. Many of the students will also be LDS and raised by conservative parents. They will also likely have grown up in the surrounding neighborhood for a very long time. I went to school with kids I had known for years, many since elementary school. If your child is not LDS, it will stand out. They will probably still make friends and have a social life and have opportunities, but they will definitely stick out at least for the first little while. \n\nIn terms of extracurriculars, Skyline has a ton to offer, from sports to the arts. Your child will have many opportunities there, and the teachers are fantastic. I loved Skyline for the teachers and the programs, and I would recommend it for that reason. It also has a smaller student population, which is a factor--huge student population means crowded halls, more competition, and larger classes.\n\nThe lack of diversity, however, does trouble me now. It didn't bug me when I went there because I didn't know anything else, but I now teach at a extremely diverse high school in West Valley and I find the  students to be far more open-minded and accepting than the kids I went to high school with. \n\nWest has a population that is similar to the school I teach at now, and it has strong academics as well. I can't speak to their extracurriculars, but everyone I know who went to West really enjoyed their time there.\n\n I really think your kid will do fine if they have a good head on their shoulders, but if you want academics + diversity, West is probably your best bet. "}