{"doc_id": "1025", "name": "2017_04_humanities_student_major_948_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2017-04-humanities-student-major_948_UofT.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.183", "Subjectivity": "0.412", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "259", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64b71h", "Reddit_id": "dg0xb08", "Subreddit_id": "t5_2rbaq", "Commenter": "fattittyfucker", "length": "1517", "content_scrubbed": "My cousin goes to USC for business and I go to UofT so I have some insight on both schools. From what I can gather USC is a strong school that does not foster a particularly academic environment. USC is most known for its famous alumnus and downtown LA campus. Due to its history as a prestigious private, somewhat liberal_artsy, university in California, many affluent families elect to send their children there — often as a continuation of already a lifetime of private education. \n\nThat being said, the school spirit there is very strong and much stronger than at UofT. As a result the Trojan alumni network is very powerful which works to the advantage of students in fields where networking is very important. For example, Tinder HQ which is located in LA hires almost strictly USC graduates. From what I understand Chinese billionaire(s?) are known to send their children there and there is a strong international student presence.\n\nIn terms of academics, they only require 4 courses a semester whereas UofT requires 5. They also offer flimsy courses like yoga or dance for less than regular credits. Arguably, there are more opportunities at USC (And universities in the states in general; more so for international students at private universities) and if you are already very strong in academics to begin with, it might be easier to stand out at USC. Ultimately, whether you'll be able to get research opportunities is more reliant on you than the school, so I wouldn't really make a decision based on that."}