{"doc_id": "328", "name": "2017_10_humanities_student_major_955_iama", "namespace": "we1sv2.0", "metapath": "", "pub": "IAmA", "title": "2017-10-humanities-student-major_955_IAmA.txt", "pub_date": "2017-10-10T00:00:00Z", "Sentiment": "0.113", "Subjectivity": "0.397", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "584", "Permalink": "http://reddit.com/r/IAmA/comments/75iw4f/im_the_ceo_of_gusto_a_startup_in_silicon_valley/do6kbk1/", "Threadlink": "http://reddit.com/r/IAmA/comments/75iw4f/im_the_ceo_of_gusto_a_startup_in_silicon_valley", "Parent_id": "t1_do6izwp", "Reddit_id": "do6kbk1", "Subreddit_id": "t5_2qzb6", "Commenter": "joshwithgusto", "length": "3279", "content_scrubbed": "I view my undergraduate education as a critical part of my development. That said, I don't think there is a one size fits all approach out there to how folks approach life. I'm personally a huge believer in the value of an undergraduate education and for most folks, it[.] a time to live away from parents for the first time, be in a thought space to really explore one[.] interests, what they like / don't like, and learn a ton of new things. I'm a believer in the value of a liberal_arts education where students can take classes outside their major, connect the dots on how electrical engineering and roman history are related, plus get a sense of the broader world out there.\n\nI've also had friends take gap years though and approach this time as their opportunity to explore the world, and their own preferences. Education has always been important to me for a variety of reasons, but one of the main ones is that my parents are both teachers. My father taught high school education in San Francisco and my mother was a spanish and french teacher.\n\nElectrical Engineering was a great foundation for me because I loved math, and it gave me a chance to explore complex systems and learn how to deconstruct them and simplify them. This is something I love doing in any context, and I had fun in college also joining Econ lectures, IR lectures, learning about the markets, but also about human psychology. \n\nIn my role as CEO of Gusto, I interact with complex systems all day. Whether it[.] market strategy, product development, or things like how it feels to walk around our office, or get an offer to join Gusto. These are all systems where we want to be deliberate, simplify, and make sure the most important parts are being done well.\n\nWhen it comes to dropping out of college, I can share some generalized advice. I think a trend right now in Silicon Valley is to drop out of college to start a company because \"it is the thing to do\". I generally don't support this approach because starting a company should not be a goal in my opinion. Companies don't exist for their benefit, or for their founders benefit. Companies exist to solve problems, and so it all begins with being obsessed with a problem and wanting to fix it. Sometimes the best way to fix the problem is to start a company but that[.] a by-product, not the motivation.\n\nThere are situations where someone becomes so excited and obsessed with a problem during college that they end up spending every waking moment on it. For this dynamic, it[.] possible that taking a step back for a time makes sense. But for most situations, my strong advice is to finish college and make the most of this time to really explore and discover yourself. Try something new every summer, work in different labs, experiment with classes you might not have normally taken. You never know what you might discover.\n\nAnd for everyone that doesn't have an opportunity to go to college, you can still accomplish anything you put your mind to. We all have different advantages/disadvantages in our background. But hard_work is something that is in our control. My parents were the first to go to college in their families, and the sacrifices they made enabled my brother and I to pursue our goals. For that, we are forever grateful to them."}