{"doc_id": "248", "name": "2017_10_humanities_student_major_190_mcgill", "namespace": "we1sv2.0", "metapath": "", "pub": "mcgill", "title": "2017-10-humanities-student-major_190_mcgill.txt", "pub_date": "2017-10-03T00:00:00Z", "Sentiment": "0.11", "Subjectivity": "0.322", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "314", "Permalink": "http://reddit.com/r/mcgill/comments/7411ms/second_degree_software_engineering/dnunhpe/", "Threadlink": "http://reddit.com/r/mcgill/comments/7411ms/second_degree_software_engineering", "Parent_id": "t3_7411ms", "Reddit_id": "dnunhpe", "Subreddit_id": "t5_2rhkw", "Commenter": "Eutrope", "length": "1596", "content_scrubbed": "Have you considered doing your studies in Art instead of science? I applied to McGill not knowing what I wanted to do and applied into the faculty of arts, but later on realized in U2 that CS was what I was interested in. My advisor told me that it wasn't worth my time transferring to science since transfers are difficult and the science courses I lacked due to not taking them in CEGEP (such as biology) was not worth taking if they weren't going to give value to what I want to study and do with CS. Instead she suggested that I stay in Arts and do the major concentration in cs (there[.] one for software engineering too) and compliment it with a minor (how ever doing this will require you to pick up another minor not related to science. More info is on the arts cs/swe major page of McGill) to build a program that[.] similar to the one offered by the faculty of science. I've never been asked by a recruiter if I'm in arts or science so if you had any fear of one being less superior than be other rest assured that it won't be much of an issue and if it is an issue to then then you probably do not want to work for them anyway. What they care about is your experience and the technical skills you know. This was my experience with this so it ofc may be different from someone else but so far so good. \n\nIf you have the credits maybe you can take up a minor right now. I know some people who have been able to get tech jobs with just a minor. Not saying that it[.] 100% since it[.] really up to how dedicated you are to learn what you won't be able to learn from classes you'd miss out on. "}