{"doc_id": "435", "name": "2017_10_humanities_student_major_1983_colinslaststand", "namespace": "we1sv2.0", "metapath": "", "pub": "ColinsLastStand", "title": "2017-10-humanities-student-major_1983_ColinsLastStand.txt", "pub_date": "2017-10-20T00:00:00Z", "Sentiment": "0.012", "Subjectivity": "0.4", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "254", "Permalink": "http://reddit.com/r/ColinsLastStand/comments/77oly5/young_collegeeducated_americans_are_more/donrmd9/", "Threadlink": "http://reddit.com/r/ColinsLastStand/comments/77oly5/young_collegeeducated_americans_are_more", "Parent_id": "t3_77oly5", "Reddit_id": "donrmd9", "Subreddit_id": "t5_3jlua", "Commenter": "cocacola150dr", "length": "1464", "content_scrubbed": "I went to college in rural Wisconsin, which is quite conservative. My observation was that while the student population was split down the middle politically, the university itself was quite to the_left. Students freely discussed politics in the dorms, conservatives included, but when it came to the classroom it was a rare sight to see a conservative voice pipe up or for anybody of any political leaning to question SJW stuff (full disclosure, I hate the term SJW and rarely use it, but I couldn't think of a better phrase).\n\nI had to take a Women in Law class to satisfy my liberal_arts and one other requirement. As you can imagine, there were some topics that we talked about that were very delicate in nature. The professor, to his credit, was very good at broaching certain subjects and made sure the guys didn't feel like they were being piled on. When we actually discussed things, however, you'd get people to the_left giving their opinions, but it was very noticeable that people to the_right were nervous to say anything because of the environment we were in. Nobody ever attacked anybody, verbally or otherwise, and discussions were very good for the most part, but it was clear that questioning anything we were taught was going to seem anti-LGBT or anti-feminist and so people were afraid to question any claims or stats that were brought up.\n\nEDIT: Alright, you can't fucking down vote me for stating my factual observations. What the actual fuck?"}