{"doc_id": "1095", "name": "2017_04_humanities_student_major_1728_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2017-04-humanities-student-major_1728_GradSchool.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.092", "Subjectivity": "0.39", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "304", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65jfwp", "Reddit_id": "dgaqqoi", "Subreddit_id": "t5_2r4r8", "Commenter": "pgrechwrites", "length": "1637", "content_scrubbed": "I remember the moment I decided to go to grad school. It had been a lingering thought for several months, but one I didn't invest much time or effort into figuring out right away. I was a junior in undergrad who dual majored in English and philosophy. \n\nWhile walking with my philosophy professor one night, I realized, quickly and all of a sudden, that I HAD to go to grad school. I had learned so much, enriched my life so greatly, that I thought it would be \"selfish\" of me if I didn't share all that I had learned (and would continue to learn) with other students. It was a sort of existential demand. \n\nI don't mean to suggest that everyone has or should have an experience similar to mine. Of course not. I imagine many others have a more practical, reasoned approach to making the decision. But that[.] how I figured it out. I didn't want to do anything else. \n\nAs far as thinking it was worth it, my experience may not relate to yours (you're in STEM, right?). I'm in the humanities, which has a crumbling job market, and I'm not in a top 25 program (but it[.] still good). The only thing encouraging possible regret is the mass amount of student loans I've accumulated. I just maxed them out and have to apply for PLUS loans. Given the bleak job prospects and the student loan that will survive my death, I don't regret it at all. I've worked several different types of jobs (blue collar, corporate life (6. 5 soul crushing years), and tattooing) and I know I wouldn't have it any other way. I love what I do and study and this is the life I want. Absolutely.\n\nHope this gave you some kind of insight (apologies if it[.] a ramble). "}