{"doc_id": "421", "name": "2017_10_humanities_student_major_1797_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2017-10-humanities-student-major_1797_changemyview.txt", "pub_date": "2017-10-19T00:00:00Z", "Sentiment": "0.123", "Subjectivity": "0.377", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "234", "Permalink": "http://reddit.com/r/changemyview/comments/77h030/cmv_most_college_students_in_humanitiessoft/doltx29/", "Threadlink": "http://reddit.com/r/changemyview/comments/77h030/cmv_most_college_students_in_humanitiessoft", "Parent_id": "t1_dolso03", "Reddit_id": "doltx29", "Subreddit_id": "t5_2w2s8", "Commenter": "I_am_the_night", "length": "1370", "content_scrubbed": "\nLike I said, first year, so very easy as far as I can tell. \n\nOkay well that explains a lot.  Many first year courses are designed to be very basic in order to provide a bare minimum foundation to build on.\n\nBusiness is very much included in my OP. In fact, I think business programs/majors are the biggest offenders for this sort of thing. \n\nWe'll just so you know, business is not mentioned in your OP, nor is it traditionally considered part of the humanities and social_sciences.\n\nI love the humanities, and I mean really love them, but I'd like to know the uses for sub-average to average humanities graduates, and why those uses mean we should publicly pay them hundreds of thousands of dollars to attend school.  \n\nWe'll first, I think you're jumping to conclusions given that you're only looking at first years. Wait until those psychology students take their psychology statistics course.  If it[.] anything like mine was it will wake them the fuck up. \n\nSecond, it[.] hard to judge who is and who isn't a good student by outside observation, and more importantly it[.] hard to tell if somebody is actually gaining something from theUT forge experience. Are there people who probably don't deserve to have their college education funded?  Yes absolutely.  The difficulty is coming up with an objective, fair way to separate those students from the \"good\" ones. \n\n"}