{"doc_id": "489", "name": "2017_10_humanities_student_major_2603_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_2603_AskReddit.txt", "pub_date": "2017-10-26T00:00:00Z", "Sentiment": "0.08", "Subjectivity": "0.398", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1847", "Permalink": "http://reddit.com/r/AskReddit/comments/78wauf/what_scares_you_as_an_adult_but_didnt_when_you/doxme9f/", "Threadlink": "http://reddit.com/r/AskReddit/comments/78wauf/what_scares_you_as_an_adult_but_didnt_when_you", "Parent_id": "t3_78wauf", "Reddit_id": "doxme9f", "Subreddit_id": "t5_2qh1i", "Commenter": "AliceKettle", "length": "9990", "content_scrubbed": "I'm 22, and so far I'd say that being an adult scares me a lot more than it did in childhood when I used to think it would be so cool to do whatever I wanted once I reached my twenties, like in all of the movies and TV shows that paint being a grown up as so glamorous and so fun. So far, I've hated having to learn how to be an adult. I wish I could be ten again! It[.] like you have restrictions from authority figures that bug you when you're a kid, but you're still free, safe, independent, and limitless in the sense that you aren't expected to figure out what your going to do with your life for yourself. You take that for granted when you're a kid, especially if you're a very spontaneous, laid back, and easy going sort of person, like me, who likes to sit back and do their own thing, while everyone else plans my education and future for me. When you become an adult, go to college, and get a degree, you have to motivate yourself to come out of your shell and take initiative to do well, and it[.] often very terrifying to face your future because it brings up a bunch of insecurities, fears, and realizations. For instance, for nearly the past four years, I've been thinking about shit, like: \n\"What if I don't succeed?\" Why is the job market so fucking competitive these days to the point that I need like a 100+ credits of classes that I'll never use again to graduate from my school? Why is the tuition for my school so fucking high due to them forcing me to take all of these seemingly pointless credits in classes that I'll never use the knowledge from in my future career? Why do I have to get this much accreditation to be a success, and be in school for so long to get all the requirements I need to do so? Why can't I just get my major, and graduate within four years, so I can find a job, make a family of my own, and move on with my life? Why didn't I figure out that I needed a minor to graduate from college sooner, and why did my second advisor only tell me this shit NOW when I have made it through this school for the past three and a half fucking years, and should be graduating in the spring with most of the rest of my class of 2014-2018? How was I supposed to find out all this information myself? Why did I not think to find this information out myself sooner?\"\n\nGoing through so much school can feel soul-crushing, especially if you're a laid back person by nature, like me, who naturally values personal enjoyment, emotional investment, and passion in every subject they do as a primary motivator, and often has the mentality that  \"If I'm not having fun doing it, it feels like a chore, and so I'm going to put it off for as long as I possibly can avoid doing it until the last minute when the pressure for the assignment[.] approaching deadline finally hits me, or ask for an extension because, otherwise, doing that math assignment makes me feel bored, confused, stupid, etc., and I never like to have to indulge long in anything that ever makes me feel uncomfortable for that long.\" \n\nLearning to be an adult sucks because you're expected to be able to figure out everything for yourself, and how you're going to support yourself and be successful with a career. You have unlimited independence, and no teacher/professor is ever going to be constantly up your ass about making sure you do your homework on time for every class, or slowing the pace of the class down to accommodate you, which is what most of us thought we wanted to escape back when we were naive kids and teenagers in K-12 school, who took life for granted. Then, college comes along, and many of us, like me, realize that we've been given more independence and high expectations from the unspoken rules of professors and advisors outside of the classroom than we know what to do with to motivate ourselves when it comes to taking a lot of classes in subjects that we struggle with, don't like, have little to no interest in, and don't need for our major/minor and intended future career, especially if you're in a liberal_arts school, like me. \n\nHigh school is essentially an academic prep for the same thing, but it was so much easier to stay focused and motivated on school, even in classes that we didn't enjoy taking enough for most of us to earn a 3. 0+ cumulative GPA, so long as we followed the rules because the teachers were breathing down our necks the entire time with help and support for us in the class, even when we didn't ask them for it.  In college, I WISH I had teachers on my back, offering help, support, and classes that fit my individual pace. \n\nAlso,  you need to be really outgoing, social, and committed to forcing yourself to take initiative to go out of your way to meet new people in college. If you're an introvert by nature, who tends to get too attached to their desire for personal space and alone time to the point of borderline to extremely unhealthy isolation, if you don't see your immediate family every weekend, and you are  like me, who will isolate themselves all alone in their single dorm rooms for five days a week, typing away on tumblr, Twitter, and/or Facebook when they're not in class or busy with homework and studying. This is true for many other Gen Z/iGen kids, who have never known a world without a computer (1995-2012). We're obsessed with our smartphones and computers to the point of losing our social skills. \n\nYou need to be committed in college to taking the initiative to make new friends by signing up for a roommate from your freshman, joining this and that club, and again,  it will be very difficult, if not impossible, if you're an avoidant and lonerish introvert by nature, who can go for days without much interaction outside the classroom alone in their dorm room all day, not a self-starter by nature, especially when you have the option to not stray outside of your comfortably easy personal little loner bubble in your spare time. I say that I don't care about not having any friends in college anymore, but a small part of me does. \nAgain, in K-12 preschool-high school, I was set up to have to get outside of my loner comfort zone, and interact with new people outside of the classroom because we had the same lunch together in the cafeteria Monday through Friday, we had a lot of the same classes together, there were school sanctioned dances, and I went to junior and senior prom with a guy. Sure, I wasn't romantically interested in him, and I'm almost positive that he had Asperger[.] Syndrome, but he was genuinely nice to me. We had fun together. I learned not to judge him, and he learned not to judge me. He helped me boost my self-esteem, and I helped him boost his. He listened to me, and I listened to him because we were a couple of the very few kids from the mild special ed social outcast crowd with high future expectations for four year college and potential grad school degrees that many of the other kids in the special ed crowd didn't have, we had the same lunch together. I had an IEP for my dyscalculia and mild to moderate Hemi CP that slowed my visual/spatial skills and processing speed, and he seemed to have one for Aspergers). \nThe rest of my \"friends\" in high school were more so on-and-off-again frenemies than true friends. I was an awkward, immature, naive, and melodramatic teen, who never really thought before talking, but for the most part, I never intended to hurt anyone[.] feelings, though I wasn't entirely innocent of being a gossip, either... One of my frenemies, on the other hand, could be deliberately manipulative, petty, two-faced, and cruel to me, and made me cry on more than one occasion when  conflict arose between us because I did what I normally still do and avoided facing my issues with them until I no longer could. \n\nIt wasn't a great social life back then, but at least it was SOMETHING of social life with people outside of my mom, my dad, my two younger brothers, my mom[.] parents, and my mom[.] sister and her two kids, who are 15-20 years my junior. \nIn college, I have NO ONE outside of my immediate family, though! Granted, it[.] my own fault for not taking the initiative to make new friends, but getting close to new people makes me uncomfortable. K-12 forced me to interact with new people and get outside of my comfort zone doing so on a regular basis, and college doesn't. \nI thought getting a liberal_arts education meant that I would mostly have free reign over the classes that I got to take. I thought it meant that I would only ever have to take classes that I needed for my major in English, and certain other classes which I thought would only ever be in subjects that I found genuinely interesting, so it would be easy to excel in all my classes because I would be enjoying all the subjects I took. I dreamed of having a glamorous social life, and having fun with friends every weekend... But, NO!\nYou have to have a major AND a minor to graduate from my college, even if you don't want a minor, and you have to take a bunch of other 40-50+ credits of stupid and pointless credits in shit like first year experience, health, and phys ed. I thought I was done with gym and health classes after high school, but now I need them in college, too! \nAll I know is that my optimism of getting a liberal_arts degree has been shattered by the college I chose to attend, and still intend to graduate from (because somehow I've survived by doing enough to get by, and I should have only 36 more credits to go after this semester[.] over, so I might as well finish up and graduate from my college I've been attending for the past 3+ years now, even though it pisses me off that it[.] going to take me at least one extra semester than most of my peers to do so).\nBeing a young adult is all about making it to the top of the food chain, no matter how much you might have to sell your soul to do so through gaining accreditation. That[.] hard to do when you just want to be happy being average, dancing through life by doing what you love as much as possible."}