{"doc_id": "916", "name": "2017_04_humanities_student_major_27_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_27_AskReddit.txt", "pub_date": "2017-04-01T00:00:00Z", "Sentiment": "0.031", "Subjectivity": "0.404", "Score": "85", "Upvotes": "0", "Downvotes": "0", "Wordcount": "500", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_62pn44", "Reddit_id": "dfopszf", "Subreddit_id": "t5_2qh1i", "Commenter": "Kahzgul", "length": "2710", "content_scrubbed": "I was an orientation counselor for incoming students during the summers at my school.  I'm a good looking guy (back then I was in the gym every day, too), and I'm personable, smart, etc..  The other counselors pegged me as \"most likely to bang a freshman\" and their jokes were non-stop throughout training.  I was also the arts counselor, so I was getting all of the incoming actors, designers, dancers, cheerleaders, etc...  Basically all of the stereotypical \"hot girl\" majors fell under my purview.\n\nAnyway, every single session at least one of my students would make a pass at me.  Not always a girl.  Before you ask, no, I didn't bang any of my freshmen!\n\nSome of the come ons were really weird, like one girl kept telling me I had nice hands and it looked like I had strong fingers.  Another girl asked me if I thought her boobs were fake and if I wanted to find out (obviously there were real, but I wouldn't have minded checking.  Except, of course, that I'm a goddamn professional and wouldn't do that to a poor, impressionable freshman).  One guy said that since we were both in college now we should \"experiment.\"  I shit you not.\n\nThe best was a junior transfer student I had.  She was crazy hot to the point where all of the other male counselors found excuses to constantly visit my group that session.  When she walked up on the very first day, boobs practically bursting out of her shirt, short plaid schoolgirl skirt kicking up, she said, I swear to god, \"I'm only here because I have to be to get my scholarship.  I'm not gonna fuck you.\"  Color me shocked.  I had really no response to that, so I just kind of stammered \"Um... okay.\" and then quickly turned and walked over to another counselor.  I'm sure she found it hilarious.  Two days later at the end of the session, everyone was saying goodbye, and she writes her number on a post-it and says, \"Remember that thing I said when we met on the first day?  They were both lies.\"  And then she walked away.\n\nGod.  Damn.\n\nAnd then in the intervening two weeks between the end of that session and the start of school year, I guess she got back with her ex boyfriend, because we never got together.  Brutal.\n\nOther than that one girl, I always made a point of being very professional, thanking the crushers for being so flattering but no thanks, etc..\n\nFast forward to a few years later, I and every one of my students from that time have graduated.  I had this weird streak of like five or six of the girls who had had crushes on me back then randoming showing up at a bar I frequented, telling me how much of a crush I was (one used the term \"dream conquest\") and then coming back to my place.  So it all worked out swimmingly in the end :)"}