{"doc_id": "1070", "name": "2017_04_humanities_student_major_1412_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-04-humanities-student-major_1412_politics.txt", "pub_date": "2017-04-12T00:00:00Z", "Sentiment": "0.048", "Subjectivity": "0.366", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "681", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg5qtg3", "Reddit_id": "dg65l41", "Subreddit_id": "t5_2cneq", "Commenter": "knotswag", "length": "4359", "content_scrubbed": "Hi /u/ViskerRatio. Reading your post has actually made me change my mind on the necessity of this March for Science thingy. You're clearly a well-read, thoughtful person but your misunderstandings about current NIH funding processes really suggests a greater need for transparency and the dissemination of information about how most academics obtain funding in the U_S and the necessity of science in general.\n\nBriefly: when you write up a shiny grant and apply for government funding, your application is not being judged by bureaucrats or private entities. And the grant cannot be \"wildly inaccurate:\" the government doesn't want to waste taxpayer money on projects that don't seem possible or doable. [That[.] why there[.] study sections; we're being judged by our peers and other experts.](http://www. epilepsy. com/information/professionals/resource-library/how-national-institutes-health-nih-study-section-works) A lot of grants are not funded precisely because they're too risky or because the researcher doesn't have the experience or resources to pull off the proposed project. \n\nYes, there[.] salesmanship in the grant. Yes, you have a higher chance of receiving a better score if you frame your proposal in a manner that shows the significance of your research for the general public (i. e. the tax payers that make research possible). It[.] normal: you're literally trying to convince the government that out of hundreds of other proposals, that YOUR research is the most worthy of receiving money from our continually shrinking science budget. But that doesn't mean that the research is inherently politicized or that the research favors anything in particular. The amount of esoteric research that is pushing the boundaries of science in general that may not have implications for years, if ever, other than furthering our knowledge of the universe surprises me frequently.\n\nThere is no \"crisis\" of non-reproducibliity\" in the sciences. There are obviously scandals, sure. But people that flub their research are called out far quicker now than ever due to social media. The last major scandal I can personally remember was the [whole STAP fiasco](http://www. newyorker. com/magazine/2016/02/29/the-stem-cell-scandal), and the time between the publication of findings, other scientists trying to reproduce the data and failing, and subsequent retraction was a scant few months. The NATURE of science is to QUESTION whether an observation is real, so any decent scientist with a modicum of scientific integrity would not let bad science pass. Based off the people I've met, I think it holds true for the majority of scientists across all disciplines.\n\nIt[.] not to say there aren't flaws in our funding process, or the review process, or anything else. Anyone in academia can go on and on about it; ask any senior graduate student or young investigator. But to dismiss the March for Science as being this politicized entity, and to say that government-funded research is inherently \"corrupt\" because the money is provided by the government is simply not true.\n\nI will not try to pretend to understand the motivations for all the scientists and science-supporters that will March, or speak on behalf of them. Many scientists will participate in the March for Science for many reasons. Some of them will be to ensure the preservation of their livelihood, maybe. But science is not like the coal industry and people are marching because they're worried about jobs disappearing. Science is not really an \"industry,\" even. It will persist whether the government funds it or not, just as the arts will, because it is an inherently human endeavor to be curious and to better understand the natural world. I believe the majority of people are marching to raise awareness that science should not be dismissed, that facts should not be suppressed, and that critical thinking can inform policy and likewise policy can help unleash the potential of human thought. The current administration believes in the capacity of science enough to push for our space program: why doesn't it believe in the findings from the other sciences, or believe in the potential of the other sciences to also help humankind? I think if there[.] any sort of political motivation behind the March, that is one of potentially many that it[.] posing.\n\nSource: I'm an academic scientist."}