{"doc_id": "416", "name": "2017_10_humanities_student_major_1727_genewolfe", "namespace": "we1sv2.0", "metapath": "", "pub": "genewolfe", "title": "2017-10-humanities-student-major_1727_genewolfe.txt", "pub_date": "2017-10-19T00:00:00Z", "Sentiment": "0.089", "Subjectivity": "0.351", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "579", "Permalink": "http://reddit.com/r/genewolfe/comments/77blo1/the_sorcerers_house_open_spoilers_discussion/dol8g8w/", "Threadlink": "http://reddit.com/r/genewolfe/comments/77blo1/the_sorcerers_house_open_spoilers_discussion", "Parent_id": "t3_77blo1", "Reddit_id": "dol8g8w", "Subreddit_id": "t5_2trh7", "Commenter": "alzabosoup", "length": "3251", "content_scrubbed": "We have done extensive discussion of this book on our podcast, so we won't go too heavily into detail here, but the most basic points about the novel are as follows:\n\n* Bax is a convicted criminal who was found guilty of fraud and forgery. There[.] also some suggestion he knows how to commit fraud in real estate.\n\n* We get a very limited picture of what[.] happening in the house by virtue of the fact that Bax writes most of the letters. He is our only source for the majority of strange happenings in that house, and we have to trust he[.] telling the truth. There are several scenes and characters in the book that only \"exist\" in Bax[.] letters to George/Millie, so it[.] possible he[.] making entire elements of his story up whole cloth. Again, our narrator is a known con-man.\n\n* Bax has several advanced degrees (or potentially forged some of them, though there was a reason for him to stay in school forever). Many of those degrees have to do with the humanities or literature in a specific way, and the letters he writes bear resemblance to folk tales and Dickensian/Victorian literary works. In other words, he has a lot of knowledge with which to spin a yarn exactly like the one he[.] telling.\n\n* Bax has an agenda when writing to Millie and George. He clearly needles George and paints him in a bad light throughout the letters. He also rubs the success of his supernatural adventures in George[.] face and makes a big deal about his transformation from rags to riches.\n\n* There are clear indications from the beginning of the book that Bax and George have an antagonistic relationship, and that both have taken actions to hurt the other in the past. \n\n* There[.] a markedly different tone in the letters that Bax writes to his old cellmate, Shell, as compared to Millie. Shell never gets information about anything fantastical or unusual at the house, most of his conversation with Bax is related to practical matters. If Bax is comfortable telling George and Millie about werewolves, twins from a different world and the triannulus, but never mentions it to Shell, that[.] a big discrepancy that needs to be explained.\n\n* According to the curator of the letters, somehow Bax did end up inheriting the Black house and the Skotos Strip, coming into their possession legally, did have an Asian female companion, did possess a strange sword, and did ride his strange antique car around town in public view. So if this was all a con, an explanation for the con would have to include how all of those things occurred.\n\n* Madame Orizia and Doris seem to be the closest thing to an outside witness of the supernatural in the story, since they both write letters, but there are also good reasons for both of them to be in league with Bax for their own personal gain. We have to weigh our opinion of their trustworthiness against the descriptions we get from Bax and their own letters to make a decision on that.\n\nThis doesn't definitively answer your question about whether or not a con occurred (we think the book can be read both ways and that there are problems landing on either interpretation), but hopefully all of these points help you understand why Bax[.] story *could* be a lie, and what problems his lying would create that has to be resolved."}