{"doc_id": "1118", "name": "2017_04_humanities_student_major_1828_wayofthebern", "namespace": "we1sv2.0", "metapath": "", "pub": "WayOfTheBern", "title": "2017-04-humanities-student-major_1828_WayOfTheBern.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "-0.058", "Subjectivity": "0.311", "Score": "15", "Upvotes": "0", "Downvotes": "0", "Wordcount": "287", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65pm34", "Reddit_id": "dgc5ckl", "Subreddit_id": "t5_3ff8l", "Commenter": "Winham", "length": "1713", "content_scrubbed": "If you haven't been following (and I would not blame you if you have not), there was yet another pro-Trump demonstration in the ultra-liberal city of Berkeley, California yesterday, which was once again met with counter protests from masked \"antifascists\", and which once again turned violent. This happened because people who voted for Trump last year are tired of being painted as racist Nazis by the people who voted for Clinton, so some of them have been staging the conservative equivalent of a gay pride parade to let everyone know that they're out and they're not ashamed. The people who voted for Clinton, meanwhile, have been brainwashed by corporate media into believing that their nation is being taken over by fascist bigots, so when they saw what they were being told was a rally for white nationalists and neo-Nazis assembling in their neighborhood, they came itching for a fight. Tempers flared and fists flew.\n\nI'm not calling for this behavior to stop, for the record; if a bunch of bored internet denizens want to get together and break their hand bones on each other[.] skulls with poorly-thrown punches in order to feel something, that[.] fine by me. I just think it[.] worth drawing attention to how ridiculous this whole thing is getting. Because some rich people and their politicians figured out that rural Americans have different fears than urban Americans and that these fears can be used to keep voters fighting each other instead of demanding a just and equitable society, you've now got guys dressing up like Captain America running around breaking sticks over the heads of dreadlocked black bloc liberal_arts majors in one of the most expensive parts of the wealthiest nation on earth."}