{"doc_id": "341", "name": "2017_10_humanities_student_major_1072_advice", "namespace": "we1sv2.0", "metapath": "", "pub": "Advice", "title": "2017-10-humanities-student-major_1072_Advice.txt", "pub_date": "2017-10-11T00:00:00Z", "Sentiment": "0.004", "Subjectivity": "0.417", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "327", "Permalink": "http://reddit.com/r/Advice/comments/75rzjs/i_study_english_lit_in_turkey_and_my_teacher_gave/do8k1nm/", "Threadlink": "http://reddit.com/r/Advice/comments/75rzjs/i_study_english_lit_in_turkey_and_my_teacher_gave", "Parent_id": "t1_do8i4kq", "Reddit_id": "do8k1nm", "Subreddit_id": "t5_2qjdm", "Commenter": "80234min", "length": "2042", "content_scrubbed": "  However, 99 per cent of them are left-leaning and feminist.\n\nSo be the dissenting opinion. If you're uncomfortable being outnumbered by people you disagree with, then you may want to pick a different field of study.\n\n this is not a matter of engaging with opinions as it is about being imposed on by a higher authority\n\nYou're not being imposed with anything. You're free to disagree, but you're not free from being exposed to ideas you don't like. Are you being threatened with violence? Has she given you poor grades because she disagreed with you? If so, then you should go to the department; otherwise, deal with it, as you aren't being imposed with anything. \n\n who is teaching a subject irrelevant to her course\n\nWelcome to literary theory. There really isn't much that[.] irrelevant to the study of literature, and part of the humanities education is looking at literature through different lenses: class, race, history, philosophy, and yes, gender. You couldn't teach a class about *One Flew Over the Cuckoo[.] Nest* without talking about mental illness and institutionalization; you couldn't teach *American Psycho* without talking about violence and the history of the American 1980s; you couldn't lead a discussion on *The Left Hand of Darkness* without talking about sex and gender. Good literature courses are going to supplement literature with theory and context, and they need to teach the theory/context in order for you to understand it. Literature classes aren't *just* reading literature, you're also going to have lessons/readings in history, philosophy, gender/race/class studies, politics, and much more. You don't have to agree with the theoretical framework, but you will be expected to understand it, and if you disagree with it you'll be expected to propose a counterargument. \n\nAnd I mean, what is your end goal here? Professors who only give out readings on uncontroversial theories? Professors who never talk about anything except the literary work? This would be a poor humanities education, and boring to boot."}