{"doc_id": "952", "name": "2017_04_humanities_student_major_304_the_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "The_Donald", "title": "2017-04-humanities-student-major_304_The_Donald.txt", "pub_date": "2017-04-03T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.438", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "301", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfshzik", "Reddit_id": "dfsj43s", "Subreddit_id": "t5_38unr", "Commenter": "Florida_Bushcraft", "length": "1707", "content_scrubbed": "The problem is, as can be observed by free college loans to anyone for any major, is that all these colleges are at their hearts for profit and we get things like $800 (or even $2000!) text books and ballooning costs at every turn because college students can borrow as much as they like, so colleges and industries related to higher education (fuck you persons) massively inflate the cost of things and make college more expensive than it is anywhere else in the world, developed or otherwise, by a massive margin. \n\nI would 100% schools that are completely funded by the state (not federal government) where students can take a test to attend and then attend 36 months of state funded school, so long as they keep their grades up, and major in a STEM or technical field / area of study. No competitive sports, spartan conditions, but pay the teachers well and focus the spending on good labs and good teachers, not on fancy stadiums. No non academic frats and a dry campus. Make it about learning, not drinking, fucking and sports.\n\nIf you think my tax dollars should go to getting some girl a degree in music or liberal_arts or the history of Belgian lesbian ligature in the later part of the 1870[.] you are out of your mind. \n\nI completely support studying the arts and philosophy and such, but it is only a modern pursuit to study only those fields. Until recent times most philosophers and many artists were also mathematicians, scientists, engineers and inventors. Now we have this world were people get useless degrees in fields that can not easily be taught in a conventional setting, and then they never use their degree and get out without any practical or useful skills but massively in debt. \n\n"}