{"doc_id": "1284", "name": "2017_04_humanities_student_major_3331_casualiama", "namespace": "we1sv2.0", "metapath": "", "pub": "casualiama", "title": "2017-04-humanities-student-major_3331_casualiama.txt", "pub_date": "2017-04-29T00:00:00Z", "Sentiment": "0.185", "Subjectivity": "0.443", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "698", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgxft0r", "Reddit_id": "dgxhuf1", "Subreddit_id": "t5_2sxwp", "Commenter": "CyndiLJ", "length": "3897", "content_scrubbed": "Matt and Josh both tested as gifted and talented, and we started homeschooling in part because of that before we even had a true label.  Matt was reading at a 10th grade level in 5th grade and was at an underperforming school, and we were concerned he was losing his love of learning.  We decided to give it a try, he got tested later at a public homeschool alternative school we used for the first couple of years.  Within 2-3 weeks we saw a huge difference in his engagement, and we realized we were making the_right choice for him... and everyone else followed.  Josh[.] 1st grade teacher at the time asked if we were pulling him as well, and said we might want to as she suspected that in a couple more years we might have the same thing happen with Josh as happened with Matt.\n\nThey both do extremely well in academics, and always have.  The freedom from \"busy work\" at school like useless testing, worksheets, etc. has allowed both to blossom in ways I never expected.  Matt is 17 now, and took AutoCAD and advanced AutoCAD at 14 and 15, used his skills to design and build his own customized 3D printer, and has taken coding and already passed one COMP-TIA certification and is almost ready for another.  He is working towards his pilot[.] license, and was able to obtain a black belt in TaeKwonDo before his back started really hindering him.  He is an eclectic kid with a great appreciation for the arts, who right now is reading Alexandr Solzhenitsyn for fun, and asked for an art print for his graduation gift!  Funny, deep dude whose patience and quiet personality helped his siblings feel accepted and accommodated more than he will ever know.\n\nJosh is an all around good student, just tested post-high school in ALL subjects on the Stanford 10 standardized test he took this week, and is taking College Algebra on top of Geometry  AND completed Algebra 2 this year.  As a 7 year old we began a brief intro to politics and parties, and  I started to get a glimmer of his unique mind when he identified as a Libertarian, and then succinctly explained why, and continued to hold true to those beliefs in a variety of ways in our ongoing conversations... and by gosh he really IS a libertarian!  He has no strong obvious direction as Matt did with tech, and is not in any gifted program as we sort of just let the kids take the lead in giving us direction.  He is exploring things, but hasn't found his 'thing\" yet, though he will be studying film making next year as an elective and his imagination may shine there.  \n\nJosh has needed more closeness at home, as his attachment issues arose off and on during earlier years.  He is now feeling much more secure and drifting into new areas, so i suspect the next couple of years we will see more growth and pursuit of specific areas.  \n\nIt has been... um... interesting, to say the least, to teach such a wide array of kids, and somehow, it has worked.  We teach some things together, some things separately, and our kids have had very few outside courses, mainly math taught via computer program.  I was teaching English to new learners as I was doing remedial phonics with Kenny 3 different times, as I was trying to stretch and provide Matt with all he needed in terms of dialogue and exploration, and exposing Josh to things that were higher level yet not too mature. The girls were not only illiterate in English, but basically uneducated in their native language, having memorized a few facts but having almost no preschool level knowledge, let alone appropriate knowledge for kids their ages at the time, so we literally started at preschool and blew through 2-3 years a year.  It was fun!  I learned I wasn't a half bad educator despite having only a high school diploma, and we have enjoyed every moment of it... but it has been WORK! haha!\n\nOh, and thanks for the congrats for Matt, the Spaatz was a huge deal for him... as it should be!"}