{"doc_id": "1126", "name": "2017_04_humanities_student_major_1907_uci", "namespace": "we1sv2.0", "metapath": "", "pub": "UCI", "title": "2017-04-humanities-student-major_1907_UCI.txt", "pub_date": "2017-04-17T00:00:00Z", "Sentiment": "0.089", "Subjectivity": "0.355", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "251", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65tavj", "Reddit_id": "dgdbkjv", "Subreddit_id": "t5_2r7xu", "Commenter": "TheZombieBat", "length": "1470", "content_scrubbed": "My time has come!!! I'm a history and global culture double major (along with minors in art history and Latin American Studies)! So feel free to ask me any questions!\n\nIt[.] my first year here (as a transfer) so I can't answer 100% of your questions but I can try.\n\nSo the difference between global cultures and international studies is that global cultures is more focused on the cultural part of it (I know that sounds obvs but let me explain). So while some global cultures and international studies courses may overlap international studies tends to be more focused on politics and international relations while global cultures is more focused on that culture in general. So like this involves everything: history, politics, art, film, etc. \n\nDouble majoring in something else in humanities while doing global cultures is super easy and I recommend it. The school of humanities in general is super flexible. \n\nI haven't met any global culture majors but that[.] because there[.] only a few specific global culture classes (which I haven't taken yet) and besides that you take any class that has to do with your region be it history, art history, polisci, sociology, etc\n\nEdit: I just received an email about a free quarterly GC luncheon. I guess I didn't get it last quarter because I barely declared idk? But it[.] to meet the director and other GC majors/minors. Unfortunately I can't go because of work tho. But there you go, there are opportunities to meet others :)"}