{"doc_id": "1072", "name": "2017_04_humanities_student_major_1423_careerguidance", "namespace": "we1sv2.0", "metapath": "", "pub": "careerguidance", "title": "2017-04-humanities-student-major_1423_careerguidance.txt", "pub_date": "2017-04-12T00:00:00Z", "Sentiment": "0.076", "Subjectivity": "0.34", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "891", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64ys76", "Reddit_id": "dg6akcv", "Subreddit_id": "t5_2t9i0", "Commenter": "penisbarn", "length": "5516", "content_scrubbed": "All of the undergraduate degrees you list are pretty general, and don't necessarily describe the skills and experience you'll graduate with. An employer is interested in what you can bring to them based on the work experience and skills you have. The specific title of your degree is far less important to most employers, especially when looking at these very broad degree choices. You mention that broad programs of study are more appealing to you because you can tailor your description of what you studied to fit various jobs. Employers care FAR less about what you studied than how that translates into actual workplace skills.  \n\nFor example, let[.] say a Cognitive Science class has you do a comprehensive meta-analysis of a very specific area of cognitive research that interests you. You're responsible for navigating journal databases, evaluating research, drawing conclusions, and putting together a presentation of your findings for your class. This takes weeks of work. You worked really hard on this project and think it demonstrates your ability to do any number of research, analysis, writing, public speaking, etc. tasks that an employer might be looking for--and I'm not saying you're wrong. BUT. Most employers are going to barely glance at whatever degree you listed, just to make sure you have a BA/BS if that[.] a requirement for the job, and then they're going to want to see \"real world\" examples of the work that you've done. A resume listing out a series of courses studied and class projects worked on is not very interesting to an employer. I think you are overestimating the amount that you can sell the experience you gain in the classroom. Every college graduate has 4, 5, 6 + years of coursework and research they can describe to an employer--but employers want to know that you can reliably translate that education into the workplace. There are just too many people with college degrees--they don't want to take a chance on someone who doesn't already have a track record of workplace success. Even for entry-level jobs.  \n\nBecause of that, it[.] going to be far more important to seek out internship opportunities, research assistance positions, and networking opportunities. Of the majors you're considering, do any of them require an internship or practicum as part of the degree program? Do any of them have an active presence in professional organizations or other connections to unique networking opportunities? Do any of them emphasize taking on summer internships or otherwise provide an easier pathway toward developing hands-on skills?  \n\nAnother consideration is whether the practical experience a program offers lines up with what you want to try out professionally. For example, some Human Development programs require students, or give students the opportunity, to work with small children at a university child care center. That could give you hands-on experience working with children, which is often a requirement should you want a job working with small children in the future. But DO you want a job working with small children in the future? If not, that kind of built-in work experience might not do you a lot of good.  \n\nSO--all of that being said--my brief thoughts on your top majors listed, keeping in mind the perspective of someone seeing your degree title in a stack of 100 applications:  \n\n* Science and Technology Studies: Sounds like a fancy title for a Communication Studies/Sociology mashup. Employers will assume you have computer skills that you may or may not have. Could easily feed into any number of interesting but hard-to-find-employment-after grad programs.    \n* Cognitive Science: Sounds like it would be a hard_science degree, but your description makes it sound like it isn't. Hiring managers at your standard office job might wonder why you are pivoting away from a science career path.  \n* Psychology: Extremely popular major. Will need grad school if you want to work as a counselor/researcher/etc. Doesn't really outline to an employer what skills you bring--because it is such a popular major, people of all ability and experience levels routinely have this as their BA/BS.  \n* Human Development: Would assume you want, or wanted, to work with children in some capacity. Without an ECE license, or pairing this with another professional pathway (social work, physical education, etc.), it would be difficult to work with a living wage directly in this field. As a potential employer, I might ask why you choose that field of study, and would probably expect a pretty broad response about wanting to understand people, and how that[.] a benefit in any work environment, etc. Which is a fine response, but also really a non-response, in terms of helping the employer really know what you have to offer.  \n* Individual Major: So essentially an interdisciplinary Liberal Arts degree--correct? Extremely broad. As a potential employer, I would look to the work experience you bring, so I would expect to see internships and other campus work projects (research assistant, campus newspaper, anything to build up demonstrable skills). Really that goes for ALL of these majors.  \n\nApologies for the wall of text and if I sound extremely negative or pessimistic. I myself studied something VERY impractical, but have never regretted it, and have always (so far...) found steady employment. I've also worked for years as an undergraduate student advisor, so please know that you're not alone--most students share these questions and concerns. \n\n\n\n"}