{"doc_id": "950", "name": "2017_04_humanities_student_major_295_samharris", "namespace": "we1sv2.0", "metapath": "", "pub": "samharris", "title": "2017-04-humanities-student-major_295_samharris.txt", "pub_date": "2017-04-03T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.347", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "253", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfscn25", "Reddit_id": "dfsdiev", "Subreddit_id": "t5_2thqg", "Commenter": "kidamnesiac94", "length": "1510", "content_scrubbed": " there is evidence supporting the idea that there is a purely sexist bias against women in certain fields (STEM fields for example).\n\nAny links? Most of what I hear in academia is that they're actively trying to open up STEM subjects to women. \n\n (A) one where women think they can become engineers and another (B) where they are pressured to be mothers, they might be \"choosing\" in some trivial sense. \n\nWell, I don't know where you live, but here in the UK women have been outperforming men in education for a while now. \n\nI can see there perhaps being a light stereotype on STEM fields being 'masculine' and Humanities, for example, being 'feminine' that might have a small causal effect, but the vast majority of individual women, at least those with the ambition to go to University (more likely than men), aren't making long_term life choices based on these things. \n\n Both of those things should be discussed in a more nuanced way than: feminists are ideologues and insane.\n\nI agree. I'll admit I don't pay much attention to Christina Hoff Sommers, if that[.] her rhetoric then it[.] a little extreme. One thing you might consider is that she'll have received a considerable amount of vitriol from feminists on these issues. \n\nIt[.] easy for us to stand outside these debates and wonder why many public commentators/intellectuals, including Harris, get so worked up about the_left. It[.] because they're being individually targeted by them, and it does affect their livelihoods - the discussion of ideas. \n\n"}