{"doc_id": "288", "name": "2017_10_humanities_student_major_524_baduk", "namespace": "we1sv2.0", "metapath": "", "pub": "baduk", "title": "2017-10-humanities-student-major_524_baduk.txt", "pub_date": "2017-10-06T00:00:00Z", "Sentiment": "0.041", "Subjectivity": "0.386", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1562", "Permalink": "http://reddit.com/r/baduk/comments/74rhwg/buddhism_and_go/do0zdlt/", "Threadlink": "http://reddit.com/r/baduk/comments/74rhwg/buddhism_and_go", "Parent_id": "t1_do0tugp", "Reddit_id": "do0zdlt", "Subreddit_id": "t5_2qhqe", "Commenter": "vwvwvwv", "length": "9364", "content_scrubbed": "I tried it again, and this time it showed me the whole article. Here it is, in case anyone else has any trouble.\n\n---\n\nThe Game of Go\n\nAn Unexpected Path to Enlightenment\nBy William S. Cobb\nSpring 1999\nThe Game of Go\n\nCan a board game teach the principles of impermanence, interdependence, compassion, and no-self?\n\nA number of traditional practices in Japan have been used as aids in the search for enlightenment, such as the arts of flower arranging, archery, sword fighting, the tea ceremony, and karate. In addition to serving as paths to enlightenment, they can illuminate the Buddhist perspective. However, one major traditional practice in Japan associated with Buddhism for centuries and traditionally referred to as a \"way\" or do, (pronounced dao in Chinese), has been neglected by those seeking to explicate Buddhism. This is the game Westerners call \"Go,\" known in Japan as igo or kido, \"the way of Go.\" It provides a useful way of depicting and experiencing the fundamental aspects of life as Buddhists understand it.\n\nThe game of Go originated over 4,000 years ago in ancient China where it was considered one of the four activities a person had to master in order to be truly civilized, the other three being poetry, music, and painting. It was brought to Japan around the seventh century C. E., probably by Buddhist monks returning from training in monasteries in China. Although the game is much older than Buddhism, it was quickly recognized by Buddhists as a useful tool for Buddhist practice. Until the end of the nineteenth century, the strongest players in Japan were generally Buddhist monks. (The oldest extant record of a game in Japan is traditionally ascribed to Nichiren, the thirteenth-century founder of the Nichiren sect of Buddhism.) The game was popular as a means of instilling the virtues of overcoming fear, greed, and anger among the samurai whose instructors in Go were Buddhist monks. Its capacity for making its players better people is part of the reason Go is still widely popular in Japan, Korea, and China, where millions of people play regularly. The increasing popularity of Go in Europe and America also reflects its tendency to foster humane attitudes.\n\nGo is a strategy board game, as is chess, though the two games differ profoundly. It is played with circular black and white pieces called \"stones\" on a square grid that is usually 19 by 19 lines. The stones are placed on the intersections of the lines, rather than in the squares, and are not moved during play, although they can be captured and removed from the board. Play begins with an empty board, and the players alternate placing stones on the board, with the player who has the black stones going first. As play proceeds, patterns of black and white stones evolve on the grid.\n\nWinning and losing is determined by the number of open intersections you are able to surround with stones that are safe from capture. However, the point of playing is clearly understood as not that of winning games (when Go is played properly, you lose about half of your games), but of exploring the possibilities to be found in particular arrangements of stones. You seek to create interesting games, and that requires becoming a stronger player by acquiring a greater understanding of the game. Thus, the players engage in a search for enlightenment—which involves moral qualities as well as intellectual understanding, insofar as greed and fear are the greatest barriers to becoming better at the game. A handicapping system is also built in to ensure that players of unequal skill will have an equal chance of winning or losing: The weaker player places an appropriate number of stones on the board before the stronger player places a stone, and is thus given an advantage. To facilitate the awarding of handicap stones, each player is given a rank based on past performance, which changes as the player becomes stronger.\n\nThere is a special connection between playing Go and the authentication of enlightenment, as suggested by a striking passage in Dogen Zenji[.] Shobogenzo. In the essay \"Spring and Autumn,\" (Shunju), written in 1244, the Japanese Zen master Dogen uses a reference to Go to help his audience understand a famous koan from T'ang China: a monk asks how to avoid being cold or hot. Master Dongshan tells the monk to go where there is no cold or heat. Dogen refers to several traditional explanations of this response that interpret it as making a philosophical point about the unity that must be prior to all distinctions: A unifying concept of temperature must be realized prior to the distinctions between cold and hot.\n\nDogen says that we should, instead, heed the words of Hongshi, a twelfth-century Chinese Zen master: \"It is like when you and I are playing Go. If you do not respond to my move, I'll swallow you up. Only when you penetrate this will you understand the meaning of Dongshan[.] words.\" Dogen comments on this along with an additional explanation in terms of his own notion of \"dropping off body and mind\" (shinjin datsuraku), pointing out that Go players experience a profound overcoming of the sense of separation from each other and from the process of the game.\n\nUnderstanding Go as a path to enlightenment begins with four fundamental Buddhist principles, usually denoted by the Sanskrit terms: sunyata (emptiness),pratityasamutpada (dependent co-arising, or interconnectedness), anitya (impermanence), and anatman (no-self). Each of these is present in a straightforward way in Go, and by playing the game one can experience being in a world that is quite different from that normally inhabited by most Westerners.\n\nIn contrast to games like chess, in Go there are no playing pieces on the board at the start. This situation makes the range of moves much greater because of the size of the standard board, with 361 intersections; and because all the pieces are able to occupy a point on the board, the number of possible games is astronomical.\n\nThis starting position illustrates an important point about the notion of shunyata. Emptiness, in Buddhism as well as in ordinary language, does not refer to an absolute lack of everything. Thus, the earlier translation of sunyata as \"void\" was very misleading. Emptiness refers to the absence of something that, for some reason, one expects to find—as when we say a glass, normally used to hold liquids, is empty even though it is full of air. The point is not that there is nothing there at all, but rather that what is there differs from your expectations.\n\nThe emptiness that Buddhism affirms is very similar to that in Go. The Buddhist point is that potentiality precedes actuality. There are no ultimate limits on the possibilities of being. Reality is open-ended in an absolute sense—a fact that has many implications for understanding the human situation.\n\nThe Go player discovers that the absence of an absolute fixed structure or of ultimate limits on reality is not the disaster you might expect. On the contrary, it makes things much more interesting. Go is vastly more complex than chess because of its indefiniteness, that is, its emptiness. One learns to revel in the creative possibilities that result from the relative absence of defined powers and fixed structures rather than being frustrated by the fact that there are no final answers about what constitutes good play.\n\nIn the Buddhist sense, emptiness refers to the fact that nothing is self-determining, and thus nothing is eternal. Everything is what it is by virtue of its relationships to everything else, and since no fixed thing serves as the ultimate ground of this vast complex, everything is subject to constant change. In the same way the principles of impermanence (anitya) and interconnectedness (pratityasamutpada) also fundamental to the game of Go. The most obvious manifestation of interconnectedness in Go can be seen in the way groups of stones develop during play, while the shifting significance of these groups and the stones that compose them is a clear example of impermanence.\n\nPlay in the game is directed by the intention of one player to surround more empty intersections than the other player. The technique is to create walls that encircle parts of the board by placing stones adjacent to each other so that they form solid lines. Since stones can be captured, this process becomes very complex, and the significance of stones is constantly changing. Considered in itself, a stone has almost no significance. A stone[.] real significance lies in its potentiality for interaction with other stones. It can surround territory or disrupt the ability of stones of the other color to do so, and even capture those stones. Thus, players learn that things are what they are by virtue of pratityasamutpada, interconnectedness. Moreover, the significance of any stone or group of stones is subject to the possibility of radical change. A stone or group of stones that is important at one point can become dispensable as a result of later developments. Stones can even be used as sacrificial offerings for the sake of later gain and may or may not be accepted as such. The significance of the vulnerability of the stones accustoms the players to the reality of impermanence, and again this is found to be not a dreadful situation, but one that greatly enriches the experience of playing.\n\n(cont.)"}