{"doc_id": "1057", "name": "2017_04_humanities_student_major_1296_anime", "namespace": "we1sv2.0", "metapath": "", "pub": "anime", "title": "2017-04-humanities-student-major_1296_anime.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.418", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1664", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64v73z", "Reddit_id": "dg5cb5v", "Subreddit_id": "t5_2qh22", "Commenter": "Schinco", "length": "9717", "content_scrubbed": "We start out with a rather jarring introduction of the plot in the cold open - the future plans survey and its effect on the changing landscape of the high school social circles.  From Hachiman[.] (and apparently many others') perspective, differing majors can be a death knell for relationships of all types.  We see Tobe instantly default to the [.]tatus quo' of continuing to be with his friends with no apparent regard for his future.  Yumiko, however, has a very specific goal in mind - this is only strongly hinted here but confirmed later - to continue to be with Hayato.  This is somewhat revelatory as she is presumably willing to lose the rest of her social circle to continue being close with Hayato - in doing so, some doubt is cast on her comments in S2E2 (\"I'm enjoying how things are now\"); then again, even then, she seemed all too willing to go along with it when she found out Hayato was, so perhaps this isn't as serious a departure.  Regardless, Hayato responds somewhat cryptically with \"If you don't take this seriously, you'll regret it later\", and refuses to state his leaning.  THe ending ends with a member of his clique asking him if the rumors that he and Yukino are dating are true - this is the other major subplot of this episode.\n\nAfter the OP, we're treated to Yukino[.] birthday scene.  For some reason Iroha is there (which makes a reasonable amount of sense from a meta perspective - she[.] been in the room during the end of the OP for a couple episodes right now, but the characters seem surprised she[.] there), and she goes out of the way to note her birthday (I think to Hachiman specifically based on the use of [.]enpai' and her body language).  She notes that she has (yet another) request, but asks Yukinon the truth of the rumor.  Yukinon cuts right to the chase, saying \"You know full well that I'm not\" - this is interesting to me for two main reasons.  Firstly, she doesn't directly deny it; sure she implicitly does, but especially given Hachiman[.] stated propensity to 'read between the lines', this seems to be a somewhat unusual strategy.  Secondly, it flushes out that Iroha wasn't actually asking to gather information, but for some ulterior motive; further, Yukino is very aware of it.  As to her reasoning, based on her body language and the previous episode, she may be attempting to drive a wedge between Hachiman and Yukino, expecting a more awkward response to create insecurity; alternatively, she may be trying to get some information on Hayato.  She then continues to note the effect this has on Hayato - women are now less afraid to approach him (Hachiman humorously claims that he understands his situation).  There is a slight implication (I feel) that the same may soon become true of Yukino, which could explain Iroha[.] expository there. We then progress to an adorable, but ultimately somewhat meaningless, interlude wherein Yukino tries out the blue-light blockers that Hachiman got her for her birthday, to the admiration of Yui and Hachiman (reluctantly) - this causes Yui to (in a strikingly obvious attempt to curry favor with Hachiman) to say that she should get a pair (even though she doesn't seem to need it).\nThis segues into the next section wherein the primary conflicts are reinforced - Yumiko enters and immediately demands to know \"what[.] up with [Yukino] and Hayato\", to which Yukino responds \"Nothing, really - we've known each other for ages\".  This represents a less ambiguous reply, but the 'really' certainly allows doubt to remain.  For some reason, she also adds that \"girls like you have always been a thorn in my sides\" - this feels somewhat uncharacteristically harsh and aggressive and feels like it[.] an important line due to some personal conflict Yukino has had in the past.  She then proceeds to note that Hayato appeared irritated at the rumors, prompting her to conclude that \"there[.] gotta be more to it\" and presses about their past.  Yukino becomes very defensive with \"even if there was...\".  This greatly upsets Yumiko and Yui has to calm her down.  Hachiman attempts to do the same with Yukino, which further emphasizes their closeness (perhaps at the expense of Yui) and says she doesn't mind dealing with such rumors \"so long as the people close to [her] understand\".  She then officially delivers her request - to know Hayato[.] future plans so that she can stay \"together a while longer\".  \n\nWe then transition into the meat of the episode - dealing with the request and the implicit importance behind it.  Hachiman directly asks Hayato his plans and blatantly lies about his reasoning, to which Hayato responds very directly and aggressively, asking Hachiman to \"stop trying to trap [him] like that\" - this hearkens back to last episode when he notes that it was \"pretty mean of [Hachiman] to put me in that position\" regarding Iroha[.] advances.  Hachiman reacts surprised and Hayato falls back pretending it was a joke or hypothetical before refusing to answer the question.  We then get a scene with Saika which serves a dual purpose - to once again emphasize that Hayato really has his pick of the litter when it comes to his future (he[.] the \"only one... that has a shot\" at being recruited for sports) and also to set the plot up for the marathon scene later.  \n\nWe then get a Haruno scene - but before that there[.] yet another minor Iroha scene where she playfully drags Hachiman in by his sleeve and then stops when she realizes Yui and Yukino are there.  Yukino asks Haruno about Hayato[.] plans after Hachiman[.] failure in the endeavor, but she refuses because, in Haruno[.] eyes, she[.] \"back to leaning on people\".  This could either mean that she doesn't want Yukino blindly following Hayato (somewhat unlikely) or that she wants Yukino to become more self-sufficient and find out herself (this changes later).  Ultimately, she refuses.  After the event, Haruno insists that Hachiman walk her to the station.  As usual, she pries for information on Yukino, specifically her plans for the future - she claims that she wants to \"compare answers\", though Hachiman expresses his doubts.  She then asks if Hachiman asked Hayato directly, to which she responds that \"Hayato was hoping... for a certain someone to find him, perhaps?\"  The way she pauses and the timing indicate that she expects Hayato will be more open to Yukino, presumably because he likes her.  This really confuses me as there are seemingly two 'plots' or potential partners for Yukino that Haruno has her eyes on - Hayato and Hachiman.  The scene at the event would make it seem like she[.] pushing Yukino into Hayato[.] waiting arms, as did the ending scene last episode; however, giving Hachiman the heads-up here is somewhat counterintuitive to that strategy - she presumes that Hachiman cares about Yukino, so obviously he wouldn't send her right into Hayato[.] clutches, so perhaps this is something of a test of resolve to see how far he'll go to keep Yukino to himself?  Regardless, Hachiman seems to realize what she[.] saying and clearly doesn't like having her ask Hayato - he neglects to mention it to Yukino, moving forward with a plan of his own (the seeds of which were set with Saika earlier).  \n\nDuring the marathon, Saika and the other tennis players create something of a blockade to keep the other runners from catching Hayato and Hachiman - then, when they're halfway (when Hachiman believes Hayato to be at his weakest emotionally), he lets loose, asking if Miura was \"a convenient way to keep other girls away\".  He then tries to convince Hayato to go into the sciences so as to \"distance himself from the things shackling you\" - expectations, women, etc - this also provides a convenient end to the group so no one has to get hurt (ala the Tobe issue in S2E2).  Hayato then does something very curious - he admits that he hates Hachiman because he feels \"inferior\" - he wants to be equals so that he \"can accept losing to\" Hachiman.  While Hachiman seems confused about his implication (after all what could Hayato possibly be losing to - he[.] one of two people ranked above him academically, is a social butterfly and a star athlete), it seems pretty clear that he[.] referring to Yukino[.] affection.  Hachiman limps to the finish line, having injured himself trying to catch Hayato, as Hayato is giving his victory address, during which he specifically thanks Iroha and Yumiko, thus effectively dispelling the rumors of him dating Yukino.  \n\nHachiman heads to the infirmary to disinfect his room, where he finds Yukino.  After a brief back-and-forth, wherein she speculates what 'awful' aspect of Hachiman caused this tragedy, to which Hachiman plays along noting that he is all awful.  She then notes that he \"can't keep [his] hands to [himself\", which struck me as odd - does she think he got in a physical confrontation with Hayato?  She then insists on tending to his wounds.  There[.] another brief back-and-forth, where she implies that Hachiman is a germ (this isn't analytically important, but, again, it[.] adorable and I feel the need to mention it).  He mentions that he[.] not going into the sciences \"at the very least\", to which Yukino responds that it was a weird way to phrase it.  She then finishes up and leans up and they freeze, exactly at eye level for like thirty seconds before Hachiman breaks it off, thanking her - we get a closeup of the bandage, which is beautifully tied into a knot, and Hachiman asks her what field she[.] going into, to which she notes that \"that[.] the first time you've asked me something like that\" (thus continuing the theme of change), before noting that she[.] going into the arts, along with Hachiman and Yui (and also presumably Hayato).  \n\n(continued in a child comment)"}