{"doc_id": "1206", "name": "2017_04_humanities_student_major_2650_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2017-04-humanities-student-major_2650_funny.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.141", "Subjectivity": "0.32", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "261", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgn1eeo", "Reddit_id": "dgnol7w", "Subreddit_id": "t5_2qh33", "Commenter": "Account115", "length": "1572", "content_scrubbed": "It[.] a catchall used to categorize humanities, social and behavioral sciences, language arts, etc. Exactly what is and isn't considered a liberal art will vary depending on who you ask. \n\nBasically, non-business, non-STEM, non-vocational, non-fine art. \n\nI think a lot of so-called \"liberal_arts\" majors actually do quite well and gain a lot of valuable, marketable skills. Many also set themselves up for graduate school. \n\nYou'll always have your STEM/Business Degree master race type folks lined up to shit talk liberal_arts majors, but many of the top performing ones move on to advanced and professional occupations, while many BBA students go on to work in cube farms and STEM majors often fight for a small set of high paying but scarce jobs. \n\nSee, marketing majors are a dime a dozen. Communications/sociology undergrads with an MBA bring a different perspective to the table. This makes them more competitive both for grad schools and, ultimately, for jobs.\n\nIt works both ways and, for the most part, comes down to the individual.\n\nI also think \"liberal_arts\" education does a lot to benefit the whole person/whole life value of education.\n\nAnd a smart person learns 1000 times more outside of school than in it. If your whole idea of the value of education stems from the immediate marketability of coursework, you're in for a shock mid-career. A trained monkey can use quickbooks or autocad. I'd collect dozens of masters degrees of they were free, but, ultimately the knowledge itself is more valuable than tue transcript once you have your foot in the door."}