{"doc_id": "531", "name": "2017_10_humanities_student_major_3000_imgoingtohellforthis", "namespace": "we1sv2.0", "metapath": "", "pub": "ImGoingToHellForThis", "title": "2017-10-humanities-student-major_3000_ImGoingToHellForThis.txt", "pub_date": "2017-10-30T00:00:00Z", "Sentiment": "0.185", "Subjectivity": "0.381", "Score": "146", "Upvotes": "0", "Downvotes": "0", "Wordcount": "314", "Permalink": "http://reddit.com/r/ImGoingToHellForThis/comments/79q406/elephant_in_the_room/dp4na4r/", "Threadlink": "http://reddit.com/r/ImGoingToHellForThis/comments/79q406/elephant_in_the_room", "Parent_id": "t1_dp4lvpy", "Reddit_id": "dp4na4r", "Subreddit_id": "t5_2s7yq", "Commenter": "CaptainPunisher", "length": "1787", "content_scrubbed": "I know my response is a little tongue in cheek, but there are whole fields largely populated by one sex, whether that[.] because of tradition, discrimination and pigeon holing, or natural inclinations. For the men that DO go into nursing, how many of them do you think get teased and ridiculed by their friends & family, and by some of the nastier women in the program. Think about the last male nurse you had and answer honestly after some thought: Was he gay? I'm not saying ALL male nurses are gay, but many are. Is that number higher, lower, or reasonably in line with the instances of homosexuality among men? \n\nNow, on the other side, studies have shown that men are more apt in the classical sciences, while women show more skill in the humanities. This drives them to enroll in their better fields, thereby starting the divide in the workplace. I recently graduated from the computer science program at our local university, and it[.] a very male-dominated field. There were and are some young women in that and related fields (computer engineering, electrical engineering, etc), but the ratio is much lower than in the school of liberal_arts. No one is keeping them from coming to these majors, and, in fact, there are scholarships just for women pursuing degrees in the sciences. I'm not young to play the \"poor men\" card here, but instead let[.] find ways to make these fields now attractive to women. \n\nMaybe we can start earlier by making simple coding classes mandatory in grade school. Computers are where the most jobs are going to be in the future anyway. But, in college, if admissions started to enforce a 50/50 rule in majors, we'd be hearing an uproar about people on both sides not getting the classes they want, but at least it would be balanced and kind of fair."}