{"doc_id": "518", "name": "2017_10_humanities_student_major_2858_etymology", "namespace": "we1sv2.0", "metapath": "", "pub": "etymology", "title": "2017-10-humanities-student-major_2858_etymology.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.004", "Subjectivity": "0.315", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "244", "Permalink": "http://reddit.com/r/etymology/comments/79ioga/three_of_the_major_english_speaking_countries_uk/dp2lz43/", "Threadlink": "http://reddit.com/r/etymology/comments/79ioga/three_of_the_major_english_speaking_countries_uk", "Parent_id": "t1_dp2f3ll", "Reddit_id": "dp2lz43", "Subreddit_id": "t5_2qspe", "Commenter": "melikeybouncy", "length": "1521", "content_scrubbed": "in America we \"go to college\" but the school is usually called a \"University.\"  Many universities today started out as colleges.  Many started out as \"College of...\" where they were focused on a narrow discipline.  For example, \"teachers' colleges\" and \"colleges/schools of business\" used to be really common.  There were even colleges for individual sciences.  As these schools grew and started offering more majors in more disciplines, they added these new \"colleges\" into organization and changed the name to University.   Within most universities, you'll see that the school is split into several different colleges, the college of business, the college of liberal_arts, the college of education,etc.  Sometimes these colleges even have district names from the University (especially common with business and law schools).  for example, The Wharton School of Business is a college of the University of Pennsylvania. \n\nWe also have trade schools and junior colleges/community colleges. I'm not really sure how the higher education system in the rest of the world developed, but in the US, the name switch to University really happened in the second half of the 20th century.  Up until then, \"going to college\" was something only the really elite did.  Baby boomers went to college and they sent their kids to college, even though by then they weren't called colleges anymore.  The name just stuck.  Kids are now starting to say \"going to University\" but it[.] not as common as in the rest of the English speaking world."}