{"doc_id": "423", "name": "2017_10_humanities_student_major_1826_askphilosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "askphilosophy", "title": "2017-10-humanities-student-major_1826_askphilosophy.txt", "pub_date": "2017-10-19T00:00:00Z", "Sentiment": "0.117", "Subjectivity": "0.44", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "595", "Permalink": "http://reddit.com/r/askphilosophy/comments/77h8pr/applying_for_bachelors_degree_in_philosophy_as_i/dolxm1j/", "Threadlink": "http://reddit.com/r/askphilosophy/comments/77h8pr/applying_for_bachelors_degree_in_philosophy_as_i", "Parent_id": "t3_77h8pr", "Reddit_id": "dolxm1j", "Subreddit_id": "t5_2sc5r", "Commenter": "oneguy2008", "length": "3573", "content_scrubbed": "Glad to hear you're interested in philosophy!\n\nThe first thing to say is that the philosophy job market is *very* tight. A good chance at a tenure-track job with a decent salary and job security realistically requires a PhD from one of the top 20 programs in the world, and is far from certain even moving into the top 5 or 10. It[.] incredibly hard_work and, while fulfilling, not well compensated and has low job mobility. This isn't meant to say you can't pursue a philosophy PhD, only that you might not want to set your mind on it completely, and should keep other options open.\n\nIf you do want to set yourself up for a good career in philosophy, the good news is that for the most part, the academic considerations involved in choosing an undergraduate philosophy department are the same as the overall academic considerations that go into choosing a school. Broadly speaking, you want a school with a smart and hard-working undergraduate population so the classes will be delivered at a high level. Traditional measures like SAT and GPA are, while fallible, decent proxies for this. This means that you won't have to make a firm commitment to philosophy just yet (at least, not in the US system).\n\nThere are two complications in the case of philosophy. The first is that, although generally small liberal_arts schools are *great* choices if you'd like to do a PhD, many SLACs in the US have faculty with research interests substantially different from those valued at top PhD programs. That doesn't mean you can't walk out of such a program into a great PhD (I did; with some luck, planning, and hard_work) but you'll have to be strategic about it, making sure to cover core electives like logic, metaphysics, epistemology, philosophy of mind, language, etc. \n\nThe second is that some of the very best philosophy departments in the world (NYU, Rutgers, Pittsburgh) are lower in undergraduate quality and prestige (particularly Rutgers and Pittsburgh) than similarly-ranked counterparts. This can potentially create a great opportunity, as undergraduates there have good access to very high-caliber faculty. However, you'll pay for it with courses aimed lower, larger courses, absent professors, and a focus on graduate education. So while you might *think* about giving these programs a boost in your considerations, in large part the best advice really is just to pick the best SLAC or research university you can get in to and work hard.\n\nAs for what you should read, don't stress just yet. You'll learn to do philosophy in an entirely different way in your first few courses, so you might just have to re-read them anyways. \n\nWhat you **must** do, if you're serious about graduate study in philosophy, is to enroll in an introduction to philosophy course in your first year, and to communicate to your academic advisors that you are seriously considering further study in philosophy and would like advice designing an appropriate course schedule. \n\nWhat you **must not** do, if you're serious about graduate study in philosophy, is to take easy courses elsewhere or do badly in them, including the sciences. That[.] not just because you'd be robbing yourself of a great education, but also because admissions committees will want to see demonstrated intellectual curiosity and performance at a high level with some breadth of interests. \n\nWhat you **might consider** doing is picking up a second major in an allied subject such as linguistics, cognitive science, psychology, math, physics, or biology. But only do this if you're genuinely interested in the subject."}