{"doc_id": "1024", "name": "2017_04_humanities_student_major_945_cringeanarchy", "namespace": "we1sv2.0", "metapath": "", "pub": "CringeAnarchy", "title": "2017-04-humanities-student-major_945_CringeAnarchy.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.058", "Subjectivity": "0.421", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "244", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg0vyea", "Reddit_id": "dg0wcrx", "Subreddit_id": "t5_35j1r", "Commenter": "Bears_Bearing_Arms", "length": "1429", "content_scrubbed": "Probably the biggest is just how much he intended to tax people.  No one over 27 would vote for him if they knew how much of their paycheck he intended to take.  \n\nHe spent his honeymoon in Soviet Russia and spoke highly of it and  he[.] a self-proclaimed socialist.  That would also be a death knell for pretty much any politician in America.  Socialist and Communist are still dirty words to the vast majority of Americans.  \n\nHe[.] an Atheist.  Another thing most Americans automatically distrust and dislike.  \n\nHis wife was involved in some sketchy business with a job she had at a college (that she totally didn't get because she was his wife) and her decisions eventually led to the college having to close.  \n\nHe pays something stupid like 13% income tax and, yet, expects everyone to fork over the lion[.] share of their income so that  strangers can get liberal_arts degrees.  \n\nHis idiotic plan to tax investment transactions.  This would basically nuke the retirement savings of every American.  \n\nHe was unemployed for most of his adult life until he started politics.  Even as a politician, he[.] done little besides rename a few post offices.  \n\nThere are loads more.  This is all just off the top of my head.  \n\nIf you don't think that the GOP would lynch him with his own words, you're deluding yourself.  No Socialist/Atheist that flatout plans to increase taxes will ever get elected in America.  I guarantee it.  "}