{"doc_id": "300", "name": "2017_10_humanities_student_major_628_adhd", "namespace": "we1sv2.0", "metapath": "", "pub": "ADHD", "title": "2017-10-humanities-student-major_628_ADHD.txt", "pub_date": "2017-10-08T00:00:00Z", "Sentiment": "0.032", "Subjectivity": "0.351", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "263", "Permalink": "http://reddit.com/r/ADHD/comments/74zky2/adhd_and_grades/do2rlh2/", "Threadlink": "http://reddit.com/r/ADHD/comments/74zky2/adhd_and_grades", "Parent_id": "t3_74zky2", "Reddit_id": "do2rlh2", "Subreddit_id": "t5_2qnwb", "Commenter": "life_of_distraction", "length": "1463", "content_scrubbed": "\nHave you tried going to the tutoring dept and asking for help?\n\nRemember something I've learned just because you are getting a B or C on the test doesn't mean you aren't learning the material.\n\nI recently survived a college world history class, with a B, barely. But in the same breath, I learned far more about world history that was on the test and understood concepts my fellow classmates still don't. Unforenntly, the only thing that matters is the dam test.\n\nADHD or not, make sure you are in the_right major for you. Don't be taking physics or organic chemistry because you've been told that[.] the only way to get a good job after college. Try as hard as I can, even to the point of the professor and I both sobbing in frustration, I simply CAN NOT, under any circumstance, do any math harder than basic algebra. My ADHD brain just... it just can't. Be it organic chemistry or Pre-Cal, The professor can be standing over me, telling me just write down 3x+-Y^7. Just write it down... and I draw a squirrel. I'm told to write down 3. 14 is pi. The professor gets a stick figure holding a fishing pole.\n\nMusic, the arts, humanities, human resources, public relations, library science-those fields I kick ass in. ADHD or not, math/science is not my gift. That doesn't mean I'm stupid, it just means that[.] who I am-the weird artsy person. And that[.] okay. It[.] okay to earn a college degree that has nothing to do with STEM and everything to do with Liberal Arts."}