{"doc_id": "958", "name": "2017_04_humanities_student_major_414_ithaca", "namespace": "we1sv2.0", "metapath": "", "pub": "ithaca", "title": "2017-04-humanities-student-major_414_ithaca.txt", "pub_date": "2017-04-04T00:00:00Z", "Sentiment": "0.197", "Subjectivity": "0.433", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "386", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63h7cc", "Reddit_id": "dfu4z3u", "Subreddit_id": "t5_2rp73", "Commenter": "srslymrarm", "length": "2162", "content_scrubbed": "1. I went to IC for English education, but I originally matriculated into the Park School of Communications, so I'm pretty familiar with that school and the film program. Of course, I can't compare it with anything, but I can say that my film major friends always seemed *very* busy - always some new project to work on. It seemed like a very hands-on program, and seeing as the community is huge on the arts, there are film festivals to promote that. The more talented and devoted film majors seem to now have at least some work in LA, so I would say the program (and really the communications school in general) is pretty decent. \n\n2. The atmosphere is very friendly overall. If you want to party, you can easily find one, but that[.] not really the predominant atmosphere. For being a relatively small school, there always seemed to be something for everyone, and I never got the impression that people viewed one lifestyle as superior to another. Everyone just did their own thing. \n\n3. Ithaca (the town) and IC are hugely devoted to the arts and theater. If you want to be a part of a play, I guarantee there will be a production that will welcome you sooner or later. Keep in mind you'd be competing with a bunch of theater majors, but again, there[.] generally enough theater to go around. Rock climbing is trickier because the area is very much shale, so (to my knowledge) there[.] little if anything in the area that[.] even legal to climb. But there are a couple of bouldering walls in the area, at least one of which is on Cornell[.] campus. \n4. Ithaca is a safe, friendly, close-knit town. It[.] pleasant to walk around almost anywhere here. There are many gorgeous hiking trails, areas for swimming/cliff jumping, and camping. It[.] actually a huge tourist destination in the summer and fall due to its geography and local economy. That said, the academic year mostly comprises a long, cold, snowy winter. As someone who loves the seasons, I have no problem with that. If you come here and don't already know how to ski or snowboard, I suggest taking a . 5 credit class in it - you'll make some activity buddies while also learning how to enjoy the winter. "}