{"doc_id": "1283", "name": "2017_04_humanities_student_major_3324_albany", "namespace": "we1sv2.0", "metapath": "", "pub": "Albany", "title": "2017-04-humanities-student-major_3324_Albany.txt", "pub_date": "2017-04-29T00:00:00Z", "Sentiment": "0.011", "Subjectivity": "0.335", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "529", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgxc5en", "Reddit_id": "dgxe2ke", "Subreddit_id": "t5_2qzxo", "Commenter": "FifthAveSam", "length": "3053", "content_scrubbed": "I will respond in kind:\n\nNYFB\n\n\"We in academia\" is a coalition of scientists, researchers, humanists, and volunteers dedicated to moving beyond the shameful past in the humanities when White, Western, (often) English speaking men would define their culture as \"normal\" and others as \"abnormal\" or \"subhuman.\" See the history and social context of AAVE as one example if you're curious. Or the enslavement of Africans in the US and the \"morality\" behind it.\n\nI hate the comparison, but it[.] all I can think of off of the top of my head. You know how Trump uses words but forgets they have meaning? How he makes comments and forgets they have meaning or an impact? When anyone mentions a \"standard\" for a group of people in any cultural or ethnic sense, like language, it carries a very racist, or at least very exclusionary, context underneath. Or, perhaps more understandably, an imperial history that \"anyone not like us\" is abnormal, or not human, or needs to be looked after so slavery, killing, or occupation is for their own good. It[.] watered down supremacist rhetoric. The part of the Wiki I quoted was saying that in a consolidated manner; there is no more general consensus, if any, among the people who now practice in the field *because*, well, it[.] old-timey racism.\n\nBack to the topic on hand, GA is considered a *preferential* way of speaking *to a large number of people* because it is considered the most understandable accent by the majority because of it[.] lack of emphasis on certain pronunciations. Just like business lingo is preferred in the office, or medical terminology is required in medicine... it[.] simply a way to communicate to the intended audience. It[.] vanilla.\n\nI'll explain it in another way. IQ is a terrible measurement of intelligence, often used as the *standard* or *baseline* in society. But intelligence is context specific. You could be very intelligent in certain cultural systems because you have the required knowledge to function in society (what school is for), but if I drop you in the middle of Papua New Guinea, you'd be dumb as a stump.  I would be too. How to forage, what can I eat, how do I get around, what[.] that noise? The only reason it[.] still used today is because we don't have an alternative. We haven't decided what intelligence is exactly, there[.] no general working definition.\n\nI'll even be slightly more personal. I happen to be dating a black woman for the last decade (her father happens to be a linguistics professor who practiced for 60+ years, but that[.] just an interesting side note). She[.] well educated, speaks multiple languages, some of them unheard of by most. She has a great job and is a critical asset for her employer. She dresses well, is never in sweatpants or pajamas and takes care of herself. Do you know how often people say things about her in passing? How often we can't get a seat in certain restaurants in 2017? How we're frowned upon by some people because we're a mixed race couple? It[.] frustrating to say the least.\n\nEdit: sorry that took so long to type."}