{"doc_id": "433", "name": "2017_10_humanities_student_major_1951_dragonage", "namespace": "we1sv2.0", "metapath": "", "pub": "dragonage", "title": "2017-10-humanities-student-major_1951_dragonage.txt", "pub_date": "2017-10-20T00:00:00Z", "Sentiment": "0.017", "Subjectivity": "0.312", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1044", "Permalink": "http://reddit.com/r/dragonage/comments/77mkhj/spoilers_alloctime_to_be_storytellers_the_dragon/done9mt/", "Threadlink": "http://reddit.com/r/dragonage/comments/77mkhj/spoilers_alloctime_to_be_storytellers_the_dragon", "Parent_id": "t3_77mkhj", "Reddit_id": "done9mt", "Subreddit_id": "t5_2r8lo", "Commenter": "criticalmode", "length": "5981", "content_scrubbed": "note: i'm going to take this prompt as an excuse to feel out a style for my stupid buddy cop au, in which dorian and cullen are detective partners. it has gotten *stupidly detailed* in my head and now i have an excuse to spit it out onto a word document. ~~my character doesn't actually directly appear im sorry i keep doing this~~\n\nalso, i'll probably be back later to address older prompt 1, since i talked about it a lot this week in the headcanon thread. it[.] a great weekend for writing.\n\n***\n\n**Prompt 1**: *modern au*\n\n\"You could have told me about her, you know.\"\n\nDorian is looking pointedly at Cullen over the brim of his coffee, his eyebrow quirked. Cullen sighs and sets the binoculars in the cup holder of the car, reaching instead for his phone. They were on this stakeout for the next few hours, until Aveline could relieve them of their shift – it is nearing midnight, and they are here until 4AM.\n\n\"We've been partners for just a few weeks, Dorian. I didn't think it was relevant information.\" To continue avoiding eye contact, Cullen checks the picture of the file he had taken on his phone before they left the precinct earlier that day. They're tracking a known accomplice of Corypheus, a woman named Calpernia. Maker willing, she would appear before 4AM so Cullen could go home.\n\n\"She[.] your girlfriend. I didn't exactly expect the worst arson in Haven history to reveal to me that your potential life partner was my *roommate in college*,\" Dorian huffs. Cullen[.] girlfriend, Argent, had been the singular witness when Corypheus burned down City Hall the previous week. It was after she gave her statement to the police that the partners discovered she knew both of them; Dorian had been a close friend of hers in college before he dropped out, and she had started dated Cullen some months ago, unaware the two were coworkers. While Cullen looks at the file, Dorian takes the binoculars. \"It[.] a small world, Rutherford.\"\n\n\"I had no idea you even went to the same college – she[.] a music teacher. You're a cop. Those two jobs generally don't require degrees from the same liberal_arts university, *Pavus.*\" He finally looks over at Dorian, now that he[.] swiped through all the file pictures. His partner is frowning, still peering at the building with the binoculars. \"What did you major in?\"\n\n\"Theatre. Not intuitive, is it?\"\n\n\"Not at all,\" Cullen agrees. They lapse into an uncomfortable silence; to fill it, he prompts, \"What made you join the academy?\"\n\nDorian lowers the binoculars and looks at him curiously. \"That[.] a big question, Cullen. Do you ask every new coworker that, or am I just special?\"\n\n\"I was just curious.\" Cullen shrugs. \"Most cops I know studied criminal justice, or psychology. Some law students, too. Not many theatre kids.\" When Dorian doesn't respond immediately, it feels almost wrong – he is notorious for his quick tongue. Quickly, Cullen adds, \"If it[.] personal, you don't have to tell me. We have four hours of this stakeout left, and-\"\n\n\"No, no, it[.] fine,\" Dorian interjects. He rubs at his eyes, and hands off the binoculars to his partner. \"It[.] time I told someone, hmm? My parents are...well-known producers of shows. The big wigs. Southerners have certainly heard of how ridiculously huge a franchise the theatre is in Orlais and Tevinter, yes?\"\n\n\"Sure. Everyone had to read *King Drakon* in high school.\"\n\n\"My parents are more or less the reason those shows even get put on. They're filthy rich, Cullen – like, there is a bowling alley in the basement of my childhood home. It[.] not even a home, it[.] an *estate*, it[.] so resplendent. They pay for one-day shipping without thinking twice about it.\" Dorian pauses to take a deep breath; Cullen looks through the binoculars at the building, to give him some semblance of privacy. \"I went to college for theatre on their wishes – and I was fan-*fucking*-tastic, you can ask Argent – but everything felt...wrong. It[.] a bloated industry with high competition, and where do you think all the money from tickets go?\"\n\nCullen considers the question. \"Wild guess: the producers?\"\n\n\"And many others outside of the performers. It was an awful, awful slog for a field meant to be so freeing.\" Dorian takes a long sip from his coffee, stalling while he mulls over his thoughts. \"I wanted to do something to help. I didn't want to deal with their damn legacy, so now I'm here. Sitting in a cop car at midnight, waiting to bust some dangerous criminal.\" He pauses again, then says, \"Well, *my* soul is bared – how about you, Mr. Rutherford? What made you decide to become a cop?\"\n\n\"I should've seen this coming,\" he mumbles. But before he can respond, the door to the building moves. \"Wait, Dorian – movement. Quickly, the camera–\"\n\nThere[.] a slight scramble as Dorian hoists the surveillance camera to his eye. He snaps pictures as a figure emerges from the building, too engrossed in a conversation with someone at the door to notice the cop car in the shadows. \n\n\"Wait, I know him,\" Cullen mutters. The figure steps into the light, and he can easily identify the suspect. \"That[.] – Samson?\"\n\n\"Another someone I should know about?\" Dorian asks, zooming in further.\n\n\"No, no – we lived in the same dorm freshman year of college. He flunked out before the first semester ended. What is he *doing*?\"\n\nAs quickly as he appeared, he vanishes, and the door to the building shuts as well. There is no more movement, and no sign of Calpernia. Dorian lowers the camera and whistles a long note. \"Another name on this impossibly long list of accomplices.\"\n\n\"Raleigh friggin' Samson. Aveline and Captain Pentaghast should know.\" Dorian nods, and Cullen picks up his phone to call the precinct. He is distracted as he waits for an answer, however - he had never put much stock into *why* Dorian was here. In retrospect, it was a very intimate question, and a point he shouldn't have pushed. Cullen pushes the thoughts to the back of his head as an irate Lieutenant Aveline Vallen answers his call."}