{"doc_id": "538", "name": "2017_10_humanities_student_major_3042_television", "namespace": "we1sv2.0", "metapath": "", "pub": "television", "title": "2017-10-humanities-student-major_3042_television.txt", "pub_date": "2017-10-31T00:00:00Z", "Sentiment": "-0.006", "Subjectivity": "0.461", "Score": "109", "Upvotes": "0", "Downvotes": "0", "Wordcount": "559", "Permalink": "http://reddit.com/r/television/comments/79tzmp/for_as_much_praise_as_the_fresh_prince_of_belair/dp5chqo/", "Threadlink": "http://reddit.com/r/television/comments/79tzmp/for_as_much_praise_as_the_fresh_prince_of_belair", "Parent_id": "t1_dp4vp5x", "Reddit_id": "dp5chqo", "Subreddit_id": "t5_2qh6e", "Commenter": "satanicpuppy", "length": "3105", "content_scrubbed": "I'm white, but I grew up in a part of the South where white was the minority. So you couldn't just put black kids in the \"black\" category like they do in so many places. There were the poor kids, and the rich kids, and the sporty kids, and the nerds, and all those traditional roles.\n\nAnd my black friends were mostly sporty kids, and middle class nerds. And the former could hang out with me without damaging their racial credibility, but the smart kids... You could always tell they were catching a little shit here and there for not being \"real\" whatever that meant in context.\n\nFast forward to college. I'm going to school up north, some swanky liberal_arts college that I could only handle for two years before I moved to a big university... There were about 6000 students, of which maybe 100 are black. The school was desperate to be more multicultural, but they're just *so* white.\n\nAnd all the black kids were the sort of middle class nerds I tended to hang out with at home. The dynamic was really different (that north/south shit is no joke), but even across that I could recognize the type. To me it was another strike against the place: their idea of diversity is a bunch of clean cut well spoken kids? Come on. \n\nThey had this habit of hanging out in this certain hallway in the student center. This is part of that Northern thing: you hang out mostly with your own kind. To me, it was like they were huddling together for mutual defense, and it was... offensive? It wasn't how I thought the world should work, though nobody was as bothered as I was, and whenever I mentioned it I always got a blank look.\n\nAnyway, it[.] cold as balls up there, and this hallway was a pretty direct indoor path between two sets of classrooms and between the student center and one of the dining halls, but I always noticed there was a pretty good path through the snow from people going from the student center to the big dining hall around that hall. I took it once, to see if it was faster, but it wasn't and it was fucking cold, so I never did it again. Didn't understand why it was there honestly.\n\nFew months later, I'm in some bullshit class, and we've diverted onto race (liberal college), and some white girl says she feels threatened walking through that hallway, and I laughed (I have a really deep laugh, so it was pretty disruptive), because I think she[.] got to be joking.\n\nBut no, she[.] legitimately threatened by walking down what is (to me) a hallway full of Carlton[.] and Erkel[.] and Will Smith[.]... These really non-threatening kids who'll end up being someone[.] token black friend in later life, and will be shit on by many other black people for acting *white*... To her they are *threatening*. \n\nI ended up getting called out as a racist for getting pissy over this... Probably some people are calling me a racist reading this... But I thought, Jesus, how are we ever going to get past this as a society? When those kids, those completely unobjectionable kids... When those kids are getting shit on from both sides.\n\nSorry you had to go through that man. Just be yourself, and let the haters hate."}