{"doc_id": "1103", "name": "2017_04_humanities_student_major_1773_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_1773_AskReddit.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "-0.15", "Subjectivity": "0.256", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "292", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65ku2l", "Reddit_id": "dgbg5o4", "Subreddit_id": "t5_2qh1i", "Commenter": "costama", "length": "1584", "content_scrubbed": "My AP lit teacher was a nightmare. She: \n\n* Accused me of cheating\n* Tried to convince me that my college choice was bad. I chose the #3 school in the nation for my field. It specifically prepares you for a career. She wanted me to get a liberal_arts degree and learn to \"think\" in college.\n* Asked me if a poem I wrote was about my dad when A: she knew I was the youngest of four, B: my poem referenced being passed up for the \"Younger boys\" and C: had never even met my father\n* Told my best friend that she was \"immature and childish\" and that \"someday she hoped she would grow up and realize it\" \n* Constantly talked about how disadvantaged women were and promoted a victim mentality among her female students\n* Made us read a book with graphic descriptions of rape. Which I wouldn't have minded if it wasn't a *horrible* book and everyone, even her, agreed. I think she saw it on a bestseller list and assigned it without reading it. \n* Complained about how difficult the AP test was when she'd been teaching high school English for thirty years. \n* Spent four months teaching us poetry instead preparing us for the AP test \n* Complained about how poorly teachers are treated and paid when she makes $80,000 a year. And then complained about having to proctor the AP test instead of going on strike. (Yes, I am aware that the person benefiting from a lousy system should stick up for the younger employees that do not benefit. But it[.] not something to spend entire class periods talking about in your classroom. She brought up how upset she was constantly.)\n\nShe[.] still there. "}