{"doc_id": "1161", "name": "2017_04_humanities_student_major_2216_europe", "namespace": "we1sv2.0", "metapath": "", "pub": "europe", "title": "2017-04-humanities-student-major_2216_europe.txt", "pub_date": "2017-04-20T00:00:00Z", "Sentiment": "0.141", "Subjectivity": "0.362", "Score": "17", "Upvotes": "0", "Downvotes": "0", "Wordcount": "586", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgicixm", "Reddit_id": "dgidfdw", "Subreddit_id": "t5_2qh4j", "Commenter": "NorrisOBE", "length": "3577", "content_scrubbed": "Another question I would like to raise is shouldn't soft-power as a concius effort of the state and soft-power as an independant act (and not always even concius act) of those supporting the power be seperated?\n\nWell, South Korea is one of the best examples of how to utilize soft power for foreign policy, cultural policy and economic policy.\n\nJapan uses things like anime, videogames and sushi to help shape post-WWII Japan in regards to free trade. But South Korea takes it 2 steps further and it became an official government policy.\n\nThe Korean Wave (also known as Hallyu) helped use K-Pop bands, Korean dramas and Korean cinema to promote South Korean economy, foreign policy, culture, travel, etc. And this basically all the way from the 90s as South Korea entered democracy in 1981, they had a surplus growth beating North Korea and companies like Samsung and Hyundai started operating overseas in order to compete with Japanese companies like Sony and Honda. \n\nSo the SK government in the 1990s helped fund South Korean musicians and filmmakers and they treated the arts industry the same way Japanese companies treated the automobile and culinary industry. \n\nSuddenly you have small record labels like SM Entertainment suddenly receiving free money from the government to have bigger concerts than J-Pop artists, and the government flies these K-Pop artists to Japan, China, Malaysia, Thailand, etc. and that[.] where K-Pop grew and where South Korean record labels grew big enough that they can create stars like Psy (of Gangnam Style fame), SNSD and Jay Park.\n\nAnd the South Korean government since the 1980s have been helping to submit South Korean movies to festivals like Cannes and Berlinale and it[.] been working ever since. Films like Oldboy won the Grand Prix at Cannes in 2004 and they've been so confident with their quality that [a Korean zombie film](https://www. youtube. com/watch?v=dk48Z8vx7ZE) got the Official Selection from Cannes last year (And The Handmaiden by Oldboy[.] director Park Chan Wook was nominated for the Palme too). Not many European horror films can get that status in Cannes even.\n\nAnd thus, this has eventually resulted in South Korea utilizing its successful \"Hallyu\" as a backbone for their government policies. Countries that trade freely with South Korea will have tonnes of Korean cultural imports in exchange. Companies like Samsung that operated factories in Southeast Asia have successfully promoted K-Pop bands and Korean dramas to that region. South Korea has helped fund local channels in various countries to air Korean dramas and films in exchange for helping to introduce satelite and cable television to those countries. And Hallyu has helped South Korea[.] foreign policy as countries like Vietnam and China are getting closer to South Korea and are drifting away from North Korea. It also helped encourage Korean Americans to move to South Korea and some of them even participated in either the ROK National Military Service or the KATUSA branch of the US Army.\n\nIn North Korea, the most popular black market items are South Korean dramas smuggled from China. The popularity of Korean dramas and K-Pop was a major factor in North Korean refugees fleeing to The South, and is why NK refugees consist more of women and children than men.\n\nSouth Korea is a great example of a harmonious collaboration between government and private arts companies to promote soft power. It[.] crazy how a strong belief in their culture and pop culture has changed the dynamic of an entire country. If South Korea can do it, so can Russia."}