{"doc_id": "515", "name": "2017_10_humanities_student_major_2825_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2017-10-humanities-student-major_2825_UofT.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.094", "Subjectivity": "0.419", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "755", "Permalink": "http://reddit.com/r/UofT/comments/79fbeq/im_a_first_year_and_i_kinda_wanna_drop_chm135_and/dp23d6a/", "Threadlink": "http://reddit.com/r/UofT/comments/79fbeq/im_a_first_year_and_i_kinda_wanna_drop_chm135_and", "Parent_id": "t3_79fbeq", "Reddit_id": "dp23d6a", "Subreddit_id": "t5_2rbaq", "Commenter": "fourpointedtriangle", "length": "4257", "content_scrubbed": "Do not holy shit DO NOT pursue grad studies in the humanities/social_sciences unless you are capital-P Passionate about what you're studying. Careers in academia right now are unstable and unpredictable and near-impossible to hold in desirable cities. Meet the love of your life here at UofT? Good luck convincing them to move with you to whatever tiny school in suburban USA that will give you an underpaid contract position with no benefits or permanence. \n\nStudy what interests you. I know you're thinking \"okay in this economy you can't do what you want\" but the thing is if you do what you want, you are more likely to be good at it and it will be easier/more appealing for you to actually do the work and you'll stand out as someone who gives a shit. In this economy/academic climate, giving a shit means INFINITELY more than GPA unless you're going to law school or med school BUT I can guarantee you if you don't like your courses you won't be able to push yourself hard enough to get a high enough GPA and LSAT/MCAT scores anyway. Look at a list of subject PoSts and see which ones seem interesting. Not career-leading, not lucrative, not in-demand-- interesting to you personally. Intellectually stimulating. Something you can see yourself giving a shit about. \n\nGiving a shit is step one. Once you give a shit you start to perk your ears up about opportunities for things to do that aren't just getting a high GPA. Let me repeat, GPA alone means nothing. Which is why you study something that interests you, read the department emails that offer jobs and volunteer positions and opportunities to be on committees or do extra curriculars. Take those opportunities. This is the kind of networking that isn't bullshit: where you meet like-minded people who care about the same things you do and then your name is on the tip of someone[.] tongue when the next opportunity comes up. You'll find yourself wrapped up in things you care about and having seized opportunities that lead to more leadership roles and close working relationships. All of a sudden you have a busy schedule, a full resume, and a fulfilling undergrad experience. People might even pay you to do something you like related to your field during your undergrad and you can quit your retail gig or whatever. Next thing you know, instead of graduating with a just-fine GPA that you had to best yourself up to get and a mailbox full of waitlist offers for law schools that you don't really want anyway, you have a bunch of valuable experience and people who know you and something you give a shit about that you actually want to pursue -- something you're already pursuing anyway because you gave a shit. \n\nMaybe you will end up in grad school (in a subject you like) or law school but I promise you nobody who gets to those places did it by spending four years doing something they didn't like. By doing something you care about and that motivates you, you graduate with a degree AND transferrable skills (leadership, organisation, communication, conflict resolution, etc.) AND the relevant experience to talk about those AND a solid network of amazing like-minded people who will be your mutual support as you make your way in the world. \n\nIf you don't see anything at UofT that you can see yourself giving a shit about, do yourself a giant favour and go part_time while you shop around: extracurriculars, college program, some other job, coding boot camp... Whatever. It[.] okay if the thing you give a shit about changes and there[.] no shame in not getting a good grade in math. Your value as a human is not tied to your GPA or your degree. It[.] tied to who you are, how you impact the lives of those around you and what you choose to do with your energy. \n\nSource: Went to UofT for something I loved but that doesn't have a built-in career path. Said yes to opportunities. READ MY FUCKING EMAILS. Eight years later, even my friends who were passionate about Law from day one still struggled to get in and some didn't even get in. Friends from first year who were in uni because it seemed like the_right idea and they studied whatever they thought might get them a good GPA? Lots dropped out, but many just left uni with a useless degree, no transferrable skills, and a lot of debt."}