{"doc_id": "497", "name": "2017_10_humanities_student_major_2718_singapore", "namespace": "we1sv2.0", "metapath": "", "pub": "singapore", "title": "2017-10-humanities-student-major_2718_singapore.txt", "pub_date": "2017-10-27T00:00:00Z", "Sentiment": "0.075", "Subjectivity": "0.265", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "407", "Permalink": "http://reddit.com/r/singapore/comments/7985s7/getting_into_university_with_screwed_up_a_levels/dozyfwu/", "Threadlink": "http://reddit.com/r/singapore/comments/7985s7/getting_into_university_with_screwed_up_a_levels", "Parent_id": "t3_7985s7", "Reddit_id": "dozyfwu", "Subreddit_id": "t5_2qh8c", "Commenter": "Makiwawa", "length": "2236", "content_scrubbed": "Well nothing is better than a student who just finished A levels last year to give advice eh?\n\nTo be fair, hybrid classes probably have it hard, having to cope with H2 math (so much practise) and H2 humans (crazy essays to write) \n\nIt seems to me that you're more of a humans student? So if I assume, you would probably want to pursue an arts or social science course? If you were to ask me, arts and social science courses are generally EASIER to get into. Let me explain. High flyers for art stream kids usually will attempt law/political science etc. Or some really niche course that they like (because they actually sincerely love learning and that[.] why they scored well enough to enter the course)\nScience stream students who didn't score in the 80-90rp range (or at least I think, I'm an Arts student so I have no idea) would choose the more generic courses in an arts and social_sciences school (eg. Econs, psychology) because they haven't had the chance to expose themselves to many humanities in JC. Poly kids well... I don't think there are many modules concerning humans so relatively unscathed by their intakes.\n\nSo as an arts student, getting into a humanities course in one of the Universities wasn't too bad. Even if you end up not doing too well in the math and science department, getting A for GP and humanties can be your bargaining chips in getting into a humans course. Of course, try to score well in math and the h1 science as well. It helps open up more possibilities in a course for Uni.\n\nIn the end, regardless of what score you get, there will probably be a Uni that is willing to accept you. Private Unis are more willing to accept lower rp students, but local Unis don't have too high a cut off either. And if you're enlisting, you're allowed to retake As! So that[.] another road too.\n\nA levels is just going to be like Os or PSLE. It may feel like the end of the world but we still find our ways to make things meet eventually.\n\nEdit: oh yeahh International Universities while no push over, generally respect the Singapore A level grades. So while you may not get to get into the Ivy league without straight As, the more moderate overseas Unis will accept a fair, average grade. (Overseas is REALLY ex tho)"}