{"doc_id": "1104", "name": "2017_04_humanities_student_major_1775_newzealand", "namespace": "we1sv2.0", "metapath": "", "pub": "newzealand", "title": "2017-04-humanities-student-major_1775_newzealand.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.092", "Subjectivity": "0.281", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "356", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65iag2", "Reddit_id": "dgbhd9j", "Subreddit_id": "t5_2qhma", "Commenter": "12345654321ab", "length": "1924", "content_scrubbed": "The best advice given to me was to choose something you enjoy studying at university as well as something that[.] going to get you a job once you finish studying.\n\nMaybe you're one of those people who are lucky enough to love a field that pays well post graduation and you want to be an engineer or an auditor - that[.] what you enjoy and in that case, great! But that[.] not for all of us.\n\nI studied a degree in marketing as well as a visual design degree. I enjoyed art design at school, but boy am I glad I have a marketing degree as well. But of my four years at University, the classes that enriched my learning the most were from my minor in political science. Compared to the management degree, the arts papers were chill. So much less output / sitting in class. But unlike the management papers, I actually had to put some thought into the work I did. \n\nAs a society we look down on arts graduates, and I think that manifests in arts students hating the world, and often resigning themselves to a future of low paid work in order to do what they are \"passionate\" about. The flip side of this is there are a lot of dispassionate law and business students who'd probably be a lot happier by adding a minor / major or conjoint degree in something that they were really interested in at high school (be it English, Music or History for example). \n\nThe humanities can teach us a lot. Engaged, well rounded people make for a more interesting society. That[.] one of the casualties from a focus on the bottom dollar. They're also going to be a lot more resilient to change as technology impacts the working world over the coming decades.\n\nAlso, one thing that never seems to be mentioned is how terrible science degrees are in terms of job prospects. For every comp scientist making $75k out of school, there seem to be a couple of chemistry or bio grads cleaning glassware or working as security for  KFC making $17 an hour. "}