{"doc_id": "379", "name": "2017_10_humanities_student_major_1416_china", "namespace": "we1sv2.0", "metapath": "", "pub": "China", "title": "2017-10-humanities-student-major_1416_China.txt", "pub_date": "2017-10-15T00:00:00Z", "Sentiment": "0.094", "Subjectivity": "0.311", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1506", "Permalink": "http://reddit.com/r/China/comments/76md4y/to_inspire_young_communists_china_turns_to_red/dof37rh/", "Threadlink": "http://reddit.com/r/China/comments/76md4y/to_inspire_young_communists_china_turns_to_red", "Parent_id": "t3_76md4y", "Reddit_id": "dof37rh", "Subreddit_id": "t5_2qh2v", "Commenter": "urag_the_librarian", "length": "9291", "content_scrubbed": "YUQING COUNTY, China — With the fiery zeal of a preacher, Xie Hong addressed her class of 50 fourth-grade students, all in matching red tracksuits.\n\n\"Today[.] life is rich, blessed, happy and joyous,\" she said. \"Where does our happy life come from? Who gave it to us?\"\n\nIn Ms. Xie[.] classroom at the Workers and Peasants Red Army Elementary School, there was only one correct answer, and she had worked tirelessly to ensure her students knew it.\n\n\"It comes from the blood of revolutionary martyrs! From the Red Army!\" said a 9-year-old boy, Li Jiacheng. The class burst into applause, and Ms. Xie beamed.\n\nFor decades, the Chinese Communist Party has pushed a stiff regimen of ideological education on students, requiring tedious lessons on Marx and Mao and canned lectures on the virtues of patriotism and loyalty. Now, amid fears that the party is losing its grip on young minds, President Xi Jinping is reshaping political education across China[.] more than 283,000 primary and secondary schools for a new era.\n\nChina Tries to Redistribute Education to the Poor, Igniting Class Conflict JUNE 11, 2016\nTextbooks are getting a larger dose of Communist Party lore, including glorified tales about the party[.] fights against foreign invaders like Japan. Schools are adding courses on traditional medicine and Confucian thought to highlight China[.] achievements as a civilization. The government is scaling back discussion of iconoclastic writers like Lu Xun, amid concerns that exposing students to social criticism may inspire disobedience.\n\nIn a stern directive issued last month, the party ordered schools to intensify efforts to promote \"Chinese traditional and socialist culture\" — a mix of party loyalty and patriotic pride in China[.] past. Under this new formulation, the party is presented less as a vanguard of proletarian revolution and more as a force for reviving China and restoring it to its rightful place as a world power.\n\nBut the demands have run into opposition, and even mockery, from some parents and educators, and not just the \"tiger moms.\" Many see political indoctrination as an anachronism in an era when China[.] more than 181 million schoolchildren need a modern education in math, science and liberal_arts to get ahead.\n\nThey complain that Mr. Xi, who is expected to strengthen his hold on power at a party meeting this month, is turning public education into a self-serving propaganda exercise. Some say the president seems more concerned about defending the party[.] legitimacy than educating the skilled work force that China needs to compete in the global economy.\n\nSuch frustrations recently came to a head in Zhejiang, a wealthy coastal province, where parents protested a decision by education officials to make traditional Chinese medicine a required course for fifth-grade students.\n\nDeng Zhiguo, 40, a software programr who has two children in primary schools there, said he worried that the changes would come at the expense of instruction in subjects like biology and chemistry.\n\n\"It[.] like learning Darwinism in the morning and creationism in the afternoon,\" he said. \"How do you expect children to process that?\"\n\nMr. Xi[.] educational campaign has also extended to universities, where officials have banned textbooks that promote \"Western values\" and punished professors for straying from the Communist line. Some scholars describe restrictions on free speech in the classroom as the most severe since the aftermath of the massacre around Tiananmen Square in 1989.\n\nCritics say Mr. Xi may be raising the volume in patriotic education for fear that the party[.] message is getting drowned out in younger generations immersed in social media and the internet. But he faces significant challenges. A study this year by Chinese and American researchers found that students appear to be tuning out shrill propaganda. .\n\nThe study, based on the results of a 2010 national opinion survey, found that the \"incessant ideological indoctrination by the Chinese government turns out to be counterproductive,\" with trust in the government actually falling among those who received higher levels of education.\n\nCarl Minzner, an expert in Chinese law and governance at Fordham University in New_York, said the party[.] socialist rhetoric had become \"water-cooler banter and fodder for jokes\" among educated Chinese.\n\n\"The party of revolution is now the party of the wealthy and powerful,\" he said. \"They've got to stand for something. They're worried about the moral void at the core of Chinese society.\"\n\nMr. Xi has passionately defended his push for positively portraying China[.] past, chastising schools for removing ancient poems from the curriculum and calling traditional culture \"part of the Chinese nation[.] blood and genes.\"\n\nThis fall, the Chinese Ministry of Education began rolling out new textbooks in history, language, law and ethics across primary and secondary schools. The new books include studies of 40 revolutionary heroes, writings by revolutionary leader Mao Zedong like his 1944 speech \"Serve the People\" and lessons on China[.] territorial claims in the disputed South China Sea, a pillar of Mr. Xi[.] foreign policy.\n\nAnti-Japanese sentiment also features prominently, part of Mr. Xi[.] efforts to glorify the early days of the party and its role in defending China from foreign invaders. A second-grade lesson tells the story of the \"little hero\" Wang Erxiao, a 13-year-old cattle herder who is said to have died in 1942 while trying to protect the offices of a Communist newspaper from Japanese soldiers.\n\nExperts say the party is seeking ways to justify its hold on power in an era when its founding goal of proletarian revolution no longer seems relevant. While Mr. Xi is hardly the first Chinese leader to turn to patriotism as a substitute, he has pushed a version that plays up the party[.] role as a force for restoring China[.] greatness.\n\n\"The party[.] theories lack vitality and innovation,\" said Zhang Lifan, a historian in Beijing and a frequent critic of the party, \"so the only thing they can do is to try to use the past to seize the next generation.\"\n\nThe government has set up 231 so-called Red Army schools as models for its approach. One is Ms. Xie[.] Workers and Peasants Red Army Elementary School, located in Yuqing County near the site of a former Communist revolutionary base in Guizhou, a mountainous southern province.\n\nThe school[.] curriculum recounts the experience of Mao[.] soldiers during the early years of the revolution, who are portrayed as heroically fighting to free China from rapacious warlords and Japanese invaders. As at some Red Army schools, students wear military uniforms around campus; in Ms. Xie[.] classroom, that is a privilege reserved for the best students.\n\nEven math classes are infused with party history. Students are asked such questions as calculating the distance of the Long March, Mao[.] epic 1934-36 retreat across China. (The answer is about 6,000 miles.)\n\nTeachers tell students that loyalty to the party can help them overcome personal difficulties and live a meaningful life.\n\n\"While other countries are suffering from war and people are still starving in Africa,\" Ms. Xie said during a recent lesson on perseverance, \"please don't forget the sacrifices made by the Red Army soldiers.\"\n\nMr. Xi, himself the son of a Communist revolutionary, has hailed Red Army schools as a model for the nation. He and his mother, Qi Xin, have given the equivalent of tens of thousands of dollars to the schools, records show. A Red Army school in northwestern China is also named for Mr. Xi[.] father, Xi Zhongxun.\n\nThe party sees the schools, which serve tens of thousands of students in its former revolutionary bases in 28 provinces, as charity projects that help the most disadvantaged children.\n\nWhile the patriotic appeals have found fertile ground among working-class Chinese hungry for a sense of pride, some experts warn that placing too much emphasis on nationalistic education has its own risks.\n\nJiang Xueqin, an education consultant in Beijing, said fanning national pride could quickly \"mutate into a fierce and militant nationalism\" that is difficult to control.\n\nMr. Xi[.] vision of patriotic education is already in full bloom at the Workers and Peasants Red Army Elementary School, which was founded in 1788 but only became a Red Army school in 2012.\n\nClasses begin with Red Army songs, and students take turns reciting revolutionary stories featuring Japanese spies as villains.\n\n\"The blood in the past gave us the life we have today,\" said Kuang Yanli, 11, a sixth-grade student. \"A lot of other countries want to invade our country again, so we have to study hard and make sure that doesn't happen.\"\n\nLocal officials are sensitive to the idea that the school is indoctrinating students, and the police blocked journalists from The New_York Times from reporting after being alerted to their presence.\n\nMr. Xi himself has also become a part of the curriculum. Several times a week, the school[.] more than 1,400 students line up in the cement-paved courtyard to sing an ode to Mr. Xi[.] signature phrase, the \"Chinese dream\":\n\nChinese dream for 1,000 years,\nChinese dream for 100 years,\nThe dream carries on, the dream embraces all,\nFor the revival of China, for the revival of China!"}