{"doc_id": "389", "name": "2017_10_humanities_student_major_1546_philadelphia", "namespace": "we1sv2.0", "metapath": "", "pub": "philadelphia", "title": "2017-10-humanities-student-major_1546_philadelphia.txt", "pub_date": "2017-10-17T00:00:00Z", "Sentiment": "-0.029", "Subjectivity": "0.137", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "228", "Permalink": "http://reddit.com/r/philadelphia/comments/76ylit/south_philly_meatball_contest_ends_in_vegan/dohqe3q/", "Threadlink": "http://reddit.com/r/philadelphia/comments/76ylit/south_philly_meatball_contest_ends_in_vegan", "Parent_id": "t1_dohoeck", "Reddit_id": "dohqe3q", "Subreddit_id": "t5_2qh24", "Commenter": "shwonka", "length": "1413", "content_scrubbed": "1. Nationalistic Focus –  being a proud American is one thing. The extent to which trump divides within the country for his (edit: White) nationalism is disturbing, \n\n2.  Sacrifice of Human Rights – healthcare, treatment of women, treatment of gays, treatment of immigrants\n \n3. Enemies/Scapegoats as a Unifying Cause – Hillary. Mexicans. Etc.\n \n4. Supremacy of the Military \n \n5. Rampant Sexism – Trump is literally a rapist \n \n6. Controlled Mass Media –Trump wants to check on licenses of media outlets that challenge him or reflect poorly on him \n\n7. Obsession with National Security – \"build that wall\"\n \n8. no separation of church and state—why is trump speaking at religiously driven hate groups? Why are supposed \"Christian\" themes central to his policy\n \n9. Corporate Power is Protected – he literally refused to put his empire into a blind trust \n \n10. Labor Power is Suppressed – why don't you look up trumps nominees Marvin Kaplan and William Emanuel\n\n11. Disdain for Intellectuals and the Arts – if Betsy DeVoss isn't reflective of a disdain for education, I don't know what is. \n \n12. Obsession with Crime and Punishment – Trump has literally spoken to police, encouraging \"being rough\" on suspects.\n \n13. Rampant Cronyism and Corruption – Come. On.\n \n14. Fraudulent Elections – While the elections have not yet been proven completely fraudulent, his election does not reflect the majority of votes.\n"}