{"doc_id": "1012", "name": "2017_04_humanities_student_major_862_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2017-04-humanities-student-major_862_explainlikeimfive.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.087", "Subjectivity": "0.347", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "750", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64633h", "Reddit_id": "dfzxaiy", "Subreddit_id": "t5_2sokd", "Commenter": "WilliamServator", "length": "4672", "content_scrubbed": "At it[.] core, price is a rationing method. It[.] how we handle scarcity. The problem is that as expensive as college is today, the market is saying that it[.] not too expensive—since every year colleges have more applicants than they accept. In a theoretical equilibrium state the cost of college would increase until they only get as many applicants as they have spots available.\n\nThink of a college education like any other product. If you were a store owner selling \"widgets\", and more people wanted widgets than you had available, you'd increase the price until you sold each of your widgets for the maximum price. The economics of college costs are no different.\n\nMost of the rise in the cost of college can be traced to a few factors: the social convention that everyone should got to college, the availability of financial aid, and higher education[.] tendency to inflate potential earnings of graduates. As I said earlier, the economics of college tuition can be evaluated like any other product—by looking a something[.] effect on supply and demand. Let[.] look at each of these factors using that lens, and we will be able to see a path toward more affordable higher education. \n\nOver the past 50 years, there[.] been a dramatic change in social perception regarding college. Where someone could once find good, stable work with nothing more than a high school diploma, now it[.] \"understood\" that you need a college degree. This has the direct effect of increasing demand. While there isn't much of anything we can do to change this (assuming we'd want to at all), we can recognize that we need to dramatically expand the number of available higher education options in order to accommodate the higher demand. \n\nIt[.] ironic that one of the efforts to make college more affordable has directly resulted in raising the price of college tuition, but there is no question it has. The ubiquitous availability of financial aid—specifically student loans—has affected the price of college in two ways. First, as discussed before, cost is a rationing method. Student loans have dramatically expanded a student[.] ability to pay. Where colleges that wanted a full student body had to once consider how much an average student[.] parents could afford, now they can just encourage a student to borrow against their future. Second, student loans separate the action of buying from actually paying. When students take out loans, they're agreeing to trade something intangible (payments at some point in the future) with something very tangible (the next handful of years at college). For a bit of added irony, the US policy of preventing student loans from being dischargeable in bankruptcy has prevented the financial industry from cracking down on this irresponsible borrowing and lending by insulating the lenders from risk. \n\nFinally, the most asinine of the reasons college costs have increased is college marketing. Higher education is allowed to make absurd claims about future earnings of graduates without any form accountability. Incoming students are told that liberal_arts degrees will get them jobs with six figure salaries, enticing them into areas of study that will doom them to lives of poverty. The university collects their money, but is never held accountable for their claims. It[.] sad that universities manipulate the fact that students trust and look up to professors, but it happens everywhere. In fact, since most departments are rewarded based on the number of students enrolled in their department, there is a perverse incentive structure in which professors are actually rewarded for lying to students about their future prospects. Colleges should be required to show incoming students the average earnings of each department[.] most recent graduates. \n\nThe last thing about this to consider is—what do we really want to provide our youth? Is the education part the most important or is it the college experience? Is it ok if the instruction comes from a relatively no-name establishment or is the pedigree of the education crucial? Finding qualified people to teach class isn't an expensive service to provide; it[.] the fancy buildings, the over-inflated sports programs, the student unions and recreation facilities, introduction courses taught by nobel laureates, and all the other campus \"necessities\" that make providing college so expensive—but hey, students can always borrow more, right?\n\n**TL;DR: if we want to lower the cost of college education, we need more simple education facilities, better laws about discharging student debt in bankruptcy, and tighter controls about what colleges can tell students about their potential future earnings.**"}