{"doc_id": "976", "name": "2017_04_humanities_student_major_535_askacademia", "namespace": "we1sv2.0", "metapath": "", "pub": "AskAcademia", "title": "2017-04-humanities-student-major_535_AskAcademia.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.272", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "440", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfvz19z", "Reddit_id": "dfw19hx", "Subreddit_id": "t5_2sakj", "Commenter": "SnowblindAlbino", "length": "2569", "content_scrubbed": " I just thought that a professor spent the vast majority of the time doing research and a small portion of their time was actually teaching.\n\nThat is only true at research-oriented schools. You need to do some reading on types of institutions in the US as there are several categories among the 4,500 institutions of higher ed in the country. All tenure-track faculty have job descriptions that reflect some mix of teaching, research, and service; the exact mix and the nature of each component will vary dramatically from place to place. At large research institutions teaching is subordinate to research; at comprehensive universities they might be more in balance; at teaching-oriented schools (liberal_arts colleges and community colleges) the balance shifts far more toward teaching. Faculty in all types must do service as well, and that takes up a LOT of time for many faculty.\n\nSo I better understand the split between time spent teaching versus time doing research what would you estimate the split is?\n\nAt my liberal_arts college most junior faculty (pre-tenure) are working 50-60 hours per week during the academic year, and probably 30-40 per week in the summers (when they are off contract and not being paid). During the year that[.] about 75% teaching, 25% service, with almost no time for research; in the summer it[.] 100% research until August, then swings back as we prep for classes. Teaching well is terribly time consuming, especially at the kinds of schools where mentoring and frequent contact with students is expected. For example, on top of my classes this week I have 12 hours of individual meetings scheduled with members of my junior research class alone. Plus about six hours of advising meetings (we are registering for fall). Plus four hours of committee meetings. Add to that grading a big stack of essays for one class and a stack of paper drafts for another. Oh-- and I had a Monday deadline for a newspaper column I write and a Wednesday deadline for an academic blog to which I contribute. You can imagine where the time goes, and it[.] not to research; I did publish a book last fall but it took four years of summers to research/write.\n\nBy contrast, if you're at a R1 and focused on research, you'll teach fewer classes, you'll have TAs to do the heavy lifting of grading, and some of those classes may be cakewalk graduate seminars (I know, because I've taught them). But you'll have to produce 2-3X the publications to get tenure and that pressure is something I never wanted-- I had planned on a teaching career from the outset.\n"}