{"doc_id": "437", "name": "2017_10_humanities_student_major_2002_tumblrinaction", "namespace": "we1sv2.0", "metapath": "", "pub": "TumblrInAction", "title": "2017-10-humanities-student-major_2002_TumblrInAction.txt", "pub_date": "2017-10-20T00:00:00Z", "Sentiment": "0.044", "Subjectivity": "0.253", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "297", "Permalink": "http://reddit.com/r/TumblrInAction/comments/77l3l5/here_is_what_you_learn_in_gender_studies/donz73x/", "Threadlink": "http://reddit.com/r/TumblrInAction/comments/77l3l5/here_is_what_you_learn_in_gender_studies", "Parent_id": "t1_donwalm", "Reddit_id": "donz73x", "Subreddit_id": "t5_2vizz", "Commenter": "hadapurpura", "length": "1740", "content_scrubbed": "a Bachelor of Science in Theoretical Mathematics is not complete without the courses in Sexual and Gender Identities, Reading Poetry, and Julius Caesar and the Fall of the Roman Republic. All 3 are courses in MIT, but not in the Math curriculum\n\nA Bachelor in Science in Theoretical Mathematics is not complete without at least a wash of knowledge of other cultural perspectives, reading and writing comprehension, and/or some sort of historical context - the specific subjects depend on the autonomous decision of the student. Because in the real world, unless you wanna be an underpaid/unemployed labrat for the rest of your life, you need to work with other people from many walks of life, as well as express your ideas clearly and convince those who write the checks (often non-mathematicians, many times people with liberal_arts degrees and all).\n\nAgain, it[.] fair to criticize the context of x or y subject, but a well-rounded education *is* necessary.\n\nI looked at the Harvard Law Course Catalog, of the 566 courses, 0 were on to make the students a cultured person. Because they are there to teach the Law and how to understand it.\n\nI understand that in the US, law school and medical school come after you get your undergrad, so law and medicine students already took their gen-eds. In my country, law and medicine are majors, and students have to take gen-eds and electives.\n\nA narrow set of of skills like the Law, Medicine, Physics, Engineering, Chemistry, Biology, etc\n\nRelatively speaking, yes they are. Merely knowing your field is not enough to have a good career. And the reason we don't think of those fields as narrow is because they're taught at the uni level. Where you have to take gen-eds.\n\nyour right\n\nCase in point."}