{"doc_id": "1259", "name": "2017_04_humanities_student_major_3166_askliterarystudies", "namespace": "we1sv2.0", "metapath": "", "pub": "AskLiteraryStudies", "title": "2017-04-humanities-student-major_3166_AskLiteraryStudies.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.087", "Subjectivity": "0.389", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "318", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_682hvb", "Reddit_id": "dgv7nlx", "Subreddit_id": "t5_2tltc", "Commenter": "Moonpoke", "length": "1936", "content_scrubbed": "Obviously a bunch of randos on reddit can't truly help you make such a complex decision, especially given the paucity of specifics in the post. But I might ask you, based on the very end there, whether you've got a bit of sunk-cost fallacy in your reasoning. It[.] only foolish to skip the market if the credentials we're working to achieve in the phd don't translate at all to any other job. I know the academy likes to make it seem like there[.] only one serious career trajectory (which might have something to do with phd-holders being their only available pool of applicants for professorships), but as your own experience bears out, our skills do translate.\n\nI think it[.] possible to make distinctions between academic culture on the departmental and institutional levels. Asking whether you'll be happy in the sometimes warm and collaborative, and sometimes petty and backstabbing, departmental culture is different from asking whether you can work in an institutional culture with unethical and exploitative labor practices. Of course, sometimes they overlap--different universities being more or less hostile to the humanities have departmental-level effects.\n\nNot being in your situation for another couple of years yet, I guess my question to you would be what will let you sleep at night. If you really can't stand the often toxic culture of higher ed, you have your answer--it wouldn't matter if you'd spent 20 years getting your degree. But if you love the teaching and research and can live with the environment (perhaps by being prepared to spend years agitating in the faculty senate for adjunct and grad student rights against an intransigent administration), then go for it--sounds like you have good credentials, and even though the market is glutted, it has high levels of chance and randomness built into it, so you shouldn't necessarily take your first run at it as representative of your chances. Hope this helped."}