{"doc_id": "279", "name": "2017_10_humanities_student_major_436_voiceacting", "namespace": "we1sv2.0", "metapath": "", "pub": "VoiceActing", "title": "2017-10-humanities-student-major_436_VoiceActing.txt", "pub_date": "2017-10-05T00:00:00Z", "Sentiment": "0.201", "Subjectivity": "0.563", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "239", "Permalink": "http://reddit.com/r/VoiceActing/comments/74jypc/voicescom_or_voices123com/dnz92yr/", "Threadlink": "http://reddit.com/r/VoiceActing/comments/74jypc/voicescom_or_voices123com", "Parent_id": "t1_dnz0w5b", "Reddit_id": "dnz92yr", "Subreddit_id": "t5_2r878", "Commenter": "The-Bog-Trotter", "length": "1341", "content_scrubbed": "Well, real talk, if you intend on making quick dirty money, intend on spending majority of your mornings as early as 7am eastern time auditioning for roles that you may or may not get to in time, on top of which spending money to have a secondary \"agent\", then go ham. But be warned- Voices. com is cancerous to the industry by virtue of what they are, and anything like them are just the same in that way. \n\nIf you want real alternatives to further your creative endeavors, establish an actual network of people from which to get future jobs, I. e., get better at acting or just have fun, go to http://voiceacting. boards. net/ along with trawling indie-go-go and Kickstarter for games and shows and email/message the devs on Twitter to try and establish a connection that way. Also, create your own projects. Start writing or work with a writer and start casting for your own projects(hell, cast yourself in a role if that[.] your intent). \n\nBeing successful at VA or anything in the arts has a heck of a lot to establishing connections with people. Show you're willing to make things no matter what the reward is, show your willing to work hard for the sake of the art, and if you're lucky/actually work hard enough, the money will come, the projects, the rules, all that, will come. You'll find ways to make it work if you want it bad enough."}