{"doc_id": "259", "name": "2017_10_humanities_student_major_269_relationships", "namespace": "we1sv2.0", "metapath": "", "pub": "relationships", "title": "2017-10-humanities-student-major_269_relationships.txt", "pub_date": "2017-10-04T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.313", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "672", "Permalink": "http://reddit.com/r/relationships/comments/7490yg/i_26f_am_either_a_bad_person_or_ugly_every_guy_i/dnwlbqx/", "Threadlink": "http://reddit.com/r/relationships/comments/7490yg/i_26f_am_either_a_bad_person_or_ugly_every_guy_i", "Parent_id": "t3_7490yg", "Reddit_id": "dnwlbqx", "Subreddit_id": "t5_2qjvn", "Commenter": "Pantone711", "length": "3723", "content_scrubbed": "This may not be a factor outside the USA, so take it with a grain of salt.\n\nI was in the same boat until I was 47.  By the way I was about the same size as you when I met \"the one\" and believe me, other men were looking when I was that height and weight.  Three of my dealbreakers were that the guy be a good conversationalist, politically moderate to liberal, and somewhat educated (I didn't require that he hold a certain level of job or anything... just wanted someone I could relate to) and also (this probably goes without saying) sweet and kind-hearted.  \n\nLong story short there was a hidden social class mismatch between me and the guys I met in my daily life and also online dating.  I grew up in a working-class family and in a very strict, out-of-the-mainstream sect.  I left that sect and that milieu, but the vast majority of people I met through work and hobbies came from more the middle or even upper middle class.  I met people of all attractiveness levels and income levels who seemed to think I had horrible cooties on some hidden level, even if I thought I had more going on than they did.  Somehow, in the upper middle class, what kind of family you came from seemed to be a huge factor, much more than looks.  The upper middles went for each other by some hidden radar system.  They were unfailingly good, kind, sweet, full of integrity, good people but they just didn't go for me.  \n\nFinally a new meetup started up that for some reason was made up of liberals from the working class.  There are plenty of them--but I wasn't meeting them.  The venues where I went took me hobnobbing with middles and upper middles and something was just off.  The things they talked about bored me, for one thing.  And I think upper middles have some kind of hidden radar for each other. They put out signals of being accustomed to privilege, for one thing.  A huge topic of their conversation is how this and that restaurant aren't up to snuff, how they have more refined tastes than the riffraff, etc.  But I digress.\n\nI accidentally found my \"tribe\" and was 1000 percent more relaxed and happy around them, for reasons under the surface.  They're more fun for me to talk to.  They are in many cases just as educated as upper middles (my husband went to a prestigious private liberal_arts college that is often in the news--on scholarship) although they don't hold high-paying corporate jobs for the most part.  Some are government workers, things like that.  Some are in I/T and some are teachers.  \n\nLong story short I met \"the one\" one of the first times I went to this new venue that attracted a completely different crowd from the bird lovers and tree huggers.  These were the black-turtleneck table-pounders.  Turned out the tree-huggers and bird-lovers came from a little bit more wealthy background even though they lived frugal and earnest lifestyles and many of them were teachers too.  The ones who were teachers, their husbands were engineers, and some were independently wealthy from family money (you'd never know it by their lifestyles).  \n\nI've figured out at least three times over the decades my path had to have crossed with \"the one,\" but we didn't meet until I was 47 and he was 59.  We even rode the same city bus in the 80[.].  And this town isn't even all that big.  We just didn't meet because for one thing, the circles we ran in didn't overlap.  \n\nChange up the venues where you go, even if you have been dating friends from venues of mutual interest. Add some new venues.  And give someone who may not fit the image in your head a chance.  Someone who was off your radar may be the_right one for you but you don't know because you don't move in the same circles for some hidden reason.  \n\n"}