{"doc_id": "272", "name": "2017_10_humanities_student_major_361_newfoundland", "namespace": "we1sv2.0", "metapath": "", "pub": "newfoundland", "title": "2017-10-humanities-student-major_361_newfoundland.txt", "pub_date": "2017-10-05T00:00:00Z", "Sentiment": "0.019", "Subjectivity": "0.395", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "843", "Permalink": "http://reddit.com/r/newfoundland/comments/7432a1/just_listen_to_teacher_dont_study_education_at/dnxxu60/", "Threadlink": "http://reddit.com/r/newfoundland/comments/7432a1/just_listen_to_teacher_dont_study_education_at", "Parent_id": "t3_7432a1", "Reddit_id": "dnxxu60", "Subreddit_id": "t5_2qzqt", "Commenter": "UncomprehendedGraze", "length": "4602", "content_scrubbed": "Throwaway because someone who reads this will probably know who I am. I did the education program at MUN. Here are my two cents:\n\nWe live in a society where everyone is told to go to university and get a degree. The problem is a large number of these degrees do not lead directly to employment. The people who do those degrees at MUN end up getting funneled into the high school education program.\n\nThe program itself is a complete fucking joke. You cannot fail. At least half the people who make it through who do not know enough about their subject and should not be teachers. They are only there because they don't know what else to do with their History degree. Another huge chunk of people are there because they are not ready to grow up and be adults yet. They treat the program like a popularity contest and spend the entire time drinking and partying and socializing. You can slap an assignment together in an hour, hand it in two days late and get an 82. A lot of the profs are teachers who have done masters degrees and should not be profs. I had a prof for a social_studies methodology course that did not seem like she should be teaching at a high school level, let alone university. She was the personification of the Dunning-Kruger effect. These particular profs will teach you how not to put and exam together and then turn around and put and exam together that does the exact things they just told you not to do. I'm talking exams that consist entirely of multiple choice and true or false. They will read fairly objective articles and completely misinterpret them. My guess is the masters in education is similar to the undergrad degree in that once you are in you cannot fail.  I don't mean to give the impression that there were no good profs throughout the program, some were great, but there were also a pile of really really bad ones. Same goes for the students. A ton of them were great people and I made some great friends, but the bad shit stands out more.\n\nYou do the internship and you get in the staff room at an actual school and you realize that most of the teachers are petty and miserable and gossip about the students and other teachers constantly. A sizable handful of them should probably not be left alone with minors because they seem to have serious issues. For example the head of a department at the school I interned at took me to one side and literally told me to do something else with my life if I could because she felt teaching was hell. This was a senior teacher. Most of the things you learned in the university classroom are theoretical bullshit that flies out the window when you're actually in a high school classroom. Staff meetings regularly get held up by 20+ minute arguments over a minor issue that the people arguing don't even really care about, they just don't want to cede control to the other side. The actual good teachers just kind of keep to themselves. One of the good teachers at the school told me, and I'm paraphrasing here, when you get a bunch of people with a pair degrees into a room together it devolves into rams butting heads at the zoo. Again, Dunning-Kruger effect on full display here.\n\nThen when you finish the program you see people you went through it with working at Wal-Mart and Tim Hortons, unable to get a job. You meet people who you did the program with who are racking up sub days because their aunt is a teacher and hooks them up. Your potential employment has nothing to do with how knowledgeable you are about your teachable areas or how skilled you are at at the art pedagogy. The process to apply for jobs is needlessly cumbersome and frustrating. \n\nI stopped trying because I am the kind of person who has little time for the bullshit of other grown adults and I could not stand most other teachers, but honestly the whole system is a broken mess anyway. I really think MUN lets so many people in because they use the education program as a means to entice people into the arts and pure math/science programs, providing a potential pathway to employment, when in reality they pump out so many teachers your chances of finding a job are slim unless you have a hookup. I think the best solution would be to allow the same number of people in, but ramp up the difficulty of the program, and actually fail people who perform poorly during their internship. Right now, I feel as though the ease at which you can get through the program is actively dumbing down the public education system. I did the program back in 2010, so I don't know, maybe it[.] improved since then, but honest to god it was a complete farce."}