{"doc_id": "1226", "name": "2017_04_humanities_student_major_2820_germany", "namespace": "we1sv2.0", "metapath": "", "pub": "germany", "title": "2017-04-humanities-student-major_2820_germany.txt", "pub_date": "2017-04-25T00:00:00Z", "Sentiment": "0.024", "Subjectivity": "0.279", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1040", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgpx2vl", "Reddit_id": "dgpxzef", "Subreddit_id": "t5_2qi4z", "Commenter": "Kartoffelplotz", "length": "6540", "content_scrubbed": "Well, let[.] see. There are various definitions of fascism out there, but they have shared characteristics. Let[.] go through them, shall we?\n\n 1. Powerful and Continuing Nationalism - Fascist regimes tend to make constant use of patriotic mottos, slogans, symbols, songs, and other paraphernalia. Flags are seen everywhere, as are flag symbols on clothing and in public displays.\n\nYep. See also: AfD members raging about Merkel putting the German flag away at a celebration.\n\n 2. Disdain for the Recognition of Human Rights - Because of fear of enemies and the need for security, the people in fascist regimes are persuaded that human rights can be ignored in certain cases because of \"need.\" The people tend to look the other way or even approve of torture, summary executions, assassinations, long incarcerations of prisoners, etc.\n\nThe AfD security policy calls for racial profiling, extended video surveillance, \"more policing\" (i. e. arresting on fewer evidence, \"just to be safe\") and more, this is only what the first few google search entries brought up.\n\n 3. Identification of Enemies/Scapegoats as a Unifying Cause - The people are rallied into a unifying patriotic frenzy over the need to eliminate a perceived common threat or foe: racial , ethnic or religious minorities; liberals; communists; socialists, terrorists, etc.\n\nYes, yes and yes. \"Linksgrunversifft\", \"rapefugees\" - rings a bell.\n\n 4. Supremacy of the Military - Even when there are widespread\ndomestic problems, the military is given a disproportionate amount of government funding, and the domestic agenda is neglected. Soldiers and military service are glamorized. \n\nCan't tell, to be honest, all I know is that they all call for more military funding, but that[.] not AfD exclusive or it doesn't go to extreme lengths. So I guess we'll let this one slide.\n\n 5. Rampant Sexism - The governments of fascist nations tend to be almost exclusively male-dominated. Under fascist regimes, traditional gender roles are made more rigid. Divorce, abortion and homosexuality are suppressed and the state is represented as the ultimate guardian of the family institution.\n\nSounds like AfD for me. Traditional gender roles is something they call for quite loudly, as far as I recall.\n\n 6. Controlled Mass Media - Sometimes to media is directly controlled by the government, but in other cases, the media is indirectly controlled by government regulation, or sympathetic media spokespeople and executives. Censorship, especially in war time, is very common.\n\nTricky, since the AfD has no control over the media, but their use of *social* media clearly has this touch. And the fact that they blatantly label all media that isn't sympathetic to them as \"Lugenpresse\". We can only assume that if they should take power, they would not leave the media uncontrolled.\n\n 7. Obsession with National Security - Fear is used as a motivational tool by the government over the masses.\n\nHahahahahahahahayes.\n\n 8. Religion and Government are Intertwined - Governments in fascist nations tend to use the most common religion in the nation as a tool to manipulate public opinion. Religious rhetoric and terminology is common from government leaders, even when the major tenets of the religion are diametrically opposed to the government[.] policies or actions.\n\nDefenders of the \"Christliches Abendland\", anyone?\n\n 9. Corporate Power is Protected - The industrial and business aristocracy of a fascist nation often are the ones who put the government leaders into power, creating a mutually beneficial business/government relationship and power elite.\n\nThe fact that they just voted for an ex-Goldman Sachs and Allianz Global Investment manager as their candidate for the elections is a strong pointer for their proposed very strongly liberal economic policy. Since we don't know their final program yet it[.] hard to say anything specific about it, but I distinctly remember them opposing the financial transaction fee for banks, for example, which even the CDU wanted - but to the AfD the corporate interests were more important.\n\n 10. Labor Power is Suppressed - Because the organizing power of labor is the only real threat to a fascist government, labor unions are either eliminated entirely, or are severely suppressed.\n\nThe DGB is constantly attacked by the AfD and their call to form new unions to break up the established ones speaks a clear language.\n\n 11. Disdain for Intellectuals and the Arts - Fascist nations tend to promote and tolerate open hostility to higher education, and academia. It is not uncommon for professors and other academics to be censored or even arrested. Free expression in the arts and letters is openly attacked.\n\nSince the AfD is not in power, there really isn't anything to say about that.\n\n 12. Obsession with Crime and Punishment - Under fascist regimes, the police are given almost limitless power to enforce laws. The people are often willing to overlook police abuses and even forego civil liberties in the name of patriotism. There is often a national police force with virtually unlimited power in fascist nations.\n\nYet again, they are not in power so we don't really know what they would do, but they have repeatedly called for stronger police - thus far mostly aimed at \"policing refugees\", but who knows. They certainly don't want less police power. And \"obsession with crime and punishment\" certainly fits their supporters.\n\n 13. Rampant Cronyism and Corruption - Fascist regimes almost always are governed by groups of friends and associates who appoint each other to government positions and use governmental power and authority to protect their friends from accountability. It is not uncommon in fascist regimes for national resources and even treasures to be appropriated or even outright stolen by government leaders.\n\nNot in power, so nothing to say about that.\n\n 14. Fraudulent Elections - Sometimes elections in fascist nations are a complete sham. Other times elections are manipulated by smear campaigns against or even assassination of opposition candidates, use of legislation to control voting numbers or political district boundaries, and manipulation of the media. Fascist nations also typically use their judiciaries to manipulate or control elections.\n\nNot in power, so not in their power. \n\n\n\nTo sum up: They are not a fascist regime since they're not in power, but they share *a lot* of characteristics with the fascist regimes of the past. They might not be all out Mussolini (yet), but they certainly have their similarities."}