{"doc_id": "534", "name": "2017_10_humanities_student_major_3015_anime", "namespace": "we1sv2.0", "metapath": "", "pub": "anime", "title": "2017-10-humanities-student-major_3015_anime.txt", "pub_date": "2017-10-31T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.432", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1196", "Permalink": "http://reddit.com/r/anime/comments/78zp5t/free_talk_fridays_week_of_october_27_2017/dp5104n/", "Threadlink": "http://reddit.com/r/anime/comments/78zp5t/free_talk_fridays_week_of_october_27_2017", "Parent_id": "t3_78zp5t", "Reddit_id": "dp5104n", "Subreddit_id": "t5_2qh22", "Commenter": "esteban39", "length": "6730", "content_scrubbed": "More **Umineko** VN thoughts! (Episode 3, part 2)\n\nTagging /u/Kanbaru-fan, /u/Rhaga, /u/Whos_Batshit and more in a reply. \n\nI did [another livestream on Twitch](https://www. twitch. tv/videos/186355343) (~3:15h) and then decided to take a break until next weekend. In the mean time, I wrote up some tasty theories for y'all! I tried to think about all the facts we know up to this point and come up with explanations for the events in every different episode. \n\n*Please feel free to ask me about specifics, since I might be able to come up with more theories or explanations!*\n\nI also drew [this picture](https://imgur. com/a/DgAsv) for one of you, and [this picture](https://imgur. com/a/38UH6) **(spoilers!)** for the rest of you... or for myself. Man, I love that person/event/object that happens/appears in episode 3!\n\n[Episode 1 retrospective](/s \"A thing that stood out to me as an obvious bit of foreshadowing was Rudolf knowing he'd die beforehand. I think this little bit will be very important. I don't think my 'Rudolf is a psychic' theory was very good, but I really think my 'Shannon is a slut' theory could still hold some truth. Maybe her love to George was not AS strong in the first timeline, thus she cheated with Rudolf and let him know of Kinzo[.] crazy scheme. Or perhaps Beatrice let Rudolf know instead, since we saw her talking to people before killing them. Another theory that[.] up there for me is that Krauss is the culprit. I saw that one bit in the OP with a dude and a pistol. It might have been him. He was among the first victims twice so far, which would give him a solid alibi - being dead - for all the following murders. Plus he lives on Rokkenjima AND has access to Kinzo[.] wealth. He could have easily prepared a lot of shit years in advance for his great moment to shine. This one is my favorite theory so far. I also noticed, that Kinzo died by fire both in episode 1 and 3. I think that only has symbolic value, nothing more, but it[.] still interesting. Another important bit: It[.] only certain that episode 3[.] Rokkenjima had 18 humans. This one might have had more. So perhaps this timeline was the one of Krauss hiring a bunch of hitmen and faking his own death. Plus he was the one giving strange orders to the servants. This still doesn't explain all of the closed rooms etc., but it[.] a start. My 'Natsuhi is insane' theory could still hold some value as well. Her conversation which Kinzo could have been a fabrication of her mind, and that headshot could have easily been suicide. Or her being offed by her husband. Her headaches might be a weird hint that something[.] not right with her head. Oh shit, and I almost forgot the footsteps in the boiler room! That supports my other theories also... kind of.\")\n\n[Episode 2 retrospective](/s \"This is the episode with a visitor-Beatrice. It[.] still not confirmed whether she was a 19th human, or whether the 'only 18 humans' applies to this timeline as well. It could very well be an unknown person trying to make an outrageous claim, or a long-lost child of Kinzo. But this is also the episode with the most crazy shit happening. While Battler won one round of the mindgame, this episode has a metric shitton of closed rooms, which I am still very clueless about. Probably one of the biggest points of interest: Kinzo wrote a will in this timeline. My theory was, that he does that to give the one who solves the riddle the 'prize' of becoming the successor of the Ushiromiya wealth. Either he thought someone did it, or was just preparing for that. Either way, that timeline ended in a failure, so it ended up not mattering. The servants were the prime suspects for a while... and Kinzo seemed to be happy in the end, since he was one of the five survivors. So maybe this is the timeline of Kinzo winning, or almost winning, with the help of his loyal servants. Nanjo might or might not have been one of his allies. This episode is the hardest one to explain, just like the 'warning text' in the menu says... I don't think Krauss and his family played a big role in this episode[.] events... but I am not entirely sure about it. I think in that timeline I have to admit defeat, much like Battler. I have no idea what the heck happened. Only that there are -probably- more than 18 humans on the island in that timeline.\")\n\n[Episode 3 thoughts so far](/s \"We got a lot of background info via flashbacks, which is very interesting. We also get some useful red truths. A historical figure named Beatrice is confirmed, as is the fact that Kinzo caged her up in another mansion. Interesting truths: 'It' is dead. By the choice of that word, her truth of only 18 humans being on the island might not include peope that are 'it[.]. Now the question is, what is 'it'? A homunculus could at least shift everything from being supernatural into the pseudo-science realm. My theory of Maria being a creepy clone could also work in this timeline, if she doesn't count as a 'human' then. Being a stickler for words, I even thought that maybe there are FEWER than 18 humans on the island in this timeline. But I have enough trouble justifying the number 18, so I won't even dare to think about the possibility of even fewer people... And then there[.] of course that first bit. It shows the second mansion and a knockoff-Beatrice wanting to teach a young person - I assumed it was young Beatrice - the arts of magic. My theory was, that knockoff-Beatrice is the original that the new one is named after. But it[.] still all pretty nebulous to me. I am also curious about the fact that Genji and Shannon recognize Ronove from an earlier time. It couldn't have been from 20 years ago, because Shannon wasn't there yet. A servant got severely hurt once, was that maybe him? Was that person important? There was also another servant[.] name mentioned once, he/she might become important eventually, too. You know, I thought I had some non-shit theories, but I guess I don't. But the situation isn't actually THAT confusing. The only things unexplained are the closed rooms, really. The very supernatural murders could just be 'flavor' that was added to stuff that could actually happen in real life. There are enough motives for several of the 18 people to be the murderers. Whether it[.] insanity or greed or envy... with at least most of the servants gone in this timeline, I am curious to see what the smart-ass children of Kinzo will come up with this time. Will light be shed on the epitaph[.] riddle? Or will the motives of the siblings be explored further? The majority of them haven't run into unknown 'persons' yet, so the 'only 18 humans' bit isn't too much of a problem... well, except for the dozens of demons in Kinzo[.] study. Let[.] ignore that part.\")"}