{"doc_id": "528", "name": "2017_10_humanities_student_major_2919_hfy", "namespace": "we1sv2.0", "metapath": "", "pub": "HFY", "title": "2017-10-humanities-student-major_2919_HFY.txt", "pub_date": "2017-10-30T00:00:00Z", "Sentiment": "0.059", "Subjectivity": "0.247", "Score": "125", "Upvotes": "0", "Downvotes": "0", "Wordcount": "743", "Permalink": "http://reddit.com/r/HFY/comments/79ows2/oc_uplift_protocol_chapter_24/dp3mwuh/", "Threadlink": "http://reddit.com/r/HFY/comments/79ows2/oc_uplift_protocol_chapter_24", "Parent_id": "t3_79ows2", "Reddit_id": "dp3mwuh", "Subreddit_id": "t5_2y95n", "Commenter": "CalmBeforeTheEclipse", "length": "4674", "content_scrubbed": "Appendix #1: Who[.] Who?\n\n**Group Gamma: Cultural and social_studies.**\n\n* Kra: Female, ZidChaMa [cultural and social_studies] major from MidKwo (ZraDaub).  At 5'3 (~160 cm) she is tall (for a ZidChaMa), and fairly athletic, having been on a swim team since she was a child. Enjoys form-fitting dresses/robes which tend to be layered. \n\n* Elijah Miller: Male, human anthropology major from Thunder Bay, Canada (Earth). Around six feet  (~183 cm) tall, light brown hair, and moss green eyes, slim build. Fairly stylish in a way which might be bordering on being indie. \n\n* Toh/ Ik: Male, Ke Tee socialite/former anthropology understudy. First name pronounced with the \" / \" as a clicking noise. At 4'6 ( ~137 cm) considered tall for a Ke Tee, but average for someone of his social class.\n\n* Yeln: Mraa cultural studies student. Light grey fur, has a liking for purple shawls with various decorations embroidered on them (usually gemstones and crystals). \n\n* Cecil: Myriad [sociology and philosophy] student. Being of a low socioeconomic class, Cecil[.] vehicle is fairly low tech, looking like a silver, egg-shaped pod. \n\n**Group Alpha: Strategic intelligence, logistics, and associated military disciplines**\n\n* LoKuh: Male, ZidChaMa military academy member from The Dominion of ShulRa (ZraDaub). Fairly fierce looking, having some scars dotting his face from a training accident involving a grenade. Slightly taller than Kra. Dresses in elaborate coats and trousers, a style of which is favoured by military members (most ZidChaMa wear robes or dresses if they're civilians).  \n\n* Xiuying \"Ann\" Wu: Female, human computer science student training in espionage. From The People[.] Republic of China (Earth). Tall at 5'9 (~175 cm), and slender. A pale complexion, with hair in a bob cut.  Sort of awkward looking, still figuring out her sense of style and 'look'; often tries to look like K-pop stars. \n\n* The Calculating One: Myriad training to be a disaster relief organizer. Vehicle is slick, black, and reflective.\n\n* K!/it:  Female Ke tee from lower social class who wants to be intelligence officer.  The exclamation point depicts a whistle noise, slash is a clicking noise.\n\n* Vrood: Mraa who wants to become the pilot of a star ship – wants to become freelancer after leaving the \"space navy\". Smoky grey feathers, likes dark green shawls.\n\n**Group Beta: Spirituality, philosophy, and politics.**\n\n* Isabella Silva: Female, human political science student from Sao Paulo Brazil (Earth). 5'5  (~165 cm), Afro-Brazilian and fairly dark-skinned. Long hair that she keeps natural and often braids. Has a slim, yet curvaceous figure. Sense of style hints at her being 'alternative' and like a typical poli sci major. \n\n* Yuhldra: Male, ZidChaMa [monk analogue] from The Harmonic ShulRa Republic. Very stoic looking, with his scales dotted with burn marks from where his pigment cells were destroyed. Wears the robe of an ascetic, which is a rough spun greenish-brown material. \n\n* Ronaldo: Myriad philosophy student. Nicknamed by Isabella, after a human soccer/football player. Sleek, matte blue vehicle. \n\n* Kudlor: Mraa [international relations] student. Bluish grey feathers, likes white shawls.\n\n* H;ei/ : Male, Ke tee whose people have been colonized – wants to be  politician.   Son of a chieftain, which might make him royalty by some standards. Semicolon in name makes a cat-like hissing noise, slash makes a clicking noise.\n\n**Group Delta: The arts and interdisciplinary schools.**\n\n* Arjun Patel : Male, human creative writing and history student from Calcutta, India (Earth). About 5'10 (177 cm) with light caramel coloured skin, an artsy haircut, and stylish glasses. Average looking body type, enjoys wearing far too expensive clothes while at the same time thinking that Polo shirts can be appropriate for any occasion. \n\n* ZriLun:  Female,  ZidChaMa from the Empire of Vro – training to become school teacher, is also an amateur artist . Likes to wear ornate looking hats, flowing blue dresses, and often wears thick white face paint accentuated with blue lines, as is tradition for her people. \n\n* Kli-i : Female Ke Tee, daughter of ore miners who wants to  write children[.] books instead of doing the same as her parents. Hyphen in name indicates guttural stop.\n\n* Kworl: Mraa film student, usually interested in rather pretentious, experimental films but now has a penchant for documentaries. Light brown fur, somehow very eccentric looking despite not having facial expressions. Has no fashion sense.\n\n* \"Archie\" The Architect: Myriad training to become a combination architect and urban planner. The very stylish, platinum vehicle hints at their wealth.\n\n"}