{"doc_id": "1128", "name": "2017_04_humanities_student_major_1929_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2017-04-humanities-student-major_1929_changemyview.txt", "pub_date": "2017-04-17T00:00:00Z", "Sentiment": "-0.019", "Subjectivity": "0.367", "Score": "19", "Upvotes": "0", "Downvotes": "0", "Wordcount": "515", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgdrnl1", "Reddit_id": "dgdupd4", "Subreddit_id": "t5_2w2s8", "Commenter": "jclk1", "length": "2787", "content_scrubbed": "I agree with you that the system of determining financial aid based on parent income is flawed. Many students from middle class families end up having to pay for their schooling on their own. In fact it is people in your position who have the most to gain from free post secondary education being free. We already have a system for getting poor students into school and really wealthy students usually don't have a problem. Middle class kids are the ones who usually get straddled with debt. \n\nAlso, I hope that you think about the anger and prejudice you described in yourself in this post. It seems like your anger is pointed towards the student who got a better deal than you did, as if they created this messed up system that left you paying for your college, as opposed to pointing your anger at your government that is leaving you out of much needed financial support for your education.\n\nYou used an example of a theatre arts major, as if people with financial aid don't go into hard_sciences. Also, it shows a prejudice that you believe humanities is not as hard as hard_sciences and that somehow an engineering degree holder somehow contributes more to the world and society than a theatre arts major. While some people do coast through a humanities degree i have seen similar things from \"genius\" kids who are stoned all day and do no studying but ace through their hard_science degree. These people don't represent all people in that program. If it really were that easy everyone would do it. The other barrier to finishing a degree is that it is hard no matter what major you go for.\n\nThe fact that there exists a theatre arts program at your school means it is a more valuable school than if it only taught engineering. The fact that you can take a theatre arts class adds value to your education. And while you may not be in a position to pay to take a non major course, if the government was helping you pay for school you would get that chance. The fact that you get to interact and meet humanities_major adds value to your college experience that you would miss out on if you went to an all engineering school. And if you really thought about, none of us would want to live in a country where everyone had only ever studied the hard_sciences.\n\nThe humanities are a crucial part of education for every student and I think it is the fault of a bad financial aid system that you and many other students will never get the opportunity to take advantage of those resources in college. That is what I am angry about and see as what you and other students are being denied by not having a free college system where instead of having to worry about how much debt you will be for each course you take you can instead just concentrate on the value of what is being taught to you."}