{"doc_id": "232", "name": "2017_10_humanities_student_major_58_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2017-10-humanities-student-major_58_GradSchool.txt", "pub_date": "2017-10-01T00:00:00Z", "Sentiment": "0.135", "Subjectivity": "0.323", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "281", "Permalink": "http://reddit.com/r/GradSchool/comments/73nvv9/how_does_grad_school_even_work_these_days/dnrzsld/", "Threadlink": "http://reddit.com/r/GradSchool/comments/73nvv9/how_does_grad_school_even_work_these_days", "Parent_id": "t1_dnrzio0", "Reddit_id": "dnrzsld", "Subreddit_id": "t5_2r4r8", "Commenter": "xPadawanRyan", "length": "1579", "content_scrubbed": "In most cases, you do have to do research in a Master[.] program, the manner in which the research is conducted simply differs depending on the field. For example, I know the MA Humanities program at my school doesn't do a research proposal that the department has to 'okay' before they can even continue, however the MA History program requires your proposal to be approved before you go into second semester. This may differ based on school, program, field, etc. however all Master[.] programs at my school require individual research.\n\nWhen you do a Master[.] degree, you are becoming a 'master' in the field. You are essentially the expert on your particular research topic. So research is fairly vital, as it[.] your way of proving your skills, your abilities, your expertise in the field. You do propose your own research in many cases, however it does not have to be as original as a PhD research topic -- it must be original in the sense, though, that you can explain how it differs from previous scholars' research on the same subject.\n\nAs for looking all over the country for a specific topic, well, that really depends on your flexibility of program, of research, etc. You do not only have to find a school that offers the program you wish to take, but one with profs who have some sort of basic expertise in the particular research field you wish to do -- the example I often use is that my school doesn't have profs who teach Russian history, so an MA History student can't study Russian history as there is no prof who can properly guide their research as a supervisor."}