{"doc_id": "466", "name": "2017_10_humanities_student_major_2307_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2017-10-humanities-student-major_2307_canada.txt", "pub_date": "2017-10-24T00:00:00Z", "Sentiment": "0.106", "Subjectivity": "0.29", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "267", "Permalink": "http://reddit.com/r/canada/comments/78aid1/college_student_concerned_strike_will_affect_his/dotxzzx/", "Threadlink": "http://reddit.com/r/canada/comments/78aid1/college_student_concerned_strike_will_affect_his", "Parent_id": "t1_dotwyev", "Reddit_id": "dotxzzx", "Subreddit_id": "t5_2qh68", "Commenter": "Vorenvs", "length": "1781", "content_scrubbed": "You should read things properly before replying.\n\nDoctors, lawyers and engineers are *in demand*, so they can command good compensation. No fucking policy sets an engineer[.] salary\n\nI never said that. I said trainees (ie: residents, attacking students, etc) are subject to regulations that ensure proper fundamentals. In BC, for example, they're all exempted from the Employment Standards Act that sets out fundamentals most employees enjoy. That[.] because their regulating bodies provide the same. Post docs get neither. That[.] not a market force, that[.] an oversight.\n\nThere is no surplus of engineers anywhere. \n\nYou lose credibility when you invent facts. An entire section is devoted to this in [Engineers Canada[.] most recent industry prospecus](https://engineerscanada. ca/sites/default/files/Labour-Market-2015-e. pdf), including a prediction that the unemployment rate of civil engineers will rise above the national unemployment average approaching 2025. From the paper:\n\n\"The recent level of graduates for Quebec and Ontario exceeds the average number of job openings for these provinces.\"\n\nThere is absolutely no demand for PhDs in the humanities and much of the sciences as well. People would be far better to wake up and get jobs than pursue doctoral studies.\n\nThere is varying demand. Applied science has significant demand and schools like UBC and U of T attract amazing talent. Humanities less so. At issue however is the fact even in-demand positions in fields like experimental medicine and renewable energy, that are heavily funded, still see post-docs getting overworked, underpaid, and denied access to fundamental benefits that other trainee professionals, including those in my own field, have access to.\n\nIt[.] not a lack of demand, it[.] a lack of regulation."}