{"doc_id": "1254", "name": "2017_04_humanities_student_major_3155_math", "namespace": "we1sv2.0", "metapath": "", "pub": "math", "title": "2017-04-humanities-student-major_3155_math.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.018", "Subjectivity": "0.343", "Score": "253", "Upvotes": "0", "Downvotes": "0", "Wordcount": "370", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_681xag", "Reddit_id": "dgv3cec", "Subreddit_id": "t5_2qh0n", "Commenter": "antiproton", "length": "2292", "content_scrubbed": "Plenty of people take pride in not understanding stuff. \n\nNerds take pride in not understanding football every February. \n\nAnti-intellectuals take pride in not understanding most of science as they believe that demonstrates devotion to their beliefs. \n\nTeenagers take pride in not understanding a variety of things in what is a demonstration of the quintessential teenage experience. \n\nAnd there[.] a great many people who lament their lack of mathematical understanding. Parents, for example, who cannot help their children with homework. \n\nPersonally, I think we get too overwrought about this subject. There[.] no conspiracy to denigrate the field of mathematics. Math is abstract and complex. It requires a type of intuition that is not built up in everyday experience. The concepts of mathematics rely on each other in a way you don't see in liberal_arts or social_science. \n\nThe level of mathematical literacy in the world today is low, and that[.] troubling, but it[.] not because people aren't inspired to \"love\" math. It[.] because we don't have a good way of teaching how to intuit the answers to common problems. We force children to learn algebra and geometry because that[.] how we've always done it. Those skills are almost totally pointless for the vast, vast majority of people.\n\nBut we force them to suffer through them. \n\nAnd then we wonder why people hate math. We wonder why people take *pride* in their lack of math skills. \n\nIt[.] nothing more than shared suffering. \"Fuck Algebra, amirite?!\" \"Yes, I too did not do well in Algebra!\" \n\nExposure to the Fundamental Theorem of Algebra or the theorems of Euclidean Geometry are not required for daily life. Perhaps it[.] time we start understanding that this information can be tailored to students better. If we teach people how to grasp and intuit upon concepts like compound interest and probability instead of slogging through \"completing the square\" and \"rationalizing the denominator\" - skills they will forget the instant they are done with the final exam - maybe we can turn some people around on the utility of every day math. \n\nBut it[.] important, as mathematicians, to understand that this isn't  a form of systemic anti-intellectualism. It[.] because we are fucking shit at prioritizing the presentation of information. "}