{"doc_id": "289", "name": "2017_10_humanities_student_major_529_germany", "namespace": "we1sv2.0", "metapath": "", "pub": "germany", "title": "2017-10-humanities-student-major_529_germany.txt", "pub_date": "2017-10-07T00:00:00Z", "Sentiment": "0.058", "Subjectivity": "0.308", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "580", "Permalink": "http://reddit.com/r/germany/comments/74todu/how_are_academics_structured_in_german/do126gv/", "Threadlink": "http://reddit.com/r/germany/comments/74todu/how_are_academics_structured_in_german", "Parent_id": "t3_74todu", "Reddit_id": "do126gv", "Subreddit_id": "t5_2qi4z", "Commenter": "xstreamReddit", "length": "3289", "content_scrubbed": " studying is more \"relaxed\"  \n\nStudying isn't relaxed for a lot of fields. It[.] quite normal to have failure rates of 2/3 for a single exam and once you fail the same exam three times you get kicked out and aren't allowed to study in a program that entails the same course again, at any German university. This is of course not the same for every university and program since they are all free to make their own rules.\n\n cost of living is more manageable   \n\nI wouldn't say it[.] that much more manageable unless you are comparing it with San Francisco or something. Some university cities are among the cities with the highest rents in Germany, some aren't, it depends on the location like everywhere.\n\n Because of no tuition are professors less available to help students?  \n\nDepends on the program but with the bigger programs like most engineering programs the professors don't interact with the students apart from giving lectures. As a student I never really had the need to talk to a professor aside from some very limited instances. In fact many people might not even know the name of the professor.   \n\nThat does not mean that they aren't available, they usually do have office hours but I have never talked to anyone going there. It has little to do with tuition though, the German system is about being self sufficient, you could go to the professor if you have a question like you would maybe do with a teacher but for any German student that would be the absolute last resort after having tried for days to solve it yourself, asked all your friends and acquaintances, asked the tutors and so on.\n\n Is there no graded homework, projects, papers, or quizzes?   \n\nDepends on the program but usually there is non of this. We had homework for the math courses which could give you a small bonus for the exam though, that is graded by tutors of course. Professors don't do the grading on exams as well (they also usually don't make the questions), they just check over the work of their employees from time to time.\n\n What are exams like?  \n\nThere usually is a single exam at the end of the semester (during the semester holidays) for every course. Between 1 and 3 hours long. Multiple choice and stuff like that is very uncommon at German universities. For most of engineering these exams consist mainly of coming up with the_right formulas to describe a problem then solve those formulas on a symbolic level at the last step you may have to actually calculate some numerical values with them but that often gives so little points that it[.] not worth the time. It[.] completely normal that you only have enough time to answer 3/4 of the questions fully even if you go as fast as you can.\n\n but how does this compare with other STEM disciplines and in the humanities?  \n\nOther STEM fields often aren't much easier while humanities tend to be in terms of failure rates and grades.\n\nAll these answers I gave are gross simplifications and generalizations which will be completely wrong for some programs and universities since as I said, they can all make their own rules. If you want to know the details you have to check the regulations for a specific program.  \nAlso you should check the Wiki in the sidebar which has a section about studying in Germany and how everything works here."}