{"doc_id": "1080", "name": "2017_04_humanities_student_major_1502_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2017-04-humanities-student-major_1502_changemyview.txt", "pub_date": "2017-04-13T00:00:00Z", "Sentiment": "0.051", "Subjectivity": "0.343", "Score": "23", "Upvotes": "0", "Downvotes": "0", "Wordcount": "711", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_650ea7", "Reddit_id": "dg7acf6", "Subreddit_id": "t5_2w2s8", "Commenter": "khajiitpussywagon", "length": "4570", "content_scrubbed": "K, biologically the reason we find it gross and icky is because it can be so damaging.\n\n*\"A 1994 study found a mean excess mortality with inbreeding among first cousins of 4. 4%.[126] Children of parent-child or sibling-sibling unions are at increased risk compared to cousin-cousin unions. Studies suggest that 20-36% of these children will die or have major disability due to the inbreeding.[9] A study of 29 offspring resulting from brother-sister or father-daughter incest found that 20 had congenital abnormalities, including four directly attributable to autosomal recessive alleles.[127]\"*\nhttps://en. m. wikipedia. org/wiki/Incest\n\nFun fact of the day.  The reason are sibling smell so gross is actually biological, people with a lot of common alleles smell worse.  This is evolutions way of saying 'yo don't sleep with you brother'.  \n\nOver multiple generations the effects of incest can be devastating.\n\n*\"Charles II, the last Spanish Habsburg, was feeble-minded and physically deformed as a direct result of his limited gene pool. His ancestor, Joanna of Castile, actually appears in his family tree no less than fourteen times because of first and second cousins intermarrying. It is said that Charles II[.] genetic makeup was more muddled than it would have been if his parents had been brother and sister.\"*\n\n*\"Charles II[.] mandibular prognathism was so pronounced that it was said that he could not chew his food and that the size of his tongue caused him to drool significantly. He also had mental issues and was considered mildly retarded. He didn't learn to talk until he was four and couldn't walk until the age of eight. As an adult, his speech was so poor that he was, for the most part, unable to be understood.\"*\nhttps://owlcation. com/humanities/The-Habsburg-Jaw-And-Other-Royal-Inbreeding-Deformities-and-Disorders\n\nPathologic mandibular prognathism is a potentially disfiguring genetic disorder where the lower jaw outgrows the upper, resulting in an extended chin and a Crossbite. It is sometimes a result of acromegaly.\n\n*\"This condition is colloquially known as lantern jaw, as well as Habsburg jaw, Habsburg lip or Austrian Lip (see House of Habsburg) due to its prevalence in that bloodline.[4] The trait is easily traceable in portraits of Habsburg family members.[5] This has provided tools for people interested in studying genetics and pedigree analysis. Most instances are considered polygenetic.[6]\"*\nhttps://en. m. wikipedia. org/wiki/Prognathism\n\nTo your point about it not being different then a genetic disorder.  I will admit it gave  me pause.  But there are a couple major differences.  Incest is a compounding issue the more it happens from generation to generation the worse the issues become.  The other major difference is it creates a culture.  Look at the Colt family. \n\n*\"The Colt family incest case, dubbed by media as the Colt incest clan, is an Australian family discovered in 2013 to have been engaging in four generations of incest beginning with \"Tim and June Colt,\" a brother and sister who emigrated from New Zealand in the 1970s.[1]The family grew to nearly 40 members ranging from grandparents to mothers, fathers, sons, daughters, aunts, uncles, nephews, brothers and sisters all engaging in various forms of incest. Many of the children suffered from deformities and medical problems.\"*\n\n*\"In the first half of the 20th century, brother and sister \"Tim and June Colt\" lived in New Zealand. In 1966, she married her brother and ultimately gave birth to seven children: Martha, Frank, Paula, Cherry, Rhonda, Betty, and Charlie, before moving to Victoria in the 1970s.\nThe family was led by matriarch Betty Colt along with her brother Charlie Colt who, together, had 12 children.[4] The family was known to frequently relocate before locals became suspicious. They relocated to New South Wales, 20 miles outside of a small town three and a half hours southwest of Sydney.[5]The police ultimately discovered nearly 40 members of the family living under squalid conditions in tents and shacks.[6]\"*\nhttps://en. m. wikipedia. org/wiki/Colt_clan_incest_case\n\nYou should read the rest of this link. Not too long very interesting. \n\nI think the laws against incest are largely to stop this kind of situation from happening.  \n\nNow to wrap up.  While it is a universal religious and cultural taboo and that[.] the main reason it[.] illegal; but it[.] a universal taboo for a reason.  It[.] in our biology to be grossed out by the though of incest, because it can do some serious harm. \n\nLike lions, tigers, and bears oh my!\n\n\n\n\n\n\n\n\n\n"}