{"doc_id": "475", "name": "2017_10_humanities_student_major_2422_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_2422_AskReddit.txt", "pub_date": "2017-10-25T00:00:00Z", "Sentiment": "-0.065", "Subjectivity": "0.28", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "331", "Permalink": "http://reddit.com/r/AskReddit/comments/78mpfx/students_and_professors_of_reddit_what_moment/dovbtwv/", "Threadlink": "http://reddit.com/r/AskReddit/comments/78mpfx/students_and_professors_of_reddit_what_moment", "Parent_id": "t1_dov60u9", "Reddit_id": "dovbtwv", "Subreddit_id": "t5_2qh1i", "Commenter": "ibeeprofin", "length": "1895", "content_scrubbed": "Oh man I was going to post something similar but I'll just comment here instead. My college is a PC mess, and nearly every single damn class I take has some form of gender equality lessons or minority things. I wouldn't have a problem with either of them if I was taking a class for those topics but no, I don't want to learn about that in my damn math class. I don't want to learn about that when I'm taking a botanical studies class that doesn't have a single thing even relating to humans.\n\n It[.] all just so obviously forced into everything and it[.] almost insulting. It[.] as if they treat you as if you don't understand anything about gender, women, and minorities. Please stop insulting my intelligence and telling me I'm racist for being white. I paid to learn about plants, let me learn about plants not how women are oppressed for the 80th time.\n\nThe one time I did take a course on humanities and American studies (it was required) I felt almost alienated. I'd say I'm right smack dab in the middle of the political spectrum but the entire course was liberal garbage. All of the discussions were students telling sob stories straight out of r/thathappened. The professor would stop students mid sentence if she disagreed with them, which blew my mind. You weren't allowed to have constructive criticism and ideas if the professor disagreed with you. She also picked favorites, mostly the r/thathappened kids and started to not call on other students besides them halfway through the semester. I would try to contribute to almost every discussion we had but she stopped letting me speak entirely. I hated that class, it felt like a censorship brainwashing since there was so much \"I'm right, you're wrong\" coming from the professor.\n\nThere[.] plenty more where this leftist PC garbage has seeped into other aspects of my college but these are the most annoying since I can't avoid them. "}