{"doc_id": "1048", "name": "2017_04_humanities_student_major_1205_uci", "namespace": "we1sv2.0", "metapath": "", "pub": "UCI", "title": "2017-04-humanities-student-major_1205_UCI.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.113", "Subjectivity": "0.439", "Score": "20", "Upvotes": "0", "Downvotes": "0", "Wordcount": "832", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64omik", "Reddit_id": "dg3we64", "Subreddit_id": "t5_2r7xu", "Commenter": "Beige-Alert", "length": "4893", "content_scrubbed": "CGS at UCI is quite new, so there[.] always a bit of uncertainty regarding the specifics (such as which classes are required or offered). So take what anyone says with a grain of salt, since it may be different in a couple years.  \n\nWith that said, the major is mostly computer science, as opposed to game design (levels, gameplay, etc) or art, so expect the difficulty to be in line with the CS program for the most part. There[.] a lot of math involved (Calc, Stats, Boolean Algebra, Discrete Math, Linear Algebra), and it definitely becomes important in the later classes like Computer Graphics. The CGS major also shares the core CS classes (Intro, Intro II, Data Structures & Algorithms, C++/Java), though things have been shifting since I first took them. For example, the first three classes were taught in Java when I was there, but now I think it[.] Python, though Data Structures might be taught in C++ now. It[.] been 2 years since I graduated, so  \\\\_(ツ)_/   \n\nThe classes that directly relate to games tended to be a bit easier at first, though they often took large amounts of time since they were project-based. When I was there, the first year was an anthropology class (Computer Games and Society), followed by an introductory game programming class, and we capped off the year by learning how to work with a modern game engine (Unity). The coursework generally followed that pattern, getting more complex and specific as time went on, as we covered topics like graphics engines (C++ and OGRE3D), networking and multiplayer, game design (just 1 course when I was there), etc. Also, as we entered 3rd and 4th year, we started taking classes that diverged depending on which track we wanted to follow within the major, such as human-computer interaction, artificial intelligence, networking, and so on, so the program offered some flexibility with electives toward the end. I ended up going with the networking and security/crypto track, along with electives in mobile development, AI, and writing (as in, narrative design). In the final year, there[.] a capstone course, in which students form teams and develop games over the course of 20 weeks, each being guided by an industry mentor (employees from Blizzard, when I was there). I hope I've made it clear that it isn't necessarily an easy major, but I appreciated the wide breadth of topics, since pretty much everything can be applied to game development.  \n\nHowever, a few of these classes were a little undercooked, due to problems getting faculty to teach some of them.  For example, the Game Design class I took was taught by a guy from the mobile industry, so the lessons were geared more toward that market (lots of free to play, microtransactions stuff). Some of the lectures in the introductory game programming course and the game engines course were basically either review or super obvious (\"images in the jpeg format take less space!\", \"computers display color in red, green, and blue!\", etc).  \n\nTo make up for this, I would **highly** recommend joining the Video Game Developers Club (VGDC) at UCI. Most of the people in the CGS major were in it, along with folks from CS, the arts, audio, writing, etc. The club provided a place for the students to practice making games, which is honestly the most important thing to do. It was also a great place for us to educate each other on any topics that we felt weren't adequately covered by the coursework. I think being in CGS while not being in the VGDC would be a huge missed opportunity, especially if you're into non-programming roles like design.  \n\nIn terms of internships and other extracurriculars beyond the VGDC, it mainly comes down to keeping an eye out for opportunities. Every now and then, some professor will want to build a simulation or social experiment using a virtual environment, and CGS students are great at that. There are several game studios in or near Orange County, including Blizzard, Obsidian, Blind Squirrel, Ready at Dawn, Amazon, Naughty Dog, Red 5, Riot, etc., so there are opportunities for internships at those companies, too.  \n\nFor Freshman housing, I'd choose Middle Earth, since it[.] closest to most of your classes. The quality of the dorm buildings would be better if they were newer (most are from the 80s or something, and they've been lived in by thousands of college students), but overall I'd say they were totally fine. After that, any of the nearby housing communities are fine, and they tend to be newer. In particular, I enjoyed staying at Vista Del Campo, though the cell signal up there could be spotty sometimes.  \n\nOverall, the major was a lot of fun, but challenging nonetheless. The main thing is to take your classes seriously, especially stuff like math, which'll sneak up on you if you're not careful. Just be aware that both the games industry and the CGS major are young, so things are always changing."}