{"doc_id": "990", "name": "2017_04_humanities_student_major_627_dartmouth", "namespace": "we1sv2.0", "metapath": "", "pub": "dartmouth", "title": "2017-04-humanities-student-major_627_dartmouth.txt", "pub_date": "2017-04-06T00:00:00Z", "Sentiment": "0.29", "Subjectivity": "0.46", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "620", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63v4o0", "Reddit_id": "dfxdeyb", "Subreddit_id": "t5_2rc20", "Commenter": "Joemann4000", "length": "3404", "content_scrubbed": "Wow. OK Dartmouth grad here, not a CS major but friends with several. 1) The CS dept at Dartmouth has deep history in AI. We invented AI at Dartmouth in the 1956, I was on campus for the 50th anniversary conference, etc.. CS is a big part of the Science side of Dartmouth, which is very strong considering the \"small liberal_arts college\" perception. Dartmouth is ranked low for CS graduate studies because it is primarily focused on undergrad. You'll set a great foundation in CS at Dartmouth and then can move on to Cal Tech, Stanford, MiT, CMU, where ever you want for graduate work. 2) Top companies recruit at Dartmouth every year, same as any where else in the Ivy and similar college tiers. You'll have access to every where you want to go and the CS dept with the help of your other classes will prepare you for it all. 3) Econ is the major at Dartmouth for business/finance aspirations, there is no 'finance' major (unless they've added one?) but you'll have plenty of options within the Econ dept to craft your courses towards finance careers. 4) I work in finance, connections are really helpful for getting in the door at an entry level but not necessary. Those connections plus the on-campus recruiting/preparation should provide ample opportunities for great jobs. 5) I don't think they offer a combo UG and MBA program at Tuck but they may have added one since I've been gone. Tuck is a great school, many friends went there but IMO you're better off doing a joint MS/MBA at a larger school that has great CS and MBA programs. Plus Tuck is an \"older\" school with most applicants over 26. \n\nIf you really want a city experience, then Dartmouth may not be the best choice. That said, it is a beautiful place to live and learn for 4 years. You'll have access to the great outdoors, amazing professors, and some of the most interesting people you'll ever meet. You can spend the rest of your life living in a city and you'll always remember the 4 years you spent in Hanover. Cool things about Hanover: Dartmouth has its own ski resort, golf course, canoe club, and hiking trails/cabins right on campus or very close by. The food on campus is great, usually ranked right behind Cornell (known as the best). The social life is a choose your own adventure ranging from a Capella, to Frisbee, to Varsity sports, outdoor adventures, skiing, club sports, Frats/Greek life, etc... Plus the beer is always free at frat parties. There are very interesting people who choose to study at Dartmouth. I'm sure all the schools you mentioned will have cool people there too, but the folks who choose Dartmouth are truly unique and special in their own way. A friend of mine was a CS minor and wrote apps in college for the iPhone for an upcoming travel company and was a millionaire at age 27. Another is a decedent of Martha Washington and Robert E Lee that ended up at the top of her math major class.\n\nIf you need to get a city, Boston is 2. 5 hours by bus and the Dartmouth Coach goes there 5 times/day.  My advice is to use your formative college years to find and explore your passion in addition to your CS work and job prospects, don't let the bright lights/big city steer you awry from who you are and whom you will become. You'll spend the next 50 years of your life in a city working around the clock, enjoy the fresh air while you can. \n\nFeel free to DM if you want to chat further. Best of luck. "}