{"doc_id": "527", "name": "2017_10_humanities_student_major_2917_intj", "namespace": "we1sv2.0", "metapath": "", "pub": "intj", "title": "2017-10-humanities-student-major_2917_intj.txt", "pub_date": "2017-10-30T00:00:00Z", "Sentiment": "0.041", "Subjectivity": "0.426", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "269", "Permalink": "http://reddit.com/r/intj/comments/79oppv/i_am_struggling_with_college_any_advice/dp3m0tc/", "Threadlink": "http://reddit.com/r/intj/comments/79oppv/i_am_struggling_with_college_any_advice", "Parent_id": "t3_79oppv", "Reddit_id": "dp3m0tc", "Subreddit_id": "t5_2qowo", "Commenter": "Faultypetal", "length": "1513", "content_scrubbed": "I am in my last semester of college.\nTruly, I must agree that college is BS after BS. I was an excellent student in high school, could've gone anywhere, but chose to stick around in my hometown (a college town) and get a degree in 3 years debt free. Mistake. \nI think most liberal_arts colleges now are for the birds. They do not teach you higher level thinking, they teach you how to run through the hoops to get the credits. It[.] simply not about learning anymore, and our society has created this self-fulfilling prophecy about needing a degree to do anything. It[.] a farce. \nI did not do well in college, I could never make my profs happy, even if I followed assignments to the letter, they didn't like me and how I presented, so I generally received mediocre grades. I have a 3. 0 gpa, not happy with that. \n\nAs an alternative route, Have you researched trade schools? Sometimes learning a skill set through work/experience is more valuable initially, and you will be making money instead of spending it on fruitless, PC classes which teach no practical skills. \n\nIf you want to stick with it, talk to a counselor about your degree path and try and figure out if what you're studying is right for you. Being passionate about something makes having to gut through the miserable stuff easier.\n\nAfter that, all I can say is that it[.] hard to be a smart person in \"higher education\", because they aren't looking for intelligence, they are looking for drones to follow instructions and think the way they think. \n\n"}