{"doc_id": "446", "name": "2017_10_humanities_student_major_2134_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2017-10-humanities-student-major_2134_changemyview.txt", "pub_date": "2017-10-22T00:00:00Z", "Sentiment": "0.026", "Subjectivity": "0.49", "Score": "15", "Upvotes": "0", "Downvotes": "0", "Wordcount": "624", "Permalink": "http://reddit.com/r/changemyview/comments/782ylz/cmv_the_new_trend_of_shaming_people_for_being/doqoh7t/", "Threadlink": "http://reddit.com/r/changemyview/comments/782ylz/cmv_the_new_trend_of_shaming_people_for_being", "Parent_id": "t3_782ylz", "Reddit_id": "doqoh7t", "Subreddit_id": "t5_2w2s8", "Commenter": "Ardonpitt", "length": "3706", "content_scrubbed": "a hyper-sensitive, liberal-liberal_arts student who thinks their views are special/unique when really they're just indoctrination from another culture which they've marked as superior.\n\nI would also add in hyper sensitive conservative people who think their ideas should be treated with some sort of respect or reverence and that inherently they as the people who hold those ideas should be treated with respect or reverence. Like any insult it can go both ways.\n\nthey think they are superior because of their uniqueness or entitled to special considerations.\n\nHonestly that is the core of the criticism, not that they think they are unique; but that they WANT to be treated as if they are special. No one calls someone a snowflake just because they are gay, but if they want to be treated specially because of that, that[.] the difference.\n\nThe thing is that people have been criticizing this sort of bad faith behavior FOREVER in our society. If you read Catcher in the Rye you see Holden Caulfield calls everyone who acts like that \"phonies\". You listen to punk rock you hear them criticize it too. The 16th century philosopher Michel de Montaigne wrote an entire book called the essays relentlessly mocking this behavior in academics and lords saying \"to learn we have said or done a stupid thing is nothing, we must learn a more ample and important lesson. That we are but blockheads\"; and \"on the highest throne in the world we are seated still upon our asses\".  Personally I view these all as more  elegant ways of stating the idea, but they are all pointing out the fairly laughable pretense of the groups at hand. This is not a new thing, just a new way of stating it.\n\n This is critically preceded by separating people into (often tiered) groups, and proclaiming solidarity of the incentives of the superior group such that all sorts of secondary tenants can be justified (state  individual, order  truth, unity  diversity).\n\nBasically you are trying to water down fascism into tribalism or identity politics. I wouldn't suggest it, (then everything is fascism at some level) . I would suggest letting fascism remaining as the more technical definition of \"a form of radical authoritarian nationalism, characterized by dictatorial power, forcible suppression of opposition and control of industry and commerce\". Its different than other forms of authoritarianism or nationalism and is FAR FAR more extreme that tribalism, or identity politics by themselves.\n\nI would say that accepting \"you think you're unique\" as an insult in our culture as something to be ashamed of is evidence of the dissolution of a core American value: individualism.\n\nWell the thing is, its more making fun of people who go about wanting to be treated as special because they are unique, which honestly is one of the more American things to do. We are all individual pieces of shit.\n\n It represents a cultural shift in which people increasingly believe that they belong in large groups which are designated by \"race\"/religion/party within which all people are the same as the other people in that group.\n\nNow you are referencing \"identity politics\", and it[.] true it can be a dangerous type of politics depending on how it[.] practiced, but it is also needed in order to create equality. People have to note when different groups are being treated differently in order to try and create equal treatment. \n\nPlease CMV because this is depressing af.\n\nI know, my suggestion, learn to laugh at it; and talk about it in a way that anyone can understand. It[.] a prime example of the absurd. It[.] a constant part of society, noting when people are being hypocritical and insane, and also when the people calling them out are too. "}