{"doc_id": "514", "name": "2017_10_humanities_student_major_2824_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-10-humanities-student-major_2824_AskHistorians.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.031", "Subjectivity": "0.485", "Score": "87", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1397", "Permalink": "http://reddit.com/r/AskHistorians/comments/79dwua/why_did_poland_have_lower_rates_of_black_death/dp1ztto/", "Threadlink": "http://reddit.com/r/AskHistorians/comments/79dwua/why_did_poland_have_lower_rates_of_black_death", "Parent_id": "t1_dp1tjsq", "Reddit_id": "dp1ztto", "Subreddit_id": "t5_2ssp3", "Commenter": "mikedash", "length": "8956", "content_scrubbed": "There[.] only one thing left to do at this point, and that[.] to ask exactly what encouraged Carpentier to conclude that Poland experienced the Black Death differently to practically every other part of Europe. After all, however inadvertently, her paper, and her map, have caused a thousand lazy writers on the net – and some first-rate historians, as well – to think of Poland as some sort of shining beacon in the grim history of mid-fourteenth century Europe. What on earth prompted her to identify the kingdom as an area \"*partiellement ou totalement epargnees par la peste*\" - partially or totally spared by the plague? What evidence did she cite, and how much detail did she go into? Could it be we're overlooking some crucial bit of evidence that she dug up half a century ago?\n\nWell, the answer to that final question is a resounding \"no\". Carpentier[.] paper mentions Poland only once, and pretty much in passing. She asserts that the country was \"only affected – weakly – in its northern part\", and notes in passing that the one Polish chronicle account familiar to her deals solely with Torun, a small town on the Vistula, and is in any case quite useless, being copied word for word from a French source. The problem requires further study, she suggests. Worse still, her brief passage is not footnoted or sourced, making it impossible to tell – without engaging in a major act of historiographical archaeology – how she was able to conclude that only northern Poland was visited by the Black Death. \n\nAll in all, it[.] staggering that Carpentier[.] short, casually-composed passage – and the map that she drew based on it – has had so massive an impact on plague studies. And it is, to put it as politely as I can, more than a little bit unfortunate that it unleashed a myth that[.] only getting ever more entrenched with every general survey of Polish history that[.] published, and every bit of internet clickbait written about the Black Death.\n\n**Conclusions**\n\nThis has necessarily been a long post, so **a tl;dr** seems sensible. I conclude:\n\n• There is currently no detailed, accurate demographic data for Poland in the period up to and after the Black Death that would allow us to extrapolate the number of deaths caused by the plague in this region, even very approximately, with confidence. Data for prices and wages from one major Polish city suggest an impact similar to that experienced in western Europe.\n\n• Poland was not sufficiently isolated from the rest of Europe for isolation to explain its apparent \"escape\" from plague. And it seems to be the case that it experienced a significant number of deaths, though – perhaps as a consequence of population densities – *possibly* fewer, in proportion, than more populous states did.\n\n• However, the difficulty of assessing the impact of the Black Death in the kingdom is increased by its integration into the eastern European trading economy of the 14th century. The flow of people and cash eastwards from Germany was sufficiently significant to obscure and confuse any attempt to measure the impact of the plague in Poland, both economically and demographically.\n\n• English-language studies draw on only a couple of contemporary chronicle accounts from the region, not enough to base any proper sort of study on – and these suggest that the impact of the Black Death in Poland was, if anything, at least as catastrophic as it was elsewhere in Europe. More detailed local records may be largely or wholly lacking; if they exist, they have not been the subject of studies that have had an impact in the English-speaking world. \n\n• Nonetheless, no peer-reviewed books and papers written by academic historians, at least in western European languages, suppose there was anything extraordinary about the passage of the plague through Poland. \n\nMore modern studies generally suppose that the country escaped relatively lightly in 1347-51, though they acknowledge that it was not *unaffected* by the plague, nor was it necessarily invulnerable to later outbreaks of epidemic. Since I have not yet come across any such work that cites more detailed surveys of the impact of the Black Death in the region, it may well be that even the writers of these studies are basing their ideas about Poland an the plague on Carpentier and her (unreferenced, 55-year-old) work.\n\n• Mention of the actions of Casimir the Great in blocking the borders of Poland, or of the idea that the reluctance of Poles to kill cats helped to retard the spread of disease there, exist only in popular books and on the internet; such suggestions only began to appear after 1995. They do appear not to have been made by specialists in Polish history, nor does there seem to be any evidence at all that they are true. It seems more likely they are post-hoc rationalisations, brainwaves dreamed up to explain Poland[.] supposed escape from the ravages of the Black Death.\n\n• The idea that areas of Europe (including Poland and Milan) \"escaped\" or almost escaped the impact of the epidemic can be traced to incautious reading and recopying of a map *showing preliminary conclusions only* regarding the spread of the disease first published by Carpentier in 1962, and widely republished in English-language popular works from 1969.\n\n**Sources**\n\n[General note: there is a large void in studies of medieval Poland. The literature is relatively abundant up to c. 1250 and after the Union of Krewo in 1385, but I have struggled to find much written in the past 50 years, in any language, devoted to the history of Poland after 1250 and before its union with Lithuania, much less a study of the impact of the Black Death there. Benedictow – who devotes a chapter to the question \"Did Some Countries or Regions Escape?\" – acknowledges that the dearth of studies of Poland makes it difficult to draw conclusions about the impact of the epidemic there.]\n\nHollee Abbee, \"[Cats and the Black Plague](https://owlcation. com/humanities/Cats-and-the-Black-Plague),\" Owlcation 4 February 2010, accessed 29 October 2017\n\nWilhelm Abel, *Agrarkrisen und Agrarkonjunktur: Eine Geschichte der Land- und Ernahrungswirtschaft Mitteleuropas seit dem hohen Mittelalter* (1966)\n\nPerry Anderson, *Lineages of the Absolutist State* (1974)\n\nOle J Benedictow, *The Black Death, 1346–1353: The Complete History* (2004)\n\nHenry Buckle, *Miscellaneous and Posthumous Works* (1872)\n\nNorman Cantor, *The Black Death and the World It Made* (2001)\n\nElisabeth Carpentier, \"Autour de la Peste Noire: Famines et epidemies dans la histoire du XIVe siecle,\" *Annales*, XVII (1962)\n\nAlice Creviston, \"[Economic, social and geographical explanations of how Poland avoided the Black Death](https://rucore. libraries. rutgers. edu/rutgers-lib/47644/PDF/1/),\" Rutgers undergraduate paper 2015.\n\nNorman Davies, *God[.] Playground: A History of Poland* (1982)\n\nGeorge Deaux, *The Black Death, 1347* (1969)\n\nJM Doll et al, \"Cat transmitted fatal pneumonic plague in a person who travelled from Colorado to Arizona.\" *American Journal of Tropical Medicine & Hygiene* 51 (1994)\n\nChristopher Dyer, 'Rural Europe.' In *The New Cambridge Medieval History: Volume 7, c. 1415-c. 1500* (1998)\n\nRobert Frost, *The Oxford History of Poland-Lithuania I: The Making of the Polish-Lithuanian Union, 1385-1569* (2015)\n\nAlexsander Gieysztor, 'The Kingdom of Poland and the Grand Duchy of Lithuania, 1370-1506.' In *The New Cambridge Medieval History: Volume 7, c. 1415-c. 1500* (1998)\n\nRobert S. Gottfried, *The Black Death: Natural and Human Disaster in Medieval Europe* (1983)\n\nFrantisek Graus, \"Autour de la peste noire au XIVe siecle en Boheme,\" *Annales* (1963)\n\nJ. F. C. Hecker, *Der Schwarze Tod im Vierzehnten Jahrhundert* (1832)\n\nFred Hoyle and Chandra Wickramasinghe, *Diseases from Space* (1979)\n\nPaweł Jasienica, *Piast Poland*  (1985)\n\nAF Kaufmann et al, \"Public health implications of plague in domestic cats.\" *Journal of the American Veterinary Medical Association* 179 (1981)\n\nAlan Kors and Edward Peters, *Witchcraft in Europe, 400-1700: A Documentary History* (2001)\n\nDionysius Lardner, *The Cabinet Cyclopædia... History, Poland* (1831)\n\nJerzy Lukowski & Hubert Zawadzki, *A Concise History of Poland* (2005)\n\nDavid C. Mengel, \"[A plague on Bohemia?](http://www. jstor. org/stable/pdf/23014810. pdf)\" *Past & Present* (2011)\n\nJulian Pelc, *Ceny w Krakowie w latach 1369-1600* (1935)\n\nNational Polish Committee of America, *The Polish Encyclopædia* (1921)\n\nGeorg Sticker, *[Abhandlungen aus der Seuchengeschichte und Seuchenlehre I: Die Pest](https://archive. org/details/abhandlungenausd01stic)* (1908-10)\n\nJoseph Strayer, *Dictionary of the Middle Ages* (1982)\n\nHelen Taylor [ed.], *The Miscellaneous and Posthumous Works of Henry Thomas Buckle* (1872)\n\nBruce Weiniger et al, \"Human bubonic plague transmitted by a domestic cat scratch,\" *Journal of the American Medical Association* 1984\n\nAdam Zamoyski, *Poland: A History* (2009)\n\nPhilip Ziegler, *The Black Death* (1969)"}