{"doc_id": "1099", "name": "2017_04_humanities_student_major_1761_topmindsofreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "TopMindsOfReddit", "title": "2017-04-humanities-student-major_1761_TopMindsOfReddit.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.069", "Subjectivity": "0.275", "Score": "84", "Upvotes": "0", "Downvotes": "0", "Wordcount": "620", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgb0ycz", "Reddit_id": "dgb9g8p", "Subreddit_id": "t5_35g9w", "Commenter": "pizzashill", "length": "3927", "content_scrubbed": "Yeah, anti-jewish conspiracies actually fueled the rise of Hitler. Hitler played the \"November criminals\" angle hard and anti-semitic conspiracies were already pretty popular before Hitler even showed up. For example, officers in the military had tried to claim jews weren't enlisted in the army and did a survey and then hid it when the outcome wasn't what they wanted:\n\n Wilhelmine Reich, for instance. The Jewish-owned parts of the press, particularly the newspapers controlled by the two liberal Jewish firms of Mosse and Ullstein, which together produced over half the newspapers sold in Berlin in the 1920s, strongly supported the liberal institutions of the Republic. The arts' new-found freedom from censorship and official disapproval brought many Jewish writers, painters and musicians to prominence as apostles of modernist culture, where they mingled easily with non-Jewish figures like the composer Paul Hindemith, the poet and playwright Bertolt Brecht, or the artists Max Beckmann and George Grosz. Jews signalled their support for the Republic by voting particularly for the Democrats, and to a lesser extent for the parties of the_left. 196\nOn the other hand, partly in reaction to these developments, the 1920s also witnessed a broadening and deepening of the currents of antisemitism in German politics and society. Even before the war, the Pan-Germans _ and others on the_right had pumped out propaganda accusing the Jews of undermining the German nation. This kind of racist conspiracy theory was more than shared by military leaders such as Ludendorff. It found notorious expression during the war in the so-called Jewish census of October 1916, ordered by senior army officers who hoped it would give them support in refusing Jews admission to the officer corps once the war was over. The aim was to reveal the cowardly and disloyal nature of the Jews by showing statistically that Jews were under-represented in the army, and that those who had joined up were over-represented in desk-jobs. In fact, it showed the reverse: many Jewish Germans, like Victor Klemperer, were nationalist to the core, and identified strongly with the Reich. German Jews were over- rather than under-represented in the armed forces and at the front. Confounding the expectations of antisemitic officers to such a degree, the results of the census were suppressed. But the knowledge that it had been ordered caused a great deal of anger among German Jews, even if the attitudes it revealed were not shared by the majority of rank-and-file troops.\n\n After the war, the widespread belief on the_right that the German army had been [.]tabbed in the back' by revolutionaries in 1918 translated easily into antisemitic demagogy. It was, men like Ludendorff evidently believed, 'the Jews' who had done the stabbing, who led subversive institutions like the Communist Party, who agreed to the Treaty of Versailles, who set up the Weimar Republic. In fact, of course, the German army was defeated militarily in 1918. There was, as we have seen, no stab-in-the-back. Leading politicians who signed the Treaty, like Matthias Erzberger, were not Jewish at all. If Jews like Rosa Luxemburg were over-represented in the Communist Party leadership, or, like Eugen Levine in the revolutionary upheavals in Munich early in 1919, they were not acting as Jews but as revolutionaries, alongside many non-Jews (such as Karl Liebknecht, whom many right-wingers thought instinctively must be Jewish because of his ultra-left political views). Most Jewish Germans supported the solid liberal parties of the center, or to a lesser extent the Social Democrats, rather than the revolutionary left, whose violent activism shocked and appalled a respectable citizen like Klemperer. Nevertheless, the events of 1918-19 gave a boost to antisemitism on the_right, convincing many waverers that racist conspiracy theories about the Jews were correct after all."}