{"doc_id": "930", "name": "2017_04_humanities_student_major_139_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2017-04-humanities-student-major_139_RPI.txt", "pub_date": "2017-04-02T00:00:00Z", "Sentiment": "0.094", "Subjectivity": "0.404", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "373", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_62zlbz", "Reddit_id": "dfq9tfi", "Subreddit_id": "t5_2rg3u", "Commenter": "dankestcompsci", "length": "2121", "content_scrubbed": "Social life- completely over exaggerated. I go out every weekend. We're not all just a bunch of nerds. RPI[.] mentality is very much \"study hard, play hard.\"\n\nGender ratio- As a guy, I've found it to not be as bad as everyone else makes it out to be. Granted, it[.] a thing. You need to see how important this is to you.\n\nOne dimensional- you can definitely dual with music or another humanities_major I'm currently doing a minor in media studies. HASS majors make up about 10%+ of the school and then you have the business and science majors, but about half the school is studying engineering. I wouldn't consider that one sided though, it[.] roughly the same as a liberal_arts college except instead of half doing liberal_arts, half are doing engineering. Granted, most people do a minor and just because people are studying engineering doesn't mean they aren't interested in other things.\n\nWeather- it[.] not bad. I'm from New_York City, it[.] literally the same weather just a few degrees colder in the winter. I never hear anyone complain in NYC about it. I've always found it amusing that people make such a bigger deal about it when looking at RPI. You shouldn't have a rough time coming from Washington.\n\nCampus- google pictures, go on the RPI Facebook page and browse pictures of campus. I personally find it beautiful, especially in the fall/summer with the flowers and the leaves tinting. The weather is also beautiful then (80+ degree weather).\n\nMental health- I'm not really sure how you gauge that, but we have a dedicated counseling center.\n\nUW Seattle and RPI - I'd say RPI is a much better school overall. Much lower acceptance rate, better class metrics (aka smarter kids overall), and a better brand name/reputation. The school as well as classes are also much smaller (I know someone is going on comment on this and say the opposite, but UW has 700/800 person lectures for Intro classes). You'll definitely get a more rigorous curriculum at RPI. I'd say it[.] a better bet coming here, especially for BME, but that[.] just me. It[.] up to you to figure out the rest and make the final decision. Best of luck!"}