{"doc_id": "1168", "name": "2017_04_humanities_student_major_2304_enoughlibertarianspam", "namespace": "we1sv2.0", "metapath": "", "pub": "EnoughLibertarianSpam", "title": "2017-04-humanities-student-major_2304_EnoughLibertarianSpam.txt", "pub_date": "2017-04-20T00:00:00Z", "Sentiment": "0.112", "Subjectivity": "0.321", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "426", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgj1n3k", "Reddit_id": "dgj3fs4", "Subreddit_id": "t5_2tzlb", "Commenter": "OpinionGenerator", "length": "2434", "content_scrubbed": "It[.] not.\n\nYou should look more into the film and music industry if you think otherwise. China in particular is having an interesting effect on cinema.\n\nYou do live in that world, you just don't choose to participate in it.\n\nHence me saying I'd rather not live in it...\n\nCall me when you spend 500 million dollars producing a movie and still think you deserve zero credit.\n\nWho said zero credit? I said OVER the major artists. The point is that these things should be funded by non-private entities. And more importantly, why the hell would anybody make a film that costs $500m? Show me a worthwhile film with a budget of over $60 million (and I'm using that number based upon the adjusted inflation of The Shining which is just over $50 million) and we'll talk.\n\nWith $500 million, you could make 25 insanely intelligent, well-funded films by the likes of filmmakers with actual visions like Lynch, Haneke and Von Trier, but instead, capitalists blow it all on one or two bloated teenie films pretending to be for adults like comic films.\n\nHave some conversations with some left anarchists\n\nOkay, but again, I specifically made a point to say you're only talking about ONE group. I specifically mentioned market socialism which isn't anything like what you're describing.\n\nNot really. I've been told on many occasions by the far left that art isn't important and if the arts have to die to make the socialist utopia happen, then so be it\n\nSo, anecdotal evidence. Count me as one counter, then head on over to /r/socialism asking the same question. When you inevitably get a bunch of people telling you the opposite, you can put that blanket statement to bed.\n\nWho decides what art is good enough to grant the artist food and shelter that other people busted their asses to provide?\n\nAgain, you're being very specific and ignoring market socialism which would use markets like now, but even if it were a small group of people in an anarchist society, how is that any different than how it is now? It[.] still just a handful of rich people deciding.\n\nYour definition of the word theft is at odds with reality. I suggest a dictionary or something of that sort.. Sorry for the snark, but I really have no patience for people who redefine words in order to make their points.\n\nOxford dictionary:\n\n2 of or relating to a person or group favoring liberal, **socialist**, or radical views\n\nHmmm, market socialism fits the bill then doesn't it?"}