{"doc_id": "346", "name": "2017_10_humanities_student_major_1100_maliciouscompliance", "namespace": "we1sv2.0", "metapath": "", "pub": "MaliciousCompliance", "title": "2017-10-humanities-student-major_1100_MaliciousCompliance.txt", "pub_date": "2017-10-11T00:00:00Z", "Sentiment": "0.147", "Subjectivity": "0.44", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "461", "Permalink": "http://reddit.com/r/MaliciousCompliance/comments/75pf9q/texas_officials_rename_robert_e_lee_high_school/do8xr2o/", "Threadlink": "http://reddit.com/r/MaliciousCompliance/comments/75pf9q/texas_officials_rename_robert_e_lee_high_school", "Parent_id": "t1_do8x21s", "Reddit_id": "do8xr2o", "Subreddit_id": "t5_3boqz", "Commenter": "rg90184", "length": "2799", "content_scrubbed": "I'm pretty sure that[.] not how the lesson would be introduced if the teacher has any sanity. That[.] a trip to HR just waiting to happen lol. I mean, can you imagine?? \n\nBut I think it[.] important to know that historical figures aren't just (and pardon the accidental pun) black and white. A horrible person is perfectly capable of doing something great that should be honored. Being able to understand that, yeah Robert E Lee had some retrograde views on black people (a lot of people at the time did) But he was also a tactical genius who invented many battlefield tactics still used today, mostly because while he did fail on the battlefield quite a bit, he learned from each one and was able to devise new strategies, as well as after the war becoming the president of Washington State College.\n\nAfter the Civil War, General Robert E. Lee turned down several financially tantalizing offers of employment that would merely have traded on his name,[14] and instead accepted the post of college president for three reasons. First, he had been superintendent of the U_S Military Academy on the Hudson River at West Point, New_York, so supervising higher education was in his background. Second, and more important, he believed that it was a position in which he could actually make a contribution to the reconciliation of the nation. Third, the Washington family were his in-laws: his wife was the great-granddaughter of Martha Washington, and Lee had long looked on George Washington as a hero and role model, so it is hardly surprising that he welcomed the challenge of leading a college endowed by and named after the first president.\n\nArguably Lee[.] finest achievement was transforming a small, not particularly distinguished Latin academy into a forward-looking institution of higher education. He established the first journalism courses (which were limited and only lasted several years),[15] and he added both engineering courses and a business school and a law school to the college curriculum, under the conviction that those occupations should be intimately and inextricably linked with the liberal_arts. That was a radical idea: engineering, journalism, and law had always been considered technical crafts, not intellectual endeavors, and the study of business was viewed with skepticism.\n\nLee was also the father of an honor system and a speaking tradition at Washington College that continue to the present time. And, ardent about restoring national unity, he successfully recruited students from throughout the reunited nation, North and South.\n\nIf not for Robert E Lee, higher education would not be what it is today. And he is a perfect case study for the simple concept that a person is not defined merely by their opinion on one thing. Even if that opinion is harmful. \n\n"}