{"doc_id": "1257", "name": "2017_04_humanities_student_major_3164_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-04-humanities-student-major_3164_AskHistorians.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.064", "Subjectivity": "0.285", "Score": "27", "Upvotes": "0", "Downvotes": "0", "Wordcount": "939", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgv6vwr", "Reddit_id": "dgv7jwv", "Subreddit_id": "t5_2ssp3", "Commenter": "sunagainstgold", "length": "5792", "content_scrubbed": "[1/2]\n\n*Democratizing the Digital Humanities: A Future for AskHistorians*\n\n*Cait Stevenson (I'll save you the doxxing effort)*\n \nThe NCPH has asked us what it means to do history \"in the middle.\" One of the things that I hope has come across most strongly so far is that AskHistorians isn't just placing itself in some pre-existing middle. Whether deliberate or not, we ended up creating it.\n \nAnd the most radical and liberating thing of all is that we're not the middle between \"academic historian teachers\" and proletariat students. Only two of us up here are practicing academics, and neither of those is the one who[.] published a book or been invited to give public lectures or conducted the most thorough literature review of their research interest. \"The only qualification for writing an AskHistorians answer is the ability to write a good answer.\" Thanks to our lack of concern for credentials and the culture of anonymity fostered by our reddit platform, we're the meeting place for different conceptions of history, rather than hierarchies of historians.\n \nBut at the same time, we are tethered to academia. It[.] built into our standards, in fact: in-depth, comprehensive, and supported by current academic research. That requires an awareness of what the current research is, and the time and insider knowledge of how to stay up to date. Most importantly, it requires some way to access the journals, books, and ephemeral insider networks that communicate current research. Academia doesn't just supply most of our material, it governs access. And academia is a democracy.\n \nSo to finish up for today, I'm going to look at the implications for AskHistorians of our necessary binding to academic history. Right now academia is very much in its own middle of a conflagration of contigent labor, grad student exploitation, seemingly infinite compartmentalization and specialization There[.] a sense that this all bad, coupled with an inability to do anything besides make it worse. So how can AskHistorians continue to thrive? And what strategies can we share for other public historians facing similar funding and staffing shortages in the face of a urgent moment to bring historical knowledge to public consciousness?\n \nFirst I want to talk about what it means to do history outside an academic or professional hierarchy.\n \nI consider recruiting occasional commenters to participate more often and earn flair to be my personal sacred duty as a moderator. And over and over, I hear \"but I'm just an amateur\" or \"I'm not in academia\" or \"I just read a lot.\" I just read a lot! That[.] it, that[.] exactly it. So one of the challenges, especially to me as a well-known academic and mythical Girl on the Internet, is to mediate the academic-ness of my own language, to make us seem less ivory tower—without belittling the user or demeaning myself as a woman intellectual. But also, the other mods and I have to appeal to potential flairs on two competing grounds: first, their ability to absorb and reproduce an academic perspective; second, the confidence that an outsider perspective is something unique, valuable, and necessary in and of itself.\n \nWe're used to celebrating an inside perspective: either as academics talking to academics, or as local historians evoking pride in our towns and cities. So the benefits of celebrating an outside perspective is a very useful takeaway from AskHistorians. Ultimately, historians are teachers: we empower people to know. What AskHistorians tries to nurture is the power to pass that knowledge on—especially outside formal settings. Our conversion rate of potential recruits into certified flairs proves the viability of our strategy. We're working on new ways right now to turn even more lurkers and one-off participants into experts. The shift of public historical goals from unidirectional conveying of knowledge to the creation of communities of historians is one of the most exciting things to watch about AskHistorians.\n \nOur challenge from the other direction is different. I'm currently one of the AH academics, although I don't expect that to last past graduation. And like I tell people: my job is writing about history. My hobby is writing about history anonymously on the Internet. I've made my decision to spend thousands of hours on this, obviously, but this type of individual choice is not long_term and wide-scale sustainble if AH wants to grow. One example from the academic warzone must suffice to illustrate the problems we face.\n \nRecent research has shown the systemic factors stacked against women succeeding in academia. Moms use maternity leave to be parents; dads use paternity leave to write a book. Women carry a vastly disproportionate amount of the \"departmental service\" burden. Overall, factors like these make women less likely to have viable long_term academic careers; it also means the ones who do have less time outside their work lives.\n \nThis dynamic plays out on AskHistorians. We're on reddit, a website that the medieval feminist scholarship society uses as shorthand for Internet misogyny. AskHistorians has a reputation on and off reddit for strict standards of civility and zero tolerance for bigotry, including sexism. Answers on feminist historiography and women[.] history have been voted by users best post of the month 4 times now in less than 3 years of running monthly awards. And yet, our readership can't seem to break reddit AVERAGE score of 15% female, and our team of flairs is even worse. Average, on a website with large sections that promote \"no means yes\". AskHistorians is passively accepting of women. How do we go from a passive strategy thst fosters a nice environment for men, to an active strategy that encourages women[.] participation for an even better overall subreddit?\n \n"}