{"doc_id": "1055", "name": "2017_04_humanities_student_major_1270_ukpolitics", "namespace": "we1sv2.0", "metapath": "", "pub": "ukpolitics", "title": "2017-04-humanities-student-major_1270_ukpolitics.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.192", "Subjectivity": "0.36", "Score": "29", "Upvotes": "0", "Downvotes": "0", "Wordcount": "296", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg4yksz", "Reddit_id": "dg4ywsw", "Subreddit_id": "t5_2qhcv", "Commenter": "ajehals", "length": "1719", "content_scrubbed": "A graduate tax sounds like a far more straightforwards way of handling the whole system.\n\nOr we could just fund it through the tax system, I really don't see the issue in a system with progressive taxation. Earn more because of your degree, pay more taxes, earn more because you can employ well educated people, pay more taxes, etc.. Education is something that should benefit society, so we should pay for it.\n\nThe problem I have right now is actually more with the direction we are going with university education generally, it is becoming essential for everyone not because people need a university education, or university education is particularly relevant to a lot of jobs, but because there has been a massive push to get people into university. I'd rather that were spread more across vocational and in work training and getting people into work that offers a career when they leave school, as well as having university push people into academia and research... Low level management doesn't and shouldn't require a degree, nor should a whole slew of jobs that up until recently were broadly vocational for the majority (with some people taking the degree route and going into research..).\n\n*edit: Just realised I sort of missed the other side of my argument.. - I also don't think university should just be about jobs or about what you can earn with a given degree. I would prefer university to be an option for talented musicians and artists, for social_scientists and people with an interest in the humanities and media, and that people can learn and develop for the sake of learning, not because they feel they have to, to be able to compete for work that doesn't have any relevancy to their degree anyway.*\n"}