{"doc_id": "1179", "name": "2017_04_humanities_student_major_2435_uwaterloo", "namespace": "we1sv2.0", "metapath": "", "pub": "uwaterloo", "title": "2017-04-humanities-student-major_2435_uwaterloo.txt", "pub_date": "2017-04-21T00:00:00Z", "Sentiment": "-0.009", "Subjectivity": "0.149", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "252", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgl6hr3", "Reddit_id": "dglcxmx", "Subreddit_id": "t5_2rb5s", "Commenter": "randomuwguy", "length": "1476", "content_scrubbed": "The [CFM requirements](http://ugradcalendar. uwaterloo. ca/page/MATH-Computing-Financial-Mngt-Overview-Degree-Req) are mostly the same as [CS requirements](http://ugradcalendar. uwaterloo. ca/page/MATH-Bachelor-of-Computer-Science-1), except:\n\n* CFM does not require CS 350 (OS, a good low level course) or CS 251 (an easier course, more hardware based, not super interesting).\n* CFM requires a bunch of AFM and ECON courses, and a STAT 3xx course. Everything in AFM and ECON on the page isn't required in CS.\n* In CFM, you get 7 electives, at least 3 of which must be upper year CS courses (it could be 7 CS courses). With CS you get 24 electives, at least ~6 must be upper year CS electives, and at least 10 need to be non-math (so you could technically do 14 CS electives).\n* CS requires depth and breadth requirements: of your non-math electives, you need to do 2 humanities courses, 2 social_sciences, and 2 sciences (see the CS page for what is in each). You also need to do 3 courses of the same type (with a few requirements on what you take. You could take 3 AFM courses), and these count towards the breadth requirements.\n* In CS, you can take minors or options. It doesn't look like there is enough courses in CFM to (unless you overload or do another semester).\n\nIt[.] hard to say if any point is a pro or con, it really depends on what you want to get out of university.\n\nEdit: I should add, I haven't heard of any CS or CFM acceptances going to Ontario residents yet."}