{"doc_id": "1004", "name": "2017_04_humanities_student_major_799_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2017-04-humanities-student-major_799_AdviceAnimals.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.005", "Subjectivity": "0.364", "Score": "31", "Upvotes": "0", "Downvotes": "0", "Wordcount": "332", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfzkflk", "Reddit_id": "dfzmv62", "Subreddit_id": "t5_2s7tt", "Commenter": "divisibleby5", "length": "1897", "content_scrubbed": "BA in sociology aka liberal_arts (i took of lot of medical sociology/sociology of the body) second tier state school, $48k right out the gates doing medicaid audits /compliance then a program with medicaid a. nd veterans affairs. This was midwest. Won two regional excellence awards. Super rewarding: helped vets exposed to agent orange and thier families get appropriate care. \n\nBestie has spanish degree aka liberal_arts and took vietnamese courses-skypes doctor visits with non english speakers from house for $32 an hour \n\nGood friend- russian lit (aka liberal_arts) $42,500 teaching high school in texas\n\nGood friend- fashion and apparel design liberal_arts: 40 to 42 k $ case manager for the homeless , used to work in adult protective services \n\nShitty friend - art and media aka liberal_arts- IEP coordinator , makes over 35,000$ \n\nPothead friend- library masters degree $60,000 gets to drive book mobile stoned\n\nWe're pretty open and competitive with each each other, as well as a few of these jobs werecones i also applied for or was interested in, like librarian and case manager\n\n\n\nYou know why trade schools arent for everyone? Because it takes a huge physical strain on your body. My middle school science teacher was a union journeyman, made great money but destroyed his back. My dad was a welder and was terribly burned in an accident in west of tulsa oil site. My grandpa welded after the War and got a hunchback immediately besides damage to skin and nerves from sun exposure and holding positions for hours. plus a lot of those jobs are seasonal or contract, meaning you are constantly chasing the next job or located in a boomtown on the ass end of hell like a pipe line in the seirra nevadas or the one bit of canada thats ugly. \n\nSo yea, its great if you wanted to wallow in shit , live with five guys in a camper for $1000 a month or destroy your sanity or body in two years\n"}