{"doc_id": "1271", "name": "2017_04_humanities_student_major_3230_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2017-04-humanities-student-major_3230_slatestarcodex.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.035", "Subjectivity": "0.343", "Score": "14", "Upvotes": "0", "Downvotes": "0", "Wordcount": "255", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66w4g4", "Reddit_id": "dgw6h0c", "Subreddit_id": "t5_30m6u", "Commenter": "Rietendak", "length": "1637", "content_scrubbed": "This is some Grade A culture war stuff that I would really object to were it from the Other Side, so I'm posting it in the very tail end of the thread, with a disclaimer that it[.] a really unique situation that has never happened before (to my knowledge) and doesn't say anything about the_right in general. It[.] such a crazy story that I'd put 25% odds on it being fake.\n\n[A Trump Supporter Allegedly Attacked Students At A Kentucky University With A Machete](https://www. buzzfeed. com/davidmack/a-trump-supporter-allegedly-attacked-students-at-a-school)\n\n \"He asked the first girl if she was a Democrat or a Republican. She said Republican. He said okay, then asked some other girl,\" Michael Soder told Lex 18. \"By that time, some of my friends were running out and yelling for us to leave, and I tried to stay behind to see if — I mean I didn't know what to do, I wanted to help, but I knew I should get out of there.\"\n\n \"He asked somebody what their political affiliation was, they said 'Republican,' and the guy said, 'You are safe,'\" campus newspaper editor-in-chief Tristan Reynolds told the Lexington Herald-Leader. \"And then I realized what was going on and started getting people out.\"\n\n In 2015, after BuzzFeed staffer and Transylvania alum Tracy Clayton wrote a viral post detailing her experiences with racism at the university, Adkins wrote a post on this website as a community contributor. In the post, \"[Discrimination of Conservatives in Liberal Arts](https://www. buzzfeed. com/madkins19/discrimination-of-conservatives-in-liberal_arts-1ynfg),\" Adkins wrote of making \"several enemies\" because he is a \"proud Republican.\""}