{"doc_id": "261", "name": "2017_10_humanities_student_major_279_ubc", "namespace": "we1sv2.0", "metapath": "", "pub": "UBC", "title": "2017-10-humanities-student-major_279_UBC.txt", "pub_date": "2017-10-04T00:00:00Z", "Sentiment": "0.041", "Subjectivity": "0.335", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "291", "Permalink": "http://reddit.com/r/UBC/comments/73y7vg/admissions_megathread_20172018_post_all_your/dnwrlan/", "Threadlink": "http://reddit.com/r/UBC/comments/73y7vg/admissions_megathread_20172018_post_all_your", "Parent_id": "t1_dnw0589", "Reddit_id": "dnwrlan", "Subreddit_id": "t5_2qy2j", "Commenter": "Kinost", "length": "1932", "content_scrubbed": "Some general things I've heard about BUCS:\n\n* BUCS students are the only students with reserved seats for Computer Science courses in the first year (110, 121) which is a huge bonus since those seats are difficult to get (or easy, depending on your grades. I guess it just makes your life a bit easier come registration time or incase you need to change your timetable.)\n\n* Can't do a specialization in commerce like Finance or OpLog without delaying graduation or having a difficult courseload (subjectively speaking).\n\n* Tuition is higher, and the domestic Sauder Tuition is about 1. 5 times the Arts tuition after first year. [See tuition fees here.](https://students. ubc. ca/enrolment/finances/tuition-fees/undergraduate-tuition-fees) It would be ultimately cheaper to do a BA or BSc in Computer Science. However, as a domestic student, you may not think the extra ~$7. 5k to be significant. As well, there are higher student fees for Sauder students, in addition to your tuition, like a $531. 71 building fee (whereas other faculties, like Arts, pay a $15 building fee annually), and a $256. 69 CUS fee (whereas Arts students pay only $13/year). If you were to assume that the commerce student fees remain the same for a 4 year degree (it won't), it will add about ~$2384 on top of your tuition throughout your degree. Making it an extra ~10k you're paying for a B. Com. degree (as a domestic student). [Source for undergraduate student fees.](http://www. calendar. ubc. ca/vancouver/index. cfm?tree=14,267,785,0) If you're an international student (no Canadian Citizenship or PR status), you do not get a subsidized first-year tuition, and you're looking at an extra ~$43-44k for a Sauder degree, as tuition is approximately ~$10k higher annually than Arts & Sciences.\n\n* [See this thread here.](https://www. reddit. com/r/UBC/comments/2ze0qb/calling_all_bucs_students/) And don't forget to search /r/UBC for more information on BUCS."}