{"doc_id": "1272", "name": "2017_04_humanities_student_major_3251_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-04-humanities-student-major_3251_ApplyingToCollege.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.115", "Subjectivity": "0.412", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "478", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_6878r1", "Reddit_id": "dgwe7cl", "Subreddit_id": "t5_2y2r8", "Commenter": "8YearOldCodPlayer", "length": "2695", "content_scrubbed": "Don't underestimate alumni networks. The best jobs are not found from applying online, speaking with a recruiter, but through alumni connections, and knowing the_right people.\n\nSince you don't like Georgia tech, screw it. Your parents don't like it too, I would let them feel a bit better about where their money is going (cause they're paying) and not go to a school they \"100% discourage\"\n\nUCLA has an international reputation, and was also one of the two of my biggest options I was considering for college, so I researched it extensively. The post you probably read on /r/ucla about the dead entrepreneur scene is outdated and many ucla students have countered that point. There are quite a few startups there with students from different majors collaborating together. Do you really care about worldwide reputation if you're not going to be working in another country? Worldwide rep is basically based off grad school anyways. UCLA lower divs are pretty hard, cause a lot of people want to transfer into CS so they have difficult weed-out classes. \n\nCampus is nice, huge, food is fantastic, and you can definitely do well socially there, cause there[.] bound to be people with similar interests as you. One thing about UCLA to consider, is that the curriculum is pretty much set for CS. You only have a couple elective courses in your undergrad. You won't be able to double major, and since it[.] a public uni: it would be difficult to switch majors if you decide CS is not what you want to focus on the rest of your life.\n\nAlso keep in mind that moving to california is not so easy. Sure your parents can say they'll go to cali, but they'll leave behind their friends, and also are you sure they'll find a good job in cali? California is generally more expensive to live in: for my parents to be making 100k here would be like them making 200k in san fran.\n\nNotre Dame is strong overall, it[.] cheaper, and you can study abroad, and since it[.] a private school - smaller classes and more research opportunities.\n\nI spent weeks deciding between a small private liberal_arts school like Notre Dame and UCLA, and I ultimately chose a small liberal_arts school after jumping back and forth.\n\nThe main decision factor regarded the question: Am I positive I want to major in *only* computer science for the next 4 years of my life? (look at the UCLA CS curriculum, I'm not exaggerating)\nAt Notre Dame, I can pursue anything, I can switch majors easily, I can double major/minor easily. It'll be tougher if I want to be a software engineer in the Bay Area, but it'll be easier to work anywhere else.\n\nNote: I didn't notice you said CSE, I know alot about their CS program, don't know much about CSE."}