{"doc_id": "1088", "name": "2017_04_humanities_student_major_1659_politicaldiscussion", "namespace": "we1sv2.0", "metapath": "", "pub": "PoliticalDiscussion", "title": "2017-04-humanities-student-major_1659_PoliticalDiscussion.txt", "pub_date": "2017-04-14T00:00:00Z", "Sentiment": "0.09", "Subjectivity": "0.342", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1393", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg9o8ea", "Reddit_id": "dg9pvfh", "Subreddit_id": "t5_2sfmf", "Commenter": "JonWood007", "length": "7754", "content_scrubbed": "I actually think the opposite.\n\nMy own experiences, as well as sociological analyses of how our economy works, tells me that \"opportunity\" sounds all well and good, but it really rings hollow for me.\n\nJobs exist because something needs doing. They're a means to an end. Our current system treats them as an end in themselves, which is why the democratic party has actually put tons of effort into \"opportunity\" during the clinton and obama administrations. But no matter how much we try to fix things in this way, it will never bring about good well being for the people. \n\nOur economy is structured like a game of musical chairs. No matter how many chairs we make, there will always be more players. In an economic sense, this is necessary because a job for everyone means there is no surplus labor pool to fill new jobs, and there will be significant pressure on wages. As such, there will always be some people who are poor, and there will always be an underclass. \n\nThis means that wage negotations, the power of labor, will always be suppressed. In the past this was compensated for by unions, but the legacy of the reagan years have destroyed unions mostly and even if we got them back, we've allowed corporations to become so powerful they will ship jobs elsewhere to avoid paying higher wages.\n\nWhich is another contradiction of our system. We want a society in which jobs are plentiful and pay well. We live in a society dominated by the wealthy elites in which jobs are scarce and pay poorly. People are upset jobs are scarce and pay poorly, but there is no market based initiative to fix this coming to the rescue. The desires of the populace are actually counter to the natural inclinations of the capitalist system. And as such, the capitalist system is what must come under scrutiny if we are to fix the issues.\n\nAs long as we insist on job creation and that kind of nonsense, things will never be better. There is an inherent contradiction between our values and the inclinations of the system that governs us. The job creation narrative tries to make the system in line with our values, but I think we need a value change going forward. Combine this with the coming of automation to many jobs and we are looking at this crisis potentially getting much worse.\n\nI really think we need to reevaluate our lives in general. We are living in the shadow of the protestant work ethic, which has become the american dream, which is a silly vision that was never as great as what it promised. Work shouldnt be the purpose of life. Work should be about enhancing live. We should work to live, not live to work, and honestly, I dont think redistribution and \"welfare\" as you put it are the end of the world. It might be against a lot of these guys values, but we need to really paint a good picture that those values are contributing to the problem, and the problems will never be solved until we change our thinking.\n\nI also strongly feel like the college or bust mentality is negatively affecting those that could not afford college. And this category happens to be growing the largest.\n\nThe college thing has its own concerns. As someone who is college educated, I think a huge problem with our system is the lack of affordability of college, student loans, and the fact that people are going through training and cannot find jobs afterwards. yes, we need to stop acting like college is an end all to economic success. I fell into that trap since it was the perception i grew up with and is a huge reason I think the way I do today. Quite frankly, in a system in which I feel unneeded so to speak, once again the whole mentality of making more work so people can earn paychecks seems to be hollow for me.\n\nIf work were really so necessary and integral to our lives, where it was a life or death situation for society if everyone did not work, which is what our social norms are based around, then finding work should be EASY. People should be begging for workers. But that isnt the case. You have to beg to be employed, and I find this to be an odd concept in a society that claims work is so necessary.\n\nI really do believe that our insistence that everyone must work and earn their way is a huge source of our problems. The whole concept doesnt make sense to me, looking at it in context. We have a society that LACKS WORK for everyone. And we act like it[.] a bad thing. Shouldnt it be a good thing? A sign that our society is progressing ever forward? That we can provide for the whole population in theory with a fraction of the population?\n\nOnce again, it[.] our norms that make it a bad thing. And this is where I think the Trump voters are in for a rude awakening. Because we already saw the democrats take a stab at \"opportunity\" in the obama administration and failed, and now its the republicans' turn and they will fail too.\n\nI really think peoples' misery will continue as long as we stick with our current ideas.\n\nWe do need strong safety nets. We need to reform the whole system to meet our needs in the 21st century, the way roosevelt did for the 20th. And this requires abandoning previous principles on the subject and thinking differently. ANd in this case, more utopian. I really dont think people realize just how advanced our society is. We could eliminate poverty if the political will was there. But it isnt. Because the rich and powerful have a vested interest in the status quo and the populations have been misled to think about society a certain way in black and white terms and refuse to change. \n\nPursuing more opportunity is a fool[.] errand. it[.] a dysfunctional approach to a dysfunctional system. It[.] 20th century thinking in the 21st century. \n\nHigh school or less (the so called uneducated) didn't win Trump the election, the college drop outs and associate degrees did. This forms the basis of my education reform ideas on focus on subsidizing trade schools (e. g. nursing, welding, etc) as opposed to the give universities a government sourced blank check. \n\nMy views tend to vary a bit. Think of why people go to college. Many people go to get jobs. people who attend for associates degrees tend to go for degrees that provide employment. They tend to be very career focused. And they might have voted for Trump because of his \"make america great again\" spiel, which appeals right to their values. They value hard_work and meritocracy, but think the system isnt providing it and that Trump will provide it.\n\nContrast this with someone like me, who has a post graduate degree and is more liberal_arts minded. I tend to view our society a bit differently, having long rejected those values due to a combination of my own experiences, and more importantly, my more liberal_arts social science oriented education. My degrees are more liberal_arts minded, and I majored in social_sciences. As such, i tend to have a bit more of the \"sociological imagination\" so to speak. I can look at my troubles, and view them within the context of the larger sociological system. And in my case, I've rejected those values.\n\nCollege does tend to make people critical thinkers. But if you only have a little college, or tend to go into the whole associates degree track, you're much much more career focused, so you get educated, but not in a way that changes your values. So you accept the whole meritocratic american dream stuff and eat up trump[.] talk of opportunity. \n\nIf that makes sense. That[.] just my take on that. I do think there[.] a mismatch between skills and opportunities for these people. But due to their presumed values, education level, frame of mind, I don't think they understand that it[.] the system itself that[.] at fault. Which I did above. I tend to blame the entire system and the values that prop it up. "}