{"doc_id": "1182", "name": "2017_04_humanities_student_major_2448_askthe_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "AskThe_Donald", "title": "2017-04-humanities-student-major_2448_AskThe_Donald.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "-0.034", "Subjectivity": "0.292", "Score": "41", "Upvotes": "0", "Downvotes": "0", "Wordcount": "608", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgl4d3n", "Reddit_id": "dglir0x", "Subreddit_id": "t5_3fuwj", "Commenter": "Bump-4-Trump", "length": "3692", "content_scrubbed": "Hi, i whole heartily disagree. Its cultural marxism. Its leftist playbook. This mentality is actually by design. The whole racist, sexist, homophobe, imperialist jargon is actual communist propaganda from old that flooded the universities through humanities departments. Now, the soviets, after going through a very bloody civil war, and 2 world wars wanted to land on top as the most powerful superpower in the world, but were weak and tired. So, marxist philosophers created a liberal think tank called the school of social_sciences or 'the frankfurt school'. They developed these humanity courses with 1 purpose. For america to eat itself alive, basically. Their military couldnt match the US[.] military so they developed courses known as 'critical theory'. Its mostly done by americans to americans. Racism, sexism, homophobia, patriarchy, blah blah blah. These all stem from critical theory. The point of critical theory is simply to criticize, and only the west and western culture is up scrutiny. Anything else is 'politically incorrect'. Politically correct is a old term, as is SJW. But politically correct was the antithesis of scientifically correct. For example with slavery-If you try to make a point that only 5% of the world[.] slaves came to america, and the Africans were second only to the arabs in the slave trading business, that is politically incorrect. If you mention that slavery was much more brutal in the middle east and still exist today, youre a racist xenophobe. If you break down critical theory[.] racist, sexist, homophobic, imperialist to their counterparts it equates to white, male, christian, and capitlism is evil. This happened to be the dominate group in the country, and at the time when this first washed up on campuses, especially so. The result is quite clear. Anyone (leftist do it all the time) can criticise white, males, christian at will with no repercussions. Infact, a leftist will say its impossible to be racist towards whites(dehumanization). They will print hate articles about whites in huffpo, salon, cnn. Schools openingly teach courses on hating whites, christians, capitalism, etc. Leftist actually become giddy when they talk about the browning of america, or how the white gene is recessive and will be extinct. Just so we're on the same page, thats bragging about actual genocide and advocating for it. You read this and probably think im a white supremacist. But, i am not. Infact, if you look on wiki right now itll say how black pride, asian pride and latino pride are all so noble. White pride is inherently evil. The myth of privilege is pretty much exposed right there.  \n\n The liberal lie is that its america, and white people to blame for everything. But all the horrible racist crap was the democrats. The same ones who run on the same platforms. It was the democrats who created the instituion of government marriage licenses-to keep black and white from marrying. Prior to that, it was purely a religious ceremony. Between man, woman and god or church. Same reason why democrats created gun control-to keep guns out of the hands of newly freed black slaves. They disarmed the blacks and started the KKK and lynched 6,000 people. 1,500 white republicans as well. Food for thought. John Wilks Booth was an actor. The cast of Hamilton was really nasty to Mike Pence. They also had auditions for their play that said \"whites need not apply\". All of hollywood has it out for Trump. Lee Harvey Oswald, who shot Kennedy, was a Marxist. Search it on youtube. Right out of his mouth. \n\nCheck out this vid. Its pretty short and well made. Itll explain critical theory and cultural marxism better. \n\nhttps://youtu. be/4fo5jLdJlgI\n\n "}