{"doc_id": "957", "name": "2017_04_humanities_student_major_399_berkeley", "namespace": "we1sv2.0", "metapath": "", "pub": "berkeley", "title": "2017-04-humanities-student-major_399_berkeley.txt", "pub_date": "2017-04-04T00:00:00Z", "Sentiment": "0.173", "Subjectivity": "0.417", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "407", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63eqig", "Reddit_id": "dftx311", "Subreddit_id": "t5_2qh9w", "Commenter": "kkranberry", "length": "2213", "content_scrubbed": "I'm going to preface this by saying that I think that due to my major, I've had an easier time than a lot of people. Yeah I have to write a lot of papers, but I'm not going to pretend that I've worked nearly as hard in media studies as someone in STEM. I didn't have weeder classes or a grade curve. It[.] my personal impression that liberal_arts at Berkeley and STEM at Berkeley are very different experiences, but both challenging in their own ways.\n\nI didn't come to Berkeley for my current department, but now I absolutely love what I study enough to be voluntarily writing a thesis in it. Berkeley helped me overcome this idea that I had to stick to my plan. I learned that I wanted to take a different path, and I struggled with that for a while. I think I've become more flexible in this way. Dealing with rejections in college has also helped with that. I was a perfectionist in high school, but college isn't that simple. There are a lot more challenges, and there have been a lot more things that haven't gone how I hoped they might. And I think I've come out the other side a better person.\n\nI also think the amount of opportunities that are available for Berkeley students has been a really valuable thing. Student organizations on campus have allowed me to pursue new passions and stay connected to old ones, and there is a club for just about everything.\n\nBerkeley is also weird, which I think is a great thing. I come from a very run-of-the-mill NorCal suburb, and Berkeley kind of scared me at first. But I think being exposed to some of the grunge and weirdness of Berkeley has made me a more confident, accepting, and adventurous person. Things that used to freak me out feel normal, and I don't feel as nervous navigating certain situations anymore.\n\nI think another really valuable thing is the value that comes with meeting people who share your values and drive. Pretty much everyone who got into Berkeley did so because of their intelligence, skill, and/or work ethic in some way, and the more you look into clubs, the more you'll find people you connect with. I may not agree with everyone on campus, but it means a lot to be surrounded by people who value so many of the same things as me."}