{"doc_id": "1155", "name": "2017_04_humanities_student_major_2133_accidentalrenaissance", "namespace": "we1sv2.0", "metapath": "", "pub": "AccidentalRenaissance", "title": "2017-04-humanities-student-major_2133_AccidentalRenaissance.txt", "pub_date": "2017-04-19T00:00:00Z", "Sentiment": "-0.045", "Subjectivity": "0.361", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1501", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dggg20b", "Reddit_id": "dghekzg", "Subreddit_id": "t5_32xq7", "Commenter": "voodoo_soviets", "length": "9849", "content_scrubbed": "Once more you've ignored my evidence and are deadset on you sympathizing. \n\nConsidering antifa and anti Trump supporters have been beating up trump supporters, payback is a bitch\n\nOh, so now it[.] no longer peaceful protests, it[.] payback? The Trump supports are no longer the victim and violence is a-okay when *they* do it, right? \"As long as those people who are opposed to racism are the ones being hit, I'm cool with violence.\" \n\nFucking hypocrite.\n\nAlso, antifa are straight up facists. Why?\n\nBecause you're an idiot who thinks fascism is defined as just violence?\n\n Because they are acting like facists\n\nWhat *great* argument. \n\nSince you seem to be like the thousands of clueless people who misuse the word \"fascist\", and then have the goddamn **gall** to try to say the_left \"calls everything it disagrees with fascist\", I'm going to define fascism **for** you. And I know this wont leave an impact. You are determined to remain set in your ways and ignore any information that goes against your bias. I dunno if you *actually* support neonazism, just support Trump or if you're going with the modern political trend of \"not so much for *this* as I am *against* that.\" Which, again, if you're just against Anti-fascism, you should really reexamine yourself. \n\nIve actually read about fascism and am able to define it, not just google \"fascism\" and take the 3rd entry on the first link you clicked cause its the only one to fit your narrative. \n\n\nIve had to make this post several times against idiots and liberals, so Im gonna x-post it instead of typing it all out.\n\nHere[.] what fascism is:\n\nFascism has a very clear definition,  which we know because fascists love writing about it.  \n\nFascism,  at its barebones, is **far right-wing radical authoritarian nationalism.** Often with a **heavy emphasis on state power.**\n\nTo go into a bit more depth, fascism has three major concepts:\n\n* The negations of anti-liberalism, anti-communism and anti-conservatism;\n\n* Nationalist authoritarian goals of creating a regulated economic structure to transform social relations within a modern, self-determined culture;\n\n* A political aesthetic of romantic symbolism, mass mobilization, a positive view of violence, and promotion of masculinity, youth and charismatic leadership.\n\n**Racism** is extremely common,  but *not* required. \n\nRobert Paxton says that fascism is \"a form of political behavior **marked by obsessive preoccupation with community decline, humiliation, or victimhood and by compensatory cults of unity, energy, and purity, in which a mass-based party of committed nationalist militants, working in uneasy but effective collaboration with traditional elites, abandons democratic liberties and pursues with redemptive violence and without ethical or legal restraints goals of internal cleansing and external expansion**.\"  (coughcoughcough)\n\nSo when we talk about \"the alt right\",  who often describe themselves as \"White Nationalists\",  we call them what they are: white supremacists,  fascsists and nazis.   \n\nNot everyone anti-fascists disagree with is a fascist, And simply because we disagree with you,  does not make you a target of Anti-fascists.  ALSO: KEEP IN MIND, WHEN I SAY \"TRUMP SUPPORTERS\", I'M REFERRING TO THE NEO-NAZIS, WHITE SUPREMACISTS AND FASCISTS THAT I HAVE *BEEN* TALKING ABOUT WHO ARE USING TRUMP AS A BANNER TO PEDDLE THEIR HATEFUL BULLSHIT, NOT YOUR AVERAGE CONSERVATIVE OR RIGHT LEANING LIBERAL WHO JUST VOTED FOR TRUMP. \n\nYou may not like baseball, hate guacamole and think jazz is America[.] greatest mistake,  but no ones gonna attack you for it. \n\nAntifa stops fascism,  white supremacy and nazism because they are dangerous and have historically shown they are violent and will alway use violence to harm marginalized people. Allowing their beliefs and practices to go unopposed threatens and oppresses marginalized people. Yes antifa uses violence,  but its defensive violence. \n\nDr. Lawrence Britt has examined the fascist regimes of Hitler (Germany), Mussolini (Italy), Franco (Spain), Suharto (Indonesia) and several Latin American regimes. \n\nBritt found 14 defining characteristics common to each: \n\n1. **Powerful and Continuing Nationalism** - Fascist regimes tend to make constant use of patriotic mottos, slogans, symbols, songs, and other paraphernalia. Flags are seen everywhere, as are flag symbols on clothing and in public displays. (Present in trump supporters, not anti-fascists)\n\n\n2. **Disdain for the Recognition of Human Rights** - Because of fear of enemies and the need for security, the people in fascist regimes are persuaded that human rights can be ignored in certain cases because of \"need.\" The people tend to look the other way or even approve of torture, summary executions, assassinations, long incarcerations of prisoners, etc. (Present in trump supporters and the trump administration, not in anti-fascists.) \n\n\n3. **Identification of Enemies/Scapegoats as a Unifying Cause** - The people are rallied into a unifying patriotic frenzy over the need to eliminate a perceived common threat or foe: racial , ethnic or religious minorities,  such as Muslims, Jews,  or homosexuals; liberals; communists; socialists, terrorists, etc. (guess what? Not anti-fascists either) \n\n4. **Supremacy of the Military** - Even when there are widespreaddomestic problems, the military is given a disproportionate amount of government funding, and the domestic agenda is neglected. Soldiers and military service are glamorized. (I've never heard an anti-fascists say \"Support our troops\")\n\n5. **Rampant Sexism** - The governments of fascist nations tend to be almost exclusively male-dominated. Under fascist regimes, traditional gender roles are made more rigid. Divorce, abortion and homosexuality are suppressed and the state is represented as the ultimate guardian of the family institution. (Gasp. Trump supporters.)\n\n\n6. **Controlled Mass Media** - Sometimes to media is directly controlled by the government, but in other cases, the media is indirectly controlled by government regulation, or sympathetic media spokespeople and executives. Censorship, especially in war time, is very common. (Trump supporters obviously don't control the media, but the media certainly is biased against antifa)\n\n7. **Obsession with National Security** - Fear is used as a motivational tool by the government over the masses. (You fucking idiots instituted and support a multi-billion dollar wall and a muslim ban, which \\*gasp\\*, anti-fascists opposed!) \n\n8. **Religion and Government are Intertwined** - Governments in fascist nations tend to use the most common religion in the nation as a tool to manipulate public opinion. Religious rhetoric and terminology is common from government leaders, even when the major tenets of the religion are diametrically opposed to the government[.] policies or actions. (Again, trump supporters)\n\n9. **Corporate Power is Protected** - The industrial and business aristocracy of a fascist nation often are the ones who put the government leaders into power, creating a mutually beneficial business/government relationship and power elite. (The fucking president is a business man)\n\n10. **Labor Power is Suppressed** - Because the organizing power of labor is the only real threat to a fascist government, labor unions are either eliminated entirely, or are severely suppressed. (Anti-fascists are working class people.\n\n11. **Disdain for Intellectuals and the Arts** - Fascist nations tend to promote and tolerate open hostility to higher education, and academia. It is not uncommon for professors and other academics to be censored or even arrested. Free expression in the arts and letters is openly attacked. (shocking)\n\n12. **Obsession with Crime and Punishment** - Under fascist regimes, the police are given almost limitless power to enforce laws. The people are often willing to overlook police abuses and even forego civil liberties in the name of patriotism. There is often a national police force with virtually unlimited power in fascist nations. (just look at your fucking comments to me!)\n\n13. **Rampant Cronyism and Corruption** - Fascist regimes almost always are governed by groups of friends and associates who appoint each other to government positions and use governmental power and authority to protect their friends from accountability. It is not uncommon in fascist regimes for national resources and even treasures to be appropriated or even outright stolen by government leaders. (lol)\n\n14. **Fraudulent Elections** - Sometimes elections in fascist nations are a complete sham. Other times elections are manipulated by smear campaigns against or even assassination of opposition candidates, use of legislation to control voting numbers or political district boundaries, and manipulation of the media. Fascist nations also typically use their judiciaries to manipulate or control elections. (i mean... reallly?)\n          \n\nIf they don't fit most of these criteria,  theyre probably not a fascist,  and thus wont be called and one and are not likely to be a target. The Trump supporters who were at Berkley *fit this shit to a tee*, and I've included multiple links of evidence that they're literally fucking neo-nazis and fascists. \n\nYou thinking the people who oppose to them are \"acting like fascists\" because they use violence and don't want, again, this shouldn't be emphasized so much, **actual fucking neo-nazis** a platform to spread their hatred just shows your incredible lack of fucking knowledge, your willful ignorance and your disgusting support for fucking neo-nazis. \n\nFFS, if you oppose the violence, fine, oppose violence, but you are fucking cheering on fascist and nazi using violence while calling the people trying to stop them \"the reeeeeeaaal fascists\". You're a fucking hypocritical idiot and a nazi sympathizer.  "}