{"doc_id": "369", "name": "2017_10_humanities_student_major_1316_iama", "namespace": "we1sv2.0", "metapath": "", "pub": "IAmA", "title": "2017-10-humanities-student-major_1316_IAmA.txt", "pub_date": "2017-10-14T00:00:00Z", "Sentiment": "-0.018", "Subjectivity": "0.414", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "228", "Permalink": "http://reddit.com/r/IAmA/comments/76bzv1/im_a_professor_who_has_published_books_on_star/doczl5z/", "Threadlink": "http://reddit.com/r/IAmA/comments/76bzv1/im_a_professor_who_has_published_books_on_star", "Parent_id": "t1_docyjmm", "Reddit_id": "doczl5z", "Subreddit_id": "t5_2qzb6", "Commenter": "bulgokovfrog", "length": "1414", "content_scrubbed": "Thank you for your feedback! This is really helpful, and corroborates/expands upon things I've already heard (publishing only one chapter from your dissertation, especially).\n\nI do have a few follow-ups: First, to the question of working at a journal, where would you suggest starting? In the event that you only have acquaintances in editorial places, what would be the \"etiquette\" for suggesting yourself as a peer reviewer or slush reader, for instance? \n\nSecond, when it comes to actually applying: how common is it to, say, begin with an English PhD and end up teaching in a Philosophy department teaching critical theory/continental philosophy? Or, your position for instance; I see many postings for general Humanities or Cultural Studies jobs -- Did you get a PhD in Cultural Studies, or in something like Literature which you then \"spun\" for the position?\n\nCorellary to the above now that I think of it: I see many postings asking for specializations in post-colonial literature, gender studies, Victorian materialism, etc... Specializations which are, needless to say, pretty far away from my own areas. Now, I could probably *teach* any of those courses, but I'm hardly a researcher in those areas. Would you still recommend competing for those sorts of positions, even if they're \"outside my wheelhouse,\" so to speak? \n\nSorry for the long reply -- but thank you again for your willingness to engage!  \n"}