{"doc_id": "935", "name": "2017_04_humanities_student_major_190_berkeley", "namespace": "we1sv2.0", "metapath": "", "pub": "berkeley", "title": "2017-04-humanities-student-major_190_berkeley.txt", "pub_date": "2017-04-02T00:00:00Z", "Sentiment": "-0.026", "Subjectivity": "0.256", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1499", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfqvj1z", "Reddit_id": "dfqvmmn", "Subreddit_id": "t5_2qh9w", "Commenter": "Grace-Grace-Grace", "length": "9212", "content_scrubbed": "College Of California \nfirst 75 years berkeley\n\n\nP 40\nState owned college\n1862 passage of Morill act by Congress offering liberal land grants to States (states actually Christians) for use in building publicly owned universities (for Christian gospel preaching schools as Act 19:9  But when divers were hardened, and believed not, but spake evil of that way before the multitude, he departed from them, and separated the disciples, disputing daily in the school of one Tyrannus.\n...\n30,000 acres of federal land for each each member in congress\nIn 1866 Legislature passed a bill providing for establishment of an agricultural, Mining, and Mechanical Arts College. The Bryne ranch north of College of California site was selected as the location for the new school influenced by Proffesor Durant p 41\nWith this action as evidence of the States' serious intentions, trustees voted October 9, 1867 to donate their Berkeley site to the state for a university, and therefore to disincorporate when the State institution was established. This decision was maid on condition that the State should include the former college of californiIa in its university as a college of letters , a department of instruction which had not been contemplated in the previous legislative act. \n\n(CAL is Built on pride Great of flesh)\n\n(College School)\n\n(Beware much of this is politically corrected re written history is Babble confusion where every evil work is)\n\n... At the time of its founding in 1868 from Berkeley city history (also politically corrected history), berkeley library book , there were two primary models for American higher education: the classical liberal_arts college (NO SUCH THING NAME THEN) inherited from colonial times and the new land grant university (see above) which included practical education in \"agriculture and mechanics.\" Cal (Cal NO SUCH NAME AT THE TIME BUT RE WRITTEN TO MAKE YOU THINK SO Jeremiah 9:8  Their tongue is as an arrow (maul, sword, deep pit, goes down into your inner most being), shot out; it speaketh deceit: one speaketh peaceably to his neighbour with his mouth, but in heart he layeth his wait. War god), of course, embodied both of these traditions (Babylon is Confusion defined in Revelations 18 make slaves steal souls Un Verse Ites). It started out as the private College of California and became the state[.] (Notice: owned by the republic state[.] by liberal land grants fostered by Congress Miri Act, and that is by Christians \"We The People\" NOT CAL A DECEPTIVE FRAUDULENT FOREIGN CORPORATION 666 WORSHIP OF THE BEAST, BEARS DRUNKEN SEX RAGE GLADIATOR TEMPLES SOWING TO FLESH REAPING CORRUPTION CRUEL CRIPPLING) land grant university.\n\nPage 17\nFirst americans to claim property under provisions of the Possesory Right Law (Federal Law STATE RELIGION ROMAN WAR GOD CATHOLIC PERVERTED to defraud the poor make it legal for the Pedophile Baal prophet priests sex gods to steal the lands from poor Mexican and Ohlone American Indians Native Americans, by making unjust codes, rules, laws Maritime tribunal war time emergencies acts etc as today) four disappointed gold seekers (love of money root of all evil depraved perverts), \n... who filed 160 acre claims with county recorder martinez alameda county (THE CORPORATION 666 ALAMEDA-CONTRA COSTA COUNTY TRANSIT DISTRICT, WASHINGTON DC DISTRICT OF COLOMBIA COLUMBUS ACT OF THE CROWN ROMAN WAR GOD THE CROWN, VATICAN, BANKING CENTER OF LORDS OF LONDON AC TRANSIT TRANSVESTITE SPIRIT MAR GOD OF WAR PASSES = MAR 17 WAR GOD MANY MARCH WARS STARTED THIS MONTH 2017 MORE CIVILIAN MURDERS ON EARTH IN ALL WARS, AC TRANSIT CLIPPER CARD GOD CLIPPER HISTORY WITCH HEROINE DRUG RUNNING SLAVE TRADE SHIPS Clipper\nCut\n1 Kings 18:28\n28  And they cried aloud, and cut themselves after their manner with knives and lancets, till the blood gushed out upon them.\n\nMark 5:5\n5  And always, night and day, he was in the mountains, and in the tombs, crying, and cutting himself with stones.\n\n\nClipped   ABATE\ngara'\ngaw-rah'\nA primitive root; to scrape off; by implication to shave, remove, lessen or withhold: - abate, clip, (di-) minish, do (take) away, keep back, restrain, make small, withdraw.\nAC TRANSIT DISTRICT FRAUD TEN COMMANDMENTS GOD CUTS OUR MEASURE B, and M increased sales taxes from us and continues robbing the poor)\n\n... not yet formed in June July of 1852 requirment 200 in improvements within 90 days not kept for years after and squatters before the law\nShattuck Blake Hillegass legalized their claims 1856 by deeds obtained from members of the San Francisco combine (I believe this COMPANY Were Evil politician behind closed doors deals with thieves of Roman Catholic Vatican Pope Rockefeller Money Changers And Evil Congress man, they  led this deceptive shadow group or front group to purchase the Priests man Peralta stollen lands to cover up the poor Mexicans american indians Ohlone land thefts) which had baught most of the Domingo Peralta[.] property in 1853. Each paid 5,000 for his deed all were farmers save Leonard all left the land and settled in oakland\nBlake lawyer\n\n(Note : The Catholic pedophile gay priests stole the land made slaves of the original poor people in Mexico California cali was Mexico, The pedofile Baal prophets needed security gave East Bay Area to Peralta a man of War who worshipped War, Prison industry, pedophiles, men with men perverse sex, Hippy sexual revolution Berkeley) Addy Peralta history line: \n1852  Claims filed with U_S Land Commission by all the Peralta brothers\n5/4/1852 Town of Oakland incorporated\n3/25/1852 Alameda County incorporated, Rancho San Antonio becomes part of Alameda County\n1852-1853 Vicente Peralta sells all but 700 acres for $110,000\n1853  Domingo Peralta sells all but 300 acres for $82,000\n1853-1854 Fire and police services established in Oakland;first newspaper published in Oakland, Alameda County  Express est. March, 1854 and Contra Costa and Oakland Herald est. Sept. 1854\n1854  City of Oakland incorporated\n1854  Oakland passes ordinance prohibiting bull fights\n2/8/1854  Land Commission confirms a portion of Rancho San Antonio to Domingo and Vicente Peralta.  Commission confirms all of the claims of Antonio and Ignacio Peralta\n\n\nP 18 all were Oakland city council members or mayor\nPage 25 1859 the board entered into negotiations with other land owners including William Hillegass 17 acres after long barganing (Hillegass credited to say donated this land as the tract would revert to him or heirs if college were not established but official county records on September 4, 1860 he was paid 2,000 for 17. 31 acres better than the average price of about 100 per acre.) \nPage 26 nine members attended meeting of the board of trustees five reverends april 16, 1860 at founders rock\nCollege Of California page 38\nApril 13, 1855 charter signed by Governor John Bigler\n\nPage 27 designating grounds as futuer college site AND PRAYER WAS SAID, Asking God that it remain a seat of Christian learning; a blessing to the youth of this State, and a center of usefulness in all this part of the world\"\n1864 trustees formed The College Homestead Association to bolster finances through sale of adjoining property of the campus site\n40 acres section south of campus were purchased from Frances K Shattuck, George M Blake, James Leonard for 8,000 each, from William Hillegass for 9,000. The new land surveyed and platted lots about one acre marketed at 500 each paid for in 20 instalments\n\nP29\nDr. Willey moved away 1869 gave to State college management.\n\nP31 slow settling berkeley the new town reletively high priced land poor transportation depressed financial conditions. Warring Wilkinson, first pres deaf dumb blind assylum listed these as only homes near the homestead tract 1868-9 when the assylum was being built: (Spirit of cruel torture founded) the Willey place the old ranch house of James Leonard the homes of Julian Haste and Judge Ferris, all along dwight way; cabin \"occupied by Heimboldt\"; Orrin Simmon[.] place just east of the Homestead Tract; the Shattuck farmhouse; and the homes of the Godard and Byrne families to the North. The last four whose homes were listed were old timers whose arrivals antedated opening of the Homestead Tract.\nThe chief drawback to settlement was uncertainty over the future of the college itself. Loss of six of the original trustees through death ir departure from the State had sapped it[.] strength no donations from rich mony changer worshipers. \n\n1867 trustees approached State to give college unto. Accepted on 1868 merger completed in 1869\nSale of lots increased immediately. 1870 State prepared to lay first blocks fist building new campus reported \"already ex-Gov Stanford, Mr, Mayor Felton, Mr. ex-Mayor Dwinelle, and other well known gentlemen, have purchased and now improving or about to improve village sites in the neighborhood.  \n\nPage 39 the trustees took over and the institution became known or stollen and renamed known as the College School. Principal effect on its operation adding courses prepare courses for work of college grade.\nThe trustees did not want to be charged with \"anticipating the wants of the state\" \n1856 search for permanent site and two years later Berkeley site permanent."}