{"doc_id": "376", "name": "2017_10_humanities_student_major_1381_askphilosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "askphilosophy", "title": "2017-10-humanities-student-major_1381_askphilosophy.txt", "pub_date": "2017-10-15T00:00:00Z", "Sentiment": "0.079", "Subjectivity": "0.32", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "286", "Permalink": "http://reddit.com/r/askphilosophy/comments/76i7e6/how_has_your_interest_in_philosophy_changed_your/doe6po6/", "Threadlink": "http://reddit.com/r/askphilosophy/comments/76i7e6/how_has_your_interest_in_philosophy_changed_your", "Parent_id": "t3_76i7e6", "Reddit_id": "doe6po6", "Subreddit_id": "t5_2sc5r", "Commenter": "thedeliriousdonut", "length": "2038", "content_scrubbed": "I'm going to answer this small and big, it[.] certainly eating up more and more of my time. I used to study a lot of things in various disciplines. Psychometrics, physics, phil-physics, phil-science, metaethics, cinematography, screenwriting, acting, voice acting...\n\nBut unfortunately, my growing interest in philosophy and my limited time means I'm making sacrifices. Now I'm an actor who studies metaethics, phil-science, physics, as many film classes as I can fit, and that[.] it. My acting career is getting by on talent alone, I'm not taking classes on that anymore, and that[.] absolutely terrifying, like being trapped in a fish bowl and not being the biggest fish anymore when the others grow (Fun fact: Goldfish don't actually grow relative to the size of their fish bowl despite the idiom, they simply are treated poorly in captivity and die before growing large. Please do not hold animals in captivity like that.).\n\nBut of course, I wouldn't let any area in philosophy take up more and more of my time and incur these costs if I wasn't passionate about it for one reason or another.\n\nThe big answer involves me pointing at two trends that might be helpful here.\n\nFirst, a formal interest in philosophy tends to [pay](https://www. forbes. com/sites/jeffreydorfman/2014/11/20/surprise-humanities-degrees-provide-great-return-on-investment/#5e61b4b42031) back [fairly well](https://fivethirtyeight. com/features/philosophers-dont-get-much-respect-but-their-earnings-dont-suck/), and second, it tends to lead to the majority of people who pursue the degree saying that they [find meaning in their choice of degree](https://web. archive. org/web/20150905080925/http://www. payscale. com/college-salary-report/majors-that-pay-you-back/graduate-degrees) (I had to go to Hell and back to get this source, does anyone know why Payscale has suddenly made it impossible to get access to their data on graduate degrees!?).\n\nHopefully, that answers your question both from my view and from the view of many others who are interested in philosophy. "}