{"doc_id": "1027", "name": "2017_04_humanities_student_major_987_conspiracy", "namespace": "we1sv2.0", "metapath": "", "pub": "conspiracy", "title": "2017-04-humanities-student-major_987_conspiracy.txt", "pub_date": "2017-04-09T00:00:00Z", "Sentiment": "0.226", "Subjectivity": "0.444", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "513", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg1iw1c", "Reddit_id": "dg1lesj", "Subreddit_id": "t5_2qh4r", "Commenter": "Guywhodoesthings73", "length": "2999", "content_scrubbed": "That[.] fine, make the government pay for it, or make the healthcare insurance corps pay for it, for Christ sake we pay them enough, but don't cripple small business owners. We get skewered and raked across the coals already. Business owners will act in their own best interest and self preservation. \n\nConversely, you can vote with your moral compass and values, move to a state that offers a form of paid family leave like California. \n\nNext you would argue that we should pay full benefits and pay to someone that is involved in an accident at home and can't work for 3 months. Then they will argue that guys should get a paid 3 months off too.. then they will argue that we should give\nPaid time off for sex changes, pet adoptions, volunteer work, exercise, breast implants,  etc\n\nWhat people are forgetting is that everyone has choices, the choice to have children, when they have them, whether they should buy their 4th consecutive new iPhone, putting that trip overseas on a credit card... then after saving ZERO money and frivolously trying to keep up with the Jones', they expect a helping hand. \n\nYour choices should be no one else[.] responsibility but your own.. what happened to being responsible, saving money, NOT buying that car or apartment that is frivolous?\n\nWhen did it become okay to rely on everyone else and not answer for your own choices?\n\nIt[.] just like the \"college should be free people\".  No it shouldn't, it should be free for the people who earn it. My tax money and hard_work shouldn't be spent on someone getting an East_Asian studies degree, or liberal_arts, or political science, or any other degree where you come out of school making as much money as you would have had you never gone. \n\nTake your issues up with the government and find out how they are spending our money before you ask for more of mine.  They certainly have enough to create a utopia, but instead spend it just like the people who want more handouts from work. \n\nIt[.] a cycle of handouts and unaccountability... \n\nGovernments waste money, spend frivolously, don't help the average citizen, and ask for more from business owners. \n\nEmployees waste money, spend frivolously, don't help themselves, and ask for more from the business owners. \n\nI've owned a small business for 10 years, I have taken over 30 people from college and mostly not college educated people, gave them the tools /knowledge and helped them earn over 100-200k per year.  Of those 30, maybe 4 where financially responsible. They were also the best employees. The vast majority made that money, bought leases on luxury cars, unnecessarily upgraded their electronics every chance they got, and took lavish vacations. Those are also the same ones who I hear supporting free college, free healthcare, and maternity leave. \n\nWe have an entire generation that believes everyone should do more for them, and that they should be able to do whatever they want because they are \"special\" and everything is ALWAYS everyone else[.] fault. "}