{"doc_id": "1268", "name": "2017_04_humanities_student_major_3214_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_3214_AskReddit.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.305", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "304", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgvpmj5", "Reddit_id": "dgvw4kr", "Subreddit_id": "t5_2qh1i", "Commenter": "that1prince", "length": "1860", "content_scrubbed": "It[.] an interesting thought for sure, and I initially felt that way, especially on the social side of things. It[.] easy to look at things so far in the past as all being similar because we don't have as much first-hand knowledge about them as more recent times.\n\nAt least in the U_S, Reconstruction took a while, and things like civil rights and womens' rights were still in their infancy. In some ways the passing of Black Codes, the predecessors of the Jim Crow laws made things get a little worse socially. But technologically speaking, I'd say 1880 to 1917 are just as different, if not more so than 1980 to 2017.\n\nIn 1880 both lightbulbs and telephones had *just* been invented and were not widespread. By 1917 they were ubiquitous.  The invention and large-scale manufacturing of the automobile greatly changed transportation around the world.  Speaking of transportation, the airplane went from the stuff of fantasy to being used in WWI in just about 15 years time after its invention.  Major biomedical breakthroughs (including terrible things like chemical warfare) also changed science and ethics as we know it.  Alternating Current became widespread as we built power plants and far-reaching electric lines which allowed for household appliances and large scale manufacturing including a second industrial revolution of sorts.  Refrigerators and Air Conditioning units were invented during this time greatly changing living conditions and nutrition capabilities for the average person. One could argue that this was the beginning of what we consider the \"middle class\".  This also changed the arts because people could now afford and have time to see things like movies, and hear recordings of music. There was a lot of rapid change during the turn of the century, just as much as things like the internet, cell phones, and computers in the 2000s.\n"}