{"doc_id": "386", "name": "2017_10_humanities_student_major_1510_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2017-10-humanities-student-major_1510_changemyview.txt", "pub_date": "2017-10-16T00:00:00Z", "Sentiment": "-0.008", "Subjectivity": "0.291", "Score": "23", "Upvotes": "0", "Downvotes": "0", "Wordcount": "470", "Permalink": "http://reddit.com/r/changemyview/comments/76uwlw/cmv_video_games_are_a_waste_of_time_and_talent/dogw3ga/", "Threadlink": "http://reddit.com/r/changemyview/comments/76uwlw/cmv_video_games_are_a_waste_of_time_and_talent", "Parent_id": "t3_76uwlw", "Reddit_id": "dogw3ga", "Subreddit_id": "t5_2w2s8", "Commenter": "IIIBlackhartIII", "length": "2884", "content_scrubbed": "Let[.] break down a few different ideas here. The first you're presenting is the idea that games are a time suck, a waste of resources and people[.] time. The same has literally been said throughout history in regards to every single new form of media. Books, radio, television, films, games... every new technology and new form of human entertainment has been met with indignation as just another waste of time and a dilution of the intelligence of society. [Socrates was against the idea of writing, of the opinion that it dulled memory and weakened thought.](http://www. units. miamioh. edu/technologyandhumanities/plato. htm) Video games just happen to be one of the newest forms of media, and are being met with just the same rebuttal, as the old media and traditionalists who do not understand them feel them worthless. And while its true that playing games doesn't provide a direct tangible benefit to society as such... neither does sport or literature really, but entertainment provides a medium through which we can have experience, and how it is used can provide much. There are paleontologists today who are so because they saw Jurassic Park, Archaeologists who are so because they saw Indiana Jones... or Tomb Raider. And the stories in games can teach us about ourselves, provide philosophical quandaries. One of my favourite narratives in games is that of Spec Ops The Lines. It[.] a game whose story and impact is very meta. It messes with your perception of agency as a player of the game, and forces you to make uncomfortable decisions that you aren't aware you're even making, and then forces you to live with the consequences. Its a brutal experience, really, hiding under the masquerade of a generic brown military shooter. \n\nFurther, its an industry, and just like any major entertainment industry (i. e. books, films, television) it creates economic impacts which really do make a massive difference on the world. \n\nAnd finally, lets think about those developers who seem to you to be wasting their time. Video game development involves a lot of RnD, which pours money into solutions that do make real world impacts. Graphics technology has pushed GPU tech, which is advancing parallel computing used in complex data crunching and neural network supercomputers. Research papers on rendering and the physics of light has advanced our understanding of optics. Network development helps improve the infrastructure and underlying code of our internet. When you push developers to be inspired by novel ideas, novel problems, in fields which interest them, you end up with research and results you wouldn't have had otherwise. People argue that NASA is obsolete and a waste of money because what possible use is space to us, but a plethora of technologies and medical advances have come from the unique problems posed by space travel, which do benefit us on earth every day. "}