{"doc_id": "517", "name": "2017_10_humanities_student_major_2856_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-10-humanities-student-major_2856_politics.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "-0.018", "Subjectivity": "0.455", "Score": "16", "Upvotes": "0", "Downvotes": "0", "Wordcount": "255", "Permalink": "http://reddit.com/r/politics/comments/79jyb8/professors_like_me_cant_stay_silent_about_this/dp2ksta/", "Threadlink": "http://reddit.com/r/politics/comments/79jyb8/professors_like_me_cant_stay_silent_about_this", "Parent_id": "t1_dp2jhmn", "Reddit_id": "dp2ksta", "Subreddit_id": "t5_2cneq", "Commenter": "Middle_Eats", "length": "1679", "content_scrubbed": "Dude, you have no idea how wrong you are. Universities are places where all ideas should be submitted to objective, critical and meaningful discussion. \n\nPreaching support of nazism, for example, is flat out wrong. Restricting a professor from discussing the dominant philosophical and ideological trends in late Weimar Germany through exposure to first hand sources including incendiary and racist sources in the period, however, is unacceptable. It stifles necessary discussions into the formation of opinion and dark corners of the human condition that an educated individual should endeavor to understand so that they may identify and refute such viewpoints when they encounter them in their own lives. \n\nThe same statement can be applied to anything- modern white Supremacist theory, a Virginia Gazette article released two weeks after the attack on fort Sumpter speaking in favor of the Confederacy, and anything else you can think of. \n\nThere is a critical distinction between objective academic discussion of highly offensive socially unacceptable ideals and espousing actual support for those ideals. One could argue that learning to identify that distinction, and thus learning to discuss highly controversial viewpoints without implying an acceptance of such viewpoints is a crucial skill that one must acquire to become a truly educated critical thinker. \n\nStudents refusing to engage in such discourse fail to accept the very premise of a liberal_arts education and attempt to force their own ignorance as acceptable by refusing to engage in such discussion- evidence, perhaps, that the discussions and lectures they resist are precisely the education they require. "}