{"doc_id": "1105", "name": "2017_04_humanities_student_major_1777_gentlemanboners", "namespace": "we1sv2.0", "metapath": "", "pub": "gentlemanboners", "title": "2017-04-humanities-student-major_1777_gentlemanboners.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.39", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "306", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgbgwdg", "Reddit_id": "dgbhxfc", "Subreddit_id": "t5_2sesx", "Commenter": "Alssndr", "length": "1706", "content_scrubbed": "I said I fully support anyone studying whatever they happen to enjoy, but pretending that every major has an equivalent course-load is a joke. I've also never met and arts or business student who does think they do more work that Hard science/Eng. I'm not putting down their desired career path, it[.] just a fact of how universities happen to be run in these subjects. \n\nI am simply saying that if you take a biochem major and complete the required 120 involved credits, you will be doing a lot more work than a business management major completing his 120 credits. Whether your goal is getting a C, B, or A average, the required work to achieve that is much higher in Science/Eng than it is in business/arts. But you seem to agree with me with these quotes:\n\nthe average business student does far less than the average science student. \n\n.\n\nbut only because I choose to make it so\n\nAnd yes, obviously everyone can do more work if they want to with extracurriculars and volunteering and labwork, but i'm just talking about doing the required coursework for a given major. And obviously if you need to be doing 80hrs a week of required work vs 20hrs, then you will have less time to do ECs and \"make the most of university\". This is coming from someone who worked during uni, while doing labwork almost every semester and taking every relevant volunteer opportunity I could so my CV looked better for med school. \n\n\nWe can be super hugbox-y if you want, but some majors are just easier. I had to do 28 credits of social/humanities courses because some med schools wanted that and holy shit is it mind numbingly easy. I put 0 work into those courses and flew through them. The stereotype exists for a reason."}