{"doc_id": "1210", "name": "2017_04_humanities_student_major_2693_jordanpeterson", "namespace": "we1sv2.0", "metapath": "", "pub": "JordanPeterson", "title": "2017-04-humanities-student-major_2693_JordanPeterson.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.138", "Subjectivity": "0.253", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1248", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgo114h", "Reddit_id": "dgo60ac", "Subreddit_id": "t5_32jqy", "Commenter": "Boazy", "length": "7897", "content_scrubbed": " I struggle to think of any artists/musicians who would be considered \"conservative\". There[.] some, but the majority are liberal. Especially the ones who innovate and push the envelope. A world without artists sounds like hell.\n\nreminder that there have been many, many eras of explosive innovation in the arts which provoked no outcry from the conservatives, but rather on the contrary cries of exaltation. The discoveries of perspective and polyphony come to mind. In the High Gothic, people would flock to the cathedrals to hear the Ars Antiqua, and would weep with astonished joy at the beauties the choir masters had mined from plainchant. Organum is not a rejection of plainchant. It is plainchant raised to a higher power, hair-raising, almost unbearably beautiful and majestic.\n\nPerspective and polyphony were florescences of the traditions that gave them birth, intensifications of what had come before rather than rejections. The same could be said for the Baroque, the Classical, and the Romantic in music.\n\nalso worth mentioning right-wingers are unexpectedly strong in poetry. The list of the top ten right-wing poets is very close to the list of the top ten 20th century English-language poets period.\n\nfor your consideration, here[.] part of a list presenting a shitload of notable novelists, poets, and a few other literary types of a rightist persuasion. \n\n* Kingsley Amis - despite early socialism, he moved rightwards through his life to become a curmudgeonly conservative\n* Martin Amis - in recent years has followed his father[.] path, with his views on Islam condemned by many left-wingers; also anti-communist, writing books about Stalin\n* Honore de Balzac - royalist and chronicler of a society in decline\n* Hilaire Belloc - the poet and writer, known for his verse for children, was an admirer of fascism and especially Mussolini; he was a devout Catholic and has been accused of anti-semitism\n* Saul Bellow - a youthful leftist he moved to the_right, was culturally conservative, opposing political correctness and multiculturalism\n* John Betjeman - a small-c conservative: an admirer of the English upper classes, a campaigner to preserve disappearing aspects of England, scornful of mass culture, and a Catholic\n* Jorge Luis Borges - the Argentinian postmodernist was an admirer of Latin American dictators, including Pinochet\n* William F. Buckley, Jr - writer, tv presenter, and occasional novelist, a leading intellectual of US Republicanism from the 1960s to the 2000s\n* Roy Campbell - South African poet and Catholic, he moved to Spain in the 1930s and supported Franco (unlike most writers who went to Spain); turned against the Bloomsbury group after his wife had an affair with Vita Sackville-West\n* Orson Scott Card - best known for science fiction novels such as Ender[.] Game, he is also a pro-Republican commentator and a Mormon\n* Thomas Carlyle - Scottish historian, satirist, and essayist who distrusted democracy and modernity, and believed nations needed great men to lead them, writing an admiring biography of Frederick the Great\n* Willa Cather - a novelist who was conservative both in aesthetics and politics\n* Louis-Ferdinand Celine - the modernist novelist was an anti-semite and supporter of Vichy France\n* Francois-Rene de Chateaubriand - French royalist and a devout Catholic\n* GK Chesterton - humorist and Christian apologist, converted to Catholicism; George Orwell accused him of writing \"endless tirades against Jews\"\n* Agatha Christie - reactionary conservative who portrayed a bygone England, her early books included various racial caricatures\n* Winston Churchill - winner of Nobel prize for literature for his non-fiction, and Conservative prime minister\n* EM Cioran - Romanian philosopher and essayist, a pupil and follower of far-right philosopher Nae Ionescu\n* Feodor Dostoyevsky - a reformer in his youth, he later moved to the_right, seeking to defend the traditional Russian spirit\n* Mircea Eliade - Romanian fiction writer and philosopher of religion, a fascist in the 1930s\n* TS Eliot - former banker, socially and politically conservative, also accused of anti-semitism, said: \"I am an Anglo-Catholic in religion, a classicist in literature and a royalist in politics\"\n* Fillia - Italian futurist writer and painter known for his religious art, had links with fascists\n* Michel Houellebecq - anti-political correctness, anti-Islam, anti-women, for his admirers he offers a critique of modern liberal humanism\n* JK Huysmans - in his early life, a writer of Zola-influenced liberalism, he dallied briefly with fin de siecle decadence but converted to Catholicism and became a conservative\n* Ernst Junger - German writer who glorified the military following World War I and opposed democracy\n* Jack Kerouac - the beat novelist moved right in the 1960s, supporting the Vietnam war, becoming friends with William F Buckley, and returning to the Catholic faith he was raised in\n* Philip Larkin - his posthumously-published letters revealed a racist, misogynistic, right-wing private man, while his poetry showed a kindlier backward-looking conservatism\n* DH Lawrence - novelist and poet had liberal views early in his life but later moved towards fascism\n* CS Lewis - Christian apologist and a moderate conservative, though he avoided political association and refused a CBE from Churchill\n* Wyndham Lewis - influenced by the Futurists, he was briefly a supporter of Hitler, and often anti-semitic\n* Liu Xiaobo - the Chinese writer, poet, and Nobel Peace Prize-winner was an admirer of George W Bush and a defender of American imperialism who criticised John Kerry for being insufficiently right-wing; also anti-Islam\n* FT Marinetti - Italian proto-fascist poet, active as both an artistic and political leader; he split with Mussolini because he felt the Fascist party was too backward-looking\n* Yukio Mishima - right-wing anti-democratic Japanese novelist and playwright who attempted a military coup\n* Flannery O'Connor - Catholic moralist who mocked the godlessness of modern life in grotesque fiction\n* Luigi Pirandello - experimental playwright allied himself with Mussolini, although his supporters claim it was purely from self-interest\n* Ezra Pound - sophisticated and erudite aesthete, accused of being sympathetic to Mussolini in World War Two and imprisoned\n* Marcel Proust - upper-class aesthete, although homosexual, came from a conservative background; he avoided politics and his political position is contested\n* Moshe Shamir - Israeli novelist, playwright, and politician, moved from early socialism to right-wing Likud and Tehiya parties\n* Alexander Solzhenitsyn - the Soviet dissident had an understandable hatred of communism; on his arrival in the USA he allied himself with the neo-conservatives who believed the Soviet Union was the gravest threat to the USA[.] existence, and called for its destruction\n* Allen Tate - American agrarian poet, who later became a Roman Catholic and a legendary womaniser\n* Alfred Lord Tennyson - the poet laureate was a traditional English gentleman who celebrated military virtue and the chivalrous middle ages, but was more liberal on some causes - he refused a baronetcy from Disraeli and was agnostic\n* JRR Tolkien - deeply conservative and strongly Catholic throughout his life, he supported Franco in the Spanish civil war, although he hated Hitler for perverting northern-European myths and traditions\n* Evelyn Waugh - satirist of the British upper classes and author of Brideshead Revisited, a right-wing Catholic\n* William Wordsworth - a radical in his youth, he became more conservative as he got older, repudiating his initial support for the French Revolution and eventually becoming a member of the establishment\n* WB Yeats - Irish nationalist and mystic, a Nobel laureate for his poetry, who became increasingly conservative and eccentric and even flirted with fascism"}