{"doc_id": "453", "name": "2017_10_humanities_student_major_2200_roughromanmemes", "namespace": "we1sv2.0", "metapath": "", "pub": "RoughRomanMemes", "title": "2017-10-humanities-student-major_2200_RoughRomanMemes.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "0.163", "Subjectivity": "0.492", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "311", "Permalink": "http://reddit.com/r/RoughRomanMemes/comments/7810o1/good_man/dos17bc/", "Threadlink": "http://reddit.com/r/RoughRomanMemes/comments/7810o1/good_man", "Parent_id": "t1_dorrjgx", "Reddit_id": "dos17bc", "Subreddit_id": "t5_3fu0l", "Commenter": "Majorianos", "length": "1925", "content_scrubbed": "You're thinking of the wrong John there, though John II did take inspiration from Nikephoros[.] triumph in planning his own. \n\nTo quote a comment I made a little while ago, because I'm lazy, on an /r/history post asking which ruler was most rightfully loved by both peasants and nobility, John Komnenos, \n\n\"was the quintessential successful ruler, reconquering huge swathes of lands from the Turks, destroying the Pechenegs, which had been troubling the Romans' western front for some 70 years, once and for all in the battle of Beroia, securing his country[.] diplomatic position, namely through maintaining an alliance with the papacy and HRE, defeating the Hungarians and subduing the Serbs, establishing new border themes to serve as bulwarks against nomadic raids, reinforcing the Vassal and client-state status of the Crusader polities, especially Antioch, founding many charitable institutions such as hospitals and poor-houses, maintaining good Justice and the funding of the imperial legal academies, reversing the nepotistic policies of his father in favour of appointing new men to government, leaving the empire an overflowing treasury, and, on his death bed, choosing his younger but more competent son as his heir.\n\nJohn excelled in internal politics, diplomacy, grand strategy, military science, and the appointment of magistrates. He was benevolent, charitable, and a patron of the humanities, but frugal enough to leave his heir a full treasury. He was loved by everyone but his own extended family, having kept them out of government for the common good, an end towards which he worked tirelessly his entire reign, the Marcus Aurelius of his era. John wasn't a hugely ambitious man, perhaps why he isn't known as \"John the great\", but few men could be said to have steered the ship of state better.\"\n\nOf course the man did have a few faults, such as how he handled the Venetians, but they are just that, few. "}