{"doc_id": "1061", "name": "2017_04_humanities_student_major_1306_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2017-04-humanities-student-major_1306_news.txt", "pub_date": "2017-04-11T00:00:00Z", "Sentiment": "0.147", "Subjectivity": "0.466", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "388", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg5godl", "Reddit_id": "dg5gyl8", "Subreddit_id": "t5_2qh3l", "Commenter": "DylanHousman", "length": "2014", "content_scrubbed": "Not the OP and I don't really like his tone but I tend to agree.\n\nI also fit the stereotype you're hoping to demonize I think. I am a white male current college student who comes from a wealthy family who is paying for my education. So let[.] just get that out of the way and if that disqualifies me from the discussion in some people[.] eyes than so be it. I didn't have a choice of whether or not to attend college, my parents made it clear it was required.\n\nHowever, I personally feel a lot of people make the wrong choice by going to college. I think only certain majors are likely to pay off in today[.] economic climate --  STEM, business degrees, maybe a few others. At my school at least, which is a good state school but not elite tier by any means, pretty much any student in STEM or the business school gets a job in their field immediately out of college if they put in just a small amount of effort. The resources at the school are very helpful and make it pretty easy.\n\nHowever, if you're not going into one of these fields and are less likely to be able to get a solid entry level job right after school (things like the social_sciences, the arts, etc) then no I don't think it[.] wise to go to college unless you're already well-off financially.\n\nHad I not been blessed enough to be in the situation I am with my family I likely would have gone to community college for a year or two then pursued my business degree by finishing at a 4 year school. I think community college and trade schools are often better investments than accruing a bunch of debt at a 4 year school.\n\nAt the end of the day in the current year college is nothing more than an investment to increase your future earning potential. There are a lot of factors that play into how good this investment is -- what are you studying, how are you paying for it, etc. I think this is a bad investment for a lot of people but it[.] been made out to be a necessity that it isn't. That[.] just my opinion though and I'm welcome to healthy debate."}