{"doc_id": "344", "name": "2017_10_humanities_student_major_1076_duluth", "namespace": "we1sv2.0", "metapath": "", "pub": "duluth", "title": "2017-10-humanities-student-major_1076_duluth.txt", "pub_date": "2017-10-11T00:00:00Z", "Sentiment": "0.132", "Subjectivity": "0.416", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "807", "Permalink": "http://reddit.com/r/duluth/comments/75ebi0/virginia_mn_heard_of_it/do8lquv/", "Threadlink": "http://reddit.com/r/duluth/comments/75ebi0/virginia_mn_heard_of_it", "Parent_id": "t1_do68atq", "Reddit_id": "do8lquv", "Subreddit_id": "t5_2s2ua", "Commenter": "lopsic", "length": "4354", "content_scrubbed": "I live in Virginia, have for most of my 30+ years, spent around 10 other places, different states, in Duluth or Mpls for around 7 of that 10.  We have a lot of traffic passing through heading for any of the various lake based destinations north of town, BWCA, Vermillion, or other parts of the superior national forest.  \n\nPeople from outside the area act like it[.] the middle of nowhere, and well it[.] partially true, the area is not isolated in anyway, it[.] faster to get to Duluth, than a some commutes across the Twin Cities.  A fair number of people here commute to Duluth for work, and a fair number of people working in the area commute from Duluth.  Our internet works good, and is reasonably quick, 100Mbs at home for a price comparable to what you pay in Duluth for the same.\n\nIt[.] not much of a destination, however there is plenty to do on the range if you know about it.  There is more going on than I think many outsiders know about.  Heck even more than locals know about sometimes.  There is some crossover between towns, lots of people will live and work crisscrossed, live in Hibbing work in Virginia, or the opposite.\n\nOne thing that has been very slow for people to understand is that \"Virginia-Eveleth-Gilbert-Mountain Iron\" is really just one city with some minor redundancies.  Some people get it, others are stuck in the old ways.\n\nAs others have said, the city lives and dies by the mines, people generally understand it[.] a boom or bust type economy, good years are really good, bad years are really bad.  Miners make very good money, with only a high school diploma many will have better incomes than many liberal_arts degrees can get you.  Which is why it can be hard to get one of the jobs at a mine.\n\nOne very big problem, we have a serious brain drain issue, the majority of our best and brightest move away, some to Duluth, a lot to Mpls, others further than that.  Those that leave, generally do very well, we have some NHL players, a top billing actor in Hollywood, people at google, wikimedia, pandora, others in middle to high levels at major corporations.  But these people are never coming back.  They finish high school and get out.  If we had 1/4 of them back, the general education and brainpower of the city would skyrocket.  But there isn't anything here for them, so they go, and you can't blame them.  I'm part of small minority who returned post collage, with my education and skills I could easily find work in Mpls, or most big cities.  I lived in Mpls for 5 years, I had enough of the big city, there is more to do sure, other than stiff that meets regularly, any of the big things it[.] easy to drive down for.\n\nSome people will say crime or drugs are high, and it[.] a screwy statistic, it looks worse than it is.  One of my neighbors is a police officer, the other a sherif.  The actual real crime problem we have is mostly opportunistic thefts when people leave a garage door open.  The drugs is overstated, as they tell me a significant number of the drug related arrests are people from Duluth bring stuff here for other people from Duluth, to avoid the bigger cities bigger police force.  So some of the drug statistics look worse than they actually are if you consider locals only.  Sure there are drugs but it[.] the same problem across all of rural mn no worse or better, but I couldn't find weed to save my life here, I can go get as much as I want in Mpls hardly even trying.\n\nMost of the city hasn't changed since I was a kid, the bad parts of town are still the bad parts of town, the good parts still the good parts.  I was let to run wild through town as I kid, my kids will do the same.  We have a couple of excellent parks, and some lakes in town.\n\nLastly, I'm unhappy with my city officials for two recent things, they closed down a long running trapshooting club in town, and now rent out the clubhouse to whatever groups want to use it, and it[.] a much bigger hassle than it used to be, plugging up traffic.  Second they are going to restore an old fountain in one of our parks, which is fine on the surface, but they removed a couple of ancient ancient trees, which really cheapened that corner of the park, and you can't get trees like that back without waiting a hundred years.  Lastly, the bridge does not make the city any kind of destination, and people who think it will are dumb."}