{"doc_id": "983", "name": "2017_04_humanities_student_major_587_transformation", "namespace": "we1sv2.0", "metapath": "", "pub": "transformation", "title": "2017-04-humanities-student-major_587_transformation.txt", "pub_date": "2017-04-06T00:00:00Z", "Sentiment": "0.097", "Subjectivity": "0.275", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1324", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfuobim", "Reddit_id": "dfwt8c9", "Subreddit_id": "t5_2rqr7", "Commenter": "personinthecorner", "length": "7263", "content_scrubbed": " You're basically everything I'm into except I'm not big into furry stuff and inanimate objects. I too have often thought about what my fondness for TG erotica and fiction means. I crossdress, and have thought about being a girl numerous times. But I think it[.] just a fetish/fantasy thing at this point. \n\nI took a look at your submission history and read a number of the responses in those threads. I can't speak to anyone[.] experiences except my own, but I have a suspicion that it might be a bit more than just a fetish to you. To me, the biggest flag was how you asked your friends to refer to you by your female name. Once again, I can't speak for anyone except myself, but I personally believe in compartmentalizing my \"regular\" life and my sex life. The closest I've gotten to bridging the two was subtly hinting that I'm a furry to some close Internet friends in a closed chat; at this stage, I'd never divulge details about my involvement in the TF or TG spheres (it[.] worth noting that I haven't been in a relationship for years due to social isolation, so sharing that with a partner is still uncharted territory). And while I've personally wondered (somewhat often) how my life would be like if I was female, I'm confident that it[.] nothing more than an idle curiosity. As such, it[.] been really easy for me to maintain that compartmentalization. \n\nFrom my perspective, though, asking others to refer to you as a female says to me that it[.] much more than an idle curiosity. You're not just imaging yourself as a girl, but you're actively testing the waters to see how much you accept a female identity and how much your friends and family will accept you were you to transition. Perhaps the way I think about presenting my sexuality is a lot different than how you think about it, but I personally can't see myself doing that unless there was some serious intent behind that decision. Considering your crossdressing and your numerous questions to /r/asktransgender in this light, it seems to me that you're actively asking yourself which gender you're most comfortable as and whether you'd be happier beginning HRT. I don't think a mere TG fetish would cause the sort of inner turmoil you're experiencing. \n\nOf course, I'm but a random Internet person who knows you only by the questions you've asked myself and others. My opinions are shaped by my biases, and perhaps they don't quite mesh up with yours. Ultimately, the onus is on you to figure out which side of the gender spectrum you'd be happiest most on, and I can only offer you my thoughts. I wouldn't just dismiss it as a fetish or a fantasy, though. For me, TG is just a fantasy of mine, and I don't experience anywhere near as much doubt and uncertainty as you appear to be. \n\nTo finish this off, I think an anecdote is in order. It[.] long, yes, but I do think it[.] relevant. If you're the TL;DR type, just skip down to the next horizontal rule.  Brevity is not my strength. \n\n---\n\nWhen I was in middle school, I was essentially a straight A student, and was known as \"that really smart kid who builds robots and stuff.\" As it came down to applying to high school (there[.] a hell of a lot of high schools in NYC), my focus fell on a very exclusive private school. The application process required me to score within a certain percentile on a rigorous application test, and then to pass an interview, all on top of having solid academics. I went into the test with a splitting migraine, and was convinced I didn't make the cut. As I later found out, I tested pretty damn well and cleared the percentile requirement with a respectable margin. The interview was scheduled for early January 2008, but on January 2nd I had an appendectomy and was unable to attend. The school agreed to give me a chance a week or two after the scheduled date, and not long after I was released from the hospital I went to take the interview. I was still getting the painkillers out of my body, and between my low stamina and the constant pain from the incision I was certain I screwed it all up. You can therefore probably imagine my surprise and exhilaration when I received my acceptance letter a few months later. At that point, I was absolutely certain it was a match made in heaven, and not even being told during freshman orientation that 1/3 of our class would not last the four years could curb my enthusiasm. \n\nThe next two years of my life turned out to be incredibly stressful, partly thanks to myself perpetuating the cycle of pain. The academics I was so proud of crashed and burned, and I was placed on academic probation for most of my time there. The school forced me into an afterschool program every day of the week where I basically had to do my homework there with \"zero\" distractions (read: no extracurricular activities). Due to the school[.] bullshit behavioral and technology policies, I was in detention early in the morning just about every day for one and a half years. Combined with escalating tensions at home over my academic performance, my self esteem deteriorated quite rapidly. Yet despite all of this, any time my parents asked if I wanted to stay there I said yes. As much as I loathed the school and my academic situation, I continued to hold on to my middle school identity of being the really smart kid, hoping that I could just stop being such a lazy fatass and actually get the work done. Who knew, maybe if I forgot about hanging out with my best friends after school I could focus. As it turned out, my (at the time undiagnosed) ADHD and OCD kept me from being able to focus on doing literally anything that could help my situation. Go figure. \n\nThings came to a head in early 2010, when I ended a routine argument with my parents over a homework assignment with an unsuccessful suicide attempt. It was at that moment that all of us realized that school wasn't working for me, and I began the process of choosing another school. I was soon notified by the school that they wouldn't be renewing my scholarship for the next year regardless, so my hands were kinda forced. The school I ended up transferring to had a similar reputation of high quality, but with less of a focus on the humanities. I was dreading going in, worried that my lack of friends and shattered self esteem would just result in another two years of hell. \n\nIt turned out to have been the best goddamn decision I could have made. My grades shot back up to the 90s, I made several close friends and was reunited with one of my best friends who in a similar situation at my old school, and my outlook on life and the future became bright again. The teachers there were some of the nicest I've ever had, giving me support where I needed it and really just going above and beyond in general. I felt more at home there than I ever did at the other school. \n\n---\n\nSo yeah, I guess the moral of that wall of text is probably that sometimes you don't know what you really want until you have it. \n\n As for the furry thing, I want to reiterate I have no prejudice against those who like that fandom or participate in it. But I don't feel like it[.] for me. Not really my style. \n\nHey, that[.] totally fine. TF takes many forms, and mine just happens to be a bit different than yours. You do you, as they say. "}