{"doc_id": "306", "name": "2017_10_humanities_student_major_674_femalefashionadvice", "namespace": "we1sv2.0", "metapath": "", "pub": "femalefashionadvice", "title": "2017-10-humanities-student-major_674_femalefashionadvice.txt", "pub_date": "2017-10-08T00:00:00Z", "Sentiment": "0.066", "Subjectivity": "0.387", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "529", "Permalink": "http://reddit.com/r/femalefashionadvice/comments/7546pd/article_cute_outfits_and_the_academic_career/do3mug3/", "Threadlink": "http://reddit.com/r/femalefashionadvice/comments/7546pd/article_cute_outfits_and_the_academic_career", "Parent_id": "t3_7546pd", "Reddit_id": "do3mug3", "Subreddit_id": "t5_2s8o5", "Commenter": "ysabeaublue", "length": "2889", "content_scrubbed": "I'm an assistant professor in a social science department that has a STEM dual degree program (a lot of faculty have joint appointments and/or do interdisciplinary work in science and tech especially). \n\nAs someone who is the same age or sometimes younger than the grad students I teach, this is an issue I've had to handle. Most people in my department (which skews heavily male and older) dress casually and in a \"I don't care because I'm a serious academic\" way (not trying to generalize or stereotype, but that[.] how best to describe it). I'm known among my colleagues and students for my style, not only because I wear more skirts and dresses, but my tops, pants, shoes, or even jeans are more fashion forward, and I put...I guess more intentionality into my appearance, which is pretty feminine. \n\nI do think some of the students initially judge me as less intelligent because of how I look and dress (and because I'm young, though it seems to not be an issue for the male colleagues who are close to my age) – but I just do my work and once people get to know me, they get over it. Or they don't. Students comment on my wardrobe, but it doesn't bother me, I'm actually flattered (note: they say this to me personally, not in my evaluations)! I'm not going to change my style, though I do dress a little more conservatively on the days I teach my classes – higher necklines and lower hemlines – especially with the undergrads. It amuses rather than angers me when certain students (usually male) suddenly have their aha moment when they realize I actually know what I'm talking about, and they can learn from me, (yes, I do hold a PhD for a reason). I know I don't always get the same respect as some of my older and/or male colleagues, but it is what is. There is a weird culture here that \"dressing up\" means not as serious as my peers. \n\nThat said, there are times when certain outfits and looks are more appropriate than others, such as during presentations or when I was on the job market. Then it[.] about the substance of my work, though I do make sure whatever I do wear is still cute :) \n\nI think like in any field, there are outfits I can wear and outfits I can't. I don't have the same restrictions as someone in law or business, but I also don't have the flexibility of someone in the fashion business or the arts. I further recognize that my style is also more \"acceptable\" in many ways. As casual as my department is, they are still conservative not so much politically, but...no one on the faculty has colored hair or visible tattoos, or anyone who wears something way outside the bounds of traditional outfit expectations. A few of our students do, but I'm not sure if we're at the stage where we'd hire someone who did (things are changing, so we might now if the applicant blew us away). My hire as an under 30, unmarried female was something of a revolution in itself.\n"}