{"doc_id": "1204", "name": "2017_04_humanities_student_major_2631_scu", "namespace": "we1sv2.0", "metapath": "", "pub": "SCU", "title": "2017-04-humanities-student-major_2631_SCU.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.083", "Subjectivity": "0.221", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "309", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66z6oo", "Reddit_id": "dgnjhsp", "Subreddit_id": "t5_2s8yh", "Commenter": "IdealEntropy", "length": "1912", "content_scrubbed": "Hi, COEN student here with friends in both CS and COEN. COEN is in the school of engineering so if you've applied and been accepted to the school of arts and sciences you'd need to apply to transfer schools. I'm not sure exactly how this happens but it[.] based on your interests,academics and recommendations from faculty. \n\nSince coen is in the school of engineering you have to do the engineering core. Math 11-14 (calculus), phys 31-33 (calculus physics), math 51,53(discrete math, linear algebra) amth 106,108(differential equations, engineering statistics). You are likely set for your language requirement (2 years hs) and advanced writing happens for your senior design project. There[.] a very detailed plan you can find on the website, google \"cse 4 year plan\". Engineering lets you double dip basically every class if you can find one that[.] offered, also. \n\nCS follows the arts and science core, which I'm less familiar with, but no physics requirement is a big one. \n\nThey have different intro to coding tracks, too. Engineering has coen 10,11,12,70 and CS has csci10,60,61. Coen starts with C programming and eventually into C++ once you fundamentally understand data structures and algorithms. In the CS classes I know they start with C++ for the object oriented approach quicker. They both share coen21/20, which are logic design and assembly for embedded applications. They give you fundamentals for understanding the hardware you're dealing with.\n\nFrom there it[.] in to your upper divisions, where either coen/CS can basically take either department[.] classes, just check for your requirements. It[.] up to you what you specialize in from there (data science, information assurance, robotics, software engineering etc) are all fields you can get into with an under grad degree and the_right classes, and all of the ones I mentioned are masters tracks at SCU.\n\nHit me up if you have more questions "}