{"doc_id": "359", "name": "2017_10_humanities_student_major_1243_writing", "namespace": "we1sv2.0", "metapath": "", "pub": "writing", "title": "2017-10-humanities-student-major_1243_writing.txt", "pub_date": "2017-10-13T00:00:00Z", "Sentiment": "0.093", "Subjectivity": "0.349", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "975", "Permalink": "http://reddit.com/r/writing/comments/762vxk/how_do_i_start_writing_books/dob9x1y/", "Threadlink": "http://reddit.com/r/writing/comments/762vxk/how_do_i_start_writing_books", "Parent_id": "t3_762vxk", "Reddit_id": "dob9x1y", "Subreddit_id": "t5_2qh2n", "Commenter": "clashbuster", "length": "6175", "content_scrubbed": "**Short answer**: Start writing now. There are a ton of tips and tricks. You probably won't use any of them, because they don't work for everybody.\n\n**long answer** Educate yourself, practice, acquire necessary resources. I'll elaborate.\n\n**educate yourself** \n\nThere are college courses and tech courses, but you're poor! and so am I! here[.] a bunch of free options.\n\n[Brandon sanderson[.] complete  sci-fi-fantasy writing course free](https://www. youtube. com/watch?v=N4ZDBOc2tX8&list=PLH3mK1NZn9QqOSj3ObrP3xL8tEJQ12-vL) it[.] useful for all fiction writers and includes industry information as well.\n\n[writing excuses](http://www. writingexcuses. com/) they pick a writing related topic each episode and discuss the dos and donts. It[.] a podcast really, but includes a ton of big name authors who know what they're talking about.\n\n[Terrible writing advice](https://www. youtube. com/channel/UC3ogrx6d9oohf6D42G44j1A) an author sarcastically tells you dos and dont[.] of many different categories. He also includes \"Serious\" versions of some of his episodes.\n\nr/pubtips A subreddit dedicated to going over writing concepts and giving advice. they also have a newsletter here! Some guy named Brian says a lot of shit.\n\n[khan academy](https://www. khanacademy. org/humanities/grammar) Best known for teaching everything math related for free online. They have a grammar section. I've linked it here.\n\n[query shark](http://queryshark. blogspot. com/) includes a host of information related to querying agents and actually getting your novel published traditionally.\n\n[seven basic plots](https://en. wikipedia. org/wiki/The_Seven_Basic_Plots)\n\n[monomyth](https://en. wikipedia. org/wiki/Hero%27s_journey)\n\n[4 elements of story](http://www. writersdigest. com/writing-articles/by-writing-goal/write-first-chapter-get-started/4-story-structures-that-dominate-novels) this is very important stuff when it comes to writing a gripping story.\n\nAlso the sidebar has a lot of resources linked. check there.\n\n**practice**\n\nIf you wanna write a great book. You'll need to practice daily if possible. If you wanna make this a career. You'll definitely need to practice daily. The world doesn't expect anything from you so don't expect the world from yourself. Keep it simple. 500 words a day is a modest amount, and the minimum requirement if you're to take this seriously in my honest opinion. However, give yourself plenty of time to fall into a good stride. Don't get discouraged if you can't do it starting today.\n\nSimilarly, reading a lot is very important. It will help make all of your weaknesses stronger by osmosis. Have a question or concern? Have you seen it before in a book you've read? These things will help you reassure yourself.\n\nI cannot stress practice enough. At the end of the day you just need to have something rather than nothing to show for your time. Also, you will learn so many valuable things while practicing. I didn't even start plotting until after I'de written two novels. **it took me two novels to figure out plotting was the best strategy for me** Every project brings me closer to something I'm proud of, closer to this beautiful thing inside my mind which I can never put on paper as beautifully as I can imagine it. It took me **four novels** before I even really loved my own novel and considered it something truly worth my potential reader[.] time.\n\n**Acquire necessary resources**\n\nThere are things which are more or less required. Most of these things are required after you've finished writing a manuscript. You'll need critique groups. You'll need beta readers. You'll need to query agents.\n\nMy personal advice? Find a friend who likes reading books. Ask them to be a beta reader for you. Family members work too. Many on this subreddit like to say family members tend to lie about the quality. That depends on the family member. Most authors simply beta read through their Husbands/wives anyway. Family works fine if that[.] all you have. Make one of them your beta reader.\n\nPart of getting a beta reader is teaching your beta reader. Even a well read person might not understand what writing a novel takes. You'll have to instruct them on a few things. Beta readers do not line edit. If your beta reader is line editing, tell them to fucking stop that shit. Beta readers do not decide the direction of the story. Beta readers tell you why they stopped reading, or why they thought it was boring, or if certain parts were confusing, or needed more detail, which parts they liked and why and more shit like that.\n\n**FAQ[.]**\n\n*\"what if my manuscript is shit?\"* All first drafts are shit. Make sure you've put a lot of work into editing. You should expect editing to be half of the total work. if it has a ton of problems, don't give up on it. Furthermore practice makes perfect. Most career authors do not publish their first novel. You likely won't do it either. **do not get discouraged**\n\n*\"what If I'm not good\"* Everybody starts bad. This is a complicated skill similar to sculpting or painting. Ask any painter how many paintings they've painted. Their apartments are usually full of hundreds of paintings and sketchbooks stacked high with sketches. Ask a painter what their first painting looked like. It'll probably look awful. This is how skill building works. You have to improve on it with practice. Treat writing the same. You'll get better. You have to keep doing it if you wanna get good.\n\n*\"Am I too young to write a novel?\"* NO Many people like to spew this bullshit about you needing to be older. It[.] bullshit. Even as an adult most of my great ideas came to me with practice. My first novel was at 25 years old and it was the most tropey bullshit ever about some immortal man. My ideas developed almost in sync with my writing skills. I'de expect even a child to have similar results. If you put in the time, thought, and practice you don't need to be some arbitrary age.\n\n*\"Is my vocabulary too small to write a novel?\"* NO If you are capable of having a conversation with your neighbor you have all the vocabulary you need to write a novel. Additionally, your vocabulary will increase naturally if you keep reading and practicing.\n\n\n\n\n\n\n\n"}