{"doc_id": "1089", "name": "2017_04_humanities_student_major_1661_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2017-04-humanities-student-major_1661_college.txt", "pub_date": "2017-04-14T00:00:00Z", "Sentiment": "0.135", "Subjectivity": "0.34", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "411", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65ccyo", "Reddit_id": "dg9rko4", "Subreddit_id": "t5_2qh3z", "Commenter": "SnowblindAlbino", "length": "2393", "content_scrubbed": "Interesting question, and as a historian and college professor I really dont' have a good answer beyond anecdotes and general observations. The primary difference since the 1980s is probably the adoption of the Common Application by many schools, and the move toward \"SAT optional\" applications by growing numbers of schools. The online application process of course is different, as is the ability to access information on schools easily... back in the Reagan years we had to go to a library and look at microfiche copies of college cataloges to find out what sort of courses were offered, who the faculty were, etc. But there were still college fairs, admission reps, and piles of mailings once you got on one of their lists.\n\nContrary to what some have suggested here, selectivity hasn't changed that much at most schools. While the ~20 schools that are truly \"elite\" now have acceptance rates in the single digits, there are still a great many schools with near-universal admission (90%+ rates) just as there were in the past as that is part of their mission. For \"selective\" schools the acceptance rates may have gone down on paper, but that[.] largely due to much larger application pools, which are now inflated by the ease of the Common Application, online applications, and the reduction/elimination of application fees by many schools. So a school that might have seen 3,000 applications in the 1980s and accepted 85% might now get 6,000 applications and accept 70%... but if you look at the academic profile of the accepted students it hasn't changed much. What has changed is that 30 years ago most people applied to 2-3 schools, and now the average is at least twice that. There are more women applying overall now, but the fact that it[.] much easier to apply simply runs up the numbers... what happened behind the scenes is that \"yield\" is down-- that[.] the percentage of accepted students who actually end up attending a given school. Whereas 30 years ago a given school might have accepted 80% of its applicants and seen a 30% yield to make a class, now they may accept 70% and have a 20% yield, but they still make a class of the same size due to higher overall application numbers-- not because there are more students, but because students are applying to more colleges than they did when application fees were $50 per school and it all had to be done on paper through the mail."}