{"doc_id": "251", "name": "2017_10_humanities_student_major_219_justiceserved", "namespace": "we1sv2.0", "metapath": "", "pub": "JusticeServed", "title": "2017-10-humanities-student-major_219_JusticeServed.txt", "pub_date": "2017-10-03T00:00:00Z", "Sentiment": "0.193", "Subjectivity": "0.295", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "260", "Permalink": "http://reddit.com/r/JusticeServed/comments/73qusk/brighton_dealership_says_panhandler_turned_down/dnv8sf9/", "Threadlink": "http://reddit.com/r/JusticeServed/comments/73qusk/brighton_dealership_says_panhandler_turned_down", "Parent_id": "t1_dnu12yk", "Reddit_id": "dnv8sf9", "Subreddit_id": "t5_2vxxc", "Commenter": "TheInnsmouthLook", "length": "1326", "content_scrubbed": "This is a great reason to do your research but please, please, please don't lump all 501c3[.] together. \n\nI work with a ton of non-profits in the arts and could take my technical knowledge on the road and make 80k and up a year for a lot less work then I do now for my 501c3. Hell, our GM does like 4 jobs including all of HR, IT and Accounting and does ALL of them well for maybe around 50k a year, definitly less than 60k. Our Executive makes less than that cause he knows he doesn't do as much as our GM.\n\nAre we gold digging? HELL YES. We need donars to stay afloat, and wealthy donars at that. But an overwhelming majority of that goes straight into our teachers, our youth programs, supplies, maintenance and other essentials to make the place run, like power. Payroll is the smallest of where our money goes, but most of it goes to the people doing the day to day stuff on the ground with our clients, not some shadow group who make decisions once a week. (our admin team is in building at least 5 days a week, most of the time 6, all of us carry water jugs up stairs and vacuum floors and grab projects the place needs but we don't have people for)\n\nBut yeah. Food for thought. It does take good personnel to do good work. A lot of us are just trying to find a good living while making a little more good in the world. "}