{"doc_id": "1176", "name": "2017_04_humanities_student_major_2428_uncg", "namespace": "we1sv2.0", "metapath": "", "pub": "UNCG", "title": "2017-04-humanities-student-major_2428_UNCG.txt", "pub_date": "2017-04-21T00:00:00Z", "Sentiment": "0.176", "Subjectivity": "0.424", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "347", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66szga", "Reddit_id": "dgl9vv5", "Subreddit_id": "t5_2sdw3", "Commenter": "FilthyGypsey", "length": "1889", "content_scrubbed": "It[.] good. The people here, they're kind. You can walk up to people and start a conversation. The first few weeks of college will be weird because everyone is terrified and is trying to make new friends but once that passes they show who they really are and open up. \n\nThe events are fun. Nothing huge happens but what does happen has a lot of meaning. My two fondest memories from this year was from when Vermin Supreme showed up and when we held an Open Mic at the EUC. Everyone in the crowd felt like they belonged. It was like a giant family. \n\nAthletics are a small part of the student life. Greek life is minimal. This place is where the arts really thrive. There isn't a football team and that is what makes me love this school so much. Instead we have a quidditch team which is great :)\n\nThe school has your typical basic party people who get lit on the weekends, and if that[.] your style you'll find a group to be with. But if you look hard enough, you'll find people with so much heart and passion. You'll find people who are unbelievably strange but at the same time are the most fascinating and genuine people you'll ever meet. \n\nWe have what you would want at any other college, the sports (our basketball team is pretty good), the frats, the academia. But what makes UNCG special is the people.\n\nI love this campus and everyone on it. I know I probably sound sappy but I really feel connected with everyone I see here. \n\nThere is so much to learn, about academia and knowledge, but more importantly about yourself.   \n\nThe teachers here care. They want you to succeed and they're passionate about what they teach. I haven't had one professor here that seemed disinterested. \n\nTo me, being a Spartan means being someone who cares a whole lot about people you don't know, and believing that the world can be a better place.\n\nBut the caf kinda sucks, get a plan with extra flex."}