{"doc_id": "1224", "name": "2017_04_humanities_student_major_2784_rpi", "namespace": "we1sv2.0", "metapath": "", "pub": "RPI", "title": "2017-04-humanities-student-major_2784_RPI.txt", "pub_date": "2017-04-24T00:00:00Z", "Sentiment": "0.02", "Subjectivity": "0.334", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "239", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_679fh2", "Reddit_id": "dgpkz4i", "Subreddit_id": "t5_2rg3u", "Commenter": "RPnigh", "length": "1471", "content_scrubbed": "PhD student here (not sure you care about my opinion). \nI went to an undergraduate school without grades and a masters program that was basically pass / fail \n\nnever getting grades never hurt. No one needs grades.\n\nHave students do self-determined projects within defined parameters depending on the scope of each course and pass them if the project offers a solution to a problem (engineering); allows you to judge a hypothesis (science); is well written (humanities); or looks / sounds / feels / smells / tastes good (art) + is complemented by a good writeup explaining choices. give students and professors enough time to meet in small defense exams and provide narrative feedback for each project in order to direct students towards further resources and skills to be developed. You'll end up with undergrads that will be good at grad school / have \"real-world\" skills: can write properly, can communicate goals and intent, be self-critical, take initiative when appropriate, and, if you don't hire sadistic professors, a lot more self-confident. Will probably solve your cheating problem, too. Fail the people who don't do an amount of work that can be reasonably expected of them in a term.\n\nHappy to chat more if you'd like, classdean14\n\nnote: people from my undergraduate school have no problem getting hired / get into grad school regardless of discipline even without GPAs because most people[.] independent projects mean more to hiring committees than grades. \n"}