{"doc_id": "1175", "name": "2017_04_humanities_student_major_2426_worldnews", "namespace": "we1sv2.0", "metapath": "", "pub": "worldnews", "title": "2017-04-humanities-student-major_2426_worldnews.txt", "pub_date": "2017-04-21T00:00:00Z", "Sentiment": "-0.084", "Subjectivity": "0.39", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "617", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgkxlcn", "Reddit_id": "dgl7ekp", "Subreddit_id": "t5_2qh13", "Commenter": "Ratiasu", "length": "3513", "content_scrubbed": "No, you're right. They are not policing thought. My reply below may be out of proportions, but I don't believe I can form a decent reply without typing an entire wall of text, though.\n\nThey are trying to police what is \"correct\" politics, and what isn't. Nationalism is being coined as populism, which is a complete misuse of the term. At least the man recognises this. Sadly, he then goes on to misuse it himself. Neither nationalism or populism -which are two completely different concepts- are a bad thing. Saying populism has to be countered is insane. Every major political stream was \"populist\" at one point. Traditionally, populism in Western Europe refered to socialism, like it still does in Latin-America today. The tugging between the workers class and the upper classes. Imagine him saying socialism has to be contained. In my eyes, it is just as stupid, even though I'm not a socialist. Populism is the will of \"the people\" at any given point in time, usually with a hint of disregard or even disdain of current politics or politics altogether. It is not right-wing or left-wing by definition, and even if it was, so what? If anything, democracy should embrace it, as long as the populism of the day does not threaten democracy itself or promote hate. Important to note here is that wanting less refugees or being nationalistic (for example) is not hate. Of course, it CAN come in the form of hate, but anything can come in the form of hate. And it is perfectly possible to be nationalistic, not like the EU, and not want refugees within your borders without being xenophobic or hateful. And I'm extremely pro-EU, btw.\n\nIn one statement, he says we have to move to protect freedom of speech, then he proceeds to say anti-muslim rethoric should not be allowed. \nBeing opposed to certain religions on a political level should not be viewed as a faux-pas, as long as -again- it does not come in the form of blind hate. Islam is not alone here, a party should be able to single out any social groups as unwanted, and use that as a point to attract voters. \nI would immediately vote for a party that wants to ban any contact between religion and minors. Be it Islam, Christianity, or whatever. Even though I'm definitely targetting a social group here. Even a party that wants a tax shift is targetting a social group.\n\nThis man wants to use tax payers money and official EU governmental resources to alter voter behaviour (party vs party propaganda on a lower level is entirely fine, of course.). This is crossing a major red line for me.\n\nLike I said, I'm actually very pro-European, and I will never vote for a party that for example has a EU-exit on their agenda, similarly I can't stand communists on a political level. But just like with nationalism, as long as they are not out to commit TRUE inhumanities, I will defend such parties from being legally opposed, even if I disagree with them from the bottom of my heart.\n\nSo either mister Jagland wants legislation to prevent valid political streams from having a legal framework to have their program in (being against a huge muslim intake, perhaps being opposed to taking in refugees on home soil, he is being extremely vague regarding where the boundary lies here, which is crucial when making a statement like this - perhaps the article left this out), or he aims to influence voter behaviour, which is not up to the EU to do. This might even count as policing thoughts, actually. The former would be policing out entire valid political streams."}