{"doc_id": "1144", "name": "2017_04_humanities_student_major_2023_femalefashionadvice", "namespace": "we1sv2.0", "metapath": "", "pub": "femalefashionadvice", "title": "2017-04-humanities-student-major_2023_femalefashionadvice.txt", "pub_date": "2017-04-18T00:00:00Z", "Sentiment": "0.052", "Subjectivity": "0.419", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "362", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_6605t1", "Reddit_id": "dgfb6mq", "Subreddit_id": "t5_2s8o5", "Commenter": "heyyogagirl", "length": "2325", "content_scrubbed": "Yay! I love these threads! \n\n[Spring/summer](https://www. pinterest. com/hmyoga/ss-wear/)\n\n[Fall/winter](https://www. pinterest. com/hmyoga/fw-wear/)\n\n[Inspiration](https://www. pinterest. com/hmyoga/fashion-inspo/)\n\n[Accessories](https://www. pinterest. com/hmyoga/accessories/)\n\n[Work wear](https://www. pinterest. com/hmyoga/work-wear/) (newest board)\n\nI guess my biggest question is whether or not my Pinterest board is relevant to my life and goals? I get caught up in pretty things and struggle to limit myself to what I *actually want to look like*. I also struggle to place things in the seasonal boards vs. the inspiration board; I try to keep the seasonal boards very wearable but then there are some very wearable outfits on the inspo board. I guess I don't know where the line of flamboyance is for me....\n\nHere are more details, if you want some background for advice.\n\nLifestyle: I'm a grad student in a liberal_arts field, and I work part_time as the art history department assistant, as an artist, and as a yoga teacher. I have finally eradicated leggings from daily wear after years of living in athleisure, but I still live an active daily life that includes bike commuting, LOTS of dog walking, and spontaneous yoga postures. I'm 5'8'' and 150 pounds, rectangular and a little muscular, bloated around the middle due to chronic stress and lack of sleep (thanks, school).\n\nGoals: My fashion goals are to keep up with my crazy life as it changes from job to job. I find myself in different levels of formality throughout the day, along the spectrum of casual wear. I am trying to change clothes less often throughout the day (like, no you do not need a different outfit to go out to dinner than what you wore to class), and really only keep pieces that are functional and make me feel like a million bucks. Aesthetically, I try to look like a crafty witch, in the sense that I might use my witchcraft to give you a second head... but then I'll handknit beanies for both of those heads as your Christmas gift. \n\nHere are my most successful outfits (IMO, relative to my goals) of [the last year](http://imgur. com/a/SYBIY). \n\n^^ETA: ^^**Imgur ^^is ^^not ^^working ^^for ^^me ^^today, ^^I ^^know ^^there[.] ^^one ^^photo ^^in ^^there ^^twice ^^and ^^I ^^can't ^^fix ^^it! ^^Also, ^^these ^^are ^^crazy ^^out ^^of ^^order..."}