{"doc_id": "424", "name": "2017_10_humanities_student_major_1829_slatestarcodex", "namespace": "we1sv2.0", "metapath": "", "pub": "slatestarcodex", "title": "2017-10-humanities-student-major_1829_slatestarcodex.txt", "pub_date": "2017-10-19T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.405", "Score": "15", "Upvotes": "0", "Downvotes": "0", "Wordcount": "261", "Permalink": "http://reddit.com/r/slatestarcodex/comments/76c3g5/culture_war_roundup_for_week_following_october_14/doly2x0/", "Threadlink": "http://reddit.com/r/slatestarcodex/comments/76c3g5/culture_war_roundup_for_week_following_october_14", "Parent_id": "t1_doluws9", "Reddit_id": "doly2x0", "Subreddit_id": "t5_30m6u", "Commenter": "Areopagitica_", "length": "1571", "content_scrubbed": "Yeah I agree with all this, especially point #3. When I teach, also in the humanities, I routinely make an effort to call on students who talk less, which is often students uncomfortable with public speaking, who are struggling with the work, students from different cultural backgrounds and so on. This can often be vaguely synonymous with non-white, but certainly not strictly, and I don't actually think there[.] much of a gender bias where I teach, probably in part because most students are women anyway. This is standard teaching practice, so the idea that this is a new thing this student is doing now is wrong, but specifically overlooking students who are white men would seem to be outrageously unfair to those students, precisely because it[.] such a small group. Population averages have value in certain contexts for determining policy but in a small class they are fairly useless. It[.] basically taking reasonable, standard teaching habits - encouraging less active students - and specifically shaping them into a hard and fast rule with no in-class flexibility, and publicising that in an attempt to cause a stir or make a political statement, which seems to be sacrificing the educational experience of your students for minimal gain.\n\nI mean, what if you have, say, 5 white male students in your class, and none of them are particularly active or engaged and they never speak in class? Would this just be a success story in this model of teaching? Non-white, non-male voices are dominant, so teaching mission accomplished? A bizarre way to approach things."}