{"doc_id": "1267", "name": "2017_04_humanities_student_major_3211_iamverysmart", "namespace": "we1sv2.0", "metapath": "", "pub": "iamverysmart", "title": "2017-04-humanities-student-major_3211_iamverysmart.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.007", "Subjectivity": "0.302", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "268", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgvpuxh", "Reddit_id": "dgvux3s", "Subreddit_id": "t5_2yuej", "Commenter": "Defynce", "length": "2057", "content_scrubbed": "I can't tell if this is a troll or not, but I'll bite. The clinical trials for Ambien actually had a female only cohort, you can read the journal article about it from 1990 (it was approved in 1991) [here.](http://europepmc. org/abstract/med/2092963) The majority of medical studies are not ONLY done on male participants, although there is a disparity, I've never heard of a drug going to market with clinical trials done  only with males. You can read about that [here.](http://www. newsweek. com/females-suffer-gender-gap-cancer-trials-drug-development-485631) The Tuskegee syphilis studies had nothing to do with psychology, the word isn't even on the wikipedia page about it. While absolutely horrible studies, they were done to monitor the progression of syphilis, the wiki is [here.](https://en. wikipedia. org/wiki/Tuskegee_syphilis_experiment) \n\nI would like to contest whether or not Psychology is held to a higher standard than other fields. Many liberal_arts are held to a much higher standard than psychology, for instance history and literature both require production or analysis of something worthwhile for a PhD. Psychology, on the other hand, tends to produce studies with [non-reproducible results.](http://www. nature. com/news/replication-studies-bad-copy-1. 10634) Refering to psychology[.] [.]cientific methodology' is also untrue as well, as it[.] not an [empirical science.](https://link. springer. com/article/10. 1007%2Fs12124-015-9339-x) I do find it interesting that the field of psychology has spirited debates within their own journals as to whether or not it is a science, as most other scientists see it as a dicipline soon to be replaced by a better understanding of neuroscience, which you can read about [here](http://www. realclearscience. com/blog/2015/11/why_psychology_and_statistics_are_not_science. html) and [here.](https://opinionator. blogs. nytimes. com/2010/12/19/a-real-science-of-mind/) I hope you enjoy reading that and have a higher opinion of medicine afterwards!(or you can wait until your next trip to the doctor[.] office!)"}