{"doc_id": "447", "name": "2017_10_humanities_student_major_2141_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2017-10-humanities-student-major_2141_UofT.txt", "pub_date": "2017-10-22T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.316", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "407", "Permalink": "http://reddit.com/r/UofT/comments/782bbi/cost_of_life/doqx28o/", "Threadlink": "http://reddit.com/r/UofT/comments/782bbi/cost_of_life", "Parent_id": "t3_782bbi", "Reddit_id": "doqx28o", "Subreddit_id": "t5_2rbaq", "Commenter": "Teshi", "length": "2321", "content_scrubbed": "I'm in a humanities Phd Program. \n\nAt a bare minimum, your \"take home\" to spend on life (rent, food, etc.) will probably be something like ~$16000. With this, you will be living in relatively crappy shared housing, and will be quite poor, but you will not starve provided you are careful with your money.\n\nThere are other ways to make money at the university. For example, you can invigilate exams, apply for whatever grants and scholarships you are eligible for (some of thoe will go to the university), and pick up extra work by just being super dedicated. If you're an international student with desirable experience/grades/university experience, sometimes grad programs will offer you more money to lure you in. I, for example, have four sources of income, one of which is an \"external\" scholarship, and the remaining three come from the university. \n\nThe way the university is set up is contradictory: The School of Graduate Studies is putting pressure on departments to speed PhD students up to take closer to 5 years, rather than 7. However, there has been no change in other demands. You are expected to complete TA or research hours (of course) but also to show up to events and also that you will be available to volunteer your time to contribute (for free!) in order to help with events, activities and with (functionally) aspects of the administration of the department. This is, in many cases, untenable. I am currently frustrated because many students in my cohort have been told not to take on the organization of events, and yet faculty put pressure on the students to continue to organise and attend them at the same rate.\n\nIs $16000/year survivable, sure. Is it fun? No; you will learn to be poor (if you're not already good at it). \n\nBut what I really lack is time and agency. I'm expected to be overworked and to accept responsibility for important functions, but I'm also expected to be fine with having almost no influence and support. It[.] a crazy weird situation.\n\nSo, don't not come to U of T because of the money; don't not come to U of T because of the culture.\n\nDo come because the city is awesome, and there[.] someone here you really want to work with. You'll be better treated if someone in your department looks after you.\n\nWish I could @ the Dean of the School of Graduate Studies on this."}