{"doc_id": "242", "name": "2017_10_humanities_student_major_135_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-10-humanities-student-major_135_ApplyingToCollege.txt", "pub_date": "2017-10-02T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.248", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "260", "Permalink": "http://reddit.com/r/ApplyingToCollege/comments/73u893/harvard_freshman_ama/dntnhyz/", "Threadlink": "http://reddit.com/r/ApplyingToCollege/comments/73u893/harvard_freshman_ama", "Parent_id": "t1_dnt4t11", "Reddit_id": "dntnhyz", "Subreddit_id": "t5_2y2r8", "Commenter": "daboombas", "length": "1419", "content_scrubbed": "1. The students!\n\n2. Really, nothing so far lol\n\n3. People unwind on the weekends with various ways. Some play board games with their friends, some catch up on sleep or Netflix, others go out and party, etc. Clubs are a good way to spend your time in a fun way, too.\n\n4. Not that bad for me, but I have a lot of humanities courses. Some of my friends are pre-med and STEM, so they have a lot of problem sets and work on their plates, tbh. But they're all handling it well and still staying upbeat so\n\n5. 35 ACT, 800 Math II, 760 Bio-M. Around 3. 90 GPA. Low income, immigrant family. I was a leader in a few clubs, made a club, president of one, did music stuff in high school and had a nationally-ranked EC.\n\n6. Everyone actually seems normal, whatever that means. No one brags, all super nice and friendly. There is a sort of collective pride that we are Harvard students though. Just the_right amount of stress and academic pressure, but everyone enjoys themselves in their free time. \n\n7. So the comping process, which is like auditions, for some of the big clubs like The Crimson are intense. Certain clubs are very competitive, I won't lie. Even the music groups and especially a Capella - something like 10 guys were taken by 6 groups, and around 60-70+ auditioned. But there[.] no problem finding extracurriculars to do. A lot of the clubs are relaxed and non-competitive, just a few stick out as being exclusive."}