{"doc_id": "1046", "name": "2017_04_humanities_student_major_1171_duellinks", "namespace": "we1sv2.0", "metapath": "", "pub": "DuelLinks", "title": "2017-04-humanities-student-major_1171_DuelLinks.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.106", "Subjectivity": "0.419", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "361", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64lapz", "Reddit_id": "dg3jndq", "Subreddit_id": "t5_3g70s", "Commenter": "citruslime27", "length": "2351", "content_scrubbed": "Most-all of these are existing irl products I believe.\n\nThe top bunch look like unaltered irl structure decks ([1](https://www. google. co. uk/webhp?sourceid=chrome-instant&ion=1&espv=2&ie=UTF-8#q=realm+of+light) [2](http://yugioh. wikia. com/wiki/Cyber_Dragon_Revolution_Structure_Deck) [3](http://yugioh. wikia. com/wiki/Onslaught_of_the_Fire_Kings_Structure_Deck)), and were likely put there as test assets. (They are also pretty warped/squashed looking so makes me think it was more a test, but who knows, there is still potential they were/are planned for release, however it seems less likely considering the next bunch ima go through)\n\nAlso to note these decks were released fairly recently compared to where much of the duel links cards originate, meaning their contents would likely be quite over powered. So not something I think we could even begin to expect for a while anyway- contain xyz and synchro)\n\nAnyway enough on that, onto the second bunch...\n\nThe second bunch are slightly redesigned yugi and kaiba ([reloaded](http://yugioh. wikia. com/wiki/Starter_Deck:_Yugi_Reloaded)) starter decks, the arts composition of monster colors is is more or less identical to the irl deck except the characters seem to have been replaced by chibis. Because the designs are so close, I think it would also be a pretty safe bet to assume that the contents of these decks would be almost identical to the irl decks. Also if you look closely you can see the boxes say [.]tarter deck', so it seems they would have been exactly that, rather than packs.\n\nThese weren't the first decks released but they were certainly not legacy like decks like the 2016 kaiba and yugi decks we got recently, so the majority if not all of the cards would likely be pretty balanced in the current Duel links. I coincidentally was looking through the deck lists a day or so ago and most of the cards are pretty mild. Certainly giving a little time for power creep, certain cards like vorse raider wouldn't be anything too crazy.\n\nAdditionally the marik deck I believe does not exist irl, so this would have been a duel links original product, and the contents unknown.\n\nOf the assets you posted those 3 are the ones which I would say were actually intended for release at some point, and it[.] still possible they will be released one day. (Marik ofc isnt released yet),\n\n"}