{"doc_id": "362", "name": "2017_10_humanities_student_major_1266_sneerclub", "namespace": "we1sv2.0", "metapath": "", "pub": "SneerClub", "title": "2017-10-humanities-student-major_1266_SneerClub.txt", "pub_date": "2017-10-13T00:00:00Z", "Sentiment": "0.06", "Subjectivity": "0.332", "Score": "25", "Upvotes": "0", "Downvotes": "0", "Wordcount": "697", "Permalink": "http://reddit.com/r/SneerClub/comments/7633el/not_the_critic_who_counts/doboi2w/", "Threadlink": "http://reddit.com/r/SneerClub/comments/7633el/not_the_critic_who_counts", "Parent_id": "t3_7633el", "Reddit_id": "doboi2w", "Subreddit_id": "t5_39qia", "Commenter": "queerbees", "length": "4677", "content_scrubbed": "Maybe I am just a IQ \"normie,\" as the Feynman aspirants say these days, but I don't understand the title of the post. On a literal level, the word \"counts\" is pregnant with puniness---but nowhere is the activity or meaning of \"counting\" explored, the title feels a bit of a letdown.^† On another level, by spending time generating an assessment of this subreddit---what we do, who we do it at, the sneering (gg) epithetical \"hermeneutic funhouse mirrors,\" etc---we have been explicitly counted. The thesis here is being undermined by the virtue signaling content of this essay.\n\nThat beings (constructively) said, what about that \"subtler\" lie that he isn't sneering? He[.] always dumping on humanities scholars, (non-quant!) social_scientists, [modern artists](https://www. scottaaronson. com/blog/?p=2622), \"postmodernists,\" meanie nameless feminists who write books that upset him in college, etc. I don't know what is more obnoxious: that he baldly betrays \"intellectual honesty\" when he refuses to give *others* a fair shake or his righteous indignation in the boogie pomos he[.] apprehended \"[spend[ing] years attacking [nerds]](https://www. scottaaronson. com/blog/?p=3488#comment-1747241).\" I guess the difference between \"us\" and \"them\" is that I don't think of myself as a victim of them, whereas the perennial fragility of the \"STEM\" ego paradoxically lives on.^††\n\nBut if I can't realistically push past the psychic defenses that insulate the rationalist crowd, there is certainly something to be said to dispel their boogies.  Dawkins is wrong, in is infamously forgettable review of *Impostures Intellectuelles*, to suggest \"the postmodernists claim only to be 'playing games'?\" That[.] an excuse, a strawman, and what[.] so impoverished about Aaronson[.] thinking---\"[I remember reading every detail about the Sokal affair when I was 15—it was one of the formative influences of my life. 🙂](https://www. scottaaronson. com/blog/?p=2494#comment-870075).\" Cringequote.\n\nThe thing is, the *reality* is, that Bruno Latour, Sandra Harding, Georges Canguilhem, Steven Shapin, Donna Haraway, etc take science way more seriously and critically than the sycophants who lap up Brockman[.] [annual creative writing exercise](https://www. edge. org/annual-questions). Science studies (STS) scholars and students are deeply interested in what scientists say and do, both now and historically. They also explore vistas that are simply inaccessible to working scientists: the the broad and specialized (sub)cultures, institutions, and discourses of the sciences. Students of science need to understand the complex interweaving of culture and knowledge, because it is the fundamental interdependence between science and society that makes the twenty-first century what it is. To quote Dawkin[.] foolish review is not only an err of intellectual integrity, it is absolutely cowardly way to sneer: to act like a child on the internet or in print, in the face of the serious work these philosophers, historians, *and scientists*, all while under the *im*posture of a public intellectual.^‡\n\nThere is nothing positive to be found in work of \"science warriors\" and their desperate fight against critical scholarship. So if anyone should be blamed for \"seiz[ing] on a sentence that, when ripped from context and reflected through enough hermeneutic funhouse mirrors,\" it[.] jokers like Sokal and his imitators/admirers like Dawkins and Scott Aaronson.\n\n----\n\n^† For a good example of how this pun is exicuted, see Buck[.] \"People Who Counted: Political Arithmetic in the Eighteenth Century,\" *Isis* 73. 1, 1982:28--45.\n\n^†† And to be completely clear, I don't for a moment think that these Scotts, or tech-bros, or the mumbling crowd of rationalists in any way represent he broad diversity of life among *real* mathematicians, scientists, and engineers (hence the scare quotes, Happy Halloween!). Sure their a particularly vocal crowd of moody peahens, but I'm confident they are a minority fowl. \n\n^‡ As an addition to the above note, and an amendment to the corresponding sentence: I do think the science wars did real (but hopefully not lasting) damage to the humanities and the social_sciences. While I have had the luxury of working with very open-minded scientists, and have friends among some very \"contie\" mathematicians and philosophers, I have known other STS folks who've ran into friction. The comedy of Aaronson[.] paranoid vicitimhood grows sour when it finds sympathy on tenure and grant-giving committees and in the statements of university professors. Honestly, there is something deeply unsettling about Aaronson and the psychology he projects that makes me *not* want to sneer at him."}