{"doc_id": "974", "name": "2017_04_humanities_student_major_523_granblue_en", "namespace": "we1sv2.0", "metapath": "", "pub": "Granblue_en", "title": "2017-04-humanities-student-major_523_Granblue_en.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.092", "Subjectivity": "0.374", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "295", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63nw7m", "Reddit_id": "dfvwhfu", "Subreddit_id": "t5_3e3se", "Commenter": "Ddubistro", "length": "1509", "content_scrubbed": "To answer your first question: I usually don't dual tab except when slimblasting and hosting (to not lose time with pots).\n\nOtherwise I play GBF for chill and I never felt once the need to go hardcore with several tabs. The only moment I see this really needed is during a very hard fight to maximise para and fear uptime. Or when I have almost no time and need to rush things super fast.  \nAnd you don't really need to dual tab to mvp (even if it increases your chances) on most boss. Refreshing is enough usually.  \nPlus I find 2 min gained for a GW boss not that much compared to the stress it will generate to manage 2 tabs. I pref to chat on Discord or watch stuff in the same time. If I were to dual tab to gain 2 minute I will be tired way too fast and farm less overall.\n\n---\n\nFor the 3rd question about Cygames: why would they optimize the game this way when they clearly put so much effort in animations and effects? Look at the summons, at least I always take time to watch them all once (full I mean). Same apply with Ougii and skill animations.\n\nMvP rushing is not done by a majority I believe, just the most hardcore players (and surely the most vocals) and I find it kinda sad to reduce the game to a simple smash buttons. When in the first place I'm here for the arts and musics.\n\n---\n\nFor the second question, I guess I don't know. Surely not something Cygames will tell you to do for sure ;)\n\nAnyway thanks for the post, nice trick that some may ignore. Very usefull if you are in a rush! ;D"}