{"doc_id": "240", "name": "2017_10_humanities_student_major_124_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-10-humanities-student-major_124_AskReddit.txt", "pub_date": "2017-10-02T00:00:00Z", "Sentiment": "-0.04", "Subjectivity": "0.366", "Score": "42", "Upvotes": "0", "Downvotes": "0", "Wordcount": "236", "Permalink": "http://reddit.com/r/AskReddit/comments/73thcu/what_did_you_put_effort_into_only_to_get_terrible/dntdcig/", "Threadlink": "http://reddit.com/r/AskReddit/comments/73thcu/what_did_you_put_effort_into_only_to_get_terrible", "Parent_id": "t3_73thcu", "Reddit_id": "dntdcig", "Subreddit_id": "t5_2qh1i", "Commenter": "imfsfcltj", "length": "1308", "content_scrubbed": "In college I had this research essay in my humanities class. I could research any topic, and I mean any topic I wanted, I just had to support my argument with proper research and then we had to read our essay as a speech to the whole class. Now, as a student who abhors writing essays, I was really fed up with writing essays at this point in my life. I also really hated the professor. I mean she thought she was God[.] gift to the earth. But she was a dumbass and a pompous bitch. \n\nTherefore, I chose my research topic to be \"Do humanities professors offer any positive contribution to society?\" My research consisted of articles, journals, interviews with my other professors and fellow students. Essentially I put together an absolutely flawless argument that humanities professors are among the most unintelligent, simpleminded, ignorant and obtuse human beings on the planet and that they in fact do not contribute any positive contribution to society by any means. It was hands down the most effort I'd ever put into an essay and to this day one of my most proud pieces of work. I didn't really want to accomplish anything other than really piss off my professor because i knew she had to listen to it while I read it in front of the class. I was entirely prepared to fail the assignment, which I did."}