{"doc_id": "1085", "name": "2017_04_humanities_student_major_1608_outside", "namespace": "we1sv2.0", "metapath": "", "pub": "outside", "title": "2017-04-humanities-student-major_1608_outside.txt", "pub_date": "2017-04-14T00:00:00Z", "Sentiment": "0.003", "Subjectivity": "0.417", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "336", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_655crp", "Reddit_id": "dg8vpt5", "Subreddit_id": "t5_2r3f3", "Commenter": "oneof7000", "length": "1888", "content_scrubbed": "The in-game guide is completely shit, and almost seems written to further nerf players who - let[.] be real - were never going play the game[.] [Finances] PvE mode competitively anyway. It just makes it impossible to do just about anything in the game when so many of even the Dailies are wrapped up in [Finances].\n\nThe entire [Arts] and [Humanities] skill trees are absolutely garbage unless you got super lucky and got placed into a guild that already has \"won\" [Finances] at character creation. In the older patches at least you could count on your class being relevant through to the endgame, but the last two expansions or so it[.] like the devs just decided that [Finances] didn't need so many classes skewing the balance bell-curve. And now that the [STEM] class faction has just about unlocked [Autonomous AI] I'm expecting most of that old balance curve to just get a forced-reclassing into a retooled [Plebeian] class. Haven't seen those in... how many expansions now?\n\nAnd don't get me started on how nobody cares about the lore unless they need to pretend to have a reason for the dumb shit they're going to do anyway. \"It[.] what my character would do!\" Fucking fakeass RPers. Sure, keep telling yourself there[.] this deep and meaningful story about conflict in the [Holy Land] zone that goes back hundreds and hundreds of patches. We all know you only care about that [Oil] resource. \n\nBut I would forgive all of it - ALL OF IT - if they just got rid of the bullshit [Student Loan] mechanic. Just scrap the whole fucking thing. No lingering debuff for the players who hadn't finished that questline in time for the patch that does away with this abomination. There is absolutely no build in the game where SLs are worth it.\n\nBut the guide tells you to do the extended tutorial if you really want to get the most out of the game. So you do. \n\nAnd then the game isn't fun anymore."}