{"doc_id": "1022", "name": "2017_04_humanities_student_major_934_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2017-04-humanities-student-major_934_college.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.144", "Subjectivity": "0.498", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "256", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg0s6n4", "Reddit_id": "dg0smn8", "Subreddit_id": "t5_2qh3z", "Commenter": "SnowblindAlbino", "length": "1599", "content_scrubbed": " I absolutely disagree about the quality of education though. Public schools in the sciences are often much better funded than smaller private schools. They often have more faculty of different specializations. For chemistry for example, you need a certain number of faculty and certain instruments to even get accredited by the American Chemical Society. Smaller universities can't hit that mark.\n\nLots of private schools offer ACS chemistry majors, including the one I attended and two at which I've taught. Certainly there are differences in resources and priorities between schools; if you want to be an engineer it[.] probably not a great idea to attend an SLAC that doesn't have an engineering major. But if you look at the top producers of Rhodes, Truman, and Fullbright scholarships (just as one kind of metric) private schools are disproportionally represented, especially so amoung batchelors-granting institutions.\n\nPublic vs private isn't a clearcut issue on any scale. There are great schools on either side of that divide, and poor ones as well. I've been fortunate to work and study as some very good private schools, and some very good public ones. In my experience the huge public schools-- 40K+ students --are a real mixed bag, while the extremely well resourced larger privates are generally excellent. At the lower end of the size scale there are huge differences though; smaller private schools are expensive because they invest so much in teaching whereas small public schools are often quite marginal. Which is most suitable depends on the student, the major, and their goals. "}