{"doc_id": "373", "name": "2017_10_humanities_student_major_1327_personalfinance", "namespace": "we1sv2.0", "metapath": "", "pub": "personalfinance", "title": "2017-10-humanities-student-major_1327_personalfinance.txt", "pub_date": "2017-10-14T00:00:00Z", "Sentiment": "0.126", "Subjectivity": "0.319", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "505", "Permalink": "http://reddit.com/r/personalfinance/comments/76chmp/thinking_of_going_to_college_im_38_years_old/dod8431/", "Threadlink": "http://reddit.com/r/personalfinance/comments/76chmp/thinking_of_going_to_college_im_38_years_old", "Parent_id": "t3_76chmp", "Reddit_id": "dod8431", "Subreddit_id": "t5_2qstm", "Commenter": "zultdush", "length": "2927", "content_scrubbed": "Went to school at 31, some advice:\n\n- Study something with jobs, and where education is a stepping stone to it. Don't rely on passion or anecdotal evidence from friends about a particular career choice. \n \n- Attend community college and transfer to an affordable state school. Most Bachelors share much of the same general education requirements: math, english, biology, chemistry, physics, public speaking, an art class, a psych class, etc. All can be taken at community college for cheap/free.\n\n- academic advisors do not help you get jobs, and have no idea what happens to students in the work force. Their only use is to help you finish a degree or transfer etc, so do your own career research.\n\n- Protect your GPA and take your time. GPA gives you academic options, even though it might not open doors in a career. Options matter. \n\n- seriously learn how to study. Rewrite, and Compress notes, take pictures of chalkboards, record audio and listen back at double speed. Learn how to be a good studier. For almost all majors, if you need more than 3 full days to study for a test, your study method is no good, your notes are incomplete, or you're focused on the wrong aspects.\n\n- avoid career choices that can't be reached with a bachelor[.]. A bachelor[.] in psychology is pretty useless because you really need grad school, and they're super competitive and bottlenecked to get into.\n\n- engineering is a good choice, so do the engineering version of something. Biochemistry is a major, biochemical engineer is a job, get me?\n\n- bachelor[.] of nursing (BSN) is a good choice.\n\n- avoid most of the humanities.\n\n- avoid most of the social_sciences.\n\n- avoid most of the bio sciences.\n\n- avoid art.\n\n- avoid computer science (I work as a software engineer, feels a bit full of new grads at the moment if you ask me) and instead learn object oriented, data structures, and algorithms  while focusing on clone projects  (don't waste time inventing sometime new, pick something someone has made and clone it for experience)\n\n- become a subject matter expert within your field, focus.\n\n- try to start working in your field as an intern as soon as possible, especially while in school. Once you graduate it becomes increasingly more difficult to find a job without at least some experience. Internships give you that before you leave school.\n\n- avoid Bullshit, \"non-traditional\" schools. Also Avoid for profit online schools. The only school you should consider is a REGIONALLY ACCREDITED PUBLIC SCHOOL. There are no shortages of trump universities out there, so be aware. Msg me if you're not sure :)   (edit)\n\n- universities are geared for theory, research, future PhD students, and people who need to attend some place prestigious. State College is plenty if you don't want to be a PhD in something, and tends to be a bit more grounded. I attended a high ranking uni and felt less prepared than my state College buddies. (Edit 2)"}