{"doc_id": "293", "name": "2017_10_humanities_student_major_546_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2017-10-humanities-student-major_546_changemyview.txt", "pub_date": "2017-10-07T00:00:00Z", "Sentiment": "0.114", "Subjectivity": "0.4", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "399", "Permalink": "http://reddit.com/r/changemyview/comments/74vebx/cmv_liberal_arts_colleges_are_dying/do1elqu/", "Threadlink": "http://reddit.com/r/changemyview/comments/74vebx/cmv_liberal_arts_colleges_are_dying", "Parent_id": "t1_do1dner", "Reddit_id": "do1elqu", "Subreddit_id": "t5_2w2s8", "Commenter": "-pom", "length": "2410", "content_scrubbed": "Well uniquely, she also spent a semester at a state college and liked it a lot better. \n\nCollege atmospheres vary a lot from college to college. And every college, including state colleges, have small classes with plenty of opportunity to interact with a professor on an individual basis. \n\nSome of the arguments include: \n\n**Better college-to-student ratio**  \nWhile this is true, it doesn't mean much at all. I went to one of the largest state colleges and majored in one of the largest majors (accounting) and was able to get more than enough 1-on-1 time with professors. \n\n**Fairer classes**  \nAlso not true, this is largely dependent on the professor, not the college.  \n\n**Peacefulness**  \nThis is largely dependent on what you consider peace. A very large number of students are able to find plenty of peace in state colleges and some larger universities provide more separated dorming. When you go to a liberal_arts school, you typically pay quite a bit more than a state school. By transferring that money to a better apartment complex or living quarters, you can buy the same peace and comfort again. Also, the number of people who enjoy a VERY small population is significantly smaller than the number of people who don't care too much as long as there[.] peace. \n\n**More college government**  \nCollege governments are more *transparent* in state schools, whereas private schools can make decisions without students knowing. My girlfriend[.] school is well reputable and many changes are made without the students' knowledge. \n\n**Better perks**  \nPerks are all paid for. When you pay 58k for a liberal_arts school versus 40k out-of-state for a state school, the extra 18k goes to those perks. Perks don't come out of nowhere. \n\n**Liberal arts schools are safer**  \nThis is largely dependent on the area, location, and general demographic of the school. Typically, even within schools, you can stay away from the dangerous areas and be very safe. You don't have to hang out with drug users or drunks. There[.] a lot of safety in college dorms and incidents are usually isolated (aside from dangerous places). \n\n**It[.] easier to make friends in liberal_arts schools**  \nThis is largely dependent on your interests and your needs. But there are clubs that are very open to the public in every school. And every one of those clubs in state schools are larger than equivalent clubs in liberal_arts schools. "}