{"doc_id": "236", "name": "2017_10_humanities_student_major_105_financialindependence", "namespace": "we1sv2.0", "metapath": "", "pub": "financialindependence", "title": "2017-10-humanities-student-major_105_financialindependence.txt", "pub_date": "2017-10-02T00:00:00Z", "Sentiment": "0.047", "Subjectivity": "0.374", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "647", "Permalink": "http://reddit.com/r/financialindependence/comments/73imap/you_were_wondering_where_the_lower_income_fiers/dnszklj/", "Threadlink": "http://reddit.com/r/financialindependence/comments/73imap/you_were_wondering_where_the_lower_income_fiers", "Parent_id": "t1_dnsxfqf", "Reddit_id": "dnszklj", "Subreddit_id": "t5_2t34z", "Commenter": "NotTooDeep", "length": "3629", "content_scrubbed": "Oh that[.] easy to explain. \n\nThis sub is mostly populated with young STEM majors. While they may have met a fine arts major by accident, they have no idea what it takes to be a fine arts major. All they know is \"it doesn't pay\". They will see your life choices as deficient. \n\nStrictly from a savings rate, they are correct. But their error comes from having a single threaded career. They realize they like to geek. They major in engineering because geek. Engineering happens to pay very well at this time and it[.] relatively easy to find jobs if they will move around. They scrimp and save and dream of never having to geek for someone else again.\n\nYou, on the other hand, don't hate your job or your coworkers or your bosses. You've never hated your job. You love your work and, if bills and mortality weren't an issue, you'd do your job for free.\n\nI suspect that saying that you could sell them high tech contracts for big bucks will offend them, even though it[.] true. They prefer to believe that such high tech contracts happen for rational reasons. But if you check the complaint forums that these same folks vent on, they vent about how irrational high tech contracts are. I work in IT and even the rational contract decisions don't always work out rationally.  \n\nI'm positive that I offended somebody by suggesting you could work at an Investment Bank. But taxi drivers have gotten entry level jobs at investment banks and worked up to a high salary, so why not you. It is an edge case, but so what. \n\nYou're accustomed to putting yourself in uncomfortable situations and then mastering them. Most of us techies just want to show up and write good code. We hate the meetings. We hate the interruptions. We hate the software salesmen and their blatant lies. In short, we're not able to see past our cubies sometimes.\n\nI studied music performance. I taught music while traveling for two years. I went back to school and studied art history, studio art, and dance (modern and ballet). The jobs did not exist for me when school was finished. I wandered a bit then fell into an aerospace job at a startup. Because of my time management skills from music, my processing skills from printmaking, and my physical skills from dance and martial arts, and my better than average people skills, I was shop supervisor in a year. Eventually, with a few years and a few job changes, I became a toolmaker. Then, the whole aerospace-defense sector stagnated after the USSR fell apart.\n\nThe market with the most opportunity for me at that time was software development. I used those same fine arts skills to learn to program and changed careers. \n\nThat makes three careers under my belt. I suspect most of the folks on this sub are not considering a different career. They're already working on their end game. \n\nYou, on the other hand, have had 23 fulfilling years and you accept that it will end in the next decade or so. You're planning well ahead of time to make the transition be smooth and welcoming. You know you will need a different career.\n\nYou could easily become an entrepreneur. You could become the arts coordinator for a major school district or an elite private school. You could become a fund raiser for non-profits. You could become a highly paid dance tutor to wealthy families in South Korea or somewhere else. You know how to choreograph your life. \n\nIf you haven't noticed by now, I'm a little starved for contact with the fine arts world. I apologize to the techies reading this for taking up their time. I offer my thanks to you for responding kindly. I wish you all the best and look forward to your future posts."}