{"doc_id": "1245", "name": "2017_04_humanities_student_major_3080_math", "namespace": "we1sv2.0", "metapath": "", "pub": "math", "title": "2017-04-humanities-student-major_3080_math.txt", "pub_date": "2017-04-27T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.32", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "502", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67i1kv", "Reddit_id": "dgtt8ov", "Subreddit_id": "t5_2qh0n", "Commenter": "TheGreatMrJones", "length": "2797", "content_scrubbed": "I will tell you my story. I have spent 4 years doing my bachelors in mathematics, where I am from we don't have to take liberal_arts courses so I just took math courses. I spent 3 years doing my masters in a top european university and after that I did Cambridge Part III. I finally moved to the US for phD which I completed in 8 years, yes I had to do a lot of juggling with finantial support.\n\nAll in all, until I got my phD I studied 16 years of mathematics. Why? Well, I could have done my masters in less than 2 years and then move directly to phD which I would complete in 4-5 years like my colleagues, but one thing that I have is intelectual honesty, and I think the vast majority of young mathematicians and graduate students have very sloppy foundations and put many things under the rug. \n\nMy advisor was uttelry frustrated at me, because I didn't want to move forward unless I understood every single detail of every article I was reading. I specialised in Algebraic Geometry/Arithmetic Geometry and because of my relutance to go ahead without knowing what I was doing, I got my phD without publishing a single article. My colleagues, on the other hand, were using results and ideas that they didn't fully understand. It was when I realised that this was commonplace in academia and even some of the brughtest veteran professors did that I decided to leave academics and just study mathematics on my own, at my own pace.\n\nI don't doubt that you can publish and be successful and fill in continuously your background and even gain more insight of more basic things when you learn more advanced things. But until you get there, there is lot of intelectuyal dishonest and \"I have no idea what I'm doing\" feeling among researchers.\n\nSo I have been studying advanced mathematics for almost 25 years now, without having published a singel paper. During my student years I took Algebraic Geometry 5 times and only began to fully understand the basics by the 4th time. I have read all of the foundational work of Grothendieck, Bourbaki, and have gone sucessfully through Eisenbud Commutative Algebra with a View Towards Algebraic Geoemtry. This year I finished a task that took me almost two years of studying Cohomology of Number Fields by Neukirch. My goal now is to start studying Anabelian Geometry and then maybe I will try Mochizuki which wil probably take the rest of my years on this planet. \n\nLike Paul Halmos said, what fascinated him more in maths was to clearly understand the ideas instead of just discovering new results. If you want to study math and learn it very well and deeply, no need to spend money on a uni like I did. If you really want to discover new stuff and be on pair of the latest mathematical achievments, then you need to be inserted in the academic community. "}