{"doc_id": "245", "name": "2017_10_humanities_student_major_161_stockmarket", "namespace": "we1sv2.0", "metapath": "", "pub": "StockMarket", "title": "2017-10-humanities-student-major_161_StockMarket.txt", "pub_date": "2017-10-02T00:00:00Z", "Sentiment": "0.093", "Subjectivity": "0.3", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "397", "Permalink": "http://reddit.com/r/StockMarket/comments/73xm6d/why_cant_incoming_students_have_stocks/dnu0lj0/", "Threadlink": "http://reddit.com/r/StockMarket/comments/73xm6d/why_cant_incoming_students_have_stocks", "Parent_id": "t3_73xm6d", "Reddit_id": "dnu0lj0", "Subreddit_id": "t5_2qjuv", "Commenter": "OutOfBounds11", "length": "2408", "content_scrubbed": "That was the whole theory with student loans.\n\nThen, as soon as the money taps opened, colleges realized they could wildly expand revenue by offering degrees that pandered to marginal applicants and inflated their egos with degrees that offered little or no utility.  Then the for-profits realized the same thing and the program exploded.  \n\nIf you're old enough, you can remember that all of the sudden there were \"beauty colleges\" everywhere that taught hair styling.  Then technology colleges started sprouting up.  These schools were graded by the government on their graduation rate and their students' employment after graduation.  Shoddy schools just began to only give lip service to standards and just shuttled students through a long series of courses (more revenue) and graduated everyone to meet rates needed for the government. They established \"job placement\" programs to make sure they hit the required minimums but realized the placements didn't have to be in the proper field.  so when they placed a grad in a shitty job somewhere barely inside their field and the grad balked, they could just mark it as job refused - \"Hey, not our fault.  Right?\n\nSo now there are many college grads who truly possess diplomas that are little better than their high school diplomas and there are many graduates who possess diplomas in disciplines that are of little real use in a society unless they pursue post graduate teaching positions.\n\nSo, that[.] how the government did it.\n\nNow how would the private sector do it?  The rates would increase and a candidates wages would automatically be (virtually) garnished right after graduation.  Few candidates from the diploma mills would be eligible and many urban universities and community colleges would have to close.  Interestingly enough, the arbitrageurs would probably move in and begin to finance trade schools as the length of education - to - route to higher income ratio would probably mark the sweet spot for higher rates of return.  We would lose a lot of marginal diplomas and probably end up with an under-trained middle management (even more so) but would end up with better tradesmiths.  We could see an uptick in STEM studies and almost no endowment for Arts and the Humanities - so: good for efficiency and bad for society.\n\nSo do we want a purely political solution or a capitalist solution?  Perhaps the answer is somewhere in the middle."}