{"doc_id": "361", "name": "2017_10_humanities_student_major_1262_collegebasketball", "namespace": "we1sv2.0", "metapath": "", "pub": "CollegeBasketball", "title": "2017-10-humanities-student-major_1262_CollegeBasketball.txt", "pub_date": "2017-10-13T00:00:00Z", "Sentiment": "0.191", "Subjectivity": "0.362", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "280", "Permalink": "http://reddit.com/r/CollegeBasketball/comments/764ywy/ncaa_could_not_conclude_academic_violations_in/dobm3io/", "Threadlink": "http://reddit.com/r/CollegeBasketball/comments/764ywy/ncaa_could_not_conclude_academic_violations_in", "Parent_id": "t3_764ywy", "Reddit_id": "dobm3io", "Subreddit_id": "t5_2rj3j", "Commenter": "Withmere", "length": "1582", "content_scrubbed": "Actually informed UNC senior here.  Seems to be some misinformation about this floating around this comments.  These classes were not graded on attendance but rather on a couple of papers throughout the semester.  Yes, they were not very demanding classes.  The variance in class difficulty here is huge, some comp sci, math, and science courses here are extremely rigorous while african american studies, gender studies, and other \"liberal_arts\" classes take pretty much no effort.  It is more of a problem of the evolution of liberal education than anything athletic.  Plus the classes were readily available to be taken by anyone.  Being in a fraternity, we talk about easy classes for when there is a hole to be filled in a schedule that could use a GPA booster.  I know some friends who told each other to take these classes, and I'm sure the same conversation happens in locker rooms.  It[.] really more of a knock on the value of a UNC diploma than anything to do with the basketball team.  To address the \"tutors writing papers\" point, there are classes like BUSI 101 here that have tutors who make a living offering sessions to students for $50/hr.  These tutors have taught for the tests for years and know exactly how to teach you to get an A in under 4 hours.  Once again, kind of a knock on the teachers more than anything if a tutor can do their job in a fraction of the time.  Lastly, I'm sure this happens at other schools too.  I have friends at ECU and every class of every major is complete bullshit.  We have a higher education problem, not an athletic scandal.  "}