{"doc_id": "1266", "name": "2017_04_humanities_student_major_3210_getintostanford", "namespace": "we1sv2.0", "metapath": "", "pub": "GetIntoStanford", "title": "2017-04-humanities-student-major_3210_GetIntoStanford.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.116", "Subjectivity": "0.462", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "310", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_683qvc", "Reddit_id": "dgvut8y", "Subreddit_id": "t5_3gect", "Commenter": "timetravel_scientist", "length": "1769", "content_scrubbed": "I'm only a junior so take this with a grain of salt.\n\nI think yes, but not in the way you might think. But that[.] only because Stanford is trying to move away from being perceived as a \"majority techie\" school. The fuzzy-techie divide can be seen by many, and a lot of people associate Stanford with its relationship to Silicon Valley. However, as the Dean of Admissions said, Stanford is amazing at the humanities too. So they're trying to get the best people for that too. \n\nYes, there are less fuzzy applicants in the pool, meaning that technically they have a statistically higher chance (still crazy low). However, the pool is still extremely competitive, and in order to decrease the luck factor, it[.] not enough to just be interested in the humanities, you need to excel at them.\n\nI don't think this is worth worrying about, though. I mean, if you're not truly interested in the humanities, it[.] literally impossible to fake it. Just apply for what interests you. As a half-fuzzy half-techie prospective applicant, I feel that stripping away either side of me wouldn't be a true representation of \"me\" and would, therefore, create an artificial, fake image. Sure, I could present my humanities side for higher chances, but it[.] not a good idea, simply because it[.] not me.\n\nIn short, the answer is yes. Fuzzies have a higher chance (still tiny). But then again, it depends on the school. Techies, for instance, would have a higher chance at Yale or Brown, where those applicants are less represented. It[.] about building a class, so all you can do is just focus on what you care about and sell yourself.\n\nNote: If there are any students who were actually accepted and wanna correct me on any of this, feel free, I'll happily edit my answer. Again, only a junior."}