{"doc_id": "363", "name": "2017_10_humanities_student_major_1267_canada", "namespace": "we1sv2.0", "metapath": "", "pub": "canada", "title": "2017-10-humanities-student-major_1267_canada.txt", "pub_date": "2017-10-13T00:00:00Z", "Sentiment": "0.115", "Subjectivity": "0.265", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "315", "Permalink": "http://reddit.com/r/canada/comments/7657by/universities_introducing_term_limits_for_canada/dobriyq/", "Threadlink": "http://reddit.com/r/canada/comments/7657by/universities_introducing_term_limits_for_canada", "Parent_id": "t1_dobna98", "Reddit_id": "dobriyq", "Subreddit_id": "t5_2qh68", "Commenter": "notangryjustupset", "length": "1795", "content_scrubbed": " But what if the focus is on \"softer\" skills? Teaching skills? Advising skills? The type of talent that this person can draw into the school? (remember, faculty are the big names and the big brains of research groups, but the students that they pull in are the ones who do the work).\n\nIt pretty much works like that. Number of publications at top journals are usually the metrics to measure an academics quality at a research university. It[.] not a perfect measure. But it[.] a lot more relevant then; by god but what is this person[.] skin color?\n\n But what if the focus is on \"softer\" skills? Teaching skills? Advising skills? The type of talent that this person can draw into the school? (remember, faculty are the big names and the big brains of research groups, but the students that they pull in are the ones who do the work).\n\nResearch quality is what usually attracts students and creates the 'prestige' of the program. If it[.] a program like a business school, then maybe their is more emphasis on connections. Small liberal_arts schools like Glendon might focus more on teaching and the teachers being personable. Either way your total absence of knowledge on how programs run themselves is a great argument against top down hiring requirements. Isn't it better to assume that the people who run the department know is best to hire to improve the program.\n\n \"Better\" doesn't cut it, or else our hiring committees would be able to send out offers based on our Google Scholar profiles.\n\nThey basically do. In my field tenure is based on publications and making sure that you aren't a total asshole. Offers for tenure track positions are based on a job market paper and the program you come out of. Maybe in more meritocratic disciplines, they look at whether you have a penis or a vagina.\n"}