{"doc_id": "1134", "name": "2017_04_humanities_student_major_1980_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-04-humanities-student-major_1980_politics.txt", "pub_date": "2017-04-17T00:00:00Z", "Sentiment": "0.12", "Subjectivity": "0.313", "Score": "16", "Upvotes": "0", "Downvotes": "0", "Wordcount": "512", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dge71en", "Reddit_id": "dgehfjp", "Subreddit_id": "t5_2cneq", "Commenter": "smigglesworth", "length": "2986", "content_scrubbed": "I also live in China and am constantly interacting with Chinese students who echo that sentiment. To be honest, I find it to be quite short-sighted of them which is no surprise. Throughout American history, our rise has never been a steady line up. Calamity after calamity have struck the foundations of our Democracy. From the battles over the Constitution, to the Civil War, to the time of the Robber Barons, Women[.] Suffrage, the Great Depression, and the Civil Rights movement, Americans find a way to overcome and fight for progress and greater equality. \n\nRight now things look dark for the USA and brighter for China. However, Donny Moscow will meet Lady Justice in due time and the backlash against the GOP will be vicious. If it can provide a pathway towards single payer healthcare, K-16 public schooling, infrastructure investments, renewable energy development and an appreciation of arts and humanities all of which would change America significantly for the better. If it can come with changes to partisan gerrymandering, public funding of elections, and strong regulations on the press (bring back the Fairness Doctrine for starters) then the USA would begin to truly transform.\n\nIt might be speculation, but so is this concept that Trump will automatically usher in the Pacific Century. Trump will be impeached, or he will resign, or he will be voted out. You certainly cannot say the same thing about the Pres. Xi. I think he is doing a fantastic job right now, but it does also seem like there is a consolidation of power and rumors that he wants to continue his grip on power for many many years to come. While that can be great, we can also see examples like Putin and Erdogan that are not as positive. \n\nI think Chinese students absolutely have a lot to learn about tolerance and democracy, they should also learn more about our system of checks and balances. While Donny might have an Executive Order to ban immigrants, we have a court system in place to strike anything down that is (as it was) deemed unconstitutional. While Donny might be tweeting nonsense, that is going into a mountain of evidence tying his campaign to Russia. \n\nI think the Donald Trump presidency/debacle will be a cathartic experience for America. He is making us take a good long look in the mirror and realize that if we don't vote, 40% of the crazies will determine who our President is. And yes, if you think climate change is not real, or that social programs don't help people, or that the drug war isn't an abject failure, or that immigrants don't bring far more than they 'take', or that a privatized healthcare program is better than single payer healthcare, or that investment in military is better than investing in the education (when our military is the hands down the most advanced in the world), then you are most certainly amongst the crazies. \n\nEnd rant.\n\nEdit: grammar stuffs\n\nEdit 2: Fixed giant gaffe at the end, thanks for pointing it out so eloquently /u/manticorpse "}