{"doc_id": "964", "name": "2017_04_humanities_student_major_458_german", "namespace": "we1sv2.0", "metapath": "", "pub": "German", "title": "2017-04-humanities-student-major_458_German.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.057", "Subjectivity": "0.332", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "271", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63ixbb", "Reddit_id": "dfut1lk", "Subreddit_id": "t5_2qq51", "Commenter": "spado", "length": "1533", "content_scrubbed": "As a German who moved to the UK for a Master[.] program... I think *real* fluency is something that you achieve only living and working in a country. I had some eight or ten years of school courses behind me when I went, plus reading English articles during my undergrad, but my English improved dramatically during my first six months of living there. So I think, realistically, it would be extremely hard for you to move to Germany, start to study, and expect to keep up with the native speakers in terms of speed and quality of work. \n\nThat being said -- \n\n* it depends highly on the subject you would study: a science degree program would (at least initially) focus much more on your ability to acquire formal methods and require less ability to produce fluent German, compared to a humanities degree;\n* the question is whether you need to aim at the standard six semester timeline for a bachelor[.] degree for some formal reason (or funding). If you are more flexible, and can afford to lose a semester or two in the course of your studies, I think you would be fine - because you could initially study a \"half course load\" and hone your language skills, increasing your course load over time. \nI'm not sure I followed your comment about taking courses only in English: but unless in very specific circumstances I don't think that[.] a viable option. There are very few bachelor programs that are taught completely or predominantly in English (it[.] different at the Master[.] level).\n\nGood luck, and PM me if you have any questions."}