{"doc_id": "947", "name": "2017_04_humanities_student_major_250_mcat", "namespace": "we1sv2.0", "metapath": "", "pub": "Mcat", "title": "2017-04-humanities-student-major_250_Mcat.txt", "pub_date": "2017-04-03T00:00:00Z", "Sentiment": "0.073", "Subjectivity": "0.287", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "847", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_62gmde", "Reddit_id": "dfrsi0z", "Subreddit_id": "t5_2saxp", "Commenter": "arkm_iv", "length": "4883", "content_scrubbed": "Posting super late, but thought better super late than never. Anyhow, been lurking around here since January. Never had reddit before but made an account just for this sub. \n\nBackground: Graduated last May and first time taker of the MCAT. Dreaded over taking this beast for the longest time ever. Would do on/off studying during senior year, but it never amounted to anything seriously useful considering my extracuriccular commitments and courseload (was a double major with one in the sciences and one in the humanities). \n\nStudy plan: Started my gap year by spending summer 2016 overseas, visiting extended family (couldn't really study over there although I had intended to). Came back mid-September and began proper content review, which lasted until Christmas. Used Kaplan[.] 7 book set and some Khan Academy for that. While studying, worked part-time to have some source of income. Eventually began doing FLs weekly after New Year[.]. Started with Kaplan (the diagnostic and the first 5) and then moved on to Next Step (the diagnostic and the first 3). Come March, and it was time for me to exclusively utilize AAMC material. Took the Unscored Sample FL during the first week of March. Next, I proceeded on to complete the Q-Packs and the SB. Finally, I completed the AAMC FL1 and AAMC FL2 on the second to last and last Mondays of March respectively. \n\nPractice material scores: Kaplan average: 505. Next Step average 509. AAMC Scored: 78%. Q-Packs: High 80s and low 90s. SB: 70s. AAMC FL1: 512. AAMC FL2 516\n\nPre-exam: Let me start off by saying that although I may or may not meet the requirements to be diagnosed with generalized anxiety disorder, I nonetheless do develop severe and often debilitating levels of anxiety leading up to big or sometimes not-so-big events in my life (giving a class presentation comes to mind). Thus, you can bet this exam had its way with me on Friday. I could not sleep on any of the 3 nights leading up to test day as I would, night after night, find myself stuck in this hypnogogic state (sometimes for hours) during the night, involuntarily rehearsing physics equations, metabolic pathways, amino acids, their properties and single letter abbreviations. The night before test day, I could only get 4 hours of sleep and had to live with the results (nonstop twitching of my left eye and nose during the first half of the test and a locked-in migraine during the second half). However, I should say that I have previously fought through my anxiety time and time again and I usually do come out on the other side just fine. Still cannot speak for this time. \n\nThoughts on exam: C/P - While I have done my best to nail down everyhing physics for the MCAT, it was devastating to see this section sideline physics and play to my dreaded weakness.. Orgo! Definitely should have focused more on organic chemistry lab techniques and the reactions that accompany them. The general chemistry on there was really heavy on long and tedious multi-conversion calculations and I don't remember there being any general chemistry conceptual questions (someone correct me if I am wrong). Getting bombarded with consecutive Orgo questions completely shook me and threw me off for the remainder of the section. I am positive that I messed up many of what would have otherwise been long-but-easy calculations.\n\nCARS - Traditionally my weakest section. I was literally scratching my head reading that prose garbage. Wasted so much time on it and I bet I got most of its questions wrong anyway. Because of prose, I ended up running out of time and having to guess on the last question of Olmstead. Everything else is a blur and I would not be surprised if I got below 125 on this (used to range between 125 and 129 on practice FLs).\n\nB/B: While this was the most fair section on the exam, it was however loaded with many detailed content-based questions and did not have too many questions that require you to interpret figures and numbers. It was not too similar to the SB, which I studied meticulously... hooray.\n\nP/S: This is usually my best section, but 03/31 said \"not today bud.\" Very heavy on sociology (probably more than 65% of the section), which is not usually the case with the practice material. There were definitely some terms on there that I had never encountered before, not on Khan Academy, not in Kaplan, or any of the other third party materials I have used. Then there was that one question about the BBB where I thought that no one could have intentionally gotten it correct with out having taken an Anatomy or Neuroanatomy course. All in all, this test did not want to cut me any slack and this section was definitely the shit-icing on the shit-cake that was the March 31, 2017 MCAT Examination.\n\nMy goal was a 514+ but I would be lucky if I get a 505 on that sucker... One month of agony and nightmares. I'll see you guys on the far side..\n"}