{"doc_id": "1009", "name": "2017_04_humanities_student_major_823_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2017-04-humanities-student-major_823_AdviceAnimals.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.075", "Subjectivity": "0.286", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "312", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfzotik", "Reddit_id": "dfzplz3", "Subreddit_id": "t5_2s7tt", "Commenter": "tdoger", "length": "1711", "content_scrubbed": "To your first point: Two examples don't prove anything. You have to have a much bigger sample size than that. This year my dad will bring in around 1 to 1. 2 million dollars in just this year alone and didn't graduate college. Does that mean everyone should not graduate college? No. He[.] an outlier.\n\nTo your second point: Getting a good focused degree doesn't mean you have to be miserable at your job. There[.] a lot of variety when it comes to good degrees, and you can do almost anything with good degrees.\n\nTo your final paragraph: I'm not in any way shape or form bashing on mathematics, science, or some of the social_sciences. I'm strictly bashing on general degrees. i. e. A literal liberal_arts degree, Psychology (if you don't get a masters is not great either), most art degrees, etc. If you talk to successful people, like many of the millionaires and billionaires out there they would laugh at you if you said you want to major in liberal_arts, psychology, or gender studies. They would ask why do you even go to college? College is not for everyone, that is well known and pretty commonly preached by the very successful people now of days. College is pretty much only expected by people in the middle and upper middle class (50k/yr to around 150k/year). But, if you go to college, you are getting in to debt for no reason if you don't pick a good major. My sister got her bachelors in Psychology a couple years ago. Guess where she is at in life? Managing a coffee shop in texas. Barely an upgrade from my younger sister[.] job at a coffee shop back home. What[.] the difference? One has a Psychology degree making 40k a year, the other is in high school making 20k. That degree was very helpful. /s"}