{"doc_id": "948", "name": "2017_04_humanities_student_major_261_ems", "namespace": "we1sv2.0", "metapath": "", "pub": "ems", "title": "2017-04-humanities-student-major_261_ems.txt", "pub_date": "2017-04-03T00:00:00Z", "Sentiment": "0.108", "Subjectivity": "0.271", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "368", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_635pyr", "Reddit_id": "dfs0gz6", "Subreddit_id": "t5_2rmg0", "Commenter": "slushster", "length": "1999", "content_scrubbed": "I think I could have some feedback for you. Im currently a freshmen at Penn State and I got my EMT card my senior year of high school and volunteered for almost year outside of NYC before coming up to PA. Im majoring in Biomedical Engineering with the ultimate goal of EM. A few things to note: My agency is on campus and hires only students. We cover campus and we do get mutual aided to surrounding areas.\n\nPros\n\n1. There is zero burnout in college EMS. I worked outside of NYC before I left for Penn State and the amount of salt I was exposed to was honestly astounding.\n\n2. You establish a really solid group of friends and you go out and get shit faced together.\n\n3. You get to run around code 3 with another college student. Doesn't get more fun than that.\n\n4. I loved working 911 so I get to continue what I did anyway, but you're paid! My service has no [.]et commitment' so thats nice too.\n\nCons\n\n1. If you're majoring in something outside of just premed, bio or some liberal_arts, you won't have much time. When you're not studying, at a party, working, or on r/place theres not much else you have time to do. \n\n2. Conscious alcohol overdose, conscious alcohol overdose, *unconscious* alcohol overdose, conscious alcohol overdose, conscious alcohol overdose with trauma to the forehead, conscious alcohol overdose. Get used to it.\n\nTL;DR - If I were you, i'd do it but only because I really, really enjoy it. If you wouldn't do it even if it was volunteer, I'd say don't do it and stick with working EMS during summers. Yes, my GPA definitely did struggle a little bit but I do not care. Im doing what I really like to do all the while learning, and I'd continue to do it even if they stopped paying me. Make you're you're up for the challenge because I cannot stress enough, **it[.] a lot**. \n\n\nEdit: The networking you get exposed to though *campus EMS* is incredible. Note that if its not university run and the majority of employees are career EMTs theres not much networking you can do."}