{"doc_id": "949", "name": "2017_04_humanities_student_major_268_askwomen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskWomen", "title": "2017-04-humanities-student-major_268_AskWomen.txt", "pub_date": "2017-04-03T00:00:00Z", "Sentiment": "0.191", "Subjectivity": "0.429", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "703", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_636khf", "Reddit_id": "dfs4dpv", "Subreddit_id": "t5_2rxrw", "Commenter": "squiderror", "length": "3801", "content_scrubbed": "* There is sunshine most of the year, it doesn't get ungodly hot in the summer, it doesn't freeze over in the winter. You don't have to dress in layers or shovel your walkway. You do have to pay for AC and wear sunscreen.\n\n* I lived in a major mid-Atlantic city before I moved here, and I made as many friends here in six months as I did in the three years I spent there. Both areas are pretty transient, but people are happier and friendlier here.\n\n* there is a neighbourhood, a bar, a festival, and a scene for you. Whatever it is you're into, there[.] a place nearby catering to that lifestyle or mood and there[.] probably an event in the area for it at least once a year. \n\n* while not noted as \"historic\" in a school book sense, the area has a lot of cool history and historic areas.\n\n* incredibly LGBT+ friendly, both in Tampa and St Pete\n\n* short drive to the best beaches in the country (according to a lot of travel sites), our own theme park, an hour to Orlando and all of those theme parks. \n\n* with all the water nearby, there[.] loads of outdoor sports - not just fishing and saltwater stuff but also kayaking, scuba and snorkeling, etc. there[.] always races to run because it[.] constantly nice outside. Want to off road in the truck Or Jeep? We have that too. Tons of parks and beaches and everything for anyone outdoors. \n\n* so many craft breweries, and gaining on distilleries. Seriously, there[.] over 60 breweries, brew pubs, etc within an hours drive. I take many out of town guests on brewery loop tours and can hit new ones or different ones all the time. And they're good too - remember when I said festivals? Beer festivals included, too. Next week it my favorite beer festival of the year because it[.] all sour, barrel aged, or \"different\" beers. There[.] also the beer festival at the aquarium. Or the one held that it costs over $100 per ticket, sells out quickly, and is attended by breweries all over the US... but no one ever names our state when they think of craft beer states.\n\n* the coffee scene is also up and coming and amazing!\n\n* we have a yearly event where most of the city dresses up like pirates and gets shitfaced. Also, if you attend it, there[.] essentially a pirate themed Mardi Gras. \n\n* cost of living isn't terrible. Yes, there are places around here that are expensive, but you don't have to live there. Nor do you have to live in the slums to pay cheap rent. Everything is pretty affordable, and generally the job market is pretty great. \n\n* if you need assistance, or want to volunteer, there are loads of awesome charities and nonprofits.\n\n* so many artistic and cultural events. The arts are alive and real here, not hard to connect with other local artists, always gallery openings, concerts, etc.\n\n* Sports for all! NFL and MLB teams that are OK, a NHL team that[.] been pretty exciting the last few years, USL soccer making a bid for MLS, and major MLB teams host their training camps here in the spring so you can see them too.\n\n* most musical artists will stop here on tour, as we have several awesome venues! \n\n* a lot of great bands started here, and also the birthplace of Metal. You're welcome. \n\n* Cuban food.\n\n* incredibly dog friendly!\n\n* Even the \"unsafe\" areas of town aren't scary, especially compared to other major cities. \n\n* not terrible school systems nearby, school choice for many, great colleges in the area too. \n\n* if you move far from family, you now live in a destination city so they want to come see you instead of you seeing them. Saves you money!\n\nWhere: Tampa and St Pete, Florida \n\nI never once wanted to live in this state growing up, and honestly if it weren't for all of the aforementioned things (especially the friends I've made) I would have moved on by now. Turns out it[.] worth it for now and I really like it. \n\n"}