{"doc_id": "1021", "name": "2017_04_humanities_student_major_928_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2017-04-humanities-student-major_928_college.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "0.155", "Subjectivity": "0.481", "Score": "42", "Upvotes": "0", "Downvotes": "0", "Wordcount": "522", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64ak00", "Reddit_id": "dg0riv8", "Subreddit_id": "t5_2qh3z", "Commenter": "SnowblindAlbino", "length": "3066", "content_scrubbed": "So with a grain of salt: I am also a professor, apparently with more/longer experience than OP, and I disagree with some of this advice.  Particularly #3... there are ~4,500 colleges in the US and whatever people might say the \"product\" they offer is not consistant across all institutions. Not all colleges are created equal, and not all offer equal educational opportunities. In fact, there is a tremendous gulf between poor/middling/elite schools both in subtance and in outcomes-- in part due to who is in the seats next to you. If you choose to attend a highly selective school you will be in classes with other high-performing students, which raises the bar in almost every way. It is also likely to mean you will benefit from a much better network after college-- who you know is important, and it doesn't require an Ivy degree for that to make a difference. \n\nOn a more practical basis, not all students are well suited to all types of schools. Some may do well in a lecture hall setting with 400 classmates, while others will thrive only in small classes (say 20-25) with much more direct attention from the instructor. It[.] important to know the difference between types of schools and to determine which fits your needs. There are also a lot shitty schools out there, to be frank, where faculty don't care about teaching and admins care only about revenues... fine for many people, but others will be much happier in a setting that offers more support, more services, and is more student-focused. Those are also quite often more expensive. But look at outcomes: OP is correct to suggest that many students drop out; graduation rates at many large public schools are <50%. There are also private schools with graduation rates of 85%+. Cheapest does not always mean most cost effective.\n\nFun fact: for many students an \"expensive\" school can be cheaper than a \"affordable\" one if you are simply comparing sticker price. Private colleges engage in [tuition discounting](https://www. agb. org/briefs/tuition-discounting), which means few students actually pay the sticker price; much of that is  done through merit aid so high-performing high school students should never decide \"I can't pay for that school\" until they have received a finacial aid package for comparison. At my school-- which indeed has a high price tag --a strong applicant from a family with $100K income might well end up paying less than they would at State U, which will not offer the same aid. They are also likely to require five years to graduate from State (because classes are often full) wheras our four year graduate rate is 2X that of State.\n\nIf all you care about is a credential-- a BA or BS on a piece of paper --then perhaps going to the absolute cheapest school you can find makes sense. But if you want an *education* it[.] worth being a bit more discerning about the process and taking into account more than just price. I say this as someone with degrees from public and private schools, and 35+ years experience as a student or profession in a wide range of institutions."}