{"doc_id": "268", "name": "2017_10_humanities_student_major_345_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-10-humanities-student-major_345_ApplyingToCollege.txt", "pub_date": "2017-10-04T00:00:00Z", "Sentiment": "0.216", "Subjectivity": "0.33", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "404", "Permalink": "http://reddit.com/r/ApplyingToCollege/comments/74bpqf/stanford_freshman_ama/dnxm6dv/", "Threadlink": "http://reddit.com/r/ApplyingToCollege/comments/74bpqf/stanford_freshman_ama", "Parent_id": "t1_dnx9cta", "Reddit_id": "dnxm6dv", "Subreddit_id": "t5_2y2r8", "Commenter": "notanotherjanet", "length": "2216", "content_scrubbed": "I'll just copy and paste the email I sent to one of the admission officers when I told them my decision. In the end, it wasn't that MIT was a worse school - it was just that Stanford fit me more.\n\n\"... First off, thank you for being so understanding!\n\nI'll be attending Stanford University this fall. I reevaluated my priorities and realized that I mostly wanted to pursue design more than engineering. At Stanford I could do both, and even major in product design, but at MIT I'd be more confined to engineering. There were also more opportunities to pursue classical art, and I realized I'd take having to bike to palo alto to visit the city over being frustrated over a lack of outlets for what I wanted.\n\nIt also felt like there were more opportunities to get involved in activism, and I really enjoyed Okada, Stanford[.] Asian-American ethnic theme dorm, and the Asian American Activities Center. I also liked the quarter system (even I loved IAP and P/NR), and the flexibility of the general educational requirements at Stanford. Coming from a very STEM-focused school, I also liked the student body[.] diversity of interests, and enjoyed meeting people who were majoring in the humanities or arts. I think the tipping point was when I considered my admit weekend experiences at both schools -- I didn't really connect well with anyone at CPW despite the 3+ days I spent there, but met a lot more friends in the 2 days I was at Stanford.\n\nI think the main reason why I was so indecisive was because MIT was a lot more familiar to me -- I knew a lot more students at MIT and had spent a month living on campus over the summer at WTP. I knew the campus, majors, GIRs, dorms, and slang. Even though Stanford felt like a better fit to me in terms of academic offerings and student life, I felt too scared of the unknown. But I realized after I enrolled at MIT that there would be a lot more things I'd regret if I didn't attend Stanford and, even though I'd definitely still learn a lot at MIT, I wanted to push myself out of my comfort zone even more. \n\nBut regardless, MIT, in all of its spontaneous, unabashed nerdiness, will always hold a special place in my heart. I wish I could've chosen more than one school.\""}