{"doc_id": "237", "name": "2017_10_humanities_student_major_109_philosophy", "namespace": "we1sv2.0", "metapath": "", "pub": "philosophy", "title": "2017-10-humanities-student-major_109_philosophy.txt", "pub_date": "2017-10-02T00:00:00Z", "Sentiment": "0.148", "Subjectivity": "0.315", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "478", "Permalink": "http://reddit.com/r/philosophy/comments/73st03/teaching_philosophy_to_children_cultivates_doubt/dnt38y8/", "Threadlink": "http://reddit.com/r/philosophy/comments/73st03/teaching_philosophy_to_children_cultivates_doubt", "Parent_id": "t1_dnt064c", "Reddit_id": "dnt38y8", "Subreddit_id": "t5_2qh5b", "Commenter": "regula_et_vita", "length": "2908", "content_scrubbed": "Bear with me for a longish answer--I spent most of my undergrad years in a Phil department, so I ask myself the same question every so often.\n\nMost of the jobs that sort of education prepares you for aren't just transpositions of the program. If you study e. g. civil engineering, you learn to be a civil engineer. Philosophy/liberal_arts are sort of like \"meta-disciplines\" in the sense that, rather than developing your expertise in some particular niche, they instead train the broader sorts of skills that govern how well and how thoroughly you can deal with the world, information, and increasingly complex/abstract concepts (which actually makes pure math a great major to pair with a philosophy education). Depending on the program and your interests, you get exposed to analytical thought, ethics, approaches to knowledge, formal and informal reasoning, rhetoric, aesthetics, political theory.\n\nIt[.] hard to explain, because no two philosophy programs are really the same (and because someone can always take any individual skill and say \"Oh yeah well I could just learn [skill] in [other major], so what does philosophy *really* teach you?\"), but the general idea is that you learn to ask, entertain, and maybe begin to answer the types of questions that burrow deep, *deep* into the bedrock of the way you look at and live in the world, and of what you think you know, and *how* you think you know it. And, if it sticks, you can't help but reflect like this *all the time*.\n\nIt[.] a double-edged sword, to be sure: one of the reasons (I think) a lot of people with undergrad philosophy degrees ultimately turn out to be insufferable blowhards is that they get a little knowledge under their belt and enough formal training writing papers and getting comfortable with the lingo to show off by asking/saying deep-sounding things among the uninitiated (which anyone of any discipline can do around laypeople, but which is *especially* easy to do with a philosophy education)--but they ultimately don't care about getting the answers, or care *enough* about getting them, to use those tools as instruments of self-examination.\n\nLike I said about pairing it with math: I think it[.] a good major to get alongside something more traditionally practical, like engineering, or physics, or computer science. I think it can do great things to the human brain--it adds a certain dynamism and freedom of thought where someone might otherwise end up pigeonholed by their education or upbringing--and I'd much sooner employ an engineer, physicist, or computer scientist with a joint philosophy/humanities background than a one-trick pony.\n\nMaybe you treat it like a multiplier: by itself, philosophy education may not seem to amount to much; but, woven in among all the other important and useful things in your life, the fruit they ultimately bear will be more delicious and bountiful than you could have imagined."}