{"doc_id": "227", "name": "2017_10_humanities_student_major_26_ukpolitics", "namespace": "we1sv2.0", "metapath": "", "pub": "ukpolitics", "title": "2017-10-humanities-student-major_26_ukpolitics.txt", "pub_date": "2017-10-01T00:00:00Z", "Sentiment": "0.029", "Subjectivity": "0.273", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "341", "Permalink": "http://reddit.com/r/ukpolitics/comments/73kv71/british_universities_reach_out_to_the_new/dnr5173/", "Threadlink": "http://reddit.com/r/ukpolitics/comments/73kv71/british_universities_reach_out_to_the_new", "Parent_id": "t1_dnr3g0g", "Reddit_id": "dnr5173", "Subreddit_id": "t5_2qhcv", "Commenter": "flusskrebs", "length": "2079", "content_scrubbed": "\nThe social_sciences are poorly run\n\nAll University Social Science departments are poorly run. Riiiiiight, sure, pull that one straight out of your arse. \n\nnot based in science\n\nAlso incorrect, the definition of a social science subject is trying to apply scientific methods to subjects revolving around human behaviour. Humanities subjects which aren't based in science, like philosophy or history, aren't based in science *because they aren't science subjects*. Scientific methods aren't by any means the answer to everything. You might no that if you'd studied some philosophy of science, but, oh wait, it[.] not a science subject so in your opinion isn't worth studying.\n\nand give students nothing of job value. \n\nThe assumption here is that the purpose of education is to contribute to economic activity. Whilst that certainly is a purpose for some people and some courses more than others, as someone else in this thread pointed out, theoretical physics vs civil engineering obviously have different job values later in life. The primary purpose of univeristy education, in my opinion at least, ought to be to further the acquisition of knowledge and promote knowledge throughout society. At the very least this is an equally worthwhile purpose in comparison to 'job value'\n\nI'd much rather student finance go to something like STEM field subjects, that will contribute.\n\nI would never close down or ban them, just make it so if you want to study them, you need to self fund.  \n\nThe sole effect of this would be that the Arts and Social Sciences would become the sole domain of those who can afford to go to university without student finance. Normal people who can't afford to pay £9250 out of their own pockets every year would inevitably know less about, and contribute less to cultural and artistic discussion, production and academia in general, which would have dreadful social consequences. Think this through a bit maybe.\n\nCritical thinking might have helped you out here with your ideas, but then again that[.] just a non-STEM skill so it[.] probably not any use.\n\n\n\n"}