{"doc_id": "385", "name": "2017_10_humanities_student_major_1480_wtf", "namespace": "we1sv2.0", "metapath": "", "pub": "WTF", "title": "2017-10-humanities-student-major_1480_WTF.txt", "pub_date": "2017-10-16T00:00:00Z", "Sentiment": "0.09", "Subjectivity": "0.364", "Score": "30", "Upvotes": "0", "Downvotes": "0", "Wordcount": "442", "Permalink": "http://reddit.com/r/WTF/comments/76mhmz/men_who_dont_wipe_their_asses_because_they_think/dogakmz/", "Threadlink": "http://reddit.com/r/WTF/comments/76mhmz/men_who_dont_wipe_their_asses_because_they_think", "Parent_id": "t1_dofv87o", "Reddit_id": "dogakmz", "Subreddit_id": "t5_2qh61", "Commenter": "DickilusCage", "length": "2431", "content_scrubbed": "Likely there is nothing wrong with you. \n\nI used to think, back in HS, that I was really ugly, and unpopular.  My self confidence was fucking garbage.   College about the same.  I did my best to smile, make jokes and participate, but i always had this feeling people were laughing at me behind my back.  Like i was invited to events to be the butt of a joke.\n\nNow, a major turning point for me was one day, (the college was a 200 year old building with single room unisex bathrooms) i saw on the wall, \"(my name) is hot.\" and under it, someone with another pen, in different handwriting wrote \" Yes he is.\".\n\nMade me realise, other people didn't see me the way i saw myself.  People invited me cause they wanted to hang out with me.  Apparently two people thought i was hot.  Man? woman? no idea. Didn't matter.   It made me realise it was my own BS that was holding me back.  \n\nJust trust that you are enough. If you do good, dont hurt others and build confidence that your decisions are good, women notice.  \n\nMy best friend at the time, (dawn of internet) would use the early social media sites, and write to every girl he thought was cute.  After a literal 1000 rejections, he was immune to rejection, and suddenly he was \"the man\".  He didint care if someone said no.  But his approach was now super confident cause he wasn't afraid of the outcome.  The ladies noticed, and last couple years of HS/College he was in the ladies department the chadiest chad that ever chadded the world.  Except he was nice, and thoughtful and all the the things i \"was\" too. But, he just learned that through intense rejection phase that it was how you value yourself that other see in you.  Mind you, hes 5'5'' and built like a tiny bear.   hairy, and stocky.  Not a classical beauty in any way. He[.] a smart guy, who dressed nice, and believed in his own value.  I learned a lot from him.  Taking what he taught me through observation, and that incident reading about people thinking i was attractive, it really turned my life around.  I started dating, having fun, and used my new found confidence to build a lucrative career in the arts.  A very social business.\n\nIf you are a woman, the same thing applies. Its not about gender or even looks to be honest.  So long as you try to maintain good hygene, clean clothes and some semblance of thought into your appearance, people will respond to your confidence, charm, intelligence and humor.  "}