{"doc_id": "506", "name": "2017_10_humanities_student_major_2761_mgtow", "namespace": "we1sv2.0", "metapath": "", "pub": "MGTOW", "title": "2017-10-humanities-student-major_2761_MGTOW.txt", "pub_date": "2017-10-28T00:00:00Z", "Sentiment": "0.042", "Subjectivity": "0.296", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "277", "Permalink": "http://reddit.com/r/MGTOW/comments/79aam1/for_my_younger_mgtow_brothers/dp0tb5e/", "Threadlink": "http://reddit.com/r/MGTOW/comments/79aam1/for_my_younger_mgtow_brothers", "Parent_id": "t3_79aam1", "Reddit_id": "dp0tb5e", "Subreddit_id": "t5_2sjgc", "Commenter": "mgtown", "length": "1639", "content_scrubbed": "I can attest to working out as meditation. But it also changes your priorities, and your motivations change from being shame and guilt driven to greed and happiness driven.\n\nThere will be an additional hurdle, if you're a student. You will need to actually use studying techniques or switch to project-based learning. The school system up until the first year of University is entirely based on shaming you with grades and threats of losses of employment potential.\n\nThis changes as a senior University student, when you feel pride in building something for yourself. \n\nThis is why Tech and engineering is associated with men. Mostly project-based learning, aligning well with those who are only learning what makes them happy. \n\nWhere as Humanities is entirely guilt and shame driven, where women who never tried going to the gym for a serious workout tend to huddle. \n\n\nYou can literally tell a person[.] most basic motivational factors by simply looking at there body. Fat-shaming is real, but the way feminists talk about it is wrong. If you find yourself being treated poorly by your boss at work, 90% of the time it[.] because he saw your body shape and decided your prime motivational factor was guilt/shame. This happened to me, and when I finally confronted myself and lost weight followed by a new body shape, my boss' hesitation in dealing with me became palpable. He stopped negatively dealing with me in front of everyone and only dealt with me in private, but with a more civil tone and dialog.\n\nI didn't gain his respect or anything. He always respected me based on my motivations. And he physically saw my motivations change."}