{"doc_id": "1032", "name": "2017_04_humanities_student_major_1020_civ", "namespace": "we1sv2.0", "metapath": "", "pub": "civ", "title": "2017-04-humanities-student-major_1020_civ.txt", "pub_date": "2017-04-09T00:00:00Z", "Sentiment": "0.104", "Subjectivity": "0.328", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1507", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64edkk", "Reddit_id": "dg20vqh", "Subreddit_id": "t5_2rk3b", "Commenter": "ECoast_Man", "length": "9357", "content_scrubbed": "I don't mean to come off as a dick in the following post, but I'm going to refute it as a Canadian. Also, I don't think Australia should be a civ either for much of the same reasons, so that comparison isn't a good one IMHO.\n\n**Age**\n\nIt is 1867 at *earliest*, [1931](https://en. wikipedia. org/wiki/Statute_of_Westminster_1931) more likely, and arguably [1982](https://en. wikipedia. org/wiki/Constitution_Act,_1982). For the sake of this discussion, let[.] go with 1867. \n\n This will be discussed later.\n\nRemember this when I correct your version of WW1.\n\n An interesting thing to note here is the immediate division in ideals between the US and Canada, as early as the American Revolution. Canada did not follow suit in this revolution, and would later go to battle with the US as a result of this decision. \n\nSo you think it is interesting/coincidental that Britain (read - Canada at the time) did not follow suit during the American Revolutionary War which was *fought against* Britain?  As a sidenote - you're going to have to make a better argument which includes Quebec and Aboriginals if you want to convince people Canada is \"older\" than 1867.  Based on your metrics Canada is **not** considerably older than Australia and especially not Germany, given you are applying a \"loose\" definition of statehood to early Canada while simultaneously applying a ludicrously strict one to Germany.\n\n*No, we aren't \"older\" than Germany, and we are 1867 at absolute earliest*\n\n**Historical Significance**\n\nI'm going to premise this by reminding I don't mean to come across as a dick, but this entire section is riddled with significant historical revisionism/flat out errors. Examples, with edits in strikethrough and italics:\n\n Today marks the anniversary of *the first day, of the three day engagement of* Vimy Ridge, a bloody ~~battle~~ *engagement which was a small part of the month and a half long Battle of Arras* fought in WWI by the Canadians, *British and colonies and French*. ~~Vimy was deemed too difficult to take by other allied forces, and after their repeated attempts of capturing the fortifications failed, it fell to the Canadians to get the job done.~~ *All of this is incorrect. Don Cherry likes to say it like this, but it is not even close to accurate. There were prior engagements, like the 1915 Battle of Artois, but it was not a situation where \"the Brits and French couldn't do it, so only the Canadians could\"*  It was here that the creeping barrage was popularized *(correct, but more importantly it was the first time the Canadian Corps was under \"Canadian\" command, General Byng)* and here that the modern concept of giving senior NCOs details on the battle plan was put into good use. *(not incorrect, but it was really just sharing battleplans with all soldiers, not just officers and NCOs, it was not a \"Canadian\" innovation by any means, as Germany did this frequently for example)*.\n\nRemember I said I will discuss a point later about dates? Canada didn't even formally declare war in WWI, it was declared *for* Canada when Britain declared war.  A point to note when you're trying to argue about \"age\", when Canada did not even have authority to declare war until after WW1 without Britain[.] say-so.\n\n In WWII, Canada was ~~the main~~ *a major* source of pilot training for the British Commonwealth Air Training Plan. Countless flyers would be trained on Canadian soil and Canadian skies, before being thrust into the fires of war. On D-Day, Canadian forces faced a grave battle at Juno beach *(under British command)*, delayed by choppy seas, and made the more difficult by offshore bombardments missing most of the German defences *(like the other four beaches for the most part)*. Despite these odds, Canadian forces moved inward 7 miles, and were within sight of Caen airfield, but lack of materiel and support from the other invasion forces forced the Canadians to halt.\n\nI can't go through every little point, because there are too many, but:\n\n Throughout the 20th century, Canadian forces became increasingly more involved in international peacekeeping affairs *(such as? let me guess having a general in Rwanda? That[.] not \"increasingly more\" of anything)*. Canada is also accredited with *(oh really?, by who?)* many technological developments, including the inventions of insulin, the first widely used gas mask *(you mean a [British man](https://en. wikipedia. org/wiki/Cluny_MacPherson) who was part of the Dominion of Newfoundland (British), also a place that didn't join Canada until 1949?), the G-suit, the light bulb *(Henry Woodward did not invent the lightbulb, he played a role but this is one of those myths that won't die)*, and the handheld walkie talkie.\n\nThis is a paltry list compared to \"real\" civilizations, especially Germany which you named earlier as one state we are apparently \"older\" than.\n\n*Canada fought as British colony in WWI, as it[.] own in WWII, did some cool stuff, but primarily as a British helper. Invented a couple things, most shit was British though.*\n\n**Cultural Identity**\n\n As mentioned above... cultural mixing.\n\nVirtually all of this bit is incorrect or vast oversimplifications. The fact you aren't highlighting Lower Canada (and Acadia), and you completely ignore the oldest parts (Aboriginals, and the Atlantic portion) should give you concern.  The \"Canadas\" **did not** become a unified fighting force until relatively recently, and certainly not until after WWII, in the sense you mean, because you must have forgot QC *hated* joining European Wars, to the point it was a major cultural rift in the country that is still talked about today. You're also forgetting that Aboriginal groups that like the French fought with them, and the ones who liked the British fought with them, and this wasn't settled until after the Seven Years War.  You've also conveniently forgotten the many American settlers that settled in the West.  This is a major cultural issue in certain circles, as it forms part of what is called [\"fragment theory\"](https://www. google. ca/webhp?sourceid=chrome-instant&rlz=1C1CHBF_enCA701CA701&ion=1&espv=2&ie=UTF-8#q=fragment+theory).\n\n Today, Canada prides itself on being a cultural mosaic rather than a cultural melting pot, allowing all sub-cultures to flourish within the greater nation. Canada has also had a ~~long standing~~ history of interest in the arts, producing many paintings, poems and works of writing focusing on the rugged natural phenomena of the land, the harshness of colonial and expansionist life, and the down-home day to day lives of average Canadians.\n\nOnce again I see this.  Please compare Canadian \"Arts\" that is more than inukshuks and Margaret Atwood with say - UK, USA, India, Persia, the list goes on. It[.] not even close. We read predominantly UK (Orwell, Shakespeare), US (every economy book, Mark Twain), and classics from Greece and Roman times (Sophocles, Plato, Cicero) even in Canada, *even to this day*.  They aren't reading Canadian books as a staple in other countries ordinarily.\n\n Modern Canada is considerably more liberal than many western nations. Our home brewed comedy avoids making risque jokes, and our people are generally more accepting of new ideas and thinking than would be possible in either the US or Britain.\n\nSays you, all of this is nonsense. The US and UK have pioneered every \"progressive\" issue you talk about. You're glossing over this fact.  It'[.] also irrelevant to your argument really.  Sweden is not a civilization because it[.] \"progressive\", it[.] because of a very longstanding history.\n\n Canadians have taken the best of many cultures and that makes it hard to define what Canadian culture really is. There are some very easy key examples however: we have poutine, we have maple syrup, we do say sorry a lot, some of us say eh, provinces don't always get along, some of us speak French while others don't speak either official language, we love hockey, and have a strong sense of national pride. \n\nThis is your subjective opinion, and not fact. Okay, we like fries with gravy and cheese on it, and a couple of sports.  That[.] not like say, Brazil, which has five national dances I believe (or something close to it), let alone famous music.  Brazil, which is a \"recent\" country destroys Canada culturally, try comparing that with Japan, Germany, Rome, etc.  \n\n Ask any Canadian abroad where they are from, and most will answer \"Canada\". Not Timmins, not Toronto, not Calgary, not Portage la Prairie, not Dildo (actually a real place).\n\nYou're from Ontario aren't you? When you leave, ON, Quebeckers don't feel this way, the NLers don't feel this way, and even a lot of Albertans don't feel this way. They're all \"Qcers first, Canadians second\".  \n\n*Virtually all of this is nonsense. I get you like Canada, but this is not even close to an accurate description of the country. It is a lot bigger than the Toronto, Montreal corridor I'm afraid*.\n\nI'm sick of typing, but your next section isn't really relevant in light of the foregoing.  \n\nWhat do you propose as the unique attributes? Mounties? The Avro Arrow? Civil unrest due to a linguistic minority?\n\n**TL;DR Canada would not be a good civilization for civ.  We are little UK until around WWII and little America ever since. We are weak historically, militarily, scientifically, and culturally**\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}