{"doc_id": "1256", "name": "2017_04_humanities_student_major_3162_relationships", "namespace": "we1sv2.0", "metapath": "", "pub": "relationships", "title": "2017-04-humanities-student-major_3162_relationships.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "-0.002", "Subjectivity": "0.247", "Score": "118", "Upvotes": "0", "Downvotes": "0", "Wordcount": "347", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgujn14", "Reddit_id": "dgv702j", "Subreddit_id": "t5_2qjvn", "Commenter": "actual_professor", "length": "1927", "content_scrubbed": "Fellow tenured professor here. Do not listen to this poster. The university is not on your side. At one point, you said the university has lawyers to protect you. It does not. It has lawyers to protect itself. If this woman decides to file a sexual harassment complaint against you, it can ruin your career. Read up on Peter Ludlow or Rob Latham. In both cases, a tenured professor was forced out based on dubious circumstantial evidence that would not hold up in a court of law. If this goes to a faculty hearing, you are going to be sitting across from the university lawyers and five professors from outside your department (i. e., five liberal_arts professors). You need to get your own lawyer if this complaint is serious. \n\n\nGoing forward, you need to limit your interaction with female students. Sometimes we academics take a more parental role with our students - consoling them and supporting them emotionally. Do not act this way with your female students ever again. Do not have any private interactions with this particular student ever again and, ideally, with any of your other female students. No one on one conference travel, nothing of the sort. This is your career, which you worked so hard for, and your family, which you treasure, on the line. Now that a complaint has been filed must view everything through the lens of: If this goes to court, how will it look?\n\n\nEven if the complaint was not of a sexual nature, this woman has already shown a willingness to lie for revenge. How long until she decides that upping the lie a little bit is worth it? My final advice to you is not to retaliate in any way. Let her win. If you retaliate, you up the stakes. If you up the stakes, she may go nuclear. If she goes nuclear, at best, you will remain unscathed, but with hundreds of hours of productive time wasted. At worst, you lose your job and your wife leaves you. Keep this experience in mind in the future. \n"}