{"doc_id": "1235", "name": "2017_04_humanities_student_major_2945_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_2945_AskReddit.txt", "pub_date": "2017-04-26T00:00:00Z", "Sentiment": "0.103", "Subjectivity": "0.395", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "307", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgqzvxd", "Reddit_id": "dgrr4sm", "Subreddit_id": "t5_2qh1i", "Commenter": "seacoke", "length": "1897", "content_scrubbed": "What practically happening in China was very different from what people expected to happen.\n\nNot all Liberal Arts Students chose Liberal Arts because they have talent or ability in LA, but because they are not good at mathmetics. They don't prefer LA either. The problem of passive learning is strongly existing in LA students.\n\nSome one came out a solution that seemed to solve the problem above. It let students choose their subjects freely. It later turned out that (in Beijing) 80% of high school students chose History and Geography. Why? Because these subjects could just recite to get high marks.\n\n(For non-Chinese who find hard understanding this: In China, History & Geography are tested in multiple choice and short answers only. No essay, No case studies, **NO THINKING**. Only good memory required)\n\nThe problem in education is not about choosing subjects or finding students' interest. It[.] the system of test judging. Applying University need grades, a better high school need grades, everything needs grades to access. Students would not give up gaining more grades in this system. Further problems are there as people could always find better solutions to get their aim with less cost. In testing, the better solution is reciting and tons of repeating practice.\n\nThe more serious the test is, the worse this problem exists. Gaokao(Chinese General Test for applying University) made the worst example. Alevel Exam (British Test for applying University) and SAT & AP(USA) are slightly better. Students are simply buried by books and notes. \n\nAs the system of Testing still existing the world, these problems would be inevitable. But what could the resolution be? Examination is almost the most fair and equal method in world right now people could probably thought out. \n\nWe will see changes. It[.] good that people are aware of the cracks and mistakes in current educations. "}