{"doc_id": "1083", "name": "2017_04_humanities_student_major_1566_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-04-humanities-student-major_1566_ApplyingToCollege.txt", "pub_date": "2017-04-13T00:00:00Z", "Sentiment": "0.115", "Subjectivity": "0.444", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "485", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg8b1a5", "Reddit_id": "dg8brpy", "Subreddit_id": "t5_2y2r8", "Commenter": "blue_surfboard", "length": "2554", "content_scrubbed": "See, this gives us a little more detail- this is exactly what would help us help you out. You weren't rude at all, but your \"what[.] Calvin?\" quip was definitely off-putting. \n\nOk so, that aside, let[.] see if we can sort things out a bit more... \n\n* You like Michigan, but it seems like cost might be an inhibiting factor. We can keep it on the list, but maybe move it closer to the bottom, since $20K a year (per another comment of yours I see) is not ideal.\n\n* You probably really like Georgia Tech. It[.] a great school, it[.] not far from your home (I'm guessing you're in the Research Triangle area), and honestly, $8K a year in debt would not be the worst thing. It moves higher on your list. \n\n* NC State- I totally feel you on not wanting to apply to a school where a lot of your classmates go. That[.] precisely the reason why I didn't apply to Maryland when I was a senior. But, if costs are down, and because it[.] still a relatively solid school, my thinking is that it wouldn't be terrible to keep it on your list. We can move that midpack. \n\n* Calvin- you really don't say much about this school other than it[.] in Michigan and your dad went there. A quick google search tells me it[.] a small/medium Christian liberal_arts college- pretty different from your other choices of larger state schools. You also don't tell us how much it would cost to go there, but being a private school, I would hope they would have given you scholarship, especially considering you are an out of state student and they appear to be a more regional college. However, don't be put off by a college just because your friends may not have heard the name before. If you're looking to go into a STEM field, it may do you well to really explore a college where you can get a bit more individualized attention. We can keep that one midpack as well.\n\nSo, obviously my opinions are my own, and there[.] still more information I don't really have from you, but it sure seems like Georgia Tech is at the top of reasonable options for you. But, you still have a couple of weeks before May 1- if you have already visited the campuses, maybe do more exploring of the social media pages for each of the colleges to get a sense of what the life is like on each from another angle. Make pros and cons lists- seems basic, but I think in this case, now that you have it narrowed down to four, this might help you out in the long run. And remember, we can't make that final decision for you- only you can decide where you really feel like you will fit.\n\nGood luck, and keep us posted!\n"}