{"doc_id": "1114", "name": "2017_04_humanities_student_major_1813_southafrica", "namespace": "we1sv2.0", "metapath": "", "pub": "southafrica", "title": "2017-04-humanities-student-major_1813_southafrica.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.022", "Subjectivity": "0.323", "Score": "23", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1014", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65ol5p", "Reddit_id": "dgbxqhl", "Subreddit_id": "t5_2qney", "Commenter": "CataclysmZA", "length": "5899", "content_scrubbed": "On Shelley Garland and the Huffington Post blog\n\nRecently the Huffington Post published a blog post (which has gone viral) by Shelley Garland, an MA philosophy student and self-styled activist and feminist, on whether it is time to deny white men around the globe the vote, and at the same time redistribute their assets globally. There was some speculation on social  media that Garland, who claims to not be a fan of South Africa[.] 'rainbow politics' and is thinking of ways to smash the patriarchy, was not real. Those who thought that Garland is not real were correct. For she is a pseudonym used by myself, a white South African male, to show that one can write absurd racist and sexist hogwash, as long as the target is the_right one.\n\nI have had the idea for some time. Breathless meditations on 'angry white men' or earnest letters addressed to 'white people' seem to be more common than spelling or grammatical errors in The New Age. It seemed to me that one could write any kind of collectivist tripe, as long as the target was white men, and I decided to put this theory to the test and the idea of writing a piece about depriving white men around the globe of the franchise was born.\n\nArmed with a heavily photoshopped picture I found on the Internet and some ridiculous phrases beloved of  those on the less sensible left, I set to work. I first approached Branko Brkic of the Daily Maverick, to see if he would be interested in running the piece. He was agreeable and asked me to send it through. To his credit, he saw the nonsense for what it was and didn't even reply. Huffington Post was next and they were interested in the piece, and they published the piece as a blog, which has now gone viral. The piece was accepted without question by the Huffington Post even though – as others have pointed out on social media and elsewhere - the piece is riddled with factual errors, logical fallacies, and is not something that an MA student could possibly write (apologies to philosophy students, one of my best friends is a philosopher, but it was the first humanities discipline that popped into my head when I was creating Shelley).\n\nHuffington Post did not fact check any of my ludicrous claims in the article, nor, as far as I can tell, was the  piece edited. After the piece was published I saw that I had entered one of the hyperlinks wrong for one of my [.]ources,' and this had clearly not been checked. This is an indictment on South African journalism in general, and the Huffington Post in particular. Apart from some brave publications holding the line, such as Business Day and some Media24 publications (ironic seeing as Huffington Post is also owned by Media24), among others, South African journalism is in dire straits. Wild claims are published with very little fact checking or consideration to what the broader impact of publishing obvious piffle will be.\n\nA further indictment on the Huffington Post is the fact that its editor, Verashni Pillay, then took it upon herself to defend the total garbage that I had written. Although Ms Pillay claims that her website does not necessarily agree with what I said, it is unlikely that she would publish a piece with the same sentiments but aimed at a different race group written by someone ostensibly from the other side of the political spectrum. It is highly  doubtful that she would publish a piece saying perhaps apartheid wasn't that bad, or defending Donald Trump[.] ban on people of certain nationalities entering the U_S, and rightly so. Pieces defending apartheid or the 'Muslim ban' would be hurtful claptrap. What we have seen is the South African equivalent of the Sokal Affair, where something will be published, even if it[.] 'liberally salted with nonsense if (a) it sounded good and (b) it flattered the editors' ideological preconceptions'. My article does not meet criteria a, but it certainly meets criteria b. \n\nLest I be accused of being a member of the alt-Right or any of its related groupings or movements, let me make it clear that I don't think white men are under threat globally, nor that there is a genocide happening against white men in South Africa or anywhere else. I hold no truck with people like Milo Yiannopoulos or his ideological fellow travellers. Ideologically, I would describe myself as a liberal in the South African or European sense (although to some in South Africa admitting one is a white liberal is nearly as bad having been a member of Koevoet). This means I believe in the primacy of individuals rather than the group, the power of the free market (supported by a capable state), the rule of law, and free speech and elections. \n\nSaying white men should be stripped of the franchise is absurd, as well as racist and sexist, and the Huffington Post should be ashamed for publishing such regressive tripe. White men, should not be ashamed of who they are, and nor should anyone else, no matter their race or gender. However, white people in South Africa (and white people in other countries with histories of colonialism and dispossession) should be aware of their  privilege. Us white South Africans also need to be aware of our horrific history and the pain apartheid,  colonialism, and racial discriminatory policies caused our black compatriots, but we should not be ashamed of our race or gender, features over which we had no control (unlike Rachel Dolezal). \n\nLet this be a lesson to publications like the Huffington Post (and others) to fact check articles, thoroughly  investigate contributors (especially those sending through unsolicited work), and not publish absolute poppycock, just because it fits into a certain ideological narrative. \n\nAnd in conclusion, I have one last message to white South African males (which everyone else would do well to heed including the Huffington Post editorial staff):\n\n-- Don't be a doos, be lekker.\n\n-- Nick Shannow\n"}