{"doc_id": "488", "name": "2017_10_humanities_student_major_2598_circlebroke2", "namespace": "we1sv2.0", "metapath": "", "pub": "circlebroke2", "title": "2017-10-humanities-student-major_2598_circlebroke2.txt", "pub_date": "2017-10-26T00:00:00Z", "Sentiment": "0.099", "Subjectivity": "0.377", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "227", "Permalink": "http://reddit.com/r/circlebroke2/comments/78s8bw/reddit_how_would_you_feel_about_a_high_school/doxkmy3/", "Threadlink": "http://reddit.com/r/circlebroke2/comments/78s8bw/reddit_how_would_you_feel_about_a_high_school", "Parent_id": "t3_78s8bw", "Reddit_id": "doxkmy3", "Subreddit_id": "t5_2tzax", "Commenter": "deleigh", "length": "1367", "content_scrubbed": "\"How would you feel about a reddit thread that validates your preexisting opinions and makes you feel smart?\"\n\nThat is the essence of these threads. In the age of the Internet, these types of classes are obsolete. You can learn all of this stuff in an afternoon by watching a handful of videos on YouTube. I'm surprised they didn't toss in \"learn how to balance a checkbook,\" too. Here[.] how I budget, avoid debt, and balance my checkbook, all at the same time: I log onto the Chase app on my phone and look at my balance. The only reasonable suggestion in that thread is job interview prep, but again, there are a million different sites that can teach you how to be successful in job interviews. It boils down to being prepared and maintaining a calm demeanor. \n\nInstead of wasting everyone[.] time by pretending the Internet doesn't exist, students today would be better served learning about public speaking, effective communication, corporate ethics, and other aspects of humanities. These are things which typically aren't introduced until students enter college, but students would benefit from being exposed to these concepts earlier. I think it would make students much more engaged in what they're learning if they're encouraged to think and challenge themselves as opposed to memorizing everything and forgetting about it as soon as it[.] no longer relevant."}