{"doc_id": "1273", "name": "2017_04_humanities_student_major_3261_de", "namespace": "we1sv2.0", "metapath": "", "pub": "de", "title": "2017-04-humanities-student-major_3261_de.txt", "pub_date": "2017-04-29T00:00:00Z", "Sentiment": "-0.025", "Subjectivity": "0.037", "Score": "23", "Upvotes": "0", "Downvotes": "0", "Wordcount": "254", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgwhmqg", "Reddit_id": "dgwhzjo", "Subreddit_id": "t5_22i0", "Commenter": "TxXxF", "length": "1724", "content_scrubbed": "Naturlich macht dein Standpunkt Sinn - wenn man der Meinung ist, dass Bildung ausschließlich der Wirtschaft dient.\n\nMenschen wie du verstehen nicht, dass es andersrum ist. Der Staat, die Wirtschaft  und Bildung sind Dinge, die die Lebensqualitat der Menschen verbessern (sollten).\n\nStudienkredite sind ein Geschwur, dass hunderttausende Menschen ins Ungluck reißt, nachdem ihnen 10-13 Jahre in der Schule vermittelt wurde, dass sie studieren mussen um jemals erfolgreich werden zu konnen. Diese zu privatisieren ist die lacherlichste Idee, die man haben kann. In den USA steigen aufgrund der Studiengebuhren die Semesterbeitrage und Nebenkosten immer mehr an, weil die Studenten garantierte Studienkredite (von privaten Banken) erhalten - und diese Studienkredite selbst im Fall der Privatinsolvenz bestehen bleiben! Die Universitaten konnen also verlangen was sie wollen und erhalten es garantiert. Die Kreditgeber erhalten ihn garantiert zuruck. /r/HailCorporate \n\nNaturlich ist nicht jeder liberal_arts student eine wirtschaftliche Bereicherung fur das Land - muss er auch nicht sein. Bildung insbesondere im Bereich der Kunst ist auch fur Kultur unabdingbar.\n\nDeutschland als \"Land der Dichter und Denker\" sollte es besser wissen als Kulturentwicklung zu erschweren.\n\nWie gesagt dient Bildung den Menschen (und zwar allen Menschen), nicht nur den Kindern reicher Eltern und Bildung dient auch nicht den Zweck, die Wirtschaft zu pushen (was sie allerdings in hohem Maße tut!). Wenn ich dich richtig verstehe dann bist Du schon fertig mit dem Studium. \n\nWenn du es nicht bist dann studiertst du BWL oder WiWi oder sonstwas, das deiner Meinung nach staatlich unterstutzt werden sollte. In dem Sinne:\n\n\"got mine, fuck yours\""}