{"doc_id": "1156", "name": "2017_04_humanities_student_major_2137_technology", "namespace": "we1sv2.0", "metapath": "", "pub": "technology", "title": "2017-04-humanities-student-major_2137_technology.txt", "pub_date": "2017-04-19T00:00:00Z", "Sentiment": "0.108", "Subjectivity": "0.343", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "333", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dghas2g", "Reddit_id": "dghfx7g", "Subreddit_id": "t5_2qh16", "Commenter": "tsxboy", "length": "1770", "content_scrubbed": "Guaranteed Loans, in theory, can be okay when you can get a job with Guaranteed Payment. It may not be an issue for STEM/Business kids but now idiots are using 100K+ in loans for a second rate Art Creativity education from some second rate private institution. I don't know the job prospects, but the kids I know from High School that took that route moved back to my hometown and aren't doing much. Of course the lending provider has no problem giving out those loans because they will get paid in some way or another.  I'm projected to be in close to 200k in the hole once I finish medical school but that will be a guaranteed payment unless I fuck up in someway. Liberal Arts/smaller schools seem to be the most predatory with this loan shit. \n\nOne way to change things is to tell people college is not the be all and end all. College may have helped me mature, change personally but I could have accomplished the 'competencies' via free courses, Khan Academy and a few textbooks. You can go to tech school and make more than an english_major I think kids who are interested in CS have options such as Coding Academy/Boot Camp in which you don't even need a degree.. at the end of the day I'm sure a job would want someone who is EXPERIENCED, not someone who has a 200 thousand dollar piece of paper. \n\nAlso.. Community Colleges are a great option as well, especially for those in a financial bind or have no clue at all of what they want to study. I wish more graduate programs were open to kids who took courses at a CC or started off at one. Health Professional (Medical, Dental) are notorious for looking down on a kid who took a class there; I took my Physics sequence through a CC and not only was it cheaper but it taught me the same if not more for my MCAT. "}