{"doc_id": "278", "name": "2017_10_humanities_student_major_418_writingprompts", "namespace": "we1sv2.0", "metapath": "", "pub": "WritingPrompts", "title": "2017-10-humanities-student-major_418_WritingPrompts.txt", "pub_date": "2017-10-05T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.375", "Score": "20", "Upvotes": "0", "Downvotes": "0", "Wordcount": "420", "Permalink": "http://reddit.com/r/WritingPrompts/comments/74j8ob/wp_a_mad_scientist_tired_of_gun_violence_infects/dnytu42/", "Threadlink": "http://reddit.com/r/WritingPrompts/comments/74j8ob/wp_a_mad_scientist_tired_of_gun_violence_infects", "Parent_id": "t3_74j8ob", "Reddit_id": "dnytu42", "Subreddit_id": "t5_2s3nb", "Commenter": "theolddawg", "length": "2403", "content_scrubbed": "                      Humanities Step Forward\n\nYou know when everyone says your special when your little and everyone else is special too? Well if everyone is *special* - No one is.\n\n100 years ago, a Russian scientist decided that the war between the U. S, China and Russia had become too violent. The world he had seen was spread with atrocities and false hope that made him question his own humanity. Rather than seeing sons and daughters run off to the slaughter and regimes spread across Europe devouring countries into the war machines like a plague, He decided to end it in a way that no one expected.\n\nWhile working on a new NX-132 virus to target specific troops on a battlefield while invading the EU nations - Stephoff secretly worked on a genetic mutation virus on his own. The mutation virus would strengthen the entire human body down to the genetic level increasing both the durability and longevity of the next level of humanity. He called this genetic mutation the Z-Gene. \n\nOver the next few months the Z-Gene was being tested under the guise of being a prototype for the NX-132 bio warfare virus and given to test subjects. The results were astounding - not only did the skin become hard enough to resist bullets but the organs and muscles became so strong that they could not even die from normal age or disease anymore. Russia in the beginning tried to quiet down this great discovery, giving it only to troops to empower their forces. This however did not last for long as the doctor himself leaked the formula to the other countries to even the sides.\n\nIn the end the NX-132 virus was a complete failure and the Z-Gene was a remarkable success. Skin was no longer burned by fire or chemicals; Bullets no longer pierced flesh and disease and age no longer took its toll. With everything but large explosions or extremely potent gas ineffective the war ended due to large stalemates. \n\nStephoff was however not so lucky, as he died before the war ended of unknown causes and never got to see the peace that he created. That students is how we got here today in the international peace college, getting ready to watch the first colonial launch into space. Today you will see humanity take another step forward thanks to the sacrifice of one man in the darkest time of our history. \n\nLearn from history, so we do not repeat our mistakes. \n\n---\n\nEnd\n\n~Dawg.\n\nFeedback always welcome :D \n"}