{"doc_id": "1124", "name": "2017_04_humanities_student_major_1893_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-04-humanities-student-major_1893_AskHistorians.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.113", "Subjectivity": "0.308", "Score": "553", "Upvotes": "0", "Downvotes": "0", "Wordcount": "558", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65s3ut", "Reddit_id": "dgd5e0g", "Subreddit_id": "t5_2ssp3", "Commenter": "ShaolinBao", "length": "4104", "content_scrubbed": "TLDR: In Singapore, Primary School touches on the well-known ancient civilizations.  History courses in Secondary School focus mainly on Singapore, mainly adding in European history in the context of colonization or major world events (Nazism, communism, etc.)  Very little is taught about medieval Europe or the middle East.\n\nI'm Singaporean.  In Singapore, much of our primary school social_studies education from Ages 7 to 12, is intended to indoctrinate young students into better understanding the multicultural society that is Singapore.  You can examine the Ministry of Education[.] syllabus for Primary School Social Studies [here.](https://www. moe. gov. sg/docs/default-source/document/education/syllabuses/humanities/files/social-studies-syllabus-2012-110615. pdf).  Just for fun, [here](https://www. moe. gov. sg/docs/default-source/document/education/syllabuses/character-citizenship-education/files/character-and-citizenship-education-\\(primary\\)-syllabus-\\(english\\). pdf) is the syllabus for the 'Character and Citizenship Education'.\n\nAs mentioned in the syllabus, Primary Five is meant to provide an overview of several ancient civilizations and their achievements:\n\nThe Sumerians - Writing, Irrigation\n\nThe Egyptians - Sun-dial, The Pyramids of Giza\n\nThe Greeks - The Olympics, The Temple of Artemis\n\nThe Romans - Roman Aqueduct, The Colosseum\n\nHowever, there is an entire section of the syllabus devoted to \"[how] the legacies of China and India influence our lives today\", which discusses common topics like the Huang He, ways of life in Ancient and modern China, Chinese technological inventions and the same things for the Indus Valley civilizations.  \n\nThen, in Primary Six, the social_studies curriculum reorientates itself around Southeast Asia more specifically.  We learn about famous kingdoms in SEA, famous UNESCO sites, present day industries, etc.  \n\nAfter twelve year olds take the Primary School Leaving Examination (PSLE) and are separated into different education tracks, the syllabuses begin to vary.  'Express' and 'Normal (Academic)' track students study history (who, what, when, where) focusing mainly on Asia.  Lower Secondary focuses on Singaporean history.  For example:\n\nSingapore and Asian Trade situation before the 14th century\n\nRise of Temasek in the 14th century\n\nHow was life different for the various people in colonial Singapore before World War Two?\n\nSingapore[.] connections with Melaka (15th to 16th centuries)\n\nSingapore[.] connections with the Johor-Riau Sultanate (16th to early 19th centuries)\n\nSingapore[.] connections with the Portuguese and Dutch (16th to early 19th centuries)\n\nBritish failure to defend Singapore\n\nLife under the Japanese\n\nViews of the British as rulers of Singapore\n\nBritish superiority\n\nOn the other hand, Upper Secondary focuses more on Europe, but only briefly in the context of colonization, WW2, and the Cold_War.  For example:\n\nRise of authoritarian regimes and their impact in the Interwar period\n\nReasons for the rise of Stalin in Russia\n\nImpact of Stalin[.] rule in Russia\n\nReasons for the rise of Hitler in Germany\n\nWeaknesses of the Weimar government\n\nHitler[.] consolidation of power, one-party rule\n\nWeaknesses of the League of Nations\n\nHitler[.] aggressive foreign policy\n\nJapan[.] worsening relations with the USA\n\nOver-extension of Hitler[.] army on many fronts\n\nUS-Soviet mistrust post-war: breakdown of wartime alliances, division of Europe after WW2, American containment policy, Soviet response, military responses\n\nTensions between USA and Castro: Castro[.] policies and American responses\n\nRole of external powers in the conflict: USA and USSR (Kennedy and Khrushchev)\n\nWe also touch on Dutch colonies in Indonesia, British Malaya, and the French failure in Vietnam.\n\nSocial studies courses for all tracks, including Normal (Technical), are intended to promote racial and political harmony, essentially functioning as a basic civics course. \n\nI know it isn't about China, but if you're interested in learning more, check out the Ministry of Education[.] syllabuses [here](https://www. moe. gov. sg/education/syllabuses).  "}