{"doc_id": "1119", "name": "2017_04_humanities_student_major_1836_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2017-04-humanities-student-major_1836_funny.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.09", "Subjectivity": "0.4", "Score": "40", "Upvotes": "0", "Downvotes": "0", "Wordcount": "267", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgc8k1d", "Reddit_id": "dgc909v", "Subreddit_id": "t5_2qh33", "Commenter": "mediaboy", "length": "1450", "content_scrubbed": " The problem enters when you get those degrees and don't want to work in politics.\n\nI think this applies to most degrees though. Like, if you get the_right degree for the rigth job, you're fine. If you get the wrong degree for the wrong job, you're fine.\n\nIf you get the_right degree for the wrong job, you're going to have to find a spin on it. And if you have the wrong degree for the_right job, you should have done more research before you got your degree.\n\nTake music. Every goes and gets a music degree and then goes \"... wait... this didn't lead to a job in music. Wtf.\"\n\nThe issue with most Arts degrees (which is often where people talk about \"wasted\" degrees) is three-fold:\n\n1) The vast majority of people don't really know what kind of work there is to do in those fields;  \n2) If they could find out what that work is, the vast majority of people don't really want to do it;  \n3) And opportunities for finding that work and developing it aren't particularly easy to find in any case.\n\nIf you want to go into music... get the_right training, the_right skills, the_right attitude, connect with the_right people and the_right groups, join the_right networks and find the_right communities.\n\nIt[.] almost like it[.] the same as every other industry.\n\nIt[.] just that people have this idea that the Arts are these mystical places where if you want something hard enough, it magically happens. And money falls from the skies to embrace you gently."}