{"doc_id": "977", "name": "2017_04_humanities_student_major_537_explainlikeimfive", "namespace": "we1sv2.0", "metapath": "", "pub": "explainlikeimfive", "title": "2017-04-humanities-student-major_537_explainlikeimfive.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "-0.04", "Subjectivity": "0.295", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "267", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfw0nz0", "Reddit_id": "dfw23l8", "Subreddit_id": "t5_2sokd", "Commenter": "ihugturret", "length": "1538", "content_scrubbed": "Someone[.] projecting.... The schools I've been to, it was the arts who fundraised a lot or the school in general fundraised for athletic equipment. I had to fundraise for new uniforms while my art class got cut.. And the few athletic fundraisers they did have wouldn't have covered even 10 percent of the gym and equipment costs. \n\nThere was a rich man who supported the high school and wrote a check every year for the school in general. Guess what would happen a week after the check came during a pep rally? New athletic building or addition, new uniforms, new etc. While all the academic classes had to have 2 or 3 students share 15 year old textbooks. And the creative writing class got cut completely out. The computer science class had to use completely outdated computers with 2 students sharing one taking turns. The library had to downsize and have a fundraiser just to get 2 computers.... \n\nAs for your comments about athletes doing whatever and getting away with it with no consequences, you're totally right. I'm not exaggerating. That[.] exactly why it was so infuriating. 0h you were all caught drunk smoking cigarettes on school grounds? OK write an apology letter at least 2 paragraphs to the principal. \n\nYoure an hour late? Just get to class. You skipped lunch? Get back to class. You didn't do your homework? Well we can let it slide. Non athletes: 5 minutes late? Warning, 3 warnings and it[.] ISS. Skipped lunch or a class? Immediate OSS for 3 days. Got caught drunk or smoking on school grounds? Immediate expulsion. "}