{"doc_id": "525", "name": "2017_10_humanities_student_major_2893_portland", "namespace": "we1sv2.0", "metapath": "", "pub": "Portland", "title": "2017-10-humanities-student-major_2893_Portland.txt", "pub_date": "2017-10-30T00:00:00Z", "Sentiment": "0.034", "Subjectivity": "0.378", "Score": "13", "Upvotes": "0", "Downvotes": "0", "Wordcount": "332", "Permalink": "http://reddit.com/r/Portland/comments/79jnl8/opinion_professors_like_me_cant_stay_silent_about/dp36aqm/", "Threadlink": "http://reddit.com/r/Portland/comments/79jnl8/opinion_professors_like_me_cant_stay_silent_about", "Parent_id": "t1_dp2u8yu", "Reddit_id": "dp36aqm", "Subreddit_id": "t5_2qi2i", "Commenter": "needsister", "length": "2138", "content_scrubbed": "Reed[.] humanities is not focused on Western civilization, so this argument is entirely irrelevant. Humanities 110 is a year long Mediterranean classics course that now spends almost a semester on Egypt, Mesopotamia, and Persia. It[.] also doubtful that some of the authors they cram into Humanities 110 (Aeschylus, Martinez[.] own beloved Sappho, the Presocratics, Theocritus, a bunch of random Egyptian poetry, etc.) are more essential to an understanding of Western civilization than say, Adam Smith, Kant, Rousseau, Voltaire, Hobbes, or Locke.\n\nIt[.] also laughable that a year-long course taught to freshmen would at all be sufficient to give a good understanding of Western civilization. The purpose of Humanities 110, as faculty have even agreed, is instead to teach students the basics of academic analysis, argument construction, and writing. To achieve this, almost anything can be used as a starting point, including Reed[.] other humanities courses.\n\nTwo of Reed[.] other humanities courses (220 and 210) are on Western civilization but focus on later periods, while the last one covers Chinese civilization. Reed, however, due to the fact that the Dean of Faculty is a very devoted classicist, will not allow students any flexibility in choosing the humanities course they take freshman year.\n\nI am doing an interdisciplinary science major with a very restricting schedule due to heavy requirements. I really wanted to take Humanities 220 due to having far greater interest in Enlightenment era philosophers than reading Egyptian love poems. I will not be able to due to my schedule. I ended up reading almost everything from Humanities 220 anyway and while there are certainly some core texts that helped (Homer, Plato, Aristotle, Cicero, Plutarch, the Bible, a basic knowledge of Mediterranean history), I thought that the vast majority of Humanities 110 was not essential. Try asking the administration to allow greater flexibility in course choice, however, and these classicists who think one can't have consciousness or personhood without knowledge of Greek bucolic poetry will bully students until the vast majority give up."}