{"doc_id": "406", "name": "2017_10_humanities_student_major_1686_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-10-humanities-student-major_1686_AskHistorians.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.289", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "440", "Permalink": "http://reddit.com/r/AskHistorians/comments/77874z/when_how_and_why_did_k12_public_education_become/dokfju4/", "Threadlink": "http://reddit.com/r/AskHistorians/comments/77874z/when_how_and_why_did_k12_public_education_become", "Parent_id": "t3_77874z", "Reddit_id": "dokfju4", "Subreddit_id": "t5_2ssp3", "Commenter": "UrAccountabilibuddy", "length": "2637", "content_scrubbed": "There are two ways to answer your question - one is from a legal perspective and the other is from a social one. \n\nLegally, Mississippi was the last state to formalize compulsory K-12 education in 1972. As a result of that law[.] passage, all US states were required to provide a free education to every child in the country. \n\nFrom a social perspective, a K-12 (ages 5-17/18) education became the standard when we began to use a term (dropout) to refer to students who did not finish all 13 years. The term wasn't used to refer to students until the early 1960[.] when the concept of a \"high school dropout\" caught the country[.] attention and it was identified as a problem. Before that point, there was no real social expectation that students complete all 13 years. ([Dorn, 1993](https://www. jstor. org/stable/368197?origin=crossref&seq=1#page_scan_tab_contents))\n\nThe question of \"when, how and why\", though is a bit more complicated as it relates to \"who\". The why started off with religious education as early European settlers saw basic literacy (an ability to read the scripture) as a way to keep the devil at bay. While girls did receive a basic education, it was in service to their future role as a mother and wife, more than their own needs. The \"why\" evolved into teaching morals, citizenship, and American-ness to newly arrived immigrants, both boys and girls. In 1894, the \"why\" was formally established as all of that, plus providing children a well-rounded education (math, science, English, history, physical education, the arts, and a foreign language.) It wasn't until Brown v. Board in 1954 that the country was required to provide a quality education to students of all races. \n\nThe \"how\" mostly happened through the common school movement that began in New England in the 1840[.]. The idea of all towns providing a similar, year-round, common education spread and schoolhouses in the same town began to merge into the school districts as we think of today.  \n\nIt[.] also worth noting that public education isn't required in the U_S. That is, parents can homeschool or send their child to a private secular or religious school. There is no law or mandate parents send their children to public ed. Parents who went to public school are more likely to send their own children to public school and the same holds for parents who went to private or religious school. \n\nI'm not sure if the U_S has achieved universal literacy as it[.] currently estimated 32 million adults read at a below basic level but the definition of illiterate has changed over time, so it may depend on what you're looking for. "}