{"doc_id": "966", "name": "2017_04_humanities_student_major_468_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-04-humanities-student-major_468_politics.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.048", "Subjectivity": "0.278", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "279", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfv0b00", "Reddit_id": "dfv122s", "Subreddit_id": "t5_2cneq", "Commenter": "lostboy005", "length": "1788", "content_scrubbed": " you fund and design education to raise future generations to be more intelligent\n\nRe: Edu. \n\nWhat to think vs. how to think (indoctrination vs educating):\n\nLearning how to think is about, as James Baldwin wrote, the ability to drive \"to the heart of every matter and expose the question the answer hides.\" \n\nThe war on the arts has been one of the major contributions to the dumbing down of America. It shuts us off from our intellectual and artistic patrimony, contributing to our historical and cultural amnesia.\n\nWhat has happened since both the Powell Memo and Trilateral Commission report is the removal of teaching critical thought from pub. school curriculums. It has been replaced with vocational skills and standardized testing and has cemented into place a system in which Americans have been taught what to think, not how to think.\n\nThe danger of overemphasizing quantity versus quality concerning standardized testing results with the incentive for pub. funding creates system that is a \"perversion of natural selection;\" which selectively weeds out ethical and altruistic actors, while selecting for academics who are more comfortable and responsive to perverse incentives from the point of entry, i. e. memorizing answers vs. understanding the reasoning behind answers. \n\nThe heart of the issue is the dichotomy of competitive culture:  winner and loser, black and white, good and bad, this school get X amt of federal funding based on test scores while Y school does not. \n\nCompetition does not work in education (or healthcare). Know what does? Collaboration and experimentation. If we incentivized collaboration between districts rather than encouraging competition, you would see improvement everywhere, not just the school that[.] getting all the school of choice kids.\n"}