{"doc_id": "1045", "name": "2017_04_humanities_student_major_1134_shitredditsays", "namespace": "we1sv2.0", "metapath": "", "pub": "ShitRedditSays", "title": "2017-04-humanities-student-major_1134_ShitRedditSays.txt", "pub_date": "2017-04-10T00:00:00Z", "Sentiment": "0.098", "Subjectivity": "0.339", "Score": "36", "Upvotes": "0", "Downvotes": "0", "Wordcount": "425", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg2j044", "Reddit_id": "dg3722z", "Subreddit_id": "t5_2s4m9", "Commenter": "robbysaur", "length": "2506", "content_scrubbed": "Same thing happened to people of color at our university. Our Black Cultural Center was chalked around and had posters put up around them with racial slurs and saying \"why are you mad about police killing black children when y'all abort black children all the time?\" The Black Cultural Center was basically like, \"So, administration, can we get some support on this? Like, can you say this isn't cool?\" Then a student posted a threatening message to students at our university on an anonymous social media site saying, \"You should all be happy you are not hanging from trees. What more do you want?\"\n\nIn response, our president sent an email to the student body saying how wonderful it is that we can have conversation around race, unlike many other universities that \"censor opinion,\" of which he was referring to universities where there are consequences for white supremacy.\n\nNow, our Languages and Culture building was flyered with posters talking about \"breaking the chains of white guilt,\" and working to protect the white family from \"multiculturalism and feminism,\" because if we do not, white people will become a minority. The posters literally used artwork that was used in Nazi propaganda. Again, our university president said nothing, because, \"He didn't want to give those people more attention than they deserve.\"\n\nOur liberal_arts building was also flyered with memes saying that feminism advocates for the_right of women to act like drunken whores with no responsibility, as opposed to women with values, class, and self-respect. Again, no statement from our university president.\n\nHe is also now bringing a climate change denier to campus, again in the vein of \"open dialogue,\" but when he brings these speakers to campus for a \"Conversation with the President\" as he calls them, there is a Q&A at the end. He screens each of the questions beforehand, and you cannot ask anything he does not want you to ask.\n\nAfter all of this, we did an Occupy movement where students would gather in the administration building with our signs all day every day until we get a response. It[.] been over two months, and he has basically laughed at us.\n\nThis is at one of the largest universities in the U_S, Nazi groups are recruiting here like crazy, which would make the most sense when the university president simply considers your actions part of \"open dialogue,\" and everyone is just acting like this is normal. I'm sorry, I just needed to get that rant out. I hate this place so much."}