{"doc_id": "927", "name": "2017_04_humanities_student_major_104_personalfinance", "namespace": "we1sv2.0", "metapath": "", "pub": "personalfinance", "title": "2017-04-humanities-student-major_104_personalfinance.txt", "pub_date": "2017-04-01T00:00:00Z", "Sentiment": "0.059", "Subjectivity": "0.197", "Score": "192", "Upvotes": "0", "Downvotes": "0", "Wordcount": "327", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfpoq2x", "Reddit_id": "dfpuumz", "Subreddit_id": "t5_2qstm", "Commenter": "slappywhite77", "length": "2068", "content_scrubbed": "Im 28 and moved from Minnesota to Beijing for a technical writer position with no experience. Now been working here for 1. 5 years. We're basically an agency that works on all of Huawei[.] (a top telecom company) documents. About 50 foreigners from English speaking countries spread across three sites here: Beijing, shanghai, and Shenzhen. \n\nIt[.] fairly easy to get a job here in China without any formal tech writing experience/certifications if you're a decent writer and fake like you're interested in/know tech. Most of my colleagues were humanities_major in college and then did like English teaching after that and got tired of it. China has tons of tech companies that are pretty solid by international standards but are just now making the push to legitimize themselves in the eyes of the West. Which I guess means not having shitty documentation.\n\nI got a degree in philosophy and Spanish and out of college and have since worked as an English teacher in china and Japan as well as a medical scribe in minnesota. That[.] it. So at least I have a more marketable skill now. Also, I've been working in china about three years total, never studied Chinese before coming here, and by studying by myself/with occasional tutors for these 3 years I've gotten up to the HSK 5 Chinese level (one level below the top level) and can do translations at work. So basically I've added Chinese and technical writing to my skill set without paying anything (except for textbooks/tutors).\n\nAlso if it[.] relevant I make $3,000 per month and pay $550 in rent for a single, saved over $10,000 while still paying student loans and making trips to Korea, India, Vietnam, etc.\n\nCan search technical writing jobs in china, Beijing, shanghai, and Shenzhen. \n\nEdit: \n\nMy brother lived and worked in China for 6 years and has a website and book on getting a job, traveling, and learning Chinese in China.\n\nWebsite/blog: \n\nhttp://www. chinalifefiles. com/\n\nBook: \n\nhttp://www. chinalifefiles. com/free-download/\n\nhttps://www. amazon. com/Ultimate-China-Guide-English-Chinese-ebook/dp/B01CUYT3IS"}