{"doc_id": "1264", "name": "2017_04_humanities_student_major_3193_ucr", "namespace": "we1sv2.0", "metapath": "", "pub": "ucr", "title": "2017-04-humanities-student-major_3193_ucr.txt", "pub_date": "2017-04-28T00:00:00Z", "Sentiment": "0.124", "Subjectivity": "0.247", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "490", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67xbuy", "Reddit_id": "dgvlr3a", "Subreddit_id": "t5_2s3tf", "Commenter": "UCRSOM_SI", "length": "3007", "content_scrubbed": "My name is Ross and I work at the SOM (I also post under UCR_Ross, but figured a more official channel was appropriate for this response).\n\nI shared your question with Julie Lakatos, SOM Student Affairs Officer who has oversight of the Thomas Haider EAP program and Charles Scruggs, Director of the Health Professions Advising Center. Here are their responses.\n\nJL - \"In its third year, the EAP program offers UCR undergraduates an early admission opportunity to the UCR School of Medicine. Based on a competitive science GPA and other factors outlined in the website, (http://medschool. ucr. edu/admissions/eap. html) students are admitted one year early. The competitiveness of the program is high as the average incoming science GPA is 3. 77.\"\n\nCS - \"The Health Professions Advising Center (HPAC), a unit of undergraduate education, is a resource for UCR students who need assistance in preparing for medical school and other health professions. You can find out more at http://hpac. ucr. edu/.\"\n\nFor those who want more info, here[.] a little background (mostly adapted from our UCRSOM websites).\n\nThe EAP is part of the larger Thomas Haider Program at the UCR SOM. Before the medical school was created, UCR students in the Haider Program completed their undergraduate work here at UCR and started medical school before going to UCLA to finish their degrees. That version of the program ended four years ago (that class graduated from UCLA last June). The program was adapted and now guarantees spots in our class to up to 24 UCR students. Since we get several thousand applicants for what is now a 66-person class, it is a clear advantage for those who qualify. \n\nThe EAP guarantees the students one of those 24 spots a year early, alleviating the stress and time of applying to medical schools. But if you choose the EAP, you **cannot** apply to other medical schools. So if a student is 100% certain they want to attend the UCR Medical School, the EAP could be ideal for them. If not, they may want to consider other options.\n\nRegarding your question about \"pre-med\" students - our current SOM students have a variety of undergraduate degrees, although students must complete required coursework. (More info is here: http://medschool. ucr. edu/admissions).\n\nThe school places value upon broad academic backgrounds that include humanities, foreign language, social_sciences and the arts. We also are looking for students who are \"mission-fit,\" i. e. students who are interested in a career in medicine because they have a desire to help the people of California, especially here in Inland Southern California. \n\nThis is all covered in more depth on our website. If you can't find answers to your questions, contact our admissions office at (951) 827-7353 or e-mail medadmissions@ucr. edu. HPAC is also a great resource for UCR students, regardless of where they want to go to medical school.\n\nHope this helps. I'll keep an eye on this thread and try to answer any questions if anyone has them. Good luck! -Ross\n"}