{"doc_id": "1157", "name": "2017_04_humanities_student_major_2151_games", "namespace": "we1sv2.0", "metapath": "", "pub": "Games", "title": "2017-04-humanities-student-major_2151_Games.txt", "pub_date": "2017-04-19T00:00:00Z", "Sentiment": "0.055", "Subjectivity": "0.394", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "762", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dghj7dr", "Reddit_id": "dghl9ic", "Subreddit_id": "t5_2qhwp", "Commenter": "Elysium_Dream", "length": "4269", "content_scrubbed": "Yeah true, hard to say either way I suppose. :)\n\nAs far as the cash in, it almost certainly was intended to \"cash in\", in-so-far-as be a perceived \"easy win\" for the games popularity that would attract lots of players.\n\nTo explain:\n\n* game development is a long process. this has to be mentioned because it means game developers usually design a product around predictions on where the industry will be in future combined with the present. they're always 1-2 years behind by the time they show it to the public, and 2-4 years behind by the time it gets to the public.\n\n* OMDU went into EA Beta in April 2014 with the ARTS mode as basically the  sole focus. The game was intended to launch that year, that[.] how sole focus the ARTS mode was. This date is important because it means that the game was likely started almost immediately after OMD2 shipped in mid 2012.\n\n* Why is 2012 important? Let[.] look at the start of the ARTS genre back then:\n\nLeague of Legends: League of Legends was in its third year, and had already become the most played game on the PC platform world wide.\n\nDotA 2: Was still in Beta, and not the wide super exclusive one just yet. Did have the big International event tho!\n\nHeroes of the Storm: Was in proverbial development hell, going through multiple game wide reworks with no end in sight. It wouldn't even become named Heroes of the Storm (or represent the game it is now at all) for another 1 year + a few months yet.\n\nHeroes of Newerth: Had gone F2P a year prior, starting the trend that would basically display to everyone that this genre was F2P or die. Hadn't started its mass descent to death yet as the Dota 2 beta hadn't become fuck huge entirely yet.\n\nSmite: Hadn't entered closed beta before they started on OMDU, would be part way into a pretty open Closed Beta by the time OMDU went into EA.\n\n* So basically, when they started work on OMDU there was LoL (fuck huge), Dota (not yet a full player beyond Dota 1), HoN (a tiny dust particle compared to LoL), and that was about it as far as major ARTS went. Yet, due to LoL[.] popularity the market was clearly there, so putting a (at the time) inventive spin on the gameplay could be seen as an easy way to distance from the pack and nab players with a genre that is easily addicting/easily replayable.\n\n*OMDU comes out in EA Beta and a lot of their old playerbase is peeved that they focused on this blossoming genre and...\n\nSmite is seeing plenty of success during its beta.\n\nHeroes - from Blizzard so that[.] a big deal - gets announced and enters beta partially into OMDU[.] EA beta.\n\nHoN dies a slow death.\n\nDotA 2 releases to gigantic fanfare during OMDU[.] EA beta, becoming the most played game on Steam.\n\nLoL has only grown during this time.\n\n* They quickly realize that people don't play OMD for an ARTS, the brand isn't built around that at all, and there[.] too much competition in the market, so what was supposed to be a game that came out in 2014 is coming out 3 years later instead.\n\nBasically, if they had actually gone live with an ARTS focused OMDU, it would have been essentially dead by now (i. e. it wouldn't have actually made the money they expected, so they reworked it into something that would, you can't cash in on something that won't actually cash in for you, but they still could have chased the idea originally under the assumption that it'd make them the most/easiest money). The ARTS genre is basically the most played genre on PC, and competition has only gotten stiffer since 2012. There is barely any room for any further competitors, and there[.] already a substantial graveyard of people who attempted.\n\nThe problem for these guys would have been 2 fold:\n\n* they were an independent studio without substantial backing trying to make an ARTS which is a relatively serious genre filled with hardcore players who - as the genre has evolved - has became a very high feature required 'e-sportsy' genre. Something that can't compete on that level will struggle right out of the gate.\n\n* OMD[.] fanbase was mostly casual/cooperative players, not competitive ones. Hi-Rez (Smite), Blizzard (HotS), Valve (DotA) all have tapped playerbases with competitive outlooks. Even games with competitive fanbases (e. g. HoN/S2 games through Savage) still struggled.\n\n\n\n"}