{"doc_id": "263", "name": "2017_10_humanities_student_major_291_femradebates", "namespace": "we1sv2.0", "metapath": "", "pub": "FeMRADebates", "title": "2017-10-humanities-student-major_291_FeMRADebates.txt", "pub_date": "2017-10-04T00:00:00Z", "Sentiment": "0.187", "Subjectivity": "0.458", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "651", "Permalink": "http://reddit.com/r/FeMRADebates/comments/7449x7/its_not_your_imagination_single_women_there/dnwu7wz/", "Threadlink": "http://reddit.com/r/FeMRADebates/comments/7449x7/its_not_your_imagination_single_women_there", "Parent_id": "t1_dnwi5hm", "Reddit_id": "dnwu7wz", "Subreddit_id": "t5_2y44v", "Commenter": "HunterIV4", "length": "4298", "content_scrubbed": "Frankly, unless someone is getting a STEM degree or has a specific job in mind that *requires* a four-year college degree, it[.] better to avoid college or do community college.\n\nI can't find it right now, but for your typical liberal_arts major, they'd be better off putting all the money they would have put into college into ETFs (or other diversified, inexpensive stocks) and a Roth IRA. Their return on investment will usually be higher, especially since work experience quickly overshadows degrees.\n\nThis is from an economic standpoint... if you really want to learn literature or history, sure, go to college. But we really need to end the myth that you are significantly increasing your eventual income by doing so, at least at the bachelor[.] level. And frankly, if you *really* are that interested in literature or history, the internet exists and there are plenty of cheap or free courses that are as good as anything you'll get at a university.\n\nIn my opinion, if you're paying for college via student loans and *not* taking some sort of engineering, legal, or medical degree, you might as well just subscribe to Udemy and open a Vanguard account. Do it right and you'll be independently wealthy in your 40s, if not sooner.\n\n---\n\nNote: You'll need to learn finance for this, of course, which in my opinion should be taught in primary school. Some books I recommend:\n\n* [I Will Teach You to be Rich by Ramit Sethi](https://www. amazon. com/dp/B004WL4BW6/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1). If you want *practical*, simple recommendations for financial independence, this is one of the best books I've ever seen on the topic. Especially good for those who are currently struggling (but not in severe debt, which requires more drastic changes) or for people in their early 20s, particularly college students. **If you only read a single book on this list, read this one.** Seriously, it[.] fantastic.\n\n* [Rich Dad, Poor Dad by Robert Kiyosaki](https://www. amazon. com/dp/B0175P82RA/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1). A good introduction to basic concepts of investing and business. Warning: the author[.] other books are not nearly as good (in my opinion) and, well, his results are an exaggeration. I recommend this book for conceptual understanding of cash flow and passive income, I do *not* recommend it as a method (and frankly, it[.] not really actionable anyway).\n\n* [The Intelligent Investor: The Definitive Book on Value Investing.](https://www. amazon. com/Intelligent-Investor-Definitive-Investing-Essentials/dp/0060555661). An older book, and it can be a bit dry, but the general principles are as good today as they were when this is written. I recommend reading this if you want to go down the stock market rabbit hole (beware: here there be dragons!), although I'd caution anyone seriously thinking about investing to avoid advice that promises to get you rich quickly. There is only one way to get rich fast... luck. And statistics are against you. One area this book isn't great on is the value of ETFs and robo-managers, which are probably better for most people than trying to balance your own portfolio. [Dollar-cost averaging](http://www. investopedia. com/terms/d/dollarcostaveraging. asp) wasn't really viable when this was written, either, but I *highly* recommend it for the 21st century. I would read this after the book above.\n\n* [The Book on Rental Property Investing](https://www. amazon. com/Book-Rental-Property-Investing-Passive-ebook/dp/B018UTI2DO/). This is more of a specialty thing for those interested in real estate as passive income, but it contains a lot of the same solid advice as the book above about how to think about investments. If you are even remotely interested in this subject (and you do *not* need a lot of money already for this!), this is an amazing and comprehensive book on the topic.\n\nAlso, almost anything by Warren Buffett is a good idea, for obvious reasons, but in particular [this advice](https://www. fool. com/investing/general/2016/01/06/warren-buffetts-15-minute-retirement-plan. aspx) is worth reading. Not necessarily as the end-all solution to money (there is no such thing), but for the general principles it espouses.\n\nI hope this helps someone, probably not and probably way off topic, but you never know."}