{"doc_id": "1202", "name": "2017_04_humanities_student_major_2604_askhistorians", "namespace": "we1sv2.0", "metapath": "", "pub": "AskHistorians", "title": "2017-04-humanities-student-major_2604_AskHistorians.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.111", "Subjectivity": "0.323", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1045", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_672e9i", "Reddit_id": "dgn84b4", "Subreddit_id": "t5_2ssp3", "Commenter": "rimeroyal", "length": "5775", "content_scrubbed": "American doing a UK Master[.] here--I'm in a medieval-focused literature department, so my experience might be a little different from yours, but I can give some general advice about the transition.\n\nLanguage. Seriously, this is the #1 thing I wish my undergrad had focused on more (my tiny state uni didn't even have a Latin program and I'm suffering now), you have to have to have to pick up at least one other language. If you're focusing on British history after 1500, French is a solid choice, followed by German. Both are helpful both for your source material and because Anglophone academia overlaps with French and German scholarship a *lot*.\n\nGet to know one or two professors really well. Whenever a weird question popped into my head about the reading, I'd shoot my professor a quick email. Sometimes that would turn into one-on-ones during office hours. Sometimes those conversations would turn into research papers, and sometimes they'd even turn into friendships that last after you graduate. A lot of undergrads don't realize just how much of academia is networking and making friends, but it[.] essential, not only because scholarship is one big community, but also because grad school can get really lonely and it[.] important to have people with common interests to talk to. Just be chill and chat with the experts about stuff that really interests you both, and you won't come off like a suck-up. If you can, try to find a professor who can give you practical advice for the job market. It[.] nice to hear older tenured professors wax poetic about how valuable our work is. It[.] nicer to hear concrete advice from someone who just wrangled a job and has the nervous twitch to prove it.\n\nSpecific to the UK: be ready for a big change in the way courses are structured. My classes meet once a week each, have one paper grade each, and I'm only expected to meet with my professors formally once every week or two. I was used to a very regimented, class-oriented structure in the States, but here, everything is very independent. Talking with your professors will likely involve them giving you emails of a few other scholars and setting you off on your own, encouraging you to travel and check out other libraries, etc. For some North_Americans, that freeform schedule hits you hard. I got lucky because I was a freelance writer through undergrad, so I got used to making my own schedule, and that[.] very important to nail down early.\n\nConferences. They're like big conventions of people who like the same stuff you like, and they're great for your CV too. While you're in North_America, try to submit an abstract to a conference and get funding from your school to present there. Ask your professors for good conferences to try out--some are deliberately big and inclusive to get new people involved, like Kalamazoo or Leeds for medievalists. If you can get a conference or two under your belt as an undergrad, you'll be in great shape, but don't sweat it if you can't. Also, if my tiny state college fully funded my travel to Kalamazoo, whatever college you're at in Canada can probably do the same--*this is not the case in the UK.* This was the biggest surprise for me. Might be different at Oxbridge, but where I am, you might get a third of your expenses reimbursed if you're going to a big-name conference. Faculty here only have £400 a year in travel expenses, and PhDs come after that in priority, so if you're going for an MA, you'll be fighting for what you can get. Don't get me wrong, being a stone[.] throw away from a ton of primary sources is TOTALLY worth it to me, but that might not be the case for everyone, and you need to be ready for that. Wring that Canadian funding while you can.\n\nHave a backup. I don't mean this in a \"lol jobless humanities\" way, because I think everyone in this sub is smarter than that, but the fact is that everyone across the board is hurting in the job market, so it[.] good to plan for the future. I started by thinking, \"if a freak accident happened and made me unable to stay in grad school right this second, how could I support myself?\" I prepared for it in undergrad, and I feel a lot better about going through grad school knowing I wouldn't be outta luck if this doesn't work out. But that[.] just general life advice in this job market. This goes for your MA of choice, btw. Your heart might be on Oxbridge, but do some research and find out what else there is out there. Oxbridge[.] resources are absolutely unmatched, and I'd kill to have the Bodleian library in my backyard, but being a good fit with your future thesis supervisor is also important. Definitely more important in the PhD than MA, but still important for MAs. Which brings me to the last point...\n\nIn your senior year, email some professors at your universities of choice. I made a short-ish template that went like \"Hi Prof X, I'm an undergrad interested in this MA program and I see you research this and that, and it just so happens that I'm interested in this and that, and I've written papers on this and that. I was wondering if you would be interested in supervising this and that, and if not, if you know anyone else off the top of your head who might?\" I got warm replies across the board, and some people even referred me to buddies in other universities who were closer to what I'd want to do. Some of those conversations still go on to this day, now that I'm looking around for PhD programs.\n\nIf you want any advice on more practical stuff like moving or adjusting to life in the UK, feel free to PM me. I had a *really* rocky start here, which is probably why I can ramble on and on about it. But things are beyond fab now, and I'd love to help anyone else avoid the same potholes. If I think of anything else, I'll tack it on."}