{"doc_id": "413", "name": "2017_10_humanities_student_major_1710_teachers", "namespace": "we1sv2.0", "metapath": "", "pub": "Teachers", "title": "2017-10-humanities-student-major_1710_Teachers.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.08", "Subjectivity": "0.344", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1089", "Permalink": "http://reddit.com/r/Teachers/comments/7797mp/principal_money_matters_race_matters_grit_talk/dokotwz/", "Threadlink": "http://reddit.com/r/Teachers/comments/7797mp/principal_money_matters_race_matters_grit_talk", "Parent_id": "t1_dokotid", "Reddit_id": "dokotwz", "Subreddit_id": "t5_2qqcs", "Commenter": "HereWee", "length": "6122", "content_scrubbed": "PART 2:\n\n\nQ. Your book is titled \"When Grit Is Not Enough.\" What did you make of the movement to instill and assess \"grit\" in young people?\n\nA. ARGH! So when I first read Paul Tough[.] book I was intrigued, and we did some work at BAA with thinking about the traits he discusses there.\n\nBut as I began to visit more schools and talk to my alums who were incredibly \"gritty,\" I became actually disgusted with the \"movement.\" It is a movement, for the most part, \"owned and operated\" by white folks and executed onto black and brown bodies.\n\nOf course you don't get ahead without determination and persistence, and it[.] one of the reasons I'm such an arts advocate. That[.] what you learn in the arts: how to practice, how to work together, how to persist through difficult scenes, lines, choreography, etc. . . . but this notion that \"if we show grit by having strict behavioral codes/rules, all will be well\" is ridiculous.\n\nI've seen so many schools now — all black/brown kids and majority white teachers — where this 1950s kind of discipline rules. Again . . . it[.] good to look people in the eyes, it[.] good to sit up, it[.] good to pay attention, but the example I write about in the book in a NON-no-excuses school, where the level of dialogue/discussion was so high and kids were in all manner of \"repose,\" proves to me that these somewhat oppressive conditions are NOT the only way to have an engaging classroom. Of course teachers need and want order, but all this \"hugs and bubbles\" stuff has taken it too far.  Silent cafeterias? I have seen LOTS of that. What is that about?\n\nI always go back to this: Would I want my own kids in this school? Hard to say \"yes\" for many of these \"no-excuses\" gritty-type schools. Yes, I know they have good test results. (They also do a pretty good job of making sure that they kids who can't live by the grit rules don't stay in the school), but I go back to my earlier points: School must also be about getting along, learning to work with those giggling boys and learning that there are different ways of expressing oneself.\n\nI've seen too many boys (especially black/brown boys)  suffocated by what has become grit pedagogy. Kids need to jump and play and yell and run. Of course not in the classroom all the time, but we must ensure that there are multiple methods to reach and teach our students. I think this \"movement\" needs to be curbed and I am pleased that even some of the \"worst\" offenders are now questioning their tactics.\n\nQ. If you could advise Betsy DeVos on education policy, what are the most important things you would tell her?\n\nA. This is what I'd say:\n\nDear Secretary DeVos:\n\nWe will never test our way to equality. The mass amounts of data we are now poring over only show us that all this testing has not done much to improve our schools.\n\nOf course we need standards and some way to measure results,  but we have gone too far.\n\nTed Sizer had it right. Read \"Horace[.] Compromise\" and \"Horace[.] School\" — again (I hope you have already read them once). Ted argued for minimal testing — the floor — not the ceiling, so to speak. Read \"Horace[.] Hope.\"\n\nRead Vito Perrone[.] \"A Letter to Teachers\" to understand the ways in which we need to protect this profession. Teachers cannot be the \"whipping posts\" for every issue that ails society. Teachers need unions that will protect them when and if they need to speak out. Don't try to destroy teachers' vehicles for leadership development. Look at how Finland professionalized teaching in the last 30 years. They made teaching a profession that was  hard to get into (recruited from top of the university class) and gave teachers a lot of autonomy in what they teach and how they organize their classrooms. They made teachers some of the highest paid in the country. These are lessons that we can all learn from. I know we are a large heterogeneous country and not a small homogeneous one, but if you go with an open mind you will see that there are really lessons that we can incorporate here. I was fortunate enough to visit and I came back filled with ideas.\n\nFor instance: Every child has a rich arts, music and woodworking education — just to mention a few. I believe you could encourage all schools to offer a rich and creative curriculum. Right now if you grow up poor or in the city, you can also be guaranteed you will not receive education in music, visual arts, theater, dance or creative writing. I think this is a travesty. You could use your bully pulpit to exhort schools to stop eliminating the arts.\n\nAnswer Sheet newsletter\nEducation questions and answers, in your inbox weekly.\nSign up\nI know you are very interested in how business can help our schools. You might look at the Swiss system to see how they are providing apprenticeships for a large percentage of the population. This is something we could implement.\n\nNow back to this county: I believe parents should have good options, but the choice system you have helped create in Michigan has led to the destruction of too many public schools.  Competition has not served us well. It has not improved schools. It is great for professional sports. But we have seen that competition only advantages those who know how to \"work the system\" and disadvantages most others. We cannot keep exacerbating gaps between the haves and have-nots. This should be a real focus of your work.\n\nFor-profit schools have been a disaster for too many. I hope you can read my book to hear how badly my students were hurt by these schools. This is no way to run a public education system. They should be outlawed.\n\nFinally, integration matters. I worry that too many of our schools are becoming resegregated and that young people will have fewer and fewer opportunities to work with children who may come from different backgrounds, economically, racially, linguistically, ethnically. We need many opportunities for young people to come together while in school and get to know one another. School may be the only place where we can provide these kind of experiences.\n\nIt[.] important that we make policy decisions that will help our students and schools thrive."}