{"doc_id": "286", "name": "2017_10_humanities_student_major_482_taiwan", "namespace": "we1sv2.0", "metapath": "", "pub": "taiwan", "title": "2017-10-humanities-student-major_482_taiwan.txt", "pub_date": "2017-10-06T00:00:00Z", "Sentiment": "0.048", "Subjectivity": "0.254", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "293", "Permalink": "http://reddit.com/r/taiwan/comments/74otp6/phd_programs_in_taiwan/do06y1y/", "Threadlink": "http://reddit.com/r/taiwan/comments/74otp6/phd_programs_in_taiwan", "Parent_id": "t3_74otp6", "Reddit_id": "do06y1y", "Subreddit_id": "t5_2qhrg", "Commenter": "King-Peasant", "length": "1772", "content_scrubbed": "Umm, i think i'll rephrase my answer to help you out a lot more. Taiwan[.] college education system is grouped into three main groups. Group 1 is humanities, literature, cultural majors (lawyer, historian, archeologist, language majors, etc). Group 2 is math related (engineer, accountant, math major, etc). Group 3 is medical/health majors (doctor, dentist, nurse, psychologist, sports medicine, etc). The master degree would be an extention of our majors. Usually if you majored in something health related, you would pick something that is related to the third type (medical/health related). \n\nNow what threw me off was that you mentioned you want to apply for anthropology, this is considered part of the first type. When you apply for the position, i think its reasonable to expect someone who has majored in something similar to apply. You also mentioned biology, which is the third type. Picking between 1st group to 3rd group is a little crazy because the two are not related to each other. Its doable... but most master and phd programs have a requirement that you complete certain amount of college credits in that field. This is the same in america too.\n\nYou didnt answer what you majored in so i wont press any further. But a helpful tip, youll have to see what requirements they have for each program. A master degree in something biology related will require you at least have x amount of science credits (biology, chemistry, biochem, etc) in your GED. While something anthropology related will have requirements in the complete opposite direction, (most likely language and humanity credits). We are talking about basic requirements when you fill out the application. I think you can focus down programs you want to be in after reading this. Hope this helps."}