{"doc_id": "539", "name": "2017_10_humanities_student_major_3046_riceuniversity", "namespace": "we1sv2.0", "metapath": "", "pub": "riceuniversity", "title": "2017-10-humanities-student-major_3046_riceuniversity.txt", "pub_date": "2017-10-31T00:00:00Z", "Sentiment": "0.043", "Subjectivity": "0.401", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "285", "Permalink": "http://reddit.com/r/riceuniversity/comments/79tzhf/is_it_possible_to_double_major_in_chemical/dp5eceb/", "Threadlink": "http://reddit.com/r/riceuniversity/comments/79tzhf/is_it_possible_to_double_major_in_chemical", "Parent_id": "t3_79tzhf", "Reddit_id": "dp5eceb", "Subreddit_id": "t5_2s3mw", "Commenter": "Tikimoof", "length": "1657", "content_scrubbed": "It should be possible: I did Electrical Engineering and History. I took a fifth year for the heck of it, but I had all of my course requirements done at the end of the fourth year.\n\nMost of those BAs require 30 hours/10 classes of coursework for the major if you're a dual-degree (Fun fact: the hour requirements are really low in the Humanities departments to help you do what you're planning). See the English requirements [here](https://english. rice. edu/undergraduate/english-major/degree-requirements). Since AP credit won't count towards the major, you'll have two semesters where you'll need to take 2 English classes. Every other semester, you can get away with 1. And honestly, if you enjoy the subject, it may be a good breath of fresh air to have a guaranteed non-science class each semester. I cherished my history classes.\n\nI'm not sure exactly of the CHBE course order, but you may want to do those two-class semesters near the end of your degree, since you have so many science/math pre-reqs to get through to be able to finish on time. I'd talk to course advisors in both departments. CHBE first to figure out when you have the time to put in those two-class semesters, and then ENGL to see if they have a recommendation of when you should take those few required classes. It looks like you'll want ENGL 200 as soon as possible, and probably 300 soon after.\n\nIt *will* be a lot of work, but the work is so different that hopefully it won't be too bad. Don't procrastinate on those papers that will be due during engineering project weeks!\n\nEDIT: The more credit you get from AP/IB, the easier this will be. Especially in distribution classes."}