{"doc_id": "349", "name": "2017_10_humanities_student_major_1121_professors", "namespace": "we1sv2.0", "metapath": "", "pub": "Professors", "title": "2017-10-humanities-student-major_1121_Professors.txt", "pub_date": "2017-10-11T00:00:00Z", "Sentiment": "0.043", "Subjectivity": "0.376", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "593", "Permalink": "http://reddit.com/r/Professors/comments/75q31q/what_should_the_average_test_score_be/do980li/", "Threadlink": "http://reddit.com/r/Professors/comments/75q31q/what_should_the_average_test_score_be", "Parent_id": "t3_75q31q", "Reddit_id": "do980li", "Subreddit_id": "t5_2svhp", "Commenter": "remnbibi", "length": "3118", "content_scrubbed": "I also teach in Humanities. I have some Intro classes, and its a first semester survey course for first year students at a CC. If you get below a C in this class, you have to actively apply yourself to not giving a shit over an extended period of time. Some of what they do is taking quizzes. We can't assign them papers. So, there is a certain amount of, \"who painted this, and which philosopher said that?\" If I made the class too difficult it would be over their heads or would reward people just for memorization, not for understanding deeper concepts. So I try to make their grades more about projects that are based on different skills and critical thinking. They still get quizzes on the material from the unit, and they get a midterm and final. But, they have projects, based on applied concepts that are weighted as heavily as your traditional quizzes and tests. In general I don't end up with a lot of F[.] and D[.] because those students don't have the basic skills to be in college. They get poor grades because they stop doing work or coming to class. Most A and B students start out that way and stay that way due to a general good work ethic, and they earn their grade. Their grades are not relative to a curve. Any student who has a C was probably skating around a D at some point and squeaked out a C in the last part of the semester.\n\nFor my higher level courses I don't worry about a grade distribution. I want them to learn certain skills based on applied knowledge. And I only give traditional tests because I have to give a couple. I don't think traditional tests are a very good assessment of learning in the Humanities. Humanities should assess deep thinking over time, and that is not always testable. Anyone can learn to game multiple choice tests, or fake a 5 paragraph essay in those stupid blue books. Those types of assessments really just reward students who know how to play the system. And, they are a pain in the ass to grade. I give multiple assessments throughout the semester that are weighted lower than a test but I think give a more accurate assessment of the students' progress over time. I still end up with mostly A, B, and C students. That is because the D and F students just stop coming to class, or are in denial. If a student gets an A or an F, they earned it based on the criteria I set for the entire class. I don't think of C as an average. If the D and F students drop out, now what a C is changes.  \n\n I prefer written assessments or projects. You can have an amazing class at 10 AM, where almost everyone in the class deserves an A or B, and teach the exact same class at 2 PM, and you have to hit them over the head with a hammer to get them to pay attention. If the class is smaller, sometimes, even 4 students can make a world of difference in either direction. Why punish students based on the performance of other students in the same class or subject? I think you should worry less about test scores and focus more on what skills you want them to take into the world with them. What are they going to remember in a week, a month, a year, 5 years, a lifetime?\n\n"}