{"doc_id": "1005", "name": "2017_04_humanities_student_major_806_adviceanimals", "namespace": "we1sv2.0", "metapath": "", "pub": "AdviceAnimals", "title": "2017-04-humanities-student-major_806_AdviceAnimals.txt", "pub_date": "2017-04-08T00:00:00Z", "Sentiment": "-0.016", "Subjectivity": "0.215", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "291", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfzn4n9", "Reddit_id": "dfzn9xm", "Subreddit_id": "t5_2s7tt", "Commenter": "BrianLemur", "length": "1606", "content_scrubbed": "Yes, and why don't you tell me what kinds of classes and subjects must be covered in order to major in liberal_arts? (Here[.] a hint: It[.] probably a lot of math, logic, rhetoric, sciences, and yes, a smidge of art and philosophy).\n\nSee, herein lies the other problem. People fundamentally misunderstand college and the job market. You can either specialize in college--get a degree in, say, music therapy, like I did, and then plan to be a music therapist for the rest of your life--or you can get a general degree. \"Liberal arts\" is a degree that requires overall knowledge in a lot of subjects. It requires you to be well rounded, and understand MANY aspects of the world--not just one narrow subset. The problem is, \"liberal artist\" is not a job, so people think of the degree as useless. There are a lot of jobs out there for someone with a liberal_arts degree, though--many jobs just require *any* degree. But if I apply for an HR job that requires *any* degree, and so does someone with a liberal_arts degree, if all else is equal, that person with the liberal_arts degree will probably get the job. I'm a specialist. They have given themselves room to move. With mobility comes unstable pay, but that[.] a trade off--they haven't strapped themselves down for the next 20 years as they pay off their loans, and I have. They can move around and experience different fields, and I will probably be schlepping a guitar around for the rest of my life. I COULD apply for one of these other jobs that simply require *any* degree, but someone with a more broad degree may be a better fit for such a position."}