{"doc_id": "299", "name": "2017_10_humanities_student_major_609_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2017-10-humanities-student-major_609_GradSchool.txt", "pub_date": "2017-10-07T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.495", "Score": "17", "Upvotes": "0", "Downvotes": "0", "Wordcount": "448", "Permalink": "http://reddit.com/r/GradSchool/comments/74zx8j/how_do_you_gogetters_do_it_are_yall_even_human/do2ffoa/", "Threadlink": "http://reddit.com/r/GradSchool/comments/74zx8j/how_do_you_gogetters_do_it_are_yall_even_human", "Parent_id": "t3_74zx8j", "Reddit_id": "do2ffoa", "Subreddit_id": "t5_2r4r8", "Commenter": "Boudicca13", "length": "2334", "content_scrubbed": "I don't know if I qualify for all of those activities, but I take classes full time while TAing and trying to exercise 3-6 times a week. Independent study is squeezed in whenever possible (I'm in the humanities, so I read a lot). I also try to make sure that every night when I'm finally home from school, I can spend it focusing on interacting with my husband. Or a random video game, whatever we're in the mood for.\n\nWhat I have found that works for me is front-loading my semester with homework. For my TA job, I will be handed 120+ tests/papers four to five times a semester (typically, some classes will differ) with the expectation that they be done within a week. This doesn't take into account my own tests, papers, classes, research, etc. So I spend the first three weeks to a month doing every reading or assignment on the syllabus that I possibly can. Obviously there are some that require context from class, collaboration with other students, etc. But if in the first two months I have to read 6 chapters in a particular book? I spend all my \"free time\" reading it. I've found, especially as a TA when some of my weeks are basically forfeit to grading, it means that you feel at least slightly less like you are drowning. It can also help when you inevitably lose a week - losing a pet, death in the family, ass-kicking illness, super awesome concert you couldn't pass up. \n\nI typically work/study/research six days a week. But I try to balance it out - if I'm stuck in my office/in classes for 12 hours three days a week, then I work less on the other three days (still have to hit my minimum goal, but sometimes I just work for four hours instead of eight). Whenever possible, I work in going to the gym at my school or, if I'm home, turning on one episode of a favorite show while I work out (But only for ten minutes, you can guarantee I spend the rest of my time on my ass). \n\nUntil the very end of a semester when all hell breaks loose, I have one rule: Sunday is my day off. That is the only day my husband and I have off. Unless a dire situation has arisen, I will not check emails or study on that one day. It creates a boundary and a drive. I have a reason every week on the days I spend at home to work hard enough that Sunday is guilt free, even if all I do is get shit-faced and eat too much with my husband."}