{"doc_id": "1251", "name": "2017_04_humanities_student_major_3125_engineeringstudents", "namespace": "we1sv2.0", "metapath": "", "pub": "EngineeringStudents", "title": "2017-04-humanities-student-major_3125_EngineeringStudents.txt", "pub_date": "2017-04-27T00:00:00Z", "Sentiment": "0.117", "Subjectivity": "0.524", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "290", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67yw3r", "Reddit_id": "dgukj53", "Subreddit_id": "t5_2sh0b", "Commenter": "MrGoldenFedora", "length": "1696", "content_scrubbed": "To be anecdotal: myself and most of my friends have found humanities/'lighter' sciences to be much easier to get good grades in than engineering classes. The concepts presented in them can, for the most part, be learned by attending lectures and doing assignments. Now, take a thermodynamics class for example and unless you're a prodigy that shit won't be clicking until you smash your head against some dense textbook for a few hours. Engineering is complex and you probably won't do well unless you pour in a lot of frustration filled hours, this isn't unique to engineering but it[.] especially prominent here and its why engineering is called 'hard'. \n\nSpeaking for myself, writing is easy. I can freestyle a 10+ page essay and get a great grade, and so can many other people who have natural abilities in the humanities. On the other hand I don't think I've met more than two people who can just walk into an engineering exam without preparation or freestyle a complicated technical report with only a couple hours and expect high marks. \n\nEngineering is difficult for almost everyone since 'natural talent' is nearly useless (unless you are a one in a thousand student). This is why engineering has high drop-out rates despite being filled with 'the smart kids'. Impostor syndrome is plentiful here because the materials is so time-consumingly complex that everyone thinks they are behind. \n\nWhen I look to other majors where the students seem to have confidence in their abilities and yet also have loads of time to go out and have fun, I can't help but imagine things are more difficult over here at an objective level, but I suppose I couldn't know unless I walked a mile in their shoes."}