{"doc_id": "465", "name": "2017_10_humanities_student_major_2284_the_donald", "namespace": "we1sv2.0", "metapath": "", "pub": "The_Donald", "title": "2017-10-humanities-student-major_2284_The_Donald.txt", "pub_date": "2017-10-24T00:00:00Z", "Sentiment": "0.201", "Subjectivity": "0.542", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "956", "Permalink": "http://reddit.com/r/The_Donald/comments/78f0p9/my_high_school_is_holding_spirit_week_this_week/dotkx0o/", "Threadlink": "http://reddit.com/r/The_Donald/comments/78f0p9/my_high_school_is_holding_spirit_week_this_week", "Parent_id": "t1_dotcdnx", "Reddit_id": "dotkx0o", "Subreddit_id": "t5_38unr", "Commenter": "PM_ME_YOUR_MORPHINE", "length": "5574", "content_scrubbed": "More importantly than that (because whether or not someone can afford college doesn't determine whether they should be there or not), the real problem with gov backed student loans is that the schools now know that they'll get people applying regardless of how expensive it is, so they splurge on nonsense that nobody would actually want or pay for if it weren't for the fact that their loans are guaranteed. So you get colleges with an absurdly huge bureaucratic administration system, filled with overpaid admins and make-work all around, and then they'll buy a shit-ton of amenities to try and make their school look more attractive than the next guy, amenities that students don't actually want and wouldn't pay for, if they were actually paying for it themselves.\n\nGov backed loans is perhaps the primary reason college is so over-priced right now. The worst part is that many of these colleges don't even succeed in teaching their students, and are more concerned with creating more jobs for bureaucrats so they can be even more bloated than they already are. When the gov backs loans for something like college, it essentially becomes a gravy train for everybody that works at the college. They have no incentive not to squeeze that gravy train dry, and the competition with other schools essentially just becomes who can have the most bs amenities to make students choose them over another school. Since the loans are backed, their 'customers' (students) don't have an incentive to demand they scale back or that they be more cost-effective. \n\nCan you imagine how much worse it would be if Bernie got to do what he wanted? The bottom would completely fall out, and the schools would go full-speed-ahead when it comes to just bloating themselves in every possible way, basically handing money away to all their admins and shit. \n\nIt can't be understated how important it is for an institution that is providing a commodity to have some kind of incentive to be cost-effective. As it is, the gov backed loans almost completely eliminate that incentive, and if we were to socialize education it would just go completely out of the window. Not to mention it[.] already damn near impossible to fire teachers or college administrators, and every day they do everything they can to both create more positions who[.] sole purpose is to use up more money and entrench the bureaucracy they've created, making it impossible to eliminate. Gov backed loans are ruining the education system, and most importantly, they are making it far more expensive than it needs to be. Eventually we'll get to a point where there isn't one college that is cheap and focuses just on giving the education their students want, they will just be bureaucrat/administrator gravy trains.\n\nAt this point, I dream of a future where it[.] not the government that standardizes education, and where big businesses could just create their own schools to educate and train employees for themselves. We'd probably see more scholarships -- they could invest in a student they see potential in, with an agreement that this student will work for them for at least X years once they graduate. It would also mean their only real incentive would be to make the most productive employees possible, which would mean students learning actual skills that will actually help them in the workforce. People need to wake up and realize that we're at a point where your gender studies or anthropology PhD is more of a leisure activity than anything else, and that if people want to learn about that stuff then they shouldn't expect society at large to pay for it. If businesses could make their own schools, you would certainly see them investing in students in STEM fields, but something tells me no business would see the upside to putting a student through a gender studies degree. Which means there[.] really no reason for our taxes to be paying for a gender studies degree, since we know there[.] not going to be any actual contribution to society at large with that kind of education. That[.] not to say there[.] no value in a liberal_arts degree or an art history degree, but we're kidding ourselves if we think that[.] actually preparing somebody for the workforce. It[.] a very small percentage of those students that will actually go on to use those degrees while working. But in a truly capitalistic, free-market economy society, I have no doubt that tons of people would have the wealth and free time to study these things. They should just have to do it on their own dime. Meanwhile, GE can give a scholarship to the bright young kid from the ghetto, paying for the best of the best stripped down education so they can hand him a high paying job, fully aware of what he[.] capable of because they were the ones that have been putting him through school. It could be a force for real good, to do things this way. Instead, we care more about lazy administrators and tenured professors and their quasi-gangster unions than we do about actual students or the well being of society at large. Statists have this dream that taxes and the government would be able to do what I just described GE doing, but they've tried and tried and constantly fail, mostly because all the cogs in their machine are just looking out for themselves, despite how altruistic they pretend to be. It[.] only when there[.] a situation where everybody involved wins, where GE gets a loyal and highly-skilled employee, and where that student and then employee gets a free top-tier education and guaranteed job, that this kind of thing can actually happen."}