{"doc_id": "1281", "name": "2017_04_humanities_student_major_3314_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2017-04-humanities-student-major_3314_UofT.txt", "pub_date": "2017-04-29T00:00:00Z", "Sentiment": "0.254", "Subjectivity": "0.445", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "356", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_68c1qe", "Reddit_id": "dgxaqug", "Subreddit_id": "t5_2rbaq", "Commenter": "emthinkenpoodo", "length": "2409", "content_scrubbed": "I know nothing about NYU but I majored in English at Vic so I can tell you a bit about that. \n\n**Victoria College**: really great community for the humanities. There are lots of great [clubs/opportunities](http://www. vic. utoronto. ca/students/campuslife. htm) for people who are interested in English/other humanities. For example, I was EIC of a short story journal (and on the editorial board for a few years), and was section editor for the humour section of the Victoria College newspaper, [The Strand](http://thestrand. ca/). It[.] a pretty inclusive community (especially if you live on res) and easy to get involved in clubs and things. These can also lead to pretty good opportunities outside the university... for example, a number of my friends who were also involved with The Strand [won national student journalism awards through NASH](http://www. nash79. com/jhm-winners/) and have gone on to pursue master[.] in journalism, work at newspapers, or work as editors in other capacities (at publishing houses, journals, etc.). Vic also has [a ton of humanities-based scholarships](http://www. vic. utoronto. ca/students/Financial_Matters/scholarships_awards. htm) available to students. Finally, Vic has a ton of [cool programs](http://calendar. artsci. utoronto. ca/crs_vic. htm) that you can pursue that I was entirely unaware of when I started at U of T.\n\n**English major**: The program is mostly pretty broad, which you can see if you've taken a look at the [required courses](http://calendar. artsci. utoronto. ca/crs_eng. htm#ASMAJ1645), but I found most of the upper year courses to be pretty great, and there was a wide enough variety of courses that I could kind of tailor my degree to what I was interested in (CanLit and modern fiction). Some of the profs are really great, and the upper year seminar classes give you the chance to actually write good, publishable work (I've published several of my essays from 3rd/4th year courses). That being said I wasn't particularly blown away by the program, I think it[.] a pretty standard English major with a relatively large number of courses to choose from.\n\nThis was pretty rambly, I hope it was at least somewhat helpful. Let me know if you have more questions about anything! :)\n\nEdit: BTW U of T offers a [writing and rhetoric minor](http://calendar. artsci. utoronto. ca/crs_ini. htm#ASMIN2137) that might be of interest to someone wanting to pursue journalism. "}