{"doc_id": "454", "name": "2017_10_humanities_student_major_2204_sino", "namespace": "we1sv2.0", "metapath": "", "pub": "Sino", "title": "2017-10-humanities-student-major_2204_Sino.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "0.011", "Subjectivity": "0.241", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "526", "Permalink": "http://reddit.com/r/Sino/comments/789ty4/hong_kongs_new_chinese_opera_centre_will_be_run/dos4muz/", "Threadlink": "http://reddit.com/r/Sino/comments/789ty4/hong_kongs_new_chinese_opera_centre_will_be_run", "Parent_id": "t3_789ty4", "Reddit_id": "dos4muz", "Subreddit_id": "t5_38jyn", "Commenter": "poster5439", "length": "3410", "content_scrubbed": "\n\nHong Kong[.] new Chinese opera center will be run by an American, and local performers aren't happy\n\n19 October, 2017\n\nCantonese opera performers in Hong Kong said they were \"extremely disappointed\" after the job of running the city[.] new showcase for the traditional art form went to an American.\n\nA stalwart of the local opera industry said Beijing-based consultant Alison Friedman[.] appointment to the post contradicted promises by the arts chief that the West Kowloon Cultural District, where the Xiqu Centre will stand, would nurture local talent.\n\nThe Chinese Artists Association of Hong Kong, which represents more than 1,000 Cantonese opera performers, said in a statement that it had expected the job of Chinese opera chief to be separate from posts overseeing other art forms.\n\nBut the position has been bundled in with others, to be held by one person.\n\nThat person will be Friedman, whom the West Kowloon Cultural District Authority appointed last Wednesday as director of performing arts, leading its Chinese opera, dance, theatre and music teams.\n\nThe new director will oversee productions at the Xiqu Centre, the district[.] Chinese opera venue, which is still under construction and is expected to open late next year.\n\nLiza Wang Ming-chun, a long-time chairwoman of the association and a renowned local performer, said the authority had pledged to appoint an independent art director for the Xiqu Centre.\n\n\"The management reneged on their promise ... We are extremely disappointed,\" Wang said.\n\nShe said Friedman did not have any experience with xiqu, or Chinese opera, and there were many suitable candidates in Hong Kong.\n\n\"I have no doubt of the academic calibre of the artistic director, but xiqu is about artistic attainment,\" Wang said in an interview. \"The authority has a mentality of putting the arts hub on the international map by hiring foreigners.\"\n\nShe said the authority[.] two previous chief executives as well as the incumbent all being British was evidence of that.\n\nWang said such appointments contradicted pledges from the authority to boost Hong Kong talent.\n\n\"The authority has always emphasised the importance of nurturing local talents, but a local director is not hired,\" she said.\n\nFriedman is the founding director at Ping Pong Productions, a Beijing-based consultancy promoting cultural exchanges. She has worked in China for almost two decades.\n\nHaving majored in Chinese literature and literary translation at Brown University in the US, she is a fluent Mandarin speaker. She lectures at various universities in China and around the world.\n\nIn response to the association[.] complaint, the authority said on Wednesday that it was openly recruiting a head of Chinese opera, and that whomever it appointed would be an integral part of the artistic team under Friedman.\n\n\"As a further measure, the appointment of artistic advisers [at the Xiqu Centre] is also being finalised and will be announced shortly,\" the authority said.\n\nWang said the authority should clarify the relationship between the head of the Xiqu Centre and Friedman.\n\n\"If the head of Xiqu Centre plays an administration role and the artistic director knows not much about xiqu, who should give the development direction?\" she asked.\n\nThe Post has reached out to Friedman for comment.\n\nhttp://www. scmp. com/news/hong-kong/article/2115975/hong-kongs-new-chinese-opera-center-will-be-run-american-and-local"}