{"doc_id": "281", "name": "2017_10_humanities_student_major_472_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2017-10-humanities-student-major_472_news.txt", "pub_date": "2017-10-06T00:00:00Z", "Sentiment": "0.092", "Subjectivity": "0.363", "Score": "14", "Upvotes": "0", "Downvotes": "0", "Wordcount": "258", "Permalink": "http://reddit.com/r/news/comments/74nzj6/a_staggering_98_percent_of_the_current_39million/do010a7/", "Threadlink": "http://reddit.com/r/news/comments/74nzj6/a_staggering_98_percent_of_the_current_39million", "Parent_id": "t1_dnzze5k", "Reddit_id": "do010a7", "Subreddit_id": "t5_2qh3l", "Commenter": "RiskBoy", "length": "1572", "content_scrubbed": "Ya, a big reason that tuition is going up across the board is because colleges are all trying to expand out their programs to make themselves more appealing to both wealthy donors and wealthy students. This includes top rate living, academic, campus, and athletic spaces. It basically becomes a huge race to the bottom to attract the top wealthy kids. The year before my freshman year, tuition at my liberal_arts college was 31k a year, which wasn't bad given the very low student:professor ratio and overall strong academic programs. It was also know to have a highly diverse student body (20% international) and definitely very hipster/alternative. Starting with my year they jacked the price of tuition up by 3-4k, each year and, a decade later, it now stands at 50k. Over that time they built one of the biggest division III gyms in the country (we used to be laughable at sports), hired top soccer and football coaches, and started pouring more money into recruitment. They also started refurbishing all the dorms, classrooms and college spaces. The quality of education didn't improve, just the campus experience. They also ended need blind acceptance, admitting 50 students a year (about 8% of the freshman class) based on their ability to pay full tuition before looking at other acceptance criteria.      \n       \nUnfortunately, the few wealthy people that universities are trying to attract is causing tuition costs to spiral out of control. Where each university cares only about trying to be the next Ivy, rather than trying to establish an individual identity"}