{"doc_id": "378", "name": "2017_10_humanities_student_major_1414_c_s_t", "namespace": "we1sv2.0", "metapath": "", "pub": "C_S_T", "title": "2017-10-humanities-student-major_1414_C_S_T.txt", "pub_date": "2017-10-15T00:00:00Z", "Sentiment": "0.067", "Subjectivity": "0.47", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "341", "Permalink": "http://reddit.com/r/C_S_T/comments/76i5yu/how_i_feel_the_msm_may_spin_the_weinstein/dof0hmx/", "Threadlink": "http://reddit.com/r/C_S_T/comments/76i5yu/how_i_feel_the_msm_may_spin_the_weinstein", "Parent_id": "t3_76i5yu", "Reddit_id": "dof0hmx", "Subreddit_id": "t5_37lis", "Commenter": "963189_137", "length": "2153", "content_scrubbed": "\"what is wrong with our society?\".\n\n###New [Muslim Mayor of London] (http://www. independent. co. uk/news/uk/home-news/sadiq-khan-london-mayor-terrorism-attacks-part-and-parcel-major-cities-new-york-bombing-a7322846. html):\n\nSadiq Khan has said he believes the threat of terror attacks are \"part and parcel of living in a big city\" and encouraged Londoners to be **vigilant to combat dangers**.\n\nPeople are either going to 'figure this out' or not.  They are either going to notice that they are 'occupied by a hostile Dual Citizen government' who CREATES the problems to [.]olve' those same problems by putting you in a cage without a key.  \n\nThese same 'people' (and I use that term loosely) are perpetuating fear and destruction for their own benefit.  No slave will be as docile and willing as the one that gets into the slave pen of their own choice.  \n\nAt some point you all are going to have to make a choice, YOU WILL GIVE UP YOUR FEAR OF BEING CALLED 'A NAME'... and set their society straight again or **live with the consequences**.  \n\nObviously, if people like the kind of things that 'people' like Weinstein represents; the absolute moral degradation of mankind until they are nothing more than a stupid beast... then that is what they can expect for their future and their children[.] future so long as the 'Empire' lives.  You should see the places they *want* to take you; as you willing lower yourselves into deviant immoral behavior... you ain't seen nothing yet.\n\nand turning a blind eye when they abuse said power in the most grievous ways.\n\nThey aren't 'turning a blind eye', dear...**they enjoy your suffering, the mayhem and hurt they are causing you**.\n\n\"It is in the jewish interest, it is in humanities interest that whites experience genocide [meaning the end of us all]. Until white children are burned alive, white women are raped, mutilated, murdered and all white men who have not been slaughtered watch powerlessly as their people are terrorized; only THEN will mankind be on an equal footing, ready to discuss white privilege and the apparent chip on the shoulder that minorities have.\" \n-Ishmael Levittes\n\nHave a 'good day'...\n\n"}