{"doc_id": "246", "name": "2017_10_humanities_student_major_182_memphis", "namespace": "we1sv2.0", "metapath": "", "pub": "memphis", "title": "2017-10-humanities-student-major_182_memphis.txt", "pub_date": "2017-10-03T00:00:00Z", "Sentiment": "0.184", "Subjectivity": "0.416", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "308", "Permalink": "http://reddit.com/r/memphis/comments/73yite/cbu_or_memphis/dnuj673/", "Threadlink": "http://reddit.com/r/memphis/comments/73yite/cbu_or_memphis", "Parent_id": "t3_73yite", "Reddit_id": "dnuj673", "Subreddit_id": "t5_2qpqw", "Commenter": "tinduck", "length": "1919", "content_scrubbed": "I might be a bit bias as a graduate of Herff College of Engineering. But honestly, I have never been that impressed with CBU graduates. In my experience, they are pretty meh. And my colleagues at some of the major engineering firms in town pretty much agree with me. At least the CBU graduates that stay in the city anyway. I have only met one that was decent, but he went to a good graduate program. \n\nI don't know why you think CBU has a better CS program than Memphis. The UofM CS department has research grants that are almost a third of CBU[.] endowment. [2] Memphis has the 80th best CS program in the country according to a study by Temple University. [3] We have more alumni in the city spread out among the absolute best shops. And we typically get into amazing graduate programs when we graduate. \n\nThe ROI is nonsense metric since CBU doesn't graduate that many teachers or social workers. Honestly, you did take a statistics course right? In addition, the good graduates from the UofM don't pay to go to school. I didn't pay a dime for my undergraduate at the University of Memphis. I didn't pay a dime for my masters degree at the Georgia Institute of Technology. \n\nAnd honestly, the truth is that CBU as a undergraduate school is in trouble. They have gone from 1534 to 1292 undergraduate students from 1998 to 2015. During the same time, Rhodes went from 1427 to 2007 undergraduate students. CBU has a small endowment. It can't take the drop in enrollment, while keeping up that ridiculous discount rate. It[.] going to end up like all the other small liberal_arts colleges that are closing across the country. [1]\n\nHonestly, It[.] a clear easy choice. 🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅🐅\n\n[1] - https://www. insidehighered. com/news/2015/09/28/moodys-predicts-college-closures-triple-2017\n\n[2] - http://www. memphis. edu/cs/news_and_events/news/2017_md2k_mperf. php\n\n[3] - http://www. dabi. temple. edu/~vucetic/CSranking/#/"}