{"doc_id": "354", "name": "2017_10_humanities_student_major_1170_cornell", "namespace": "we1sv2.0", "metapath": "", "pub": "Cornell", "title": "2017-10-humanities-student-major_1170_Cornell.txt", "pub_date": "2017-10-12T00:00:00Z", "Sentiment": "0.005", "Subjectivity": "0.285", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "407", "Permalink": "http://reddit.com/r/Cornell/comments/75xz3p/kicked_out_of_cornell_for_a_semester/do9zsbu/", "Threadlink": "http://reddit.com/r/Cornell/comments/75xz3p/kicked_out_of_cornell_for_a_semester", "Parent_id": "t3_75xz3p", "Reddit_id": "do9zsbu", "Subreddit_id": "t5_2r0sd", "Commenter": "AvadaKadavraBitch", "length": "2208", "content_scrubbed": "My time to shine! \n\nSo I, like you, was kicked out for a semester due to bad academics (1. 5 GPA WOO). It was my first semester sophomore year and I came back that spring. While I was gone, I took classes at the local community college to stay full time since that meant I wouldn't have to pay my loans. \n\nI also, just graduated on time this past May! So- let me tell you the secret... TRANSFER CREDIT! I don't know what your major is (sorry if you said it and I missed it) but I know it depends on what you're in. I was in CALS and they're fairly liberal with transfer credit. So my first semester back I took 17 credits, then from there on every semester I took 15. One summer break, and I think two winter breaks, I would take online courses (about 2-3) through ether Cornell (winter break scholarships! Apply and mention you were on a leave and you want to graduate on time, you're basically gonna get it. It[.] through LSC) or through community college and then I would transfer the credit. I usually wouldn't use these to fulfill any actual requirement, just needed a credit count. Although I was able to use a few of them to get my humanities reqs out of the way (Environmental Science major). \nCornell also has LSC scholarships for summer classes! I personally say take this route as opposed to overloading yourself, because that[.] going to head you back down the road of failure (in my experience). \n\nAlso, remember that 1) most of the colleges make their curriculum flexible enough to where you can basically take a semester off, esp since they want kids to go abroad. And 2) it[.] not the end of the world if you graduate a semester late! I know PLENTY of people who have graduated a semester, a year, two years, later than planned. \n\nThere[.] also a SUPER awesome support group on campus for people who took a leave (whether academic, medical, etc) that can answer all of these questions for you and give you support when you're having a rough time adjusting and are a super cool group of people who just like to chill and play video games w some drinks, so it helps socially too. If you're interested in this, PM me for deets. I highly recommend it and it basically saved me coming back from leave. "}