{"doc_id": "350", "name": "2017_10_humanities_student_major_1140_europe", "namespace": "we1sv2.0", "metapath": "", "pub": "europe", "title": "2017-10-humanities-student-major_1140_europe.txt", "pub_date": "2017-10-12T00:00:00Z", "Sentiment": "0.07", "Subjectivity": "0.299", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "249", "Permalink": "http://reddit.com/r/europe/comments/75vke8/spain_gives_catalan_leader_8_days_to_drop/do9dy1k/", "Threadlink": "http://reddit.com/r/europe/comments/75vke8/spain_gives_catalan_leader_8_days_to_drop", "Parent_id": "t1_do9dlwe", "Reddit_id": "do9dy1k", "Subreddit_id": "t5_2qh4j", "Commenter": "nachokage", "length": "1467", "content_scrubbed": "Education in general should be more common throughout the state, in my opinion. I don't want to get into indoctrination things because I don't have their history books in my hands (even though I believe that there[.] been recent reports with proof, but we'll leave them aside).\n\nThe thing is that what is required in each autonomic region from Spain is different (for considering the Bachillerato over). There are huge differences in the History, Philosophy, literature and humanities courses in general; there[.] also no reason at all why maths tests that are a gateway to superior studies in the whole of Spain should not be standard for the whole country, yet each autonomous region does as it pleases with that.\n\nIn my opinion, History should have a curriculum given by the state, but each teacher has a relative academic freedom. Philosophy should also be made more common because it makes no sense to me that there are huge parts of Spain that haven't studied Mill, Marx or Hannah Arendt between others.\n\nI also think that one step towards national unity would be that every Spaniard was taught in school 2 spanish languages (as in Spanish and one of Catalan/Gallego/Euskera/Valenciano/etc...). It makes no sense to me that in my public school I left being able to fully write, read, talk and listen in Spanish, English and Catalan with notions of German or French while in other places they leave with Spanish, a cheap English and a nearly unusable 3rd language."}