{"doc_id": "375", "name": "2017_10_humanities_student_major_1362_ucsd", "namespace": "we1sv2.0", "metapath": "", "pub": "UCSD", "title": "2017-10-humanities-student-major_1362_UCSD.txt", "pub_date": "2017-10-14T00:00:00Z", "Sentiment": "0.096", "Subjectivity": "0.345", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "600", "Permalink": "http://reddit.com/r/UCSD/comments/76gs2a/free_life_consulting_2/dodysuu/", "Threadlink": "http://reddit.com/r/UCSD/comments/76gs2a/free_life_consulting_2", "Parent_id": "t1_dodxiqb", "Reddit_id": "dodysuu", "Subreddit_id": "t5_2r6sq", "Commenter": "acl073", "length": "3387", "content_scrubbed": "The feeling of being overwhelmed is natural. The more we begin to know, the more aware we become to the things we don't know. But just because there is so much to learn isn't a reason for you to stop. \n\nInstead it should motivate you to pursue even more, to see just how much you can achieve in your field of study, whether it is a language, a programming language, or even a STEM major. \n\nYou said it yourself. You are seeing much progress, but your peers attempt to tease you out of your success while touting their own. \nThere are mainly two trains of thought. The first, and true, way of thinking is the one you felt when you admired your own progress and felt a fiery passion to pursue more. \n\nThis is the type of thinking you should listen to, as it will not only grow you as an individual, but inspire those around you as a result of the great breakthroughs you achieve.\n\nYour peers are attempting to lure out your second, negative train of thought. The one of fear, uncertainty, discomfort, and desperation. Could it really be that you were so naive to think that you would ever succeed? Absolutely not. Negativity creates negativity. \n\nYour peers have misconceptions about what it means to be an individual studying your major. They don't know what you know about the beauty of studying, learning, and grasping a language. They don't have any interest in opening their minds and welcoming the pursuits of those different from theirs.\n\nYou already know they are being jerks. Simple question:\nWould you ever take what a jerk says as reality? \nOne word. No!\nFear is natural, but you must avoid those who habitually incite fear in their peers just because it[.] natural for them to do so. \n\nYou are the average of the 5 people you spend the most time with. \nWould you rather surround yourself with others immersing themselves in the splendor of your language, or stay with those who hide behind majors they consider \"more advanced\" or plainly \"better\" than yours. \n\nThere is a reason why your major is offered at UC San Diego, and that[.] because the people who created the system saw a need for people like you to pursue this field of study. \n\nThere are millions of STEM majors and only 0. 01% of them make it to the top? Do you know why? Because most STEM majors may have held different interests in the past, be it arts, humanities, politics, law, you name it. But pop culture and societal pressures diverted them from their true passion. This way, no matter how hard they try to believe a STEM major is for them, they can never perform as well as they would if they had pursued their passion.\n\nI admire you for dedicating your college career to a language. We use language every day of our lives. To do things essential to our survival, to communicate with others to produce technological marvels. \n\nI would say your major is far more important and fundamental than the vast majority of majors. Human civilization would not be where it is today without people like you who continually refine and advance our linguistic capabilities.\n\nFind peers who share your passion, and you'll reach new heights. In order to make room for new peers, gradually break ties with those so-called \"peers\" who make fun of you. It may hurt in the short-run in terms of social interaction, but the emotional and career successes you'll gain in the long-run, I GUARANTEE, will far outweigh those costs.\n\n"}