{"doc_id": "407", "name": "2017_10_humanities_student_major_1692_relationships", "namespace": "we1sv2.0", "metapath": "", "pub": "relationships", "title": "2017-10-humanities-student-major_1692_relationships.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.181", "Subjectivity": "0.281", "Score": "81", "Upvotes": "0", "Downvotes": "0", "Wordcount": "415", "Permalink": "http://reddit.com/r/relationships/comments/77931o/my_21f_boyfriend_22m_has_a_huge_problem_about_me/dokiezj/", "Threadlink": "http://reddit.com/r/relationships/comments/77931o/my_21f_boyfriend_22m_has_a_huge_problem_about_me", "Parent_id": "t1_dojzcjx", "Reddit_id": "dokiezj", "Subreddit_id": "t5_2qjvn", "Commenter": "Definitely-a-bot", "length": "2381", "content_scrubbed": "Ok, OP, you sound legitimately awesome:\n\n1. Double majoring in two demanding fields. \n2. Empowered enough to break away from your abusive family. \n3. Financially self-sufficient at a very young age, with what sounds like a solid understanding of money and a great work ethic. \n4. Self-aware and thoughtful with appropriate boundaries. \n5. A good communicator. \n\n\nSeriously, those qualities are all pretty rare to begin with, so to find them combined in one individual is *beyond impressive*. \n\nAdd to that the fact you are conventionally attractive enough to work in a gentleman[.] club, and you're damn near a Mary Sue in terms of being the ideal catch!\n\nYour boyfriend on the other hand, well I've met *a lot* of guys like him: male feminists who have a surprisingly rigid definition of the 'right' way for women to behave. Sometimes it manifests as an objection to make-up (\"you're just pandering to the male gaze!\"), or belittling non-STEM majors (\"You shouldn't waste your intelligence on liberal_arts, you could be a good coder if you tried!\") or *choice of occupation*. \n\nBy refusing to accept your choice, he[.] showing that he thinks HIS reasoning trumps YOUR reasoning about **your** life choices. \n\nEven if your reasoning for working at the club was just \"I enjoy the delicious free bar snacks,\" he'd have no right to keep haranguing you to quit. The fact you have serious financial reasons to keep this job is just the icing on the cake. \n\nNext time he brings this up, I'd be VERY clear that he[.] disrespecting you. \n\n \"But OP, I just think you're so much better than working in a—\n\n\n\"Stop right there. It is MY choice where I work. By continuing to harass me about that choice—and yes, it[.] harassment at this point—you're being disrespectful. Do you think you know better than me how to run my life? If the answer to that is yes, then this relationship is over. If you agree that I'm an adult capable of making choices in my own best interest, then you will **never** bring up my employment again. If you do, then I'll know you don't respect my autonomy, and we'll be over. **This is not up for discussion, and this is the last warning you'll get.**\n\nOr just break up with him now, because you're the whole package and he[.] kinda an entitled dumbass. Your choice!\n\nEither way, keep kicking ass. I hope my daughter grows up to be as strong and self-sufficient as you! \n\n"}