{"doc_id": "1219", "name": "2017_04_humanities_student_major_2764_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-04-humanities-student-major_2764_ApplyingToCollege.txt", "pub_date": "2017-04-24T00:00:00Z", "Sentiment": "0.193", "Subjectivity": "0.411", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "271", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_676o6x", "Reddit_id": "dgp8yzl", "Subreddit_id": "t5_2y2r8", "Commenter": "ugrad_admitter", "length": "1543", "content_scrubbed": "The academics at each will be stellar especially in common majors like those so it[.] probably most up to personality/experience - size, location, campus culture, curriculum.  \n\nI went to U of C /because/ I wanted to go through the Core Curriculum - I was really enchanted by the idea of a canon of knowledge refined over generations and liked that you took Humanities and Social Science core courses (specifically designed) rather than \"take 3 credits in those divisions.\" It meant that you had stuff in common with every student - a common foundation - that was a big part of creating community. I also liked the House culture, wanted a big city experience, and liked the ~4. 5k undergrad size (in my day) - big enough that I always met new people, small enough that I still felt community. The grad population is big but so many of them are in the (off-main-campus) professional schools that it doesn't feel as lopsided as the numbers make it look.   \n\nI was involved in theater, orchestra, and especially scav hunt, and had a job all 4 years. Took some IR classes both in the Poli Sci and International Studies departments. It[.] definitely one of the more conservative plsc departments out there, but the IS department is a nice counterweight there. Two of my best classes ever were taught by an IS postdoctoral fellow.  \n\nI guess this got rambling, but if you have U of C questions I'd be happy to answer. I graduated in '12. Since I wasn't at the other schools I can't compare, but hopefully this gives you some ideas of comparison points."}