{"doc_id": "929", "name": "2017_04_humanities_student_major_131_askwomen", "namespace": "we1sv2.0", "metapath": "", "pub": "AskWomen", "title": "2017-04-humanities-student-major_131_AskWomen.txt", "pub_date": "2017-04-02T00:00:00Z", "Sentiment": "0.055", "Subjectivity": "0.483", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "423", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_62zgfo", "Reddit_id": "dfq6qwp", "Subreddit_id": "t5_2rxrw", "Commenter": "InfinitelyThirsting", "length": "2335", "content_scrubbed": "I've read some of the other responses in this thread, and it definitely seems like you're open to thinking and growing as a person, which is great! Just wanted to say that first, before actually answering, heh. When you really start considering how amazing humanity can be, and the diversity of experiences and world views you can encounter, it[.] fucking fantastic.\n\nI think there could, hypothetically, be such a thing as too smart. I think about Sherlock and his brother, and the idea of seeing other people as children, or even goldfish. Unhealthy narcissism aside, I can sort of understand that viewpoint almost--I certainly have no interest in dating a 20 year old, because I don't see them as my equals in life experience or knowledge or anything. I have had the experience of working with people less intelligent than me, and noticing it. And there are certainly times when I have felt outclassed, and like I was the \"lesser\".\n\nI value a lot more about a person than just their intellect. I know I'm not better than people I am smarter than. I know people who are smarter than me aren't better than me. And I also know that most people who are not as \"smart\" as I am will be able to whip my ass in one way or another, because everyone has their personal skills, and that anyone smarter than me will have areas where I could show them up, too. So, you know, it all sort of evens out.\n\nSo someone could be too smart in the sense of being on different planes than me. Like, I have some friends who are into philosophy. I've never studied philosophy, so it can make me feel a bit stupid sometimes, when they spin off on something (not that they're trying to, though). But I could talk about history or literature or cooking techniques or something, and accidentally make them feel stupid. I couldn't be with someone who was smart on so many different planes all the time that I felt bad. My solution would probably be to just study up, haha, because I love learning, but if it were something that bored me, it might be a dealbreaker.\n\n\"Smart\" people who look down on the humanities, though, barf. I went to space camp, took honors and AP courses, and am still a skeptic who keeps up on science, and I know full well that STEM fields are not inherently smarter than the humanities. That[.] not actually about being smart though, haha."}