{"doc_id": "933", "name": "2017_04_humanities_student_major_164_jhu", "namespace": "we1sv2.0", "metapath": "", "pub": "jhu", "title": "2017-04-humanities-student-major_164_jhu.txt", "pub_date": "2017-04-02T00:00:00Z", "Sentiment": "0.243", "Subjectivity": "0.399", "Score": "7", "Upvotes": "0", "Downvotes": "0", "Wordcount": "324", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_630lob", "Reddit_id": "dfql1t9", "Subreddit_id": "t5_2shup", "Commenter": "bluuuu34343", "length": "1723", "content_scrubbed": "Hopkins is what you make of it. \n\nOne thing I really love is the proximity to DC, New_York, and Philadelphia. I'm a freshman and this year alone I've gone up to DC probably 5 times and New_York twice. It[.] relatively cheap to do so too (MARC train tickets to DC are $8). \n\nPeople here like to complain about being stressed and busy all the time and while it can be true, I feel like it[.] a bit exaggerated. People like to make memes/rag on the school all the time saying how much they hate it but I love self-deprecating humor so maybe I'm biased (just check out the hopkins meme page). Overall I feel like students do like it here. \n\nThe food at Cornell is probs way better if that matters to you. There[.] not a lot of options in Baltimore imo, but I came from California with great food so idk. \n\nThere[.] a ton of clubs and social activism events on campus. One thing I really love is the activist/volunteering done on campus. I tutor a local Baltimore student and am part of a homelessness awareness club. Being in Baltimore really changed my perspective on a lot of issues like this and I don't think a place like Cornell could have done the same. \n\nTons of people here do research too, if you're into that. Mostly STEM, but I know some humanities ppl that do it too. I myself have had a lot of cool experiences. I got to go to see a talk by Justice Sotomayer in DC, Bernie Sanders came to our school to speak, I went white water kayaking, I got my own radio show, and I got to go to the Women[.] March in DC. \n\nI myself don't really party but it[.] definitely available if you want it. Mostly frats/sororities. \n\nDefinitely consider visiting both schools. Good luck, and feel free to message if you have any questions! \n"}