{"doc_id": "981", "name": "2017_04_humanities_student_major_567_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-04-humanities-student-major_567_politics.txt", "pub_date": "2017-04-06T00:00:00Z", "Sentiment": "0.151", "Subjectivity": "0.45", "Score": "119", "Upvotes": "0", "Downvotes": "0", "Wordcount": "631", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfwhj2g", "Reddit_id": "dfwhzps", "Subreddit_id": "t5_2cneq", "Commenter": "FattestRabbit", "length": "3861", "content_scrubbed": "There are two types of Russians (as they relate to this discussion) and they run very much in parallel to the two types of Americans we see today:\n\nThere[.] the camp that believes in Putin, believes he[.] good for the country, and that he[.] brought a lot of stability since he took over. He is, by most accounts, the most powerful man on the planet (and these Russians see Russia as very powerful by extension), and brought Russia out of a horrible recession. *In this way*, his popularity can be compared more to Obama[.], and a lot of Russians have blind faith in Putin because he[.] strengthened the nation. So, when he says \"read my lips, NO [we had nothing to do with the hacks]\", many Russians buy it. I would call these people the equivalent of the Republicans who buy into Trump[.] message of economic strength by putting America first, increasing military spending, and protecting our borders. A very large majority of the \"oligarchs\" (especially the ones Putin directly funnels money to) fall into this category. \n\nThen there are the Putin opposers, who are very fragmented. I would compare them more to a louder *Occupy Wallstreet* camp than the Democratic party. The reason they don't have a strong unified front or coalition is because of everything you'd expect: government-controlled media, a *very* well-run propaganda machine, election fraud, voter intimidation and suppression, political murders, and so on. Besides the murders (to my knowledge), I would say that each of these tactics are, to some extent, mirrored by the Republicans here in the US -- [specifically the propaganda, which I wrote an extensive post on last month](https://www. reddit. com/r/worldnews/comments/5w17yu/bbc_among_news_media_blocked_from_white_house/de6r1ae/). The Putin opposers who see what the Republican party is doing are terrified, because they view America as a beacon of hope and of what could be; a powerful nation that doesn't demand 100% obedience from its citizens 100% of the time in a system that is very rigged against change. In my family and small Slavic circle(s), we're worried because it seems like Democrats have historically not done what[.] necessary to fight back. Also, unlike in America, a billionaire in Russia has a very hard time publicly criticizing Putin if he or she wants to stay in Russia.\n\nFrom where a lot of us sit, congressional Republicans treat Democrats like an existential threat while ignoring real existential threats (e. g. Russian interference in Western democracy), so they win battles for their party even though they ultimately cause the majority of US citizens to suffer. The congressional Democrats treat Republicans like fellow Americans with very different ideals, which means they're split between trying to govern against an opposition party (who now controls all 3 branches) *and* investigate an existential threat without support from across the aisle. That is a *very* scary proposition.\n\nOne final thing I'll say is, as an analyst with the DoD, and a Russian-American, it is clear to me that domestic programs aimed at helping people out of poverty (e. g. education and cultural endowments) and foreign aid are the best use of money for America, in terms of lives saved and value added. An educated populace at home and happy allies around the world are the best tools to brokering stability and prosperity all around. When Trump cuts endowments for the arts, the humanities, and so on, he is playing into the hand of every terrorist organization that wants to see America fail but doesn't have the budget to fight us. Buying guns instead of books and encouraging in-fighting between US citizens are *exactly* what will bring down the USA if we're not careful.\n\nEdit - grammar / clarity\n\nEdit 2 - wow, thanks for the gold! I'm really happy I could shed some light in the situation and someone found it useful!      "}