{"doc_id": "371", "name": "2017_10_humanities_student_major_1322_math", "namespace": "we1sv2.0", "metapath": "", "pub": "math", "title": "2017-10-humanities-student-major_1322_math.txt", "pub_date": "2017-10-14T00:00:00Z", "Sentiment": "0.053", "Subjectivity": "0.323", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "227", "Permalink": "http://reddit.com/r/math/comments/765c5v/why_do_math_majors_burn_out_so_much_more_quickly/dod3fww/", "Threadlink": "http://reddit.com/r/math/comments/765c5v/why_do_math_majors_burn_out_so_much_more_quickly", "Parent_id": "t1_dock190", "Reddit_id": "dod3fww", "Subreddit_id": "t5_2qh0n", "Commenter": "sleeps_with_crazy", "length": "1338", "content_scrubbed": "You need to understand that US high school is *very* different than the European version.  We don't have people specialize at all until midway thru college.  In particular, the typical US college freshman has either never seen calculus or has seen a very cursory overview.  Likewise, most of them have never seen proper (calc-based) physics.\n\nSo first year university in the US generally consists of courses that you would have taken when you were 16 or 17 and still in what we call high school.\n\nCourses like Analysis I and II, LA I and II, etc, generally aren't taken at US universities until 3rd year (sometimes 2nd year). \n\nOur universities also tend to emphasize breadth, so taking only Math/Phys/CS courses isn't really possible (especially first-year).  Most US schools require people to take a variety of courses, including arts and humanities and social_sciences, even if they are intending to be a math or physics major.\n\nThe real issue is that US high schools are absolutely awful in comparison to the European secondary school system, and university here is quite different because of that.  I tend to assume (and I say this as someone who is an advisory member of a grad admissions committee) that a university degree from a European school is about the equivalent of a Masters' degree from a US school in terms of knowledge."}