{"doc_id": "508", "name": "2017_10_humanities_student_major_2803_bipolar", "namespace": "we1sv2.0", "metapath": "", "pub": "bipolar", "title": "2017-10-humanities-student-major_2803_bipolar.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.043", "Subjectivity": "0.355", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "344", "Permalink": "http://reddit.com/r/bipolar/comments/79en04/psa_if_you_are_are_college_student_and_you_are/dp1jvmf/", "Threadlink": "http://reddit.com/r/bipolar/comments/79en04/psa_if_you_are_are_college_student_and_you_are", "Parent_id": "t3_79en04", "Reddit_id": "dp1jvmf", "Subreddit_id": "t5_2qnv4", "Commenter": "BornOn8thOfJuly", "length": "1953", "content_scrubbed": "As someone who is a ph. d student, who is both a student registered as having a disability, and *teaches* students who are registered as having disabilities, its true. In fact, its really common. Mental illness itself is definitely the most common. More so than learning disabilities and physical disabilities. At least in my experience -- which hasn't been that long (this is my third year). Anxiety disorders are probably the most common.\n\nIf this makes you feel more comfortable about it, I can tell you I haven't seen people discriminate against their students for having a mental illness. I've found professors very understanding and compassionate both to me and other students.\n\nWhen you disclose, your professor does not get a letter saying you have bipolar disorder. The letter is usually somewhat tailored to what you need (though understandably they write the same kind of letters). I've never seen one that revealed more than mine does, and mine says very little. Namely that I have a mental health disorder that is currently in a debilitating state and I am requesting flexibility on assignments and due dates in the off chance hospitalization is required. That[.] all it says. \n\nThis last part might sound a little jaded, but, this is also so common that professors don't care much. I don't mean that they get the letter and say \"yeah well who gives a shit.\" Lol. I don't mean that they don't care in a bad way. I mean  they don' care in a good way! By that I mean, it[.] not shocking and uncomfortable for them. This is part of their job. It[.] not novel for them. They care about *you* as a student. But there is no stigma really. At least not that I can see in the humanities and social_sciences. \n\nEDIT: Also, if I heard of a professor really holding a grunge against a particular student over their mental health, and really like devoting much thought to it in a *bad* way, I'd say, \"don't you have anything better to do?\" Because they do."}