{"doc_id": "345", "name": "2017_10_humanities_student_major_1082_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-10-humanities-student-major_1082_ApplyingToCollege.txt", "pub_date": "2017-10-11T00:00:00Z", "Sentiment": "0.122", "Subjectivity": "0.375", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "261", "Permalink": "http://reddit.com/r/ApplyingToCollege/comments/75mx6j/gwu_vs_instate_flagship_uf/do8r0h2/", "Threadlink": "http://reddit.com/r/ApplyingToCollege/comments/75mx6j/gwu_vs_instate_flagship_uf", "Parent_id": "t3_75mx6j", "Reddit_id": "do8r0h2", "Subreddit_id": "t5_2y2r8", "Commenter": "futureagintern", "length": "1466", "content_scrubbed": "Current UF student here.\n\nIMO, I would look at FSU more than UF if you're looking to stay in-state. Like they said below, they're in Tallahassee and offer opportunities being in the state capital and all. UF[.] political science program is lumped into Liberal Arts and Sciences and I'm not sure how many opportunities are there since it[.] looked at as a liberal art and Gainesville honestly is in the middle of nowhere. Like you said, UF is a STEM school and I never got that vibe from FSU.\n\nUF won't give you any merit aid, most likely (admissions scholarships are HIGHLY competitive, and they seem to favor OOS students), FSU offers merit aid to freshman on admission. Both are in state so the price will be relatively the same, and you can have Bright Futures. If you say your dad is a disabled vet, there[.] plenty of scholarships and state programs out there for that too.\n\nI made my school choice on my major, too (only at UF because it[.] Florida[.] agriculture school, I couldn't care less about anything else like the things you mentioned and football, Greek life, etc.) so I know how important academics are when picking a school. I looked at quality of life too (parking, safety, availability of shops/restaurants, town size, etc.) but unfortunately I lost out on some of that in Gainesville.\n\nIf I were you - I'd apply to all that you're interested in, GWU and UF and some others (like perhaps FSU and some other OOS state schools) as safeties. Best of luck!"}