{"doc_id": "1131", "name": "2017_04_humanities_student_major_1941_findapath", "namespace": "we1sv2.0", "metapath": "", "pub": "findapath", "title": "2017-04-humanities-student-major_1941_findapath.txt", "pub_date": "2017-04-17T00:00:00Z", "Sentiment": "0.219", "Subjectivity": "0.478", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "488", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65xbck", "Reddit_id": "dge0dso", "Subreddit_id": "t5_2wqq6", "Commenter": "penisbarn", "length": "2730", "content_scrubbed": "Don't waste time feeling ashamed about \"squandering\" anything. Your pathway sounds like many people I know. You are where you are now, and you want to learn more about yourself and grow as a person and a professional. It sounds like you're on the_right track to do both of those things.  \n\nYou say you only feel fulfilled when you do creative work, but I wonder what you mean by that--do you mean when you're explicitly working on an art project? Or do you mean when you're able to creatively problem solve? For example, I used to teach English. I found lesson planning and course development to be EXTREMELY engaging and creative. It was as satisfying to put together a solid semester-long course as it was to finish a piece of creative writing. Now I work in program management for arts education programming, and find it to be similarly engaging.  \n\nI too have a Liberal Arts background and a group of creative friends. I see three major ways they pursue art--one is the hustle and grind of piecing together freelance work, which is exhausting and not for everyone. I do have friends who love it and are successful, but they are in the minority of people I know who have tried this route. Doesn't mean it[.] not worth a shot. The second major way would be having a steady day job while working on your art in your off hours. My friends who do this are still doing freelance work, gigs, community events, etc.--but they don't have that pressure to eek out a living that way, and can be more selective with their creative projects. The challenges here are having enough time for your day job and your creative projects, and also competing with people who have more experience and a larger portfolio because freelance gigs are their full-time pursuit. The third major way is to just do art for yourself alongside whatever other careers you're pursuing. I find this challenging because for me and most of my friends, art demands an audience to feel meaningful to us. If I'm just writing for me and know it[.] not going to be performed or that I'm not looking to publish it somewhere, I lose motivation. BUT--lots of people are more disciplined than me and so love doing art on their own without an audience.  \n\nIt sounds like you have a creative network who could help you find gig opportunities if/when you're interested in pursing that. The other part of your question is around a more stable career/\"day job\" kind of thing. It sounds like you have a variety of experiences working, some of them at the management level? And also that you don't like the idea of working a \"corporate\" job? I wonder if you've looked into working in the nonprofit world. It might be a good fit--it has been for me and for some of my creative friends."}