{"doc_id": "1073", "name": "2017_04_humanities_student_major_1426_askreddit", "namespace": "we1sv2.0", "metapath": "", "pub": "AskReddit", "title": "2017-04-humanities-student-major_1426_AskReddit.txt", "pub_date": "2017-04-12T00:00:00Z", "Sentiment": "0.117", "Subjectivity": "0.347", "Score": "213", "Upvotes": "0", "Downvotes": "0", "Wordcount": "341", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg5y36y", "Reddit_id": "dg6cctl", "Subreddit_id": "t5_2qh1i", "Commenter": "The_Prince1513", "length": "1814", "content_scrubbed": "Not just that, but the amount of time it takes to even get to the \"starting point\" now.  I was born in the late 80s.  My parents were 24 and 28 when they had me.  My mother went straight into work out of high school, my father went into the Air Force as an enlisted airman for four years and was able to get into a trade immediately thereafter.  Both of them were making money right out of high school.\n\nFast forward to my generation where, unless you go into a trade position, you need, at the bare minimum, a college degree to get any kind of job that isn't service industry.  On top of that is the fact that our society has glorified the idea of a college education so much that it is seen almost as a failure to not attend one.  So, to college I went, along with many others in my position.\n\nNow this is not to say I didn't want to go to college, but just to point out the average [.]tarting point' for earnings has shifted from 18 to 22.\n\nOn top of that, is that many millenials, like myself, chose their college majors, lets say, without much research as to the job opportunities that they would lead to (*cough* humanities *cough*).  So, myself and my Poli-Sci degree were left wondering what the fuck I was actually going to do with this piece of paper I just got.\n\nSo myself, and many like me, escaped to Grad School, which would actually train us for a job society deemed was socially acceptable for children of the Baby Boomer generation.\n\nSo there[.] a whole new slew of young people out there who aren't really starting their careers until their mid to late twenties (depending on the field) when their parents were able to be in the swing of their own careers several years prior.\n\nOn top of that all of those newcomers are earning less, and faced with far higher cost of living and real estate prices."}