{"doc_id": "343", "name": "2017_10_humanities_student_major_1074_exjw", "namespace": "we1sv2.0", "metapath": "", "pub": "exjw", "title": "2017-10-humanities-student-major_1074_exjw.txt", "pub_date": "2017-10-11T00:00:00Z", "Sentiment": "0.091", "Subjectivity": "0.26", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "264", "Permalink": "http://reddit.com/r/exjw/comments/75r9pq/well_so_much_for_that_college_education/do8kdlx/", "Threadlink": "http://reddit.com/r/exjw/comments/75r9pq/well_so_much_for_that_college_education", "Parent_id": "t3_75r9pq", "Reddit_id": "do8kdlx", "Subreddit_id": "t5_2qp5l", "Commenter": "barsoomeva", "length": "1533", "content_scrubbed": "Awake covered emergent phenomena and observables, and so a reader of Awake received a broad eclectic smattering of diverse topics that could be excused as natural or scientific. That being said, the college experience does feature but is certainly not limited to the survey of a field to some limited depth. Unless it[.] a survey course by design. The general idea of a college *concentration, or *degree *program, is to break through the bottom layers and dig down into your selected subject using knuckle busting research. Even in the liberal_arts the student has to delve deeply into what came before and grasp it at breadth and depth. They have to be able to master or strongly reproduce the great works of art (e. g. musical pieces). In the sciences the student has to know how to use first principles and the scientific method to be able to reproduce, by themselves, findings about the world. The Awake does nothing to cultivate mastery of an art, or mastery of a method to understand and reproduce the \"findings\" that its companion Watchtower spews.\n\nJWs of course are not permitted to step foot near to a criteria or curriculum, whether on a 4 year or community campus, so as to have the first gold-embossed clue what a college education *actually entails. JWs are *told that their little four color cartoon pulp trash with accessibility font constitutes the word, 'college', so that they may have an answer to him that is taunting them, but they are forbidden from acting like the Boreans did and verifying that that was true."}