{"doc_id": "235", "name": "2017_10_humanities_student_major_92_crappydesign", "namespace": "we1sv2.0", "metapath": "", "pub": "CrappyDesign", "title": "2017-10-humanities-student-major_92_CrappyDesign.txt", "pub_date": "2017-10-02T00:00:00Z", "Sentiment": "-0.026", "Subjectivity": "0.355", "Score": "41", "Upvotes": "0", "Downvotes": "0", "Wordcount": "709", "Permalink": "http://reddit.com/r/CrappyDesign/comments/73p12j/bs/dnsqzjn/", "Threadlink": "http://reddit.com/r/CrappyDesign/comments/73p12j/bs", "Parent_id": "t1_dnsm6ot", "Reddit_id": "dnsqzjn", "Subreddit_id": "t5_2sa3m", "Commenter": "ElectricCharlie", "length": "3984", "content_scrubbed": "Not OP, but...\n\nWhen I started out, I got an A. A. S in graphic design. Realizing that wasn't enough to be successful in life, I decided to pursue marketing. The local university was a good option for me, location-wise, and they had a touted business school. \n\nThe local school (UMKC) refused to offer a marketing specialty BS/BA, and told me they recognized none of my AA credits in the business school, down to even the very general basic math classes. They said I'd either have to start over and spend 4 years working toward a BS, with no specialty, or I could do two years in their liberal_arts school, finish my bachelor of liberal_arts, take the GMAT and then transfer into their MBA program, which does offer a marketing specialty.\n\nFaced with the option of moving to another city when I already had roots down, or 4 years of college to get anywhere, I chose to go the route that would get me an MBA. In writing, I was told that I could take certain classes while getting my BLA, that they would transfer to the MBA program (with the understanding that I was getting the statement in writing, because my intent was to bypass many of the MBA courses). I worked hard for two years, incurring debt and taking much harder classes than necessary because my plan was to drop into the MBA with all the general classes done, and knock that fucker out in a year + one semester capstone course.\n\nI took the GMAT and scored in the 86th percentile (a 690). I enrolled and the academic advisor I had spoken to two years before told me that while all the courses were the same, and I had it in writing, that the college had changed the MBA program to be a 3 year program and none of the courses I had taken could be used. He said that it would give me an opportunity to improve upon my previous scores.   \n(Bitch. How I gonna improve on straight A[.]? I lettered when I graduated with my BLA. I worked hard for a fucking reason.)\n\nBut I was stupid, so I went along with it. I figured that I'd already spent $11k on the previous two years of school, I might as well see it through, right? I could work hard and push through, just like I did before. Maybe because I already took these courses, I could relax a little and maybe take a higher courseload? My employer at the time offered some tuition reimbursement.\n\nThis \"new program\" required multiple [.]eminar' classes before the academic year, during traditional school break times, and... whatever. I was just along for the ride, right? At $1,500 a pop, they were relatively minor add ons to the nearly $10k a semester tuition cost.   \nSo the very first seminar took place a week before classes started. It was 5 evening classes, plus a Saturday session. For $1,500, I got to listen to a bunch of retirees tell fucking stories. Completely inconsequential bullshit. It was so fucking stupid and pointless and I felt like absolute chattel. I held out for the promise of Saturday, when we were supposed to have something special happen, whatever that was. On Saturday, the big day arrived. We were given over to a [.]pecial team of educators' who ran an interactive international business simulation that was somewhere between Model U. N. and the 'corporate raiders' Monty Python skit. We sat through it. My team did especially well because we had someone who actually did international shipping/receiving on our team. But it wasn't especially difficult. It seemed a little... easy, honestly. The rules were simple, the knowledge requirements were low.   \nAt the very end of it, the team that did the simulation asked us how it was. They wanted feedback, because, as one of the presenters said \"That[.] the first time we've run that simulation for anyone other than high schoolers.\"\n\nI was fucking done. The jig was up, and the whole thing was thrown into sharp relief. I finished the semester (with all A[.]) and withdrew from the school. The University of Missouri-Kansas City are shiesters. They dicked me around and ripped me off for nearly $20k. "}