{"doc_id": "1198", "name": "2017_04_humanities_student_major_2572_singapore", "namespace": "we1sv2.0", "metapath": "", "pub": "singapore", "title": "2017-04-humanities-student-major_2572_singapore.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.123", "Subjectivity": "0.266", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "398", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_670f7f", "Reddit_id": "dgmwmep", "Subreddit_id": "t5_2qh8c", "Commenter": "I_Am_A_Fake_Bot", "length": "2265", "content_scrubbed": "hey op, there[.] a ton of great advice in this thread which i hope would really help you in navigating your way through this.\n\nmy advice - try to negotiate to take the following \n(i) **double science** (chemistry is a must. choose between biology or physics based on your ability and interests, and if you've to do one in JC which of the two would you prefer. decide if you prefer numbers/calculations, or happy with memorising more qualitative content);\n(ii) **double math** (allows you to take H2 math in JC, which is a pre-req for some courses in university)\n(iii) **double humanities** (if you're confident that you're better at a particular humanities subject than you are for sciences)\n\nif there[.] no way out of taking triple sciences, you could try it out and later DROP either bio or physics (whichever you're weaker in) in sec 3 or 4. \n\notherwise, reach out to a teacher or a senior teaching staff to discuss your problems and have them sit down and really talk to your parents.\n\neven if you're unsure of what you would like to do in future, take this opportunity to start thinking about what YOU want for yourself down the road. doesn't have to be crystal clear, but at least try to understand what interests you, what you're good or weak at. \n\nit would really help knowing what you'd like to do in university. search up the admissions criteria to see which A level subjects are required to get in to a particular course. work backwards to plan out the subjects you need at O levels. the good thing is that the path they've planned out for you does give you access to apply to any university course in future - assuming you *do well*.\n\nyour parents probably want the best for you, but the way they're doing this can really come out disastrous. your parents could be living their aspirations through you. whether is it because of reasons to do with their own pride, fear (kiasu), you need to communicate to them that you have your own preferences and convince them you're mature enough to decide what[.] best for yourself.\n\ni took 11 subjects at Os a long time back (triple sciences, double math, double humans and additional subjects). it was honestly unnecessary and bears little weight in helping you get a \"challenging and professional career\"..........."}