{"doc_id": "1205", "name": "2017_04_humanities_student_major_2637_funny", "namespace": "we1sv2.0", "metapath": "", "pub": "funny", "title": "2017-04-humanities-student-major_2637_funny.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.124", "Subjectivity": "0.317", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "374", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgnhr0a", "Reddit_id": "dgnlj8a", "Subreddit_id": "t5_2qh33", "Commenter": "addledhands", "length": "2234", "content_scrubbed": " An English degree bolsters communication skills, collaboration skills, creative and critical thinking skills, and fosters leadership traits.\n If you can't turn that into gainful employment, you suck... not the degree.'\n\nI *mostly* agree with this. As somebody with almost *three* English degrees (.. yes, I know), one of the most frustrating things about my program and those of a lot of other people I've talked to is that they don't really bother to prepare you for the actual job market, or how to translate the (very real) skills you get into job skills. I went into my degree knowing full well that writing argumentative essays about Shakespeare isn't actually a real job (for the vast majority of people), and focused on more business-oriented stuff: how to deal with conflict. How to persuade people. How to adapt my voice to a myriad of mediums and styles. How to understand an audience. *How to learn new skills*.\n\nThe problem is that, with the exception of a tiny handful of business writing classes, I was never really told that I'd need to learn how to do more than analyze literature. I got lucky that I had some foresight (and nagging parents that were concerned I wouldn't be employable), but many of my peers are working far below both their potential and actual skillset because they never learned to transition.\n\nContrast that with engineering, which is inherently practical and generally immediately translatable into a junior-level job. English, and liberal_arts in general, are about understanding people, how to think, and how to construct arguments. LA folks *tend* to merge into other paths much better than STEM people, but only if they are prepared.\n\nFor what it[.] worth, after college I spent a couple of years freelance writing for rent and beer money, went back to and then dropped out of a grad program, and have since been working as a technical/ui/general copywriter at tech companies and am happier than I've ever been. You can definitely find success with an English degree, but it is without question more difficult for the LA individual than STEM. \n\nUnless you went into literally any non-engineering STEM degree and stopped at your BS. In which case, lol, enjoy being a lab tech for thirty years.\n\n"}