{"doc_id": "481", "name": "2017_10_humanities_student_major_2517_asianmasculinity", "namespace": "we1sv2.0", "metapath": "", "pub": "AsianMasculinity", "title": "2017-10-humanities-student-major_2517_AsianMasculinity.txt", "pub_date": "2017-10-25T00:00:00Z", "Sentiment": "0.023", "Subjectivity": "0.395", "Score": "21", "Upvotes": "0", "Downvotes": "0", "Wordcount": "896", "Permalink": "http://reddit.com/r/AsianMasculinity/comments/78r7l4/lets_not_forget_that_countless_power_lifting/dowf6gf/", "Threadlink": "http://reddit.com/r/AsianMasculinity/comments/78r7l4/lets_not_forget_that_countless_power_lifting", "Parent_id": "t3_78r7l4", "Reddit_id": "dowf6gf", "Subreddit_id": "t5_30c2m", "Commenter": "somepsychmajor", "length": "5495", "content_scrubbed": "You said powerlifting but you posted a weightlifting video. Those are two completely different sports. \n\nWe're also only dominant in weightlifting up until maybe the 77kg/85kg level for men (look up Lu Xiaojun and Tian Tao). Anything above that and you won't see a single Asian at the highest levels of Olympic weightlifting.\n\nThe fact is we are just smaller. That[.] the way nature worked things out with our environment through our evolutionary history. Hopefully that gets better in the future with better nutrition and whatnot, because it[.] the only way we can compete in the West, but it won't be in our lifetimes. \n\nEDIT: There has clearly been a lot of misunderstanding with this comment, so I thought I should clarify. Some of you are getting a little carried away off your emotional intuitions (which makes sense, this is /r/AsianMasculinity lmao), and what I said goes against the very grain of what we try to fight for on this sub. But please just hear me out before resorting to rage and ad hominem attacks (seriously, I get it, I study psychology).\n\nFirst of all, I never stated that Asians are genetically inferior to any other race. I do not believe in any race being inherently superior or worse than any other, which is ridiculous. What I do believe is that there ARE population-level differences across races. This is almost self-evident, but if not, there is research to back it up. There does not appear to be any population-level differences in pound-for-pound strength amongst races; what there does appear to be are population-level differences in SIZE, which begets absolute strength. \n\nI understand that the idea of population-level differences between races (or any identity marker for that matter) is a taboo thing to say. Western liberal democracies are built on the foundation that we are all the same. In support of our modern, progressivist values, the academy has adopted the tabula rasa view of life, that we are all blank slates shaped only by socialization and our environment. This view has dominated the humanities and social_sciences for decades, such that it incites moral outrage when someone might suggest an opposing view. I understand why this would be the status quo. I understand why the opposite may seem like \"old fashioned racism\" and how it can invoke flashes of fascist regimes in our history. I understand why you guys are insulting me when I haven't said anything inflammatory.\n\nUnfortunate though it is, there appears to be very little truth to the blank slate, according to modern science. It is clear that much of what we are is innate and shaped over evolutionary time. Genetics - the carrier of evolutionary adaptation - consistently plays a bigger role than any other factor when considering outcomes. Twin adoption studies, which allow you to statistically partition the variance for each predictor factor[.] effect on a variable, consistently finds that genetics takes up the largest chunk of the variance - much more than any other factor, including socialization. This is extremely well documented, and true for almost any outcome/behaviour/variable. Your IQ is highly related to your genetics, and has very little to do with the neighbourhood you grew up in or the people you hang out with. The same goes for personality. Despite the modern liberal narrative, differences in outcome are most often not the result of external factors. The fact is, a lot more than what we are led to believe is predetermined in birth, through evolution and genetics. This is what I mean by nature trumping nurture. I brought this up primarily because my fiercest critic maintained that an \"effeminate media\" (socialization) can explain away the success void in the heavyweights -- a common line of thinking when trying to explain away outcome differences. My main point is that genetics (nature), not media (nurture), is the biggest factor.\n\nThe idea of nature trumping nurture is especially true for physical features. You cannot deny that most physical features are heritable, and shaped by evolution. If you prescribe to this, you can prescribe to the idea that different populations evolved under different environmental circumstances, and that selective pressure caused different traits to be emphasized. Let me give you the most salient example of this: East African (Kenyan, Ethiopian, Eritrean) dominance in long distance running. Despite being poor countries with poor resources and infrastructure, East Africans are unbeatable. There is only one intellectually honest explanation for this: over evolutionary history, certain features of the geography/environment of the Horn of Africa led to the selective adaptation and proliferation of genes that befit running long distances. There is no reason to believe this is not the case for other physical traits. In fact, strength-wise, it seems to be the case that those in Nordic countries developed specializations in this area.\n\nAsian men are slightly smaller in stature, on average. Size begets strength. This is why we have the talent pool to produce world-class talent in the weight divisions more suited to our size and why, statistically, it will be harder for us to find a world champion in the heavyweights. This does NOT mean it is impossible, or that we are genetically inferior. Also note how I mentioned that this may improve in the future: as our countries continue to grow and prosper economically, nutrition will improve, which will lead to population changes across generations. "}