{"doc_id": "962", "name": "2017_04_humanities_student_major_454_lawschooladmissions", "namespace": "we1sv2.0", "metapath": "", "pub": "lawschooladmissions", "title": "2017-04-humanities-student-major_454_lawschooladmissions.txt", "pub_date": "2017-04-04T00:00:00Z", "Sentiment": "0.103", "Subjectivity": "0.296", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "301", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63jl3r", "Reddit_id": "dfup042", "Subreddit_id": "t5_2y2gn", "Commenter": "Core_Four", "length": "1726", "content_scrubbed": "job offers\n\nwriting specialist at school\n\nbeen told my writing is very well\n\nlol # justfreshmanthings\n______________________________\n\nUpon further research, I've found people saying that a Criminal Justice/Pre Law path is not suitable for law school. \n\nDefine suitable.\n\nAlthough I was told law school admissions don't discriminate upon the major, in reality they do (as I've been told).\n\nTold by who (or whom)? Law schools discriminate by every data point they have, to a negligible degree.\n\n I can totally see why a STEM 4. 0 is worth more than a humanities 4. 0 in the eyes of admission , btw.\n\nMaybe it is. Maybe it[.] worth the same. Though let[.] not suggest that all adcomms are the same. Also, define worth.\n\nOf course, I realize that English or History are more vigorous subjects in terms of reading/writing in preparation for the LSAT and then Law school, but I find that 4 years would be a draaaaaaag. I just find Criminal Justice an interesting major instead of say english, or communications or whatever else. My writing (as I've been told is very well, even had job offers of becoming a writing specialist at school. not being pretentious, please don't get me wrong, lol.) and I enjoy reading in my ofttimes.\n\nOk.\n\nWith that being said, I was wondering your opinions and takes on this.\n\nOn what? What you should major in? You should major in whatever will be most likely to give you a high gpa and is most marketable (in case you bomb the LSAT).\n\nWith enough hard_work and preparation for the LSAT, can I eventually get accepted into law school with a criminal justice undergrad.\n\nYes.\n\nAlso what was your undergrad major?\n\nI did a double major in a social science and a humanity with a minor in a foreign language.\n"}