{"doc_id": "1079", "name": "2017_04_humanities_student_major_1495_videos", "namespace": "we1sv2.0", "metapath": "", "pub": "videos", "title": "2017-04-humanities-student-major_1495_videos.txt", "pub_date": "2017-04-12T00:00:00Z", "Sentiment": "0.044", "Subjectivity": "0.238", "Score": "28", "Upvotes": "0", "Downvotes": "0", "Wordcount": "921", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dg72rgh", "Reddit_id": "dg76ocn", "Subreddit_id": "t5_2qh1e", "Commenter": "trexofwanting", "length": "6379", "content_scrubbed": "The freedom house is funded by the US government and has ties with the CIA. That organization is obviously going to do everything in its power to smear Cuba. \n\n Right. I should have known the CIA was responsible. \n\n What about Human Rights Watch?\n\n[The Cuban government continues to repress dissent and discourage public criticism. It now relies less on long_term prison sentences to punish its critics, but short-term arbitrary arrests of human rights defenders, independent journalists, and others have increased dramatically in recent years. Other repressive tactics employed by the government include beatings, public acts of shaming, and the termination of employment.](https://www. hrw. org/world-report/2016/country-chapters/cuba)\n\n Ooor Amnesty International?\n\n[Despite purported political openness, restrictions on the_rights to freedom of expression, association and movement continued. Local civil society and opposition groups reported increased politically motivated detentions and harassment of government critics.](https://www. amnesty. org/en/countries/americas/cuba/report-cuba/)\n\nAre those maybe acceptable to you? I feel like probably not, huh? \n\n Freedom of the press is a complicated subject\n\n Geez. \n\n The majority of Cuba[.] reporting is done through the state, but this is part of an ideology that thousands of people revolted for against a US backed regime for. \n\n \"Ignorant people from seventy years years ago made a decision to install an autocracy that believed 'freedom of the press is a complicated subject' and we have to respect that. And that[.] why the government has to censor ignorant people that are alive today from expressing any dissent. I am not very logically consistent.\" \n\n Citizens have freedom of speech and of the press in keeping with the objectives of socialist society\n\nRight. So, more like freedom-to-agree-with-the-ruling-autocracy-and-if-you-don't-it[.]-literally-illegal speech? \n\n As an aside, do you see any irony in the fact the largest online socialist community, /r/socialism, is hosted on an American website? No? You know, I didn't think you'd see any. \n\nWhen you look at America, and you look at capitalism and notice things like Operation Mockingbird, you start to realize that American press is far from free.\n\nI—wait. First of all, how are you defining freedom of the press again? Because, apparently, the\n\n[Communist Party[.] Department of Revolutionary Orientation, which \"develops and coordinates propaganda strategies\"](https://en. wikipedia. org/wiki/Human_rights_in_Cuba)\n\n is freedom of the press. But Operation Mockingbird is not freedom of the press? \n\n Maaaybe it[.] just my wacky, milquetoast liberal ideals, but I do think the US press and media is closer to the ideal when you can openly read and share criticisms of the US government on the largest online forum in the world. Which, again, is an *American-based* online forum. \n\nDon't try to downplay the Cuban Literacy Campaign.\n\n I'm about to disappoint you REALLY HARD. What'd my link say about the literacy rate?\n\nRegarding literacy rate, Cuba had the fourth highest in all Latin America. In 1995 they had the second, tied with Argentina.\n\n Cuba did rise two spots in the rankings. \n\n Of course, simultaneously, \n\n Cuba was the country with the third highest caloric intake in Latin America (data from 1948, other countries' are for 1954-57, so Cuban data would be even higher in comparison). Right now it is the last out of eleven in the list of countries surveyed.\nCuba is the only country in the sample where the number of cars per inhabitant falls, from 24 per thousand to 23 per thousand in 1988. One can repeat this analysis for energy, agriculture, and other sectors, and convince oneself that Cuba was indeed quite an advanced country before Castro. \n\n Pluses and minuses, huh? \n\nWhy would I be on team capitalist if I were a technologist? Do I need to remind you about the space race?\n\n Do I need to remind you about electricity? The telephone? The airplane? The moon landing? The Internet? The light bulb? Atomic energy? Discovering the structure of DNA? Discovering radiation? Cloning? Sequencing the human genome? The computer? The calculator? Chocolate chip cookies? Rock 'n' roll? Rap? Television? Artificial hearts? \n\n [Do you really think the Soviet Union was more innovative artistically, technologically, or any-kind-of-lly than the U_S? It demonstrably not only was not, but it wasn't even close.](https://en. wikipedia. org/wiki/Human_rights_in_the_Soviet_Union)\n\n  Censorship in the Soviet Union was pervasive and strictly enforced. This gave rise to Samizdat, a clandestine copying and distribution of government-suppressed literature. Art, literature, education, and science were placed under strict ideological scrutiny, since they were supposed to serve the interests of the victorious proletariat. Socialist realism is an example of such teleologically-oriented art that promoted socialism and communism. All humanities and social_sciences were tested for strict accordance with historical materialism.\nAll natural sciences were to be founded on the philosophical base of dialectical materialism. Many scientific disciplines, such as genetics, cybernetics, and comparative linguistics, were suppressed in the Soviet Union during some periods, condemned as \"bourgeois pseudoscience\". At one point Lysenkoism, which many consider a pseudoscience, was favored in agriculture and biology. In the 1930s and 1940s, many prominent scientists were declared to be \"wreckers\" or enemies of the people and imprisoned. Some scientists worked as prisoners in \"Sharashkas\" (research and development laboratories within the Gulag labor camp system).\n\n\n Also, the Great Purge and all that, right? Eeee. For example,\n\n [In the 1920s and 1930s, 2,000 writers, intellectuals, and artists were imprisoned and 1,500 died in prisons and concentration camps. After sunspot development research was judged un-Marxist, twenty-seven astronomers disappeared between 1936 and 1938. The Meteorological Office was violently purged as early as 1933 for failing to predict weather harmful to the crops. But the toll was especially high among writers.](https://en. wikipedia. org/wiki/Great_Purge#Intelligentsia)\n\n \"Sunspot development research,\" SeismicAltop. \n\n I'm pretty sure *that* is why you'd be on \"team capitalist if [you] were a technologist.\" \n \n\n"}