{"doc_id": "973", "name": "2017_04_humanities_student_major_515_television", "namespace": "we1sv2.0", "metapath": "", "pub": "television", "title": "2017-04-humanities-student-major_515_television.txt", "pub_date": "2017-04-05T00:00:00Z", "Sentiment": "0.157", "Subjectivity": "0.45", "Score": "9", "Upvotes": "0", "Downvotes": "0", "Wordcount": "435", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfv90uo", "Reddit_id": "dfvsq49", "Subreddit_id": "t5_2qh6e", "Commenter": "SnapMyNeckPlease", "length": "2356", "content_scrubbed": "This is long:\nFrom Ep. 1 and the application process, they make it like you have to have the perfect answer why you want to be there as they are so exclusive, like it[.] a privilege to be part of it, and then YOU PAY THEM $5k for the privilege (so called \"tuition\"), like you are getting Harvard level education and experience out of it. Then, most likely, you pay for your own plane ticket and hike 3 miles to an open air site, with unstable water supply, peers as instructors and crappy food. They profit off your ideas and what do you get? A line on your resume that will get you laughed out of a job interview. \n\n17 yrs ago I did an independent biology course (tropical ecology with a focus on medicinal healing) that took me to live in Costa Rican rainforest for a month. Being an out of state student, my instructor was able to get me in-state rate on the 3 credits, then I owed $800 for room, board, food, free day experiences, transportation, bought my own plane ticket ($575, Priceline) and brought whatever \"me time\" money ($500) I'd think I'd need. All in $1875 and I came back with over $200, stuff was that cheap. I was instructed by real instructors and had an experience to put on resume that counted as proof I expanded my college horizon (did another study abroad to knock out a humanities course the year before to Italy). I was fed a lot of rice and beans but it was balanced with fresh fruit and some vegetables. We had a constant flow of cloud forest mountain top fresh water with decent water pressure. We had a shower (cold water, but still a shower), a toilet that could flush, and bunk beds with mosquito nets. It was like Girl Scout camp, but in the most beautiful place imaginable. The shit these people are getting is a scam. The family that hosted the handful of us gained very little profit from us being there, but we were well taken care of. \n\nThis is a scam, all while Jimmy has flown back stateside, grabbing chips and multiple bottles of wine to the tune of $125, and trying to poach employees from the HATCH program he promotes at. He looks real punchable through my TV screen. Can't wait for the inevitable sickness to come from poor diet and bad conditions. I hope those who left recouped their \"tuition\" that Jimmy had probably already spent on nothing to do with Kalu Yala and everything to do with personal comfort. "}