{"doc_id": "504", "name": "2017_10_humanities_student_major_2750_assistance", "namespace": "we1sv2.0", "metapath": "", "pub": "Assistance", "title": "2017-10-humanities-student-major_2750_Assistance.txt", "pub_date": "2017-10-28T00:00:00Z", "Sentiment": "0.063", "Subjectivity": "0.286", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1015", "Permalink": "http://reddit.com/r/Assistance/comments/79bdfx/request_somebody_to_open_a_wsj_article_for_me/dp0leh3/", "Threadlink": "http://reddit.com/r/Assistance/comments/79bdfx/request_somebody_to_open_a_wsj_article_for_me", "Parent_id": "t3_79bdfx", "Reddit_id": "dp0leh3", "Subreddit_id": "t5_2s25d", "Commenter": "rhubes", "length": "6098", "content_scrubbed": "Some pictures tell stories. All pictures have stories behind them. Frederic Edwin Church[.] monumental \"The Icebergs,\" at the Dallas Museum of Art, both has a story and tells one, albeit obliquely.\n\nWhen unveiled in New_York on April 24, 1861, the painting profited from its maker[.] already considerable fame. An unsigned review in the New-York Daily Tribune, the same day, called it the \"most splendid work of art that has yet been produced in this country.\" Several years earlier, Church[.] pictures from an 1853 South_American trip with Cyrus Field (who later laid the Atlantic cable) were well received, and in 1857 his magnificent \"Niagara Falls\" (in Washington[.] Corcoran Gallery) was such a crowd-pleaser that it was displayed by itself at his dealer[.] showroom. London exhibits followed. Church became an Anglo-American sensation.\n\nWhat happened next is one of those art-history tales that make you wonder what other great pictures might lie in hiding somewhere, waiting to regain the light of day. Sir Edward Watkin, a railway magnate in Manchester, England, who later became a Liberal member of Parliament, bought the painting after it was shown in London in 1863. He kept it at Rose Hill, his country place. Watkin died in 1901, and then Rose Hill became a boys' school.\n\n\nFlash forward more than three-quarters of a century. In 1979, Sotheby[.] negotiated the sale of the painting—which seemed to have vanished from the public consciousness—for $2. 5 million, then the highest price ever paid for an American picture. The buyers were Lamar and Norma Hunt. Mr. Hunt, who died in 2006, was the son of legendary Dallas oilman H. L. Hunt. He was also the younger sibling of Nelson Bunker and William Herbert Hunt, who at the time their kid brother was buying the picture were in the business of trying to corner the world[.] silver market.\n\nOne account has it that Mr. and Mrs. Hunt intended the picture for their Dallas home, but when they realized that its size, 641⁄2 inches by 1121⁄2 inches, prohibited hanging it there, they donated it to the Dallas Museum, where it has occupied pride of place for the past three decades.\n\nAnd what a picture it is. Church (1826-1900) was, like many others, caught up in the despair surrounding the disappearance of Sir John Franklin and his crew, lost in the Arctic in 1847 while trying to find the fabled Northwest Passage. The North Pole, still untouched at the time, and the surrounding ice floes, had captured people[.] imaginations for centuries.\n\nHaving already painted pictures in both North and South_America, Church was ready for something more adventurous, and he took a one-month schooner cruise in 1859, through the North Atlantic in the vicinity of Labrador and Newfoundland with his friend Louis Legrand Noble, who wrote \"After Icebergs, With a Painter,\" which served as an early public-relations notice for the painting.\n\n\nWe know about Romantic heat, the longing for what Keats called \"the warm South,\" whether in Provence or Morocco or India. Romantic ice is equally to be contended with; the mysteries of the poles were a staple of Romantic literature. Samuel Taylor Coleridge[.] Ancient Mariner went past the Equator toward the South Pole, where the avenging spirits from the land of \"mist and snow,\" with its \"ice as green as emerald\" demanded rites of eternal penance from the albatross-slaying hero. Mary Shelley[.] \"Frankenstein\" begins and ends in the Arctic wastes, as her Faustian hero first pursues, and then is pursed by, the monster he has created. The Arctic was as sublime as the Alps, because it was as inhospitable and impenetrable.\n\nNot just the size but the shapes, colors and implicit symbolism of \"The Icebergs\" astonish. Standing in front of it, a viewer seems to occupy a position in the inlet of a bay. Water—in both liquid and solid forms—and louring sky are all there is, at least at first glance. Everything seems enormous and eerie. The section of the iceberg on the painting[.] left looks like a Chinese \"scholar[.] rock,\" a stonelike piece of ice striated by a blue stripe. On the_right, a green sheen suggests the pure depth and deadly chill of the North Atlantic waters.\n\nWhite is the visual leitmotif, but other colors make an appearance, especially when you move in for a closer view of the brush strokes and delicacies in Church[.] composition. On the_left you find orange and brown tints, picked up in the sky and the distant sunset, and by the small, pink iceberg in the back, the only object not literally connected to the major mass. In the_left-hand middle distance, the water looks ocher, almost brown, becoming lighter as it moves right toward the electric-green grotto.\n\n\nDead center is the primary mountainous mass, a sublime, almost abstract object. Looking closely at it, and at the other icy projections, you may think of the odd coloration inside any towering Richard Serra sculpture, or the jagged edges in the abstractions of Clyfford Still. And Church lays on his paint in ways that seem to predict Paul Cezanne. Although \"Icebergs\" recollects the paintings of Church[.] mentor Thomas Cole, the founder of the Hudson River School, it moves well beyond Cole[.] tamer picturesque landscapes in both subject and painterly technique.\n\nSublimity was, of course, a staple of Romanticism, but here we have an untamable nature that seems on first glance entirely removed from human life. On second glance, we see, inscribed on a rock on the picture[.] lower left side, \"F. E. Church 1861\"—the painter[.] signature, his \"Kilroy Was Here.\" Man has staked his claim, even if only vicariously, in the chilling waters. The inscription is touching because human beings have no place in this watery landscape. But wait: Another detail complicates the sublime emptiness. Between the American unveiling of the picture and its appearance in England, Church added a torn, broken ship[.] mast at the bottom of the canvas. It is, most critics agree, his elegiac homage to Franklin[.] tragic, failed expedition.\n\n—Mr. Spiegelman is the editor in chief of the Southwest Review in Dallas and writes about the arts for the Journal."}