{"doc_id": "1132", "name": "2017_04_humanities_student_major_1950_writingprompts", "namespace": "we1sv2.0", "metapath": "", "pub": "WritingPrompts", "title": "2017-04-humanities-student-major_1950_WritingPrompts.txt", "pub_date": "2017-04-17T00:00:00Z", "Sentiment": "0.077", "Subjectivity": "0.312", "Score": "14", "Upvotes": "0", "Downvotes": "0", "Wordcount": "865", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65vu38", "Reddit_id": "dge49wo", "Subreddit_id": "t5_2s3nb", "Commenter": "brixen_ivy", "length": "4660", "content_scrubbed": "*Typical Friday night at ZK,* Alan thought, cracking open another beer. *I don't even know why I'm still hanging out here.*\n*No shit, dude, it[.] been five years since you graduated. Don't you have anywhere better to be? Oh yeah, you don't. Liberal arts? What did you think was gonna happen?*\nAlan hated losing arguments with himself. But he was right. Zeta Kappa plus him was not a good combination. Maybe if he had listened to everyone and picked a real major...\n\"Aaaaaghh, one more,\" he mumbled, popping the tab on another... never heard of it brand beer. It bubbled ever so slightly out through the opening, and he gave the side of the can a quick wipe.\nA puff of grayish-purple smoke billowed weakly from the top of the can, and a dumpy little figure in a stained t-shirt appeared as the smoke dissipated. \"Thank you for releasing me,\" he intoned, his voice tinged with sarcasm and regret. \"I am your shitty genie and I can grant you any shitty wish you would like. So don't ask for a new career or a million bucks or anything good. Okay?\"\nAlan sat dumbfounded, glancing between the beer can and the genie, and concluding that he had had waaay too much to drink. \"Okay, then,\" he managed to say, \"I wish this beer wasn't so skunky.\"\nThe genie rolled his eyes and waved his left hand. \"Your wish is my command, or something like that,\" he replied with all the enthusiasm of a wet sponge.\nAlan tasted the beer. It wasn't great, but it wasn't bad. Unfortunately for his digestive system, the taste didn't make a difference, because within thirty seconds, it was coming back up and...\n\nThe next morning (okay, afternoon), Alan glanced around the room. *Was I that drunk last night?* he sort of moaned. Maybe it was out loud and maybe it was just a thought. He sat up and saw the genie hovering over a dried-up patch of...*Alan, don't think about what it was*\n\"No, yeah, you were that drunk, but not really,\" the genie said sarcastically. \"Do you remember your wish?\"\n\"Wait, this is real? How many wishes do I get?\"\nThe genie sighed and said, \"There should be a limit, but since I don't get to grant the really good wishes, I keep going until you get sick of me. Or until your imagination goes dead, which I'm guessing will be by next weekend.\"\nAlan pondered his next wish carefully. \"So it can't be anything cool for me? Actually for me? But it can be something shitty for someone else?\"\nThe genie sighed again. \"We went over this last night. Nothing that benefits you long_term. Nothing that actually improves your life. Last night, you wanted your beer to taste better. That[.] kind of a shitty thing to ask for. It did, at least before you puked it all up.\"\n\"No, no, no, enough about the beer,\" Alan groaned. \"I wish for you to give my ex-girlfriend boils on her ass. Cheat on me, will you?\"\nThe genie produced a book from... somewhere. \"Just a moment here,\" he mumbled, \"boils, boils, here we go. Yeah, okay, I can do that.\" And as if fueled by boredom, he waved his left hand the way he had the previous night. \"Anything else?\"\n\"Ummm, yeah. I wish you would make every scratch ticket I buy a winner. Even if it[.] only a dollar.\"\nOut came the book again. \"Nope, breaking even isn't shitty enough for my power. Sorry.\"\n\"Okay, then how about wishing for them to actually put enough pepperoni on my pizza from now on?\"\nBook. \"Yeah, I can cover pizza toppings, but not free pizza. Next.\"\n\"Oh, I know. I wish for you to make the bolts on my toilet seat tight enough that they don't pop off when I'm dropping a deuce, but it[.] not so tight that I can't replace it if I have to.\"\nThe genie let out an actual genuine laugh, severely lacking the sarcasm and bitterness that Alan had become used to hearing. \"I don't even need to look at the book to know that I can handle that one. What else do you got?\"\nAlan sat back, kind of stunned. He really couldn't think of anything else. \"Well, genie, guess you were right. I guess I don't have that great of an imagination.\" The hamster wheel in his brain suddenly began spinning and he added, \"Hey, I've got it. I wish for a better imagination. That way I can be the one coming up with all of the sarcastic and funny comments on Reddit. It really won't do me any good. It[.] not like I can make money from it. So it[.] sort of shitty. But it[.] sort of cool, too. Check your book, check your book. Can you do that?\"\nThe genie smiled and said, \"Now that is what I'm talking about. That[.] the best shitty wish that anyone[.] ever come up with. I don't care if they approve or not, I'm granting that one. But that means that you're done, no matter what. No more wishes.\" And he disappeared into the empty less-than-skunky beer can."}