{"doc_id": "332", "name": "2017_10_humanities_student_major_977_games", "namespace": "we1sv2.0", "metapath": "", "pub": "Games", "title": "2017-10-humanities-student-major_977_Games.txt", "pub_date": "2017-10-10T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.404", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "321", "Permalink": "http://reddit.com/r/Games/comments/75jk3m/bad_graphics/do6wy5c/", "Threadlink": "http://reddit.com/r/Games/comments/75jk3m/bad_graphics", "Parent_id": "t1_do6p3y6", "Reddit_id": "do6wy5c", "Subreddit_id": "t5_2qhwp", "Commenter": "ginsbergahoy", "length": "1859", "content_scrubbed": " It[.] hardly a critique, though. It[.] mostly just \"games I like versus games I don't like\" with hastily cherry picked examples of \"good\" and \"bad\" graphic design practices with no real attempt to connect his comparisons in any meaningful way.\n\nDing ding ding.  This is the problem with the majority of games criticism, especially on youtube: they lack a real thesis.  It[.] usually just \"here is a game I like/hate, here are all the things I like/dislike about it\".  Do you have a British accent?  Excellent.  It'll lend your words more weight.  If not, just affect a strange 'comedy' accent and yell a lot so that no-one can accuse you of taking yourself too seriously.  And don't forget to pre-empt any counterpoint by asserting the opposite.  For example, is your favorite game often criticized for being unfairly difficult?  Simply state that \"in my opinion this only *enhances* the appeal of the game\" without explaining exactly how it achieves this.  Add in some cute graphics and words like \"level design\" and \"aesthetics\" and you'll be hailed by everyone that agrees with you as the critic of the century.\n\nEgoraptor got a lot of heat when he first posted his Sequelitis video on Ocarina of Time, and while that[.] my least favorite of his Sequelitis videos, at least it had a point: that moving Zelda into 3D created a divide between exploration and combat, and to make up for this the game introduced too much padding, which is why he believed Ocarina was a bad sequel to A Link to the Past.\n\nPeople are generally mistrustful of the humanities and bullshitting your way through college papers, but I think they could stand to learn a thing or two from literary theory.  It[.] not enough to just say things and provide examples, you've got to have an actual point you're trying to make.  Otherwise, how are you going to make anyone think about anything?"}