{"doc_id": "1188", "name": "2017_04_humanities_student_major_2498_games", "namespace": "we1sv2.0", "metapath": "", "pub": "Games", "title": "2017-04-humanities-student-major_2498_Games.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "-0.12", "Subjectivity": "0.359", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "324", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgl9qg5", "Reddit_id": "dgm0921", "Subreddit_id": "t5_2qhwp", "Commenter": "Mizzet", "length": "1754", "content_scrubbed": "I don't play anymore but several factors come to mind.\n\n* There was a very drastic change to a major mechanic earlier on in the lifespan of the game: You used to draw 2 cards at the end of turn instead of 1. There[.] still a lot of resentment over that change as it was viewed as increasing the amount of randomness. Drawing less cards also significantly changed the game flow from being more tempo based with many answers per turn, to the more typical 'curve out well with incrementally larger minions' kind of flow.\n\n* Another tangentially related thing is that a big draw of Duelyst at the start was the perception that it was selling itself as a low-RNG CCG. We've had several new sets of cards since then and the impact of randomness on card design has only increased.\n\n* Little things here and there like the tuning/lowering of gold rewards for playing games and doing daily quests. An ingame store selling emotes people viewed as overpriced, a loot crate system that was just bait to get people to head to the store to buy keys (you get locked crates randomly, keys to open them are bought with real money). It all felt a little cash grabby and rubbed people the wrong way.\n\n* There was a recent interview one of the lead devs did where he kind of put his foot in his mouth a little while espousing his game design philosophies.\n\n* The artstyle is kinda all over the place too. Some people hate the pixel art but like the backgrounds. Some people like the pixel art but hate the character portraits - they can't seem to please everyone.\n\nJust stuff like that. They did go on a marketing blitz of sorts early on paying people like Kibler to stream the game. It[.] done 'okay', but it never really took off and its just been slow attrition ever since."}