{"doc_id": "325", "name": "2017_10_humanities_student_major_910_cfb", "namespace": "we1sv2.0", "metapath": "", "pub": "CFB", "title": "2017-10-humanities-student-major_910_CFB.txt", "pub_date": "2017-10-10T00:00:00Z", "Sentiment": "0.063", "Subjectivity": "0.345", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "282", "Permalink": "http://reddit.com/r/CFB/comments/75f1ga/nobel_prizes_are_great_but_college_football_is/do605aj/", "Threadlink": "http://reddit.com/r/CFB/comments/75f1ga/nobel_prizes_are_great_but_college_football_is", "Parent_id": "t3_75f1ga", "Reddit_id": "do605aj", "Subreddit_id": "t5_2qm9d", "Commenter": "ibinpharteeen", "length": "1590", "content_scrubbed": "I think the problem with this argument is that it ignores a pretty large subset of American schools, liberal_arts colleges. Now granted many of these aren't universities and don't bring in the research dollars that many of those that get listed on USNWR (and the like) do, but in terms of academics rank up there with many of those listed on here.\n\nTake for example two schools I've attended, Kenyon and Wisconsin. I chose Wisconsin because it appears on the list. In terms of entrance scores, the two schools are about as close as it gets.\n\nMadison - UW GPA - 3. 67, ACT - 29\n\nKenyon - UW GPA - 3. 68, ACT 31\n\nObviously Kenyon isn't going to bring in the money that Wisconsin is for a number of reasons, but in terms of quality of academics at least to enticing undergraduate students to attend (as part of the basis of the authors assertion) they are pretty equal. One must also keep in mind that the cost to attend a private school is higher than that of a public school (generally).\n\nNow from that, Kenyon is tied in ranking with 6 other schools at 26. From that, one can extrapolate that 31 schools that generally won't qualify for the USNWR rankings due to size, graduate level programs etc., but are similarly academically rigorous aren't included in the author[.] discussion. From that 31 only 3 have FBS football teams: the service academies.\n\nDo I think football brings in money to help bring in students? Absolutely. Do I think that the author ignores a substantial subset of the population when correlating college football with academics and ability to draw the top students? Yes."}