{"doc_id": "1209", "name": "2017_04_humanities_student_major_2690_latestagecapitalism", "namespace": "we1sv2.0", "metapath": "", "pub": "LateStageCapitalism", "title": "2017-04-humanities-student-major_2690_LateStageCapitalism.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.131", "Subjectivity": "0.299", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "251", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgo4zin", "Reddit_id": "dgo5bbi", "Subreddit_id": "t5_39qgx", "Commenter": "zen_mutiny", "length": "1515", "content_scrubbed": "Yes, 10s of millions of people going to college and spending $200k on liberal_arts degrees is absolutely going to prepare us for our automation driven future.\n\nIt doesn't need to cost $200k. That[.] an effect of greed.\n\n I've got zero interest in fully subsidizing degrees that aren't in STEM fields.\n\nFree education in STEM fields alone would at least be a start. However, I think you're underestimating what other educational fields bring to society. Technology is good, but technology without ethics or historical perspective brings disaster. \n\nI think many overestimate the actual cost of a college education. We can educate our students far more effectively for much less than what we spend on it. The Internet is already educating people just by existing. If we harness the technology we have now to create a better education system, we could churn out armies of highly skilled scientists, programrs, and medical professionals as fast as we used to churn out soldiers and factory workers. There[.] no reason for millions of people to be languishing in poverty, working two or three jobs that don't actually contribute anything to the advancement of the human species, just for their survival, when they could be getting advanced degrees in game-changing fields instead. It[.] not that people don't want to get those degrees and do the work to make the world a better place, the current system just makes it incredibly difficult to do so, especially if one is not financially well-off. We need a better system. "}