{"doc_id": "456", "name": "2017_10_humanities_student_major_2235_movingtojapan", "namespace": "we1sv2.0", "metapath": "", "pub": "movingtojapan", "title": "2017-10-humanities-student-major_2235_movingtojapan.txt", "pub_date": "2017-10-23T00:00:00Z", "Sentiment": "-0.023", "Subjectivity": "0.387", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "228", "Permalink": "http://reddit.com/r/movingtojapan/comments/78bhyp/picking_a_japanese_university/dosp5dl/", "Threadlink": "http://reddit.com/r/movingtojapan/comments/78bhyp/picking_a_japanese_university", "Parent_id": "t3_78bhyp", "Reddit_id": "dosp5dl", "Subreddit_id": "t5_3fy6c", "Commenter": "hachihoshino", "length": "1314", "content_scrubbed": "They're both kinda in the dick-end of nowhere. Tsukuba is reasonably close to Tokyo but a miserable dormitory town with little to offer in its own right; Akita is a long way from any major city but at least has a lot of really nice countryside stuff around it, though be warned it'll be VERY heavily snowed in and bitterly cold in winter.\n\nAs for the universities themselves - they couldn't be more different. Akita International University is *tiny* (I think they've only got about 1000 students) and it[.] a bit of an oddball school; essentially a liberal_arts college where everything is taught in English. Tsukuba is a big, well-regarded school that[.] quite heavily STEM focused and has made some token efforts to offer some courses etc. in English, but is by and large behind the pack in terms of internationalisation.\n\nIt really depends what you want to do in Japan, in other words. I don't think Akita would be a good place for you if learning Japanese is a high priority, because all the local students will speak good English; on the other hand, if you're just coming for the experience and not bothered about your language skills, Tsukuba might be a bit of a headache because their English-language offerings are piss-poor.\n\nFWIW, that[.] a really, really weird pair of universities to have to choose from."}