{"doc_id": "993", "name": "2017_04_humanities_student_major_653_grinnell", "namespace": "we1sv2.0", "metapath": "", "pub": "Grinnell", "title": "2017-04-humanities-student-major_653_Grinnell.txt", "pub_date": "2017-04-06T00:00:00Z", "Sentiment": "0.205", "Subjectivity": "0.529", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "655", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_63x4yv", "Reddit_id": "dfxuqsa", "Subreddit_id": "t5_2s7ec", "Commenter": "DCPhowweare", "length": "3658", "content_scrubbed": "From the beginning of my college search, I really was only interested in Carleton, St. Olaf, Grinnell, and Macalester. My experience might not be that useful because it seems that everyone has their own stereotypes for these schools, but I'll share why each of the non-Grinnell schools didn't make the cut for me.\n\nSt. Olaf - I'm from the wealthy suburbs of Minneapolis and knew that going to St. Olaf would basically be paying to re-create my high school experience. I would have ended up being involved in theater and choir here and probably would have hung out with the numerous kids from my high school who went to St. Olaf. Basically, St. Olaf being a very rich, very white more arts focused school wouldn't have pushed me out of my comfort zone. All of these schools are fairly white and affluent, but Grinnell in my experience has made the biggest commitment to achieving real socioeconomic and racial diversity. \nSt. Olaf is also a dry campus. This didn't make a huge difference, but did factor into my decision. I don't party much and didn't think I would when I was looking at colleges, but St. Olaf gave off vibes that their party culture was pretty underground. It[.] definitely there and probably really vibrant, but I disliked how it seemed like the school didn't trust their students with alcohol. Grinnell has it[.] own problems with this, but our paternalistic streak pales in comparison to St. Olaf\n\nMacalester - I couldn't get a read on Macalester. Most of these small Midwest liberal_arts schools have a reputation, but Mac stands out because it doesn't seem to have one. It[.] not as academically rigorous as Grinnell or Carleton. It doesn't have as good of arts programs as St. Olaf or Luther. It[.] just kind of there. It[.] a pretty nice campus and in a cool part of St. Paul, but other than that there isn't much to get excited about. I have a friend that goes to Macalester and swears that they have the most fun party culture for schools of its size, but I haven't heard anyone else back this up. I should mention that I had an absolutely terrible admitted student[.] weekend visit. My host had two other prospies and his roommate had two prospies as well, so I slept in a small double with seven people in it for the night. My host didn't show me around at all, he just left us to do our own thing. All the people that I met and really enjoyed hanging out with at Mac were other prospies. That was enough to tell me that I probably wouldn't love it there. \n\nCarleton - I got waitlisted here. I'd like to say that even if I hadn't gotten waitlisted, I would have still chosen Grinnell, but I'm not positive about that. I've actually spent a fair amount of time on this campus because I briefly dated someone who went here from back home. This school seems to have the most \"preppy\" students out of the group. I might be biased because the people I know from Carleton routinely bash Grinnell because it[.] basically Carleton with worse rankings and in a worse small town. Out of all these schools, Carleton feels the most like an East_Coast liberal_arts school a la Williams or Wesleyan. \n\nOverall, I'd say that I'm pretty happy with my choice. Grinnell offered me the chance to meet a very interesting cross-section of people from all over the country, and I'm grateful for that. If you want a fairly laid-back college experience where you free license to explore your academic interests while getting to learn with a lot of engaging, thoughtful people and you don't mind being in the middle of nowhere, Grinnell is a great school. If you have any other questions about Grinnell itself, shoot me a message, I'll be happy to answer any. \n\n"}