{"doc_id": "925", "name": "2017_04_humanities_student_major_82_college", "namespace": "we1sv2.0", "metapath": "", "pub": "college", "title": "2017-04-humanities-student-major_82_college.txt", "pub_date": "2017-04-01T00:00:00Z", "Sentiment": "0.163", "Subjectivity": "0.427", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "343", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_62ujrw", "Reddit_id": "dfphv14", "Subreddit_id": "t5_2qh3z", "Commenter": "SnowblindAlbino", "length": "1885", "content_scrubbed": "Lots of people work their way through college; my wife did it for both a BS and MS, though it took 10 years total. It is going to be *very* hard to work full time and carry a full time load at a decent school... easier in a community college setting or a place that caters to part-time students (i. e. \"non-traditional\" students).  As a professor at a $$$ private college I always tell my students that being a serious college student is in itself a full time job, and we certainly expect them to put in 40+ hours/week between classes/labs/studying. I've seen students try to work full time and fail because there just aren't enough hours in the week-- and we don't offer evening classes or really any other accommodations for people who are working more than the typical on-campus work study job.\n\nBut there are lots of schools where the majority of students are working, many full time, that will help accommodate your other obligations by offering classes in the evenings, on weekends, that meet only once a week, and probably above all else are simply not as demanding. Whereas I have no problem at all asking students to read 100-150 pages for every class meeting, to watch a two hour movie before class, or to require them to meet in groups outside of class every week to contribute to a project, there are lots of schools where you might have no reading assignments at all for many classes and nobody would ever think of asking you to do something like watch a movie or attend a mandatory lecture outside of class time.\n\nGood luck OP. Look for a school that caters to non-traditional students and consider attending part_time for a while, at least until you figure out what kind of load you're personally capable of carrying. Keep in mind you're better offer taking six years to ear a degree than you would be trying to do a full load and ended up with a 2. 0 GPA at the end of it."}