{"doc_id": "1191", "name": "2017_04_humanities_student_major_2518_askliterarystudies", "namespace": "we1sv2.0", "metapath": "", "pub": "AskLiteraryStudies", "title": "2017-04-humanities-student-major_2518_AskLiteraryStudies.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "0.133", "Subjectivity": "0.409", "Score": "12", "Upvotes": "0", "Downvotes": "0", "Wordcount": "667", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66x394", "Reddit_id": "dgma2ac", "Subreddit_id": "t5_2tltc", "Commenter": "BuiltLikeTaft", "length": "3821", "content_scrubbed": "Doing research on grad schools can be a lot trickier than schools generally. I basically felt like I didn't really understand what the good schools were in my subfields until my third year of grad school.\n\nThis is in no way meant to be an endorsement of the rankings, but if you just want to see what schools you might think about as options, you might start with the [US News and World Report](https://www. usnews. com/best-graduate-schools/top-humanities-schools/english-rankings) list. As I said, please ignore the rankings. Graduate study is highly dependent on having two or three great professors in your subfield who like your work, and almost no schools can boast that kind of strength in every subfield, and sometimes schools that you wouldn't expect can be quite strong. For instance, I would put Illinois in the top 5 for Old English, instead of 26, while many of the so-called top schools don't even have a single tenure-track Anglo-Saxonist.\n\nOnce you have a school to research, there are a couple things you should do. First, go to their faculty page and try to identify as many faculty who you think are doing interesting things as you can. You shouldn't go to a graduate program unless they have multiple faculty that you can imagine supervising the kind of project you want to work on. Don't go to a program if they only have one person in your area. You may get there and discover that they are a serial sexual harasser (unfortunately, I suspect that most departments have at least one), or they don't like your work, or their students never actually finish their projects. Don't put all your eggs in one basket. You also want professors who are active in their research. Is the last publication listed on their faculty page over ten years old? Then odds are they are probably not very active in their field and are just putting in time until retirement. You want professors who are actively publishing articles and/or books.\n\nI would also suggest looking at their current graduate course offerings. The courseload in grad school is very different in undergrad. People typically only take three or four classes a semester, but the workload expectations are much higher. Are there classes that you are interested in? If not, you probably won't find the kind of community that will support work in your field.\n\nFinally, you should look into what kind of funding they offer for graduate study. You should never do an English PhD at a school in the US that doesn't offer full funding for at least five years. Full funding means a complete tuition waiver as well as money to live on, which typically is a combination of stipend and work in a writing center or as a composition instructor. The amount can vary pretty widely by school (and some are pretty cagey about the amounts), but at the upper level, these can be up to $30,000 a year. I wouldn't even think about a PhD program that couldn't guarantee at least $15,000 for five years on top of the tuition waiver. Nobody should take on thousands of dollars in debt to do a PhD.\n\nYou might also look up information about specialty areas. The Modernist Studies Association is a big one, that has a regular conference. You might look at some of the programs of their recent conferences to see what schools get strong representation. Any school that is sending multiple people to a conference like that is probably a good one to look into. For video game type stuff, I don't know what the big conferences are, but the key words that will probably come up on a lot of sites are things about digital humanities. I know Maryland does a fair bit of stuff in this area, under Matthew Kirschenbaum.\n\nBut basically, you will find yourself getting really friendly with the department web pages. But you also have a lot of time, so don't feel like you have to rush this."}