{"doc_id": "370", "name": "2017_10_humanities_student_major_1319_worldnews", "namespace": "we1sv2.0", "metapath": "", "pub": "worldnews", "title": "2017-10-humanities-student-major_1319_worldnews.txt", "pub_date": "2017-10-14T00:00:00Z", "Sentiment": "-0.01", "Subjectivity": "0.24", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "310", "Permalink": "http://reddit.com/r/worldnews/comments/761uhe/more_than_25_million_people_die_each_year_without/dod0wkb/", "Threadlink": "http://reddit.com/r/worldnews/comments/761uhe/more_than_25_million_people_die_each_year_without", "Parent_id": "t1_docmxr1", "Reddit_id": "dod0wkb", "Subreddit_id": "t5_2qh13", "Commenter": "youbead", "length": "2206", "content_scrubbed": "A Doctor of Pharmacy (Pharm. D.) degree is required in order to become a pharmacist in the U_S. Before you enter the Pharm. D. degree program, you'll need to complete prerequisite coursework in biology, physics, chemistry, mathematics, humanities, and social_sciences. These requirements can be completed in two to three years, although you can choose to complete a four-year bachelor[.] degree in chemistry or a related topic.\n\nIt typically takes about four years to complete a Pharm. D. program. In the program, you'll learn about drug information and how to properly communicate with customers. You'll also learn business management, professional ethics, and public health concepts. Laboratory work is common in these programs. Required classes include biopharmacy, medicinal chemistry, physiology, pharmaceutics, pharmacology, pharmacy law, pharmacy practice, healthcare systems, pharmacy management, therapeutics, and pharmacokinetics.\n\nFrom your fucking source, Pharm. D. is a 4 year postgraduate program, the minimum prerequisite course work can be completed in 2 years but the majority of students complete their bachelors first.\n\nHere[.] an example prereq course list from the UoA school of pharmacy http://www. pharmacy. arizona. edu/prerequisite-course-guide\n\nHere is the AAMC requirements for admission into a medical program https://students-residents. aamc. org/choosing-medical-career/article/admission-requirements-medical-school/\n\nif you take a look the the science requirements are the **same fucking thing** in fact the pharmacy requirements are actually more than the AAMC minimum requirements (generally most medical school requirements are actually pretty close to the requirements I posted for the pharmacy program). \n\nThe only difference is that it requires a Bachelors to get into medical school, but there is no requirement to get a B. S. or even anything related to medicine, in fact recently many medical programs are pushing for more humanities grads to enter medical school. But, even without the requirement about 75% of pharmacy students have Bachelors.\n\nPharm. D. is a 6-8 year schooling process plus internships or residency, it is only slightly quicker than becoming a Dr."}