{"doc_id": "226", "name": "2017_10_humanities_student_major_22_europe", "namespace": "we1sv2.0", "metapath": "", "pub": "europe", "title": "2017-10-humanities-student-major_22_europe.txt", "pub_date": "2017-10-01T00:00:00Z", "Sentiment": "0.056", "Subjectivity": "0.261", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "340", "Permalink": "http://reddit.com/r/europe/comments/73k14m/map_comparing_uk_and_german_productivity_light/dnr34vm/", "Threadlink": "http://reddit.com/r/europe/comments/73k14m/map_comparing_uk_and_german_productivity_light", "Parent_id": "t1_dnr2t7d", "Reddit_id": "dnr34vm", "Subreddit_id": "t5_2qh4j", "Commenter": "Taure", "length": "1971", "content_scrubbed": " How?\n\nThe current system has university education being paid for by those who earn £21,000 or more.\n\nIf it were paid for out of general taxation instead, then it would be paid for by those earning £11,000 or more.\n\nThis is not progressive. You are having those earning £11,000 - £21,000 pay for a tax break for those earning £21,000+ (and that is what the current system is, in effect: a graduate tax).\n\nAlso an anecdote: When visiting UK universities as study trips we as german students were always astonished how few hours british students were putting in and how low the level of education was. \n\nI assume you were doing an arts or humanities subject. In the sciences the students have quite high \"contact hours\". In the arts and humanities, however, the approach is \"you can lead a horse to water but you can't make it drink\". Contact hours/lectures are not and cannot be a replacement for doing the reading. Contact hours should be used to hone in on the most difficult parts and to clear up difficulties that have arisen when the students do the reading. Of course a lot of students don't do the reading and they rightly struggle when it comes to the exams. But it[.] not the job of the university (in the UK) to spoon feed the students. The point of university (as opposed to school) is that you are now adults responsible for your own learning. \n\nIt sucks a bit for arts/humanities students that their fees subsidise the science students (all those contact hours, experiments and equipment are expensive), but it[.] up to the students to pick what they study.\n\nInterestingly, since the new tuition fees were brought in, subscription to STEM courses has increased, and student alcohol consumption has dramatically fallen. It seems that the fees are focusing students on maximising the value they get from their degree. (Not to say, of course, that arts and humanities are not valuable. I myself did a humanity. But they're less obviously vocational than sciences)."}