{"doc_id": "233", "name": "2017_10_humanities_student_major_62_northwestern", "namespace": "we1sv2.0", "metapath": "", "pub": "Northwestern", "title": "2017-10-humanities-student-major_62_Northwestern.txt", "pub_date": "2017-10-01T00:00:00Z", "Sentiment": "0.102", "Subjectivity": "0.396", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "333", "Permalink": "http://reddit.com/r/Northwestern/comments/73m4ol/engineering_students_what_has_been_your/dns39h2/", "Threadlink": "http://reddit.com/r/Northwestern/comments/73m4ol/engineering_students_what_has_been_your", "Parent_id": "t3_73m4ol", "Reddit_id": "dns39h2", "Subreddit_id": "t5_2qptt", "Commenter": "bbyeok", "length": "1871", "content_scrubbed": "Senior in CS at McCormick here. Based on what I've heard and my experiences here, one of the big things about engineering here seems to be the diversity and interdisciplinary aspect. A lot of people seem to dabble in the humanities (i. e. music or RTVF), and that[.] with good reason - at NU that kind of stuff is really accessible to you as an engineer. Other than the physical divide between north and south campus, everything is available to you, if that makes sense. Heck, the engineering school pushes our Dean[.] whole concept of 'Whole Brain Engineering', which is basically putting what I've mentioned about mixing humanities/non-STEM materials with your engineering classes into practice.\n\nCourses are tough, especially if you get complacent. Grade inflation pretty much doesn't exist. But that being said the professors care that you learn, not just that you get an A and get a pretty gpa. So I guess that[.] a pro/con depending on your pov :p\n\nSocial life really comes down to what sort of activities you do outside of the classroom. For example, if you join a fraternity then you'll make a ton of friends due to your fellow brothers, and with the mixers/parties/events that you'll have access to. On the other hand, I'm not in a fraternity, but I on one of the vehicle teams and I'm pretty passionate about it. So I'm very close to many of my buddies from there. I will agree in that it[.] pretty awkward and hard to make friends from just classes alone, unless you befriend a homework partner or something. A lot of people take classes with friends so that they don't have to worry about groups/partners, so there[.] also that.\n\nOne of the advisors for our vehicle team also is a lecturer here and is an alumni, and he said that one thing that he has noticed with NU students over the years is that they tend to bite off more than they can chew.\n\nHope that helped."}