{"doc_id": "1121", "name": "2017_04_humanities_student_major_1838_auburn", "namespace": "we1sv2.0", "metapath": "", "pub": "auburn", "title": "2017-04-humanities-student-major_1838_auburn.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.038", "Subjectivity": "0.415", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1015", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgc705b", "Reddit_id": "dgcaas2", "Subreddit_id": "t5_2s54n", "Commenter": "StoneHolder28", "length": "6320", "content_scrubbed": "First, the guy was not proposing to ban the use of state funds for research.  He wants all such research banned, no matter who funds it.  That[.] completely counter to the spirit of science.\n\nThat[.] not what you said in your removed comment. Nonetheless, I could counter with how conservative administrations in recent history have enacted policies and proposed budgets that cut research funding.\n\nPlus, the government spends millions of dollars on laughable \"research\" boondoggles for liberal_arts, like a $331,000 study on whether being hungry makes you more likely to stab a voodoo doll representing your partner.  (Shockingly, being hungry makes a person more irritable.  Who knew?!).\n\n331k isn't \"millions,\" that[.] chump change for government research money. IQ has been studies exhaustively for decades, and I guarantee you more than 331k has been spent on it.\n\nThough a study looking at how blood sugar relates to emotional control and response doesn't sound as bad as \"liberal_arts boondoggle.\"\n\nFuture of humanity[.] intellectual potential<<<do people get prickly when hungry.  Good to know.\n\nThere has been much more money poured into IQ research, hence why we know it[.] a worthless number.\n\nThe research you cite does make the excellent point that there are different kinds of intelligences, and that therefore multiple tests should be given to an individual.  That does not mean that intelligence is useless.\n\nI didn't comment in intelligence. I only said the intelligence quotient is a meaningless number.\n\nAnd no, correlation does not imply causation, or tell which way the causal direction is if there is one.\n\nWell that[.] how the study you linked to previously came to it[.] conclusions, sooo\n\nWhat if intelligence causes greater aptitude for and interest in education?\n\nWe know that IQ is largely a result of a person[.] previous education, and can fluctuate significantly over just a few years.\n\nSince IQ[.] max threshold is over 50% genetic as per studies of identical twins, separated at birth*,\n\nThis can be because genetic do affect a person[.] ability to learn (e. g. if one twin has dyslexia, it[.] likely they both do) which effects their education, resulting in similar bogus numbers. Though I'm not sure why you care about twins when you wanted to talk about the difference in IQs between races.\n\nand since so far I'm not aware of any educational program shown in randomly-controlled trials to raise IQ (please cite if they exist),\n\nThere are [multiple](https://blogs. scientificamerican. com/guest-blog/you-can-increase-your-intelligence-5-ways-to-maximize-your-cognitive-potential/) methods in give your IQ a bump. Including learning to [play an instrument](http://www. apa. org/monitor/jun06/iq. aspx).\n\nit would seem that the causality lies in the opposite direction from what you imply.\n\nI disagree so far.\n\nBTW, even if IQ were 0% genetic, liberals tend to avoid the IQ issue completely.  If it[.] 100% environmental, you guys should focus on it /more/ than right-wingers [while stressing that you don't believe IQ is genetically determined], because you could actually do something in a few years to help low-average-IQ minority groups, whereas right-wingers tend to think that the best way to help low-average-IQ minority groups is to encourage the smartest among them to have the most children, and provide free contraception to the less-intelligent in those groups, a process that would take generations to produce improvement.  (BTW, is that really so extreme??)  \n\nIt[.] not good to lump together so many hundreds of millions of people and say they all say or do one thing. I'm not sure why you jump to the extreme that IQ is *0%* genetic, when earlier you limited it to race.\n\nThough, traditionally, what you argue for is exactly what happens. Liberal leaning media and liberal politicians are constantly talking about and fighting for better education in low income neighborhoods, better quality education for everyone, reduced or free college for local colleges or up to four year universities. I'm not sure what hole you have to hide in to think that the typical liberal is against better and equal education. The same goes for contraception and fighting to keep programs like Planned Parenthood alive.\n\nThe fact that liberals won't touch the IQ issue with a 10-foot pole unless prompted by our activism shows what they really think, even if they won't consciously admit it even to themselves.\n\nWhats the \"IQ issue?\" Bettering education is already a large part of the liberal platform, and IQs are again to be extremely poor indicators of anything other than how full of oneself a person is by raving about their own meaningless number.\n\nOnce again, the correlation between IQ and race is no better than the correlation between quality of education and family income.\n\nI don't think that IQ is completely unrelated to genetics or absolutely no indicator of education, it[.] just virtually worthless in that it says nothing about the education of the person. It doesn't tell you if they're trained in literature or engineering, if they can fix an engine or design a website. It[.] hardly more than a feel-good number that makes people feel special.\n\nBut, while it can be influenced by genetics, it[.] is not influence directly by skin color. That[.] my only point. I didn't disagree with your last comment or your sources, I only made it clear that even your own source publisher has an article showing that IQ is practically useless, and that race can be correlated to conditions which affect IQ, but does not itself influence IQ.\n\n[...] 50-90% of cranial capacity (itself correlated with IQ, albeit imperfectly) is estimated to be genetic.\n\nI just really enjoyed this particular line after you tried to discredit my argument over correlation = causation, with an extra giggle for \"estimated.\"\n\nI think this is a pointless argument. I think you're a white student union troll, based on your username and removed comment. You've done nothing but harass this subreddit, and you've done so with little affect.\n\nBelieve whatever you want, cite all the studies and correlations you can find, but none of them reasonably argue that skin color affects IQ. Yes, it can be a statistical indicator on large scales, but it is a correlation largely based on inequality, and that is well understood. "}