{"doc_id": "1127", "name": "2017_04_humanities_student_major_1927_marquette", "namespace": "we1sv2.0", "metapath": "", "pub": "Marquette", "title": "2017-04-humanities-student-major_1927_Marquette.txt", "pub_date": "2017-04-17T00:00:00Z", "Sentiment": "0.081", "Subjectivity": "0.349", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "936", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65n3kq", "Reddit_id": "dgdpxre", "Subreddit_id": "t5_2s1ga", "Commenter": "WhiteSavior", "length": "5175", "content_scrubbed": "I'm a Freshman at MU right now and I have a similar experience as the other user who posted here, so I'll try to answer each of your questions in a similar way.\n\n1. Business school is pretty well regarded, and you'll take a variety of courses regarding different aspects of the business world such as finance, accounting, econ etc. and there is quite a bit of flexibility in regards to deciding specific majors. There are also hands on business simulation courses you take as early as freshman year and networking is solid enough.\n\n2. Not in honors, but I would recommend participating in it. You get to connect with more smart and academically serious people, and the courses tend to be more interesting. For example you can take a Greek Mythology course instead of standard English IIRC. The courses aren't harder (and are sometimes end up being less work), they just tend to force you to think more critically. Straz hall is one of the nicest and more desirable halls to live in on campus - the location can be either very desirable or a pain in the ass depending on what you like to do. It[.] much closer to the downtown but you will have to walk further and in a busier area to get to class or to the other side of campus compared to if you lived in Mccormick or Abbotsford. There[.] a gym and a dining hall and several honors floors in Straz and if you're cool with being around more nerds you'll like it a lot.\n\n3. Yeah, basketball is huge, and it[.] a ton of fun - even though I initially was disappointed there was no football people get pretty hyped about it, especially since  we're trending up right now. The women[.] basketball, volleyball, and soccer games that I have been to are usually half full but the school puts on events that boost attendance fairly significantly, so it won't even be totally dead. Men[.] lacrosse is also doing well and is somewhat popular on campus.\n\n 4. In my experience, Marquette is less of a party school and more of a drinking school, and it[.] presence is definitely smaller on campus than what I've heard it was like before. You won't find huge parties like at larger schools, but if you're at least somewhat social or are involved with greek life/athletics/organizaitons, you can easily go to house parties on the weekends. There are a couple bars on campus (Caffreys and Murphys are some of the big ones) and people will go downtown but the school has been cracking down on underage drinking and parties lately - both shutting them down and punishing people/groups that have parties and/or are irresponsible. There are several suspended frats/sororities that have been suspended due to alcohol/bars for example. So yeah it[.] definitely not the same experience as Madison and there[.] a stronger academic culture but you can totally make it work. \n\n5. Gen eds in my experience can range from 30 kids to 200 kids, depending on your major. General bio/chem are usually the biggest, but your liberal_arts and sometimes calc classes will be smaller. I think my intro accounting class had 80 kids or so but it dropped to 60 or so a couple weeks in. When you move up the ladder classes become much smaller and if you're doing something like upper level math or finance or history they'll be much smaller. I never had much of a problem talking to people in general classes and people usually want to get to know you/study together but you have to be social about it, so assuming that you're somewhat competent socially you can be who you want to be in those classes - keep in mind you will have to participate in most small classes and some larger classes, which can be intimidating if you're in the back of a hundred person lecture.\n\n6. Sports and music are pretty big and we have club and intramural levels for most major sports - stuff like basketball, frisbee and football can get competitive though even at intramural level so be ready to form your own team - some of the organizations that I participate in also have various intramural teams. It[.] also super easy to play pickup in the gyms/at the court outside O'Donnell hall even if you're trash, so I'm happy with the sports here. There[.] a lot of clubs that you can join, and most of them are pretty accepting. The a cappella group for men at least is legit so you have to work on your singing game if you want to do that but if you can get involved there you'll be a mini celebrity on campus. \n\n7. Greek life is meh. Other dude got it right, Greeks kind of have to their own thing and the school admins can be overbearing. It is fairly popular and there[.] a variety of types of frats/sororities on campus depending on your vibe, but nowhere near as big as the state schools. I'd say it[.] worth getting into and you'll meet a lot of people if you go Greek.\n\nSo yeah, IMO Marquette[.] a pretty academically serious school with a decent enough networking and social scene. The community is pretty involved and you can do a lot of stuff on campus and in Milwaukee. That said, my gripes with the school is that the administration can be somewhat harsh and out of touch, the student body is not particularly diverse, and you have to live in expensive mediocre dorms the first two years."}