{"doc_id": "1116", "name": "2017_04_humanities_student_major_1818_mbti", "namespace": "we1sv2.0", "metapath": "", "pub": "mbti", "title": "2017-04-humanities-student-major_1818_mbti.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.037", "Subjectivity": "0.349", "Score": "49", "Upvotes": "0", "Downvotes": "0", "Wordcount": "604", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65oux1", "Reddit_id": "dgc1cbl", "Subreddit_id": "t5_2s90r", "Commenter": "novangla", "length": "3464", "content_scrubbed": "Wow. So... I think there are two reasonable things to keep in mind and then the overarching truth that this person is a douchebag. \n\n1. I used to look down on Sensors (like back in high school when I was an epic dick), before I learned more about people and learning. As a teacher, I can assure you that Sensors aren't limited to discussing \"low IQ\" topics like this commenter tries to say. TBH, my top student this year and my top student last year are both xSxPs. And my class is NOT experiential learning. These are girls who are whip-smart, can write great analytical papers, see where I'm going with a line of thinking in seconds, have deep intellectual questions, etc. And I'll admit there[.] a temptation on my part as an N to be like, \"She[.] not an N?!\" But a smart S is going to outshine a ditzy N. And YES, there are dumb Intuitives out there. \n\nI think the misconception about intelligence arises because our education system is built for the maturation of sensors: basically, you start with concrete, hands-on tasks and memorization, and then move to concepts and theories in \"higher-level\" work. As an Ni, I actually was bewildered by all the \"experiential learning\" tasks we did in school because they didn't help me and I was kind of bad at them. Like, in 4th grade we had to design an ancient society and then create artifacts to bury and then we did a dig unveiling the other groups' things. The only part that stuck with me was inventing the society[.] political and religious structures. The dig itself? Nada. Anyway, I think that because of this, some N-types see S strengths as \"lower level\" and basic. Especially in middle-high school, where \"concrete\" is often used to mean \"less intellectually developed.\" But I think we do this because most people are Sensors, so we assume they develop abstract thinking later on, leading some N-types to think they are naturally smarter. Additionally, I can imagine that Se[.] skills with non-academic areas like the arts and athletics can make an immature person who lacks those skills and is good at, I don't know, theoretical science, think Se=less smart. But I think that[.] all borne out of insecurity and misunderstanding. \n\n2. The last point of benefit of the doubt I'll give the commenter is that people of different functions do sometimes have trouble valuing each other[.] conversation interests and habits. I know I can find Si/Fe too occupied with talking about other people (aka gossip) and r/ENTJ complained recently about Ne hypotheticals driving them crazy. And I'm sure people get annoyed with Ni/Te (even when we aren't being awful arrogant offensive assholes like this guy). Almost all of my friends have been and are other Intuitives. But it[.] not because they're better or smarter. It[.] because we gravitate toward the same fields and the same topics of conversation. Maybe this commenter doesn't have a job yet, because my work team would be a hot mess without our Sensors. I'll admit that I haven't hit it off terribly well with an ESFP, ever, and it easily could be that you guys are dominant in the functions I have but don't value as much. Probably especially true for an INTJ, for whom your glorious Se is an inferior function. \n\nBut this commenter is way off base and also unnecessarily shitty to boot. The value of MBTI is not to stereotype and dismiss. It is, in my view, to recognize *why* you may misunderstand other types and to help you connect better with them. \n\nEdit: typo"}