{"doc_id": "253", "name": "2017_10_humanities_student_major_232_israel", "namespace": "we1sv2.0", "metapath": "", "pub": "Israel", "title": "2017-10-humanities-student-major_232_Israel.txt", "pub_date": "2017-10-03T00:00:00Z", "Sentiment": "0.126", "Subjectivity": "0.32", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "711", "Permalink": "http://reddit.com/r/Israel/comments/73e9f3/free_chat/dnvio02/", "Threadlink": "http://reddit.com/r/Israel/comments/73e9f3/free_chat", "Parent_id": "t1_dnvhonn", "Reddit_id": "dnvio02", "Subreddit_id": "t5_2qhvo", "Commenter": "GiantDuarf", "length": "4755", "content_scrubbed": "Unfortunately, many people here in North_America don't think about Aboriginal people[.] at all most of the time. For many, they will never see one in their life and are largely just fantasy people from movies and books. [Most people in Canada and USA](http://cashmancuneo. net/pictures/nativeam/map%20population%202000. gif) don't live in places where Indigenous people are common. I guess it would be like Circassians and Armenians in Israel. In certain left-leaning and social justice circles though, there is more talk about their existence and rights. From what I have researched, they live the saddest existence of any social group in the country. Lost their lands and ways of lives, died en mass through a combination of disease and massacres, and today exist in isolated communities with the highest rates of alcoholism, drug abuse, & mortality with the lowest rates of education and wealth. They have basically no political power and aren't even a tertiary political issue in most regions. Much of their culture was forgotten and wiped out when our governments stole their children to be sent to government schools in the 20th century - our governments have are beginning to apologize though. Today, most of them don't speak their language and are culturally not that distinguishable from most Americans. Most First Nations are also very mixed with European - not always because of good reasons.\n\nOddly enough, separatism is almost nonexistent in most first nations communities (except maybe Lakota). Some of them are even very patriotic for the country they live in, but that patriotism is usually tied with belonging to the land rather than the dominant culture. It[.] impractical and impossible for basically any of them to secede, so they focus more instead on rights within this country. None of them control anywhere near the full extent of their traditional lands, sometimes they were moved far away from their traditional lands, and let[.] not forget that all indigenous nations are small, poor, have basically no resources, and are all landlocked. [USA](https://humanities7. files. wordpress. com/2013/05/indian-reservation-map. gif), [Canada](http://www. nrcan. gc. ca/sites/www. nrcan. gc. ca/files/images/earth-sciences/about_canada_lands. jpg). When you go to them, they do not even feel a foreign country, they look like normal rural town except they are extra poor and might have some cultural buildings and symbols. Some of the reservations are literally only a single town.\n\nIn Latin American countries it is different though. Most countries in Latin America have populations that are largely descendant from mixed marriages between Amerindians, European colonists, and West African slaves. Thus, for some countries (e. g. Mexico), certain aspects of indigenous cultures are *part* of the national identity (though certainly not the *entirety* its national identity). Using myself as an example (raised American/Canadian but in a Colombian family) I know that a lot of the foods I eat, some slang words, and some customs have Amerindian origin, but for the most part Hispanic culture dominates. However, this is just surface culture and I assume a lot of the [deep culture](http://4. bp. blogspot. com/-gvuXdBglUgk/VNjuKUUIxNI/AAAAAAAAAac/mYe4EV1iUC0/s1600/iceberg. jpg) might have more Amerindian or even West African influence. Latin America is a big place though, not all countries or even regions are the same. Some are almost all European descent (e. g. Uruguay), others are very thoroughly mixed (e. g. Dominican republic), and others have large or even majority Amerindian populations (e. g. Bolivia). It goes further, some countries are largely Mestizo but do not care much about indigenous ancestry while others are basically built upon mestizo identity (Paraguay comes to mind).\n\nAlso, that is not to say that it is all culturally Hispanic mestizos. There are still indigenous people who still live in indigenous communities with significant indigenous culture (including language). The languages of the former Mayan, Incan, and Aztec societies are still spoken by millions. Being indigenous is thus different in Anglo North_America than Latino America: in the former there is more focus on genetics and descent, in the latter the focus is on language and community.\n\nAll countries in the Americas are based on civic nationalism though rather than ethnic nationalism, and basically all of them embrace multiculturalism too (though to different extents). I think it is because of this reason that virtually no aboriginal nation seeks independence, only more rights within the countries they live.\n\nEdit: There are some interesting discussions that happen over at r/IndianCountry, perhaps r/Israel can do a culture exchange with them one day?"}