{"doc_id": "1213", "name": "2017_04_humanities_student_major_2704_dae", "namespace": "we1sv2.0", "metapath": "", "pub": "DAE", "title": "2017-04-humanities-student-major_2704_DAE.txt", "pub_date": "2017-04-23T00:00:00Z", "Sentiment": "0.015", "Subjectivity": "0.45", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1060", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_6771r8", "Reddit_id": "dgoadcm", "Subreddit_id": "t5_2r6cf", "Commenter": "PaterTemporalis", "length": "6016", "content_scrubbed": "I would encourage you very strongly to think about what the words \"smart\" and \"dumb\" mean, and how **long they have retained that meaning.**\n\nI won't burden you with a shitload of etymology, but etymonline. com is easy to use. Suffice to say that since the origin of public schooling, the formation of modern nations, and the Industrial Revolution, information theoretically became available to the population of an entire nation.\n\nBefore that, and especially before the Reformation, information was encoded in Latin, or perhaps Greek, and accessible only to a privileged elite. Even when public schoolrooms began to open, the majority of \"book learning\" was done by rote recitation, since there was only a single copy of the text for the teacher.\n\nTherefore, the idea of a \"smart person\" being a walking repository of facts, ideas, definitions, and sesquipedalian vocabulary arose from necessity, and from information scarcity. That definition is **still at the foundation of modern educational institutions**, and therefore written into our culture as a test of a person[.] \"smartness\".\n\nThat[.] at least two centuries of tradition and certainty that the best measure of a person[.] \"smartness\" is their ability to rapidly retrieve information from their memory and express it eloquently. To be dumb literally means to be slow of speech, deaf, inattentive, slow.\n\nYour smartphone revolution started TEN FUCKING YEARS AGO. The first iPhone was released in 2007. It[.] only SIXTEEN years since Google, since the Wikipedia. For much of your life, you have been swimming, perhaps drowning in a sea of information, and cannot imagine the lone and level sands of the pre-Internet information wasteland. Before then, a smart person was a powerful and useful ally; this was the person you asked questions of before you could ask Google.\n\nYou might imagine me as one of these people. I did not need to look up the text of Ozymandias to quote it, and I chose it because I know of its pop culture presence. An allusion loses all power if it is too abstruse for your reader to catch. I make all these points to show you how useless a person such as I is in this day and age.\n\nWhen I read your text, I refuse to judge you, but since you brought up this topic, I cannot help but notice not only the quality of your prose, but its content. You do not say a single thing that digs deeper than the question of social interactions, of rudeness, of being creepy, of social connectivity, of this story of someone who \"called you dumb\".\n\nFar be it from me, a grandiloquent relic of an earlier time, to judge you or your intellect from within the context of your time. *I understand the context of your time, and your place within it, and could hardly disallow you from being a creature comfortable in your time, your day and age.*\n\nBut by the standards of the past three centuries or so of \"smartness\", your writing would paint you as plebeian, concerned only with adolescent socialization. A harsh judge from just one-hundred years ago, might test you, and you would fail that test, if your prosthetic, your lighted rectangle was taken away.\n\nWe'd begin by speaking in Latin, of course, and I would make allusions to the Greeks, and take careful note of your accent in both languages, especially the meter of any prose you quoted. By the turn of the 20th century, I would expect you to be quite familiar with continental philosophy, and of course of the rising tide of the new physics. I'd expect that you could not only perform the calculus, but recognize my quotations from Newton in the Latin, and respond in kind. Your poor sentence fluency and feeble vocabulary would not have earned you any points.\n\nPut down your phone and match me, subject for subject, and for the past, say... 300 years, both I and some hypothetical panel of \"smart people\" from olden days would gladly welcome you into our ranks.\n\nBut when I say I am useless, when I say I am deprecated, I mean it clearly. Not only does has this style of speech I'm employing been turned into a total mockery of the \"I AM VARY SMRAT\" pretension, the fact that I can magic up facts and figures and calculations instantly gets me no credit whatsoever in The Year of Google 16.\n\nHell, there[.] not even an interface barrier anymore; if you can speak your question to Google, it will yield the same quality of information that it took whole lifetimes for \"smart\" people to have available at the tip of their tongues. So, you're a spectator to an infinite world of knowledge, and I'm just a cheap, biological knockoff of Google, for all you know.\n\nPut down the phone and try to remember even your best friend[.] phone number, and then come back to me with revised, modern definitions of the words \"smart\" and \"dumb\". And when you do, you won't find me criticizing you. I know that this world of information abundance is the new world, and that I am just a shitty relic of a time when fluency in ancient languages, a true liberal_arts education, and a lifetime of study and retention actually had value.\n\nThe people calling you dumb are either fucking stupider than you are, or are likely trying to set themselves above you by poking you in a place that[.] such an easy mark that you had to post about it on reddit. Are they leftover classics scholars from the turn of the 20th century? Most likely not.\n\nI don't think it is common at all for anyone to have sufficient perspective to make a valid judgment in this case. It was only an uncommon academic elite, for most of history, that had the capacity to step back far enough from the enclosure of their time and customs and habits, and then direct that baleful eye on the question of their own intelligence in the broad context of culture and history. You have the information at hand, but do you have the structure, the foundation, and the intent to rethink this question?\n\nThat[.] the question of the age of cellphones. What have you lost that you now lack the facility to tell that you have lost? It[.] not a question for dumb people."}