{"doc_id": "1112", "name": "2017_04_humanities_student_major_1809_intp", "namespace": "we1sv2.0", "metapath": "", "pub": "INTP", "title": "2017-04-humanities-student-major_1809_INTP.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.089", "Subjectivity": "0.374", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "365", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65nvdu", "Reddit_id": "dgbvk9d", "Subreddit_id": "t5_2qhvl", "Commenter": "[deleted]", "length": "1924", "content_scrubbed": "Hello. I'm a college student too in my sophomore year and I am and have been confused and frankly scared about my future for a long time. I can empathize with your wanting to kill your self if you work a 9-5 every day. I have even told my parents a similiar thing because I believed they were not really happy and never were, and that the issues our family was having was due to them being unhappy and never getting a chance to do what they want. After that I told myself I wouldn't let myself end up like that. successful but unhappy. \n\nI have been generally subscribed to the idea that the only life worth living has to be spent doing what you love, your passion. Approximately 80000 hours of your life will be spent on the job. I have never thought of a job as more than selling your lifespan for money, just to do it all again. \n\nA song called handshakes by metric says this:\n\"Drive this car to go to work go to work to pay for this car\"\n\nThat[.] pretty much how I felt about it all being futile and pointless and the only logical way to get past that and live a happy life is to pursue your dreams. \n\nAs of late though, I'm learning that not everyone can live their dream. You can work really hard and even be really good but if the stars don't align in you can always stay an amateur. I'm thinking more and more that your passions should stay amateur until the stars align, as hobbies. I know it sucks to hear, but if you're anything like most people, myself included, your passions are for the arts, music, writing, maybe film. Very few can be successful in these fields and that[.] just the way it is. \n\nI could reiterate this whole video but it[.] better you watch it. I hope it helps you. It may not be exactly what you would want to hear, but I think it is as realistic and optimistic as this subject will get in a world that is constantly crushing dreams. \n\nGood luck on your journey. \n\nhttps://youtu. be/MKlx1DLa9EA"}