{"doc_id": "1242", "name": "2017_04_humanities_student_major_3030_berkeley", "namespace": "we1sv2.0", "metapath": "", "pub": "berkeley", "title": "2017-04-humanities-student-major_3030_berkeley.txt", "pub_date": "2017-04-26T00:00:00Z", "Sentiment": "0.148", "Subjectivity": "0.406", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "314", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67spgx", "Reddit_id": "dgt0ruw", "Subreddit_id": "t5_2qh9w", "Commenter": "K0ldWar", "length": "1763", "content_scrubbed": "I was deciding between Cal and Michigan, so what I have to say won't be particularly relevant to picking between Cal and a private school. My decision at the time mostly came down to ranking (lol), but I can honestly say that I've had a great time here. I'm not someone who gets homesick easily, but that might be different for you. A lot of my friends are also out-of-state, and none of them have ever said anything about missing home/feeling homesick. With how big this school is, it[.] not all that hard to find a community that you feel comfortable with.\n\nHere[.] how I see Cal stacking up with Duke. Cal[.] student body is huge (so it[.] hard to categorize people) and 40% Asian. I'm an Asian-American who grew up in an area without a lot of Asians, but it was actually kind of cool to come here and be with other Asians. Of course, on this front, *your mileage may vary*. It[.] not like this campus is anti-(insert other racial group here), but I can only imagine that it might be hard to adjust socially if you're a member of an under-represented group. With that being said, there are tons of community groups here that do a great job of making everyone feel welcome, and they seem to have a lot of fun.\n\nOur sports teams are pretty decent compared to most other top schools, but Duke has us handily beat, at least on the basketball front. \n\nI haven't found big class sizes to be a problem, personally. Because most college classes use lectures and aren't discussion-oriented, having more people really doesn't make a difference. If you really, really enjoyed interacting with your teachers in high school, then I think class sizes at most colleges (excluding liberal_arts colleges) would be a little bothersome, at least if you're studying something in STEM. "}