{"doc_id": "537", "name": "2017_10_humanities_student_major_3031_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-10-humanities-student-major_3031_politics.txt", "pub_date": "2017-10-31T00:00:00Z", "Sentiment": "-0.035", "Subjectivity": "0.395", "Score": "48", "Upvotes": "0", "Downvotes": "0", "Wordcount": "275", "Permalink": "http://reddit.com/r/politics/comments/79v4eu/facebook_and_twitter_reveal_russian_meddling_was/dp58a6v/", "Threadlink": "http://reddit.com/r/politics/comments/79v4eu/facebook_and_twitter_reveal_russian_meddling_was", "Parent_id": "t1_dp57dw8", "Reddit_id": "dp58a6v", "Subreddit_id": "t5_2cneq", "Commenter": "the_reifier", "length": "2220", "content_scrubbed": "Unfortunately, the GOP[.] original version is no longer reachable. Broken link: http://s3. amazonaws. com/texasgop_pre/assets/original/2012-Platform-Final. pdf\n\n(Edit: See sibling comment for working link.)\n\nThe 2012 wording was as follows:\n We oppose the teaching of Higher Order Thinking Skills (HOTS) (values clarification), critical thinking skills and similar programs that are simply a relabeling of Outcome-Based Education (OBE) (mastery learning) which focus on behavior modification and have the purpose of challenging the student[.] fixed beliefs and undermining parental authority.\n\nHere[.] a [Politifact discussion](http://www. politifact. com/texas/statements/2012/aug/11/gail-collins/gail-collins-says-texas-gop-platform-calls-schools/) on the 2012 wording, which notes that there[.] some history to the odd reference to OBE. The Politifact writer doesn't address a number of issues that came up at the time (I grew up in TX), nor does the writer properly emphasize that the platform[.] objection is teaching kids to question their beliefs and authorities... but that[.] Politifact for you.\n\n[2014 wording](https://www. texasgop. org/wp-content/uploads/2014/06/2014-Platform-Final. pdf):\n Knowledge Based Education- We oppose the teaching of values clarification and similar\nprograms that focus on behavior modification and have the purpose of challenging the student[.]\nfixed beliefs and undermining parental authority. Rather, we encourage the teaching of critical\nthinking skills, including logic, rhetoric and analytical sciences\n\n[2016 wording](https://www. texasgop. org/wp-content/uploads/2016/01/PERM-PLATFORM. pdf):\n Basic Standards-The educational system should focus on basic standards which include, but is not limited to: a\ncurriculum of reading (with an emphasis on phonics), spelling, writing, the arts, music, literature, mathematics,\ngeography, economics, civics, and U_S and World History. We encourage teaching critical thinking skills,\nincluding logic, rhetoric and analytical sciences within these subjects.\n\nKeep in mind that during 2012, the tea party wave was still in effect, and conservatives felt emboldened. They have since had to moderate their expressed views... at least until Trump."}