{"doc_id": "1028", "name": "2017_04_humanities_student_major_988_applyingtocollege", "namespace": "we1sv2.0", "metapath": "", "pub": "ApplyingToCollege", "title": "2017-04-humanities-student-major_988_ApplyingToCollege.txt", "pub_date": "2017-04-09T00:00:00Z", "Sentiment": "0.062", "Subjectivity": "0.282", "Score": "32", "Upvotes": "0", "Downvotes": "0", "Wordcount": "390", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64exry", "Reddit_id": "dg1mhrt", "Subreddit_id": "t5_2y2r8", "Commenter": "admissionsmom", "length": "2199", "content_scrubbed": "Here[.] the schedule I recommend for my private juniors. \n\nSpring/early summer junior year: \nStandardized testing - if you haven't taken the SAT or ACT or any subject tests yet, start preparation and register to take both tests unless you know which one will work for you by taking practice tests.  Sign up for 2 sat subject tests also. One in a humanities subject that you are taking now and one in a stem subject you are taking now. Study. \nCollege choice - being thinking about the five fits: financial (talk to your parents openly and honestly), academic, intellectual/creative, geographic, and social. \nMake a list of what you want to find in a college. What do you care about most? \nVisit as many different types of schools you can.  Find some near you if possible and consider a family trip if your finances allow. \n\n\nSummer: make a resume. List all your ECs and awards from high school. \nOpen a common app account and look at common app personal statement topics. \n\nBegin to examine yourself and reflect on who you are and what you really believe in. Remember that admissions officers want to get to know the inner you. So dig in. Find yourself. This is an amazing opportunity for self awareness and understanding. Don't blow it. I actually don't recommend that you try to write your essays yet because you've got a lot of growing and developing to do still, but I do encourage you to think about them and practice even. Just know that whatever you write in the summer should and will most likely change. \n\nEarly fall. - \nnarrow down your list of possible fits for you. I  like for my students to have one or two true safeties and then a pretty good number of comfort schools, schools they really like and where they fit in the upper range of students stats wide. Then if they need to and want to, they can add some matches and a reach or two. Remember financial fit is just as important as every other fit. \n\nStart filling out applications. \n\nBegin essays \n\nKeep working on list \n\nBy the end of september:\n\nyou should have a list of early action schools and maybe even an early decision.  \n\nComplete those applications and essays in order of due dates.  \n\nKeep going until you are finished. "}