{"doc_id": "1120", "name": "2017_04_humanities_student_major_1837_techtheatre", "namespace": "we1sv2.0", "metapath": "", "pub": "techtheatre", "title": "2017-04-humanities-student-major_1837_techtheatre.txt", "pub_date": "2017-04-16T00:00:00Z", "Sentiment": "0.107", "Subjectivity": "0.381", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "298", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_65p3t3", "Reddit_id": "dgca4mx", "Subreddit_id": "t5_2r2ne", "Commenter": "Zeuswashere13", "length": "1544", "content_scrubbed": "Here[.] some advice I wish I had known when I was 18. You can make it in this industry. There are jobs. There are jobs that make money. There are jobs that make good money. The arts in industry makes up 25% of the U_S GDP. \n\nI don't know about your situation, but I grew up going to a high school that did not value arts education. I was told for years and years the theater was just a hobby, and no matter how much I loved it or tried, there was no money in it. So I went off to school believing what everybody had told me. I started as a physics major, hated it, switch to an entertainment major, but I hated that also because my college didn't have any real technical theater classes. It was more of a business minded program. Which is great for a certain type of person, but not for me. I failed myself out of school without a plan, lucked in to a touring job, and have been happy ever since. Currently I'm working as the pyrotechnic lead on a very large scale touring arena stunt show. \n\nBasically I'd recommend really taking a look at how seriously you want to pursue a career in the arts. Because the jobs are out there. Don't be afraid to pursue your passion just because people are telling you it[.] not a viable option. It[.] good to have a back up plan, but don't try and leave behind something you love. \n\nIf you have any specific questions about this, feel free to PM me. I remember what it was like the summer before college (that was only 7 years ago) and wish I had someone with some experience in the matter to talk to. "}