{"doc_id": "510", "name": "2017_10_humanities_student_major_2806_uoft", "namespace": "we1sv2.0", "metapath": "", "pub": "UofT", "title": "2017-10-humanities-student-major_2806_UofT.txt", "pub_date": "2017-10-29T00:00:00Z", "Sentiment": "0.124", "Subjectivity": "0.33", "Score": "15", "Upvotes": "0", "Downvotes": "0", "Wordcount": "321", "Permalink": "http://reddit.com/r/UofT/comments/79fbeq/im_a_first_year_and_i_kinda_wanna_drop_chm135_and/dp1m3sc/", "Threadlink": "http://reddit.com/r/UofT/comments/79fbeq/im_a_first_year_and_i_kinda_wanna_drop_chm135_and", "Parent_id": "t3_79fbeq", "Reddit_id": "dp1m3sc", "Subreddit_id": "t5_2rbaq", "Commenter": "AmandaLemons", "length": "1821", "content_scrubbed": "I was in exactly your position about 2 weeks ago. I had my midterms on oct 16th, and walked out of my CHM151 midterm hating my life. I just knew that I needed to drop chemistry (I had already dropped biology) and transfer out of the life sciences. So I called my parents and spend 2 hours on the phone looking at the UofT calendar with them. \nWe ultimately settled on dropping CHM151, and taking a half credit geography course in second semester. That leaves me with 4. 5 credits this year. \nI'm probably going to major in political science and minor in international relations. Most humanities will require you to go to grad school if you want to earn a decent salary. \n\nThere is no need to formally transfer, just drop chemistry on acorn and enroll in a social science course listed on the calendar. \n\nThen declare your major at the end of second semester. \n\ndon't be too hard on yourself for leaving life sci. Many people do it, and it has improved my quality of life tenfold. \n\nMy parents are sociology professors at another ontario univeristy, so they were pretty supportive of my move. Their tips were to start reading widely and to find something that you love so passionately that you could do a PhD. in it. \n\nThe academic route is a difficult one, aspecially in the humanities, (I've witnessed firsthand my parents efforts to secure grant funding for projects, and to write articles to raise their standing and get jobs).\nHowever, there is no better place than UofT to graduate from in the humanities. School ranking and brand name is a large part of hiring professors, along with research status and article publications. UofT grads have a major advantage over grads from other schools. \nAcademia can be a very rewarding life if you want it. \n\nBest of luck in whatever path you choose. \n-An ex life sci student. "}