{"doc_id": "348", "name": "2017_10_humanities_student_major_1104_changemyview", "namespace": "we1sv2.0", "metapath": "", "pub": "changemyview", "title": "2017-10-humanities-student-major_1104_changemyview.txt", "pub_date": "2017-10-11T00:00:00Z", "Sentiment": "-0.01", "Subjectivity": "0.429", "Score": "6", "Upvotes": "0", "Downvotes": "0", "Wordcount": "253", "Permalink": "http://reddit.com/r/changemyview/comments/75qyex/cmv_colleges_should_not_require_students_to_take/do90kds/", "Threadlink": "http://reddit.com/r/changemyview/comments/75qyex/cmv_colleges_should_not_require_students_to_take", "Parent_id": "t3_75qyex", "Reddit_id": "do90kds", "Subreddit_id": "t5_2w2s8", "Commenter": "scienceistoohard", "length": "1505", "content_scrubbed": "I think this issue gets at the difference between being an educated person, and being a tool that other people pay to use. \n\nIf you only train for a single, narrowly-defined skill set, then you are essentially surrending control over your life to economic and social forces that don't care about you. If your skill set ever goes out of fashion, or if it is replaced by new technology, then you could end up in a bad place with few options for recovery.\n\nUnderstanding yourself and the world you live in is your only reliable way to have options in life, and your education is the only thing that other people can never take away from you. \n\nFrom a practical perspective there[.] also a lot to be said about having broad based knowledge; people who disagree are usually just speaking from ignorance. For example, engineering students who complain about writing essays simply haven't realized yet that they will some day have to concisely explain their work to other people in writing, and that is a skill that takes practice. Accountants who complain about learning history haven't realized that understanding how people behave has important and obvious implications for business decisions, and that some day they'll work for a business. Humanities students who complain about learning computer programming have forgotten that computers run the world they live in, and that computer programming has the potential to make many career paths they might choose a lot easier, if they actually learn how to do it."}