{"doc_id": "276", "name": "2017_10_humanities_student_major_383_politics", "namespace": "we1sv2.0", "metapath": "", "pub": "politics", "title": "2017-10-humanities-student-major_383_politics.txt", "pub_date": "2017-10-05T00:00:00Z", "Sentiment": "0.143", "Subjectivity": "0.346", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "336", "Permalink": "http://reddit.com/r/politics/comments/74gb5l/americans_losing_faith_in_college_degrees_poll/dny7cs0/", "Threadlink": "http://reddit.com/r/politics/comments/74gb5l/americans_losing_faith_in_college_degrees_poll", "Parent_id": "t1_dny5v4z", "Reddit_id": "dny7cs0", "Subreddit_id": "t5_2cneq", "Commenter": "Herp_Derp_36", "length": "1934", "content_scrubbed": "Here[.] the reality. College costs tens of thousands of dollars, takes 4 years (or more) to finish, and it[.] no guarantee of a career afterwards. I can't even count the number of fellow classmates who went on to get their Masters simply because they had no idea what else to do, and couldn't find work after graduating with their bachelors. Students can easily rack up enough debt to pay off half a house before they've even landed their first real job. That[.] no joke. Never mind the shift in economic trends that could render their major less valuable than when they started. These are things that students should be aware of, but are never told by advisors because nobody wants to talk about it.\n\nCollege isn't the only way to \"better yourself\" either. There[.] nobody stopping anyone from walking into a library and reading till their eyeballs fall out, taking various courses through community college, or learning a trade.\n\nThe one tangible benefit to attending a university is networking and making valuable connections with important people. In the real world, it[.] often *who* you know rather than *what* you know that gets you ahead. The worth of your actual degree depends largely on what major it is (STEM vs something like liberal_arts), and what school you attended.\n\nI wish more had the opportunity to do so and think it would make us a better nation if we could figure out how to make it possible for more people.\n\nSame, and that can be done in a few ways. One, lower the overall cost for students. College used to be affordable (decades ago) for most people who wanted to attend. Now, unless you're already from a wealthy family, it[.] a huge financial burden/responsibility to take on a student loan. Two, reassess and eliminate the dozens of useless courses not needed for specific majors (that take both time and money from the student), allowing people to earn a degree in 2-3 years, and saving thousands in tuition."}