{"doc_id": "484", "name": "2017_10_humanities_student_major_2558_ukpolitics", "namespace": "we1sv2.0", "metapath": "", "pub": "ukpolitics", "title": "2017-10-humanities-student-major_2558_ukpolitics.txt", "pub_date": "2017-10-26T00:00:00Z", "Sentiment": "0.058", "Subjectivity": "0.348", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1035", "Permalink": "http://reddit.com/r/ukpolitics/comments/78vshe/the_nihilist_left_wants_to_abolish_free_speech/dox0d1i/", "Threadlink": "http://reddit.com/r/ukpolitics/comments/78vshe/the_nihilist_left_wants_to_abolish_free_speech", "Parent_id": "t3_78vshe", "Reddit_id": "dox0d1i", "Subreddit_id": "t5_2qhcv", "Commenter": "Inlogoraccountan", "length": "6243", "content_scrubbed": "It is one of the great scandals of our times: our universities are returning to their old, pre-modern, obscurantist ways. Instead of fighting to remain temples of free inquiry, debate and intellectual diversity, they risk reverting to their roots as peddlers of whatever the orthodoxy happens to be, more interested in brainwashing than in the pursuit of the truth. They can still pull back from the brink, but time is running out. \n\nIf you want to see how it[.] all gone wrong, compare and contrast how the higher education establishment is responding to two different threats, one from the \"Right\" and one from the \"Left\". The first comes from Tories concerned that universities are increasingly dominated by socialist and pro-Remain voices. In the UK, US and elsewhere, the share of academics who vote for center-Right parties is probably at its lowest ever level, while professors are much more Left-wing than they were even in the 1990s, as chronicled by the Heterodox Academy. \n\nNo more than 12 per cent of British academics vote Tory, according to Noah Carl for the Adam Smith Institute, down 25 percentage points since 1964. The social_sciences and humanities are stultifyingly homogenous; Tories tend to hide in science or business departments. Never before has the academy been so politically unrepresentative, and students are not being exposed to enough truly passionate advocates on every side of every argument.\n\nSeveral young Tory and libertarian academics have told me over the years that they feel they must keep their views a secret if they are to prosper, and it[.] got worse since Brexit. It[.] a shocking state of affairs: universities should do more to recruit from a broader range of views. \n\nYet it would be mad for MPs to try and force academics to change their views, or impose a national curriculum, or to hire a certain kind of person. Academic freedom is sacrosanct. While it was preposterous to accuse him of McCarthyism, a letter by Chris Heaton-Harris, a Tory MP, demanding to see Brexit course material was cack-handed. What if Momentum were to demand to see economics reading lists? \n\nBut whereas universities have been robust in rebuffing Heaton-Harris, they have rolled over when confronted by a genuine threat to academic freedom: that posed by a new generation of militant Left-wing students steeped in ever more extreme forms of cultural Marxism. Take the pernicious concept of the \"micro-aggression\": anything anybody says or writes can be deemed an act of violence by any recipient, who can then demand a \"safe space\" from where he or she can be \"protected\" from such views. \n\nSafe spaces can extend to the whole campus and, eventually, to the whole country, by which time the Snowflake Generation will have become the new oppressors. This totalitarian ideology rules out reason and elevates emotion. In that sense, it is perfect for the age of the virtue-signalling Twitter crowd. If they had any guts, any belief in freedom, academics would fight back, and refuse to be silenced.\n\nThe alternative is cataclysmic: the corollary to accepting that there can be such a thing as \"micro-aggressions\" is that \"trigger warnings\" should be issued if the content of any course, book, discussion or image might potentially upset anybody. This excuses students from reading anything that doesn't conform to the dominant ideology of the day. There can no longer really be any reading lists or curricula: trigger warnings imply academic chaos, and exams themselves become impossible. Even the 1968 generation didn't manage to smash the system so comprehensively.\n\nIf you buy into this warped logic, free speech is not merely dead but actually a nonsense. The crucial distinction between ideas and arguments on the one hand and physical threats on the other has been defined away. The First Amendment to the US Constitution was thus a tragic error committed by rich white men who wanted to continue to oppress everybody through different means.\n\nTo add to the Orwellian madness, words no longer have any objective, intrinsic meaning: what matters is how others feel subjectively about them, so anything can be proscribed. Down that road lies a Hobbesian war of all against all: our contracts and institutions cannot operate when there no longer is any right or wrong and when nothing means anything. \n\nWhile the return of the thought police is terrifying, the underlying ideology isn't new. Anybody who accuses anybody of a crime is now automatically described as a \"victim\" by the (real) police, even when the allegation is unproven or mistaken. You are a victim if you say you are. It[.] nihilism, pure and simple, as also demonstrated by other destructive concepts such as that of \"privilege\" and \"intersectionality\". \n\nIf you are white or male, you are deemed to have inherent advantages which means that you cannot pronounce on matters affecting other, less advantaged groups; free speech becomes impossible as some voices are disqualified. As to intersectionality, it[.] a catch-all to accuse dissidents of racism or sexism. The next step is to rewrite history and pretend that the past was the same as the present by purging the works of dead white men and replacing them.\n\nBut studying the ideas of a Western civilisation responsible for the wealth and freedom we take for granted must mean reading the books that defined it. It[.] great to study much more widely – Eastern thinkers, for example – but this should be in addition, not instead of, reading the Western classics. The idea that Plato or Aristotle or Kant are less worthy because they are white men, or because they emanate from a supposedly unusually imperialistic civilisation (another fatuous claim), is despicable and reprehensible. And what has race got to do with any of this? Ideas should be colour-blind.\n\nYoung people are often wrong: learning from one[.] mistakes is the whole point of being 20 years old. Academics don't have the same excuse. Are they so weak, so contaminated by anti-Western guilt, that they no longer have the guts to stand up to this assault on their own interests? Where are the lecturers in favour of free speech? It[.] easy to send tweets to a beleaguered Tory MP, but clearly much harder to stand up to the Leftist mob."}