{"doc_id": "334", "name": "2017_10_humanities_student_major_1002_news", "namespace": "we1sv2.0", "metapath": "", "pub": "news", "title": "2017-10-humanities-student-major_1002_news.txt", "pub_date": "2017-10-10T00:00:00Z", "Sentiment": "0.052", "Subjectivity": "0.344", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "968", "Permalink": "http://reddit.com/r/news/comments/75k317/terry_crews_shares_his_own_story_of_sexual/do76w7f/", "Threadlink": "http://reddit.com/r/news/comments/75k317/terry_crews_shares_his_own_story_of_sexual", "Parent_id": "t1_do70wxm", "Reddit_id": "do76w7f", "Subreddit_id": "t5_2qh3l", "Commenter": "Anarchistnation", "length": "6185", "content_scrubbed": "They could destroy his career\n\nYou'd love to destroy peoples careers simply for their beliefs, as well as limiting their Constitutional rights. You are, in fact, the same fascist you accuse others of being. \n\n\nSo one is science and the other is a bunch of bullshit spewed by nitwits who studied humanities in college with another bunch of nitwits, got it.\nYou're male or female, there[.] no in between. Either you got a dick or you got a vagina. You are a he or a she You cannot move from one to the other. If you got dick and balls you're a he. If you got a vagina and ovaries you're a she. If you got neither, you're handicapped.\nIt[.] not really difficult to understand, but I guess wanting to be a pretty little snowflake and calling oneself \"genderfluid\" seems more interesting and empowering than calling oneself being mentally retarded.\nThis social construct bullshit and gender is a spectrum non-sense was created by people sporting a gigantic erection for policing the speech of others and who couldn't do anything else to save their life. I guess it semi-worked to whine all through college and getting tenure as a genderfluid leprechaun in the failing humanities department of a once renowned university where you can push your mental illness on your students.\nBut anyway, people are slowly waking up to that bullshit.\n\nhttps://www. reddit. com/r/ImGoingToHellForThis/comments/6j5pkd/no_adam_no/djc6vqt/?context=3\n\nAnd it[.] all about that grant money you have to chase. So you become the most liberal flaccid pandering cunt imaginable to get that position in your university.\nAlso the more time you spend in universities (which are basically indoctrination centers for the_left anyways now) the more likely you'll become a leftist.\nIt[.] not about exposure to perspectives, it[.] about being hammered by a couple professor for 3 years and being dis-incentivized from disagreeing by grade manipulation by you teachers.\nbeing trained\nThis is really a great way to name it. It[.] not teaching, it[.] training. You are trained to think a certain way in universities when it used to be a place where you made your own arguments and explored subjects and disagreed with others.\nThe humanities have seen a huge decline since the 70s and no wonder, it[.] not a place of learning anymore and it[.] seeping into every other department slowly but surely. It[.] poisoning everything that made universities great.\n\nhttps://www. reddit. com/r/worldnews/comments/6pqtbv/canadian_forces_reply_to_trumps_transgender_ban/dks05fu/?context=3\n\nyeah continue calling everyone with a different opinion than yours a neo-nazi, that[.] exactly what I'm talking about. You just call people oppressor so you think you won't be called out when trying to oppress them. No mater if they're actual oppressors or not, it[.] all in your head and people see through it.\n\nhttps://www. reddit. com/r/AccidentalRenaissance/comments/65p8zm/berkeley/dgcx3qi/?context=3\n\nBut you fail to consider the socioeconomic of pushing an agenda against white men.\n\nhttps://www. reddit. com/r/politics/comments/73tjxt/white_men_have_committed_more_mass_shooting_than/dnt6kun/?context=3\n\nYou just don't want to call salon fake news because you happen to agree with it. The New_York times has a bunch of fake news in it, so does WaPo, CNN, MSNBC and Salon. Don't try to think your little world is perfect.\n\nhttps://www. reddit. com/r/politics/comments/5hjoxm/stop_calling_the_party_of_donald_trump/db0xk5g/?context=3\n\nYup, hur dur, police are bad. I never need no police officers!\nI bet you cry for police assistance when your wimpy ass drops a toast in the morning and it falls butter side facing down.\n\nhttps://www. reddit. com/r/AccidentalRenaissance/comments/6nml2h/apathy/dkar6aa/?context=3\n\nNo, but you cry for the local police and federal government to protect you because you're too cowardly to protect yourself and your own family with your beloved 2nd Amendement and imaginary arsenal of firearms that you dream of murdering Muslims and leftists with.  \n\n\nYes it can.\nWorking at McD[.] is enough to buy food, shelter, and clothes. Which is the basic standard minimum wage is supposed to afford you. Not internet, not trips to the bahamas, not cars, not cellphones and laptops, not xbox one x[.], not 42 inch+ T. Vs, not new furniture every year, not designer clothes, not pets, not restaurant every week, just the most basic things to keep you alive.\nMinimum wage is not middle-class wage because it[.] not supposed to be that.\n\nhttps://www. reddit. com/r/trashyboners/comments/72bhv0/talk_about_degrading_jobs/dnhrjn3/?context=3\n\nMontreal, Canada. Where minimum wage is roughly equivalent to the U_S Where owning a car is more expensive, gaz is A LOT MORE expensive, taxes are higher, internet and phone services are more expensive, food is A LOT MORE expensive, clothes are more expensive, rent is roughly 750-900 Canadian dollarydoos for a 4 1/2 no electricity and no heating covered in an old building with walls made of papier mache and where a public transportation pass to get across the bridge to work in the city costs upwards of 80-120 dollarydoos a month.\nSure you get to be able to wait 5-6 hours at the hospital for free and get the \"just go home and come back tomorrow\" treatment for free. But it really isn't much of a consolation prize.\nUtilities are provided by a public company that just milks its customer because it[.] a government monopoly, water is almost free tho, but that[.] because Canada and because we spawned at the_right place on the map when starting the civ. Heat is mostly electric heating, but they can't cut power during winter, which is nice, but you'll still be hounded for those payments until you die of old age or declare bankruptcy.\nAnd the weather is shit, 30 with 60-70% humidity in the summer and -30 during winter, but that[.] just me whining because living in this soggy swamp feels like shit. It[.] not a dry heat, that[.] for sure.\n\nAnd the shit icing on this shit cake found in the same thread 2 comments further. This shit stain isn't even American to begin with! What a hypocritical loser, I hope you get put in your place someday, but you'd need to live in a less civil country like America first. \n"}