{"doc_id": "377", "name": "2017_10_humanities_student_major_1412_writingprompts", "namespace": "we1sv2.0", "metapath": "", "pub": "WritingPrompts", "title": "2017-10-humanities-student-major_1412_WritingPrompts.txt", "pub_date": "2017-10-15T00:00:00Z", "Sentiment": "0.041", "Subjectivity": "0.328", "Score": "10", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1628", "Permalink": "http://reddit.com/r/WritingPrompts/comments/76jj54/eu_write_the_story_of_a_secondary_or_tertiary/doezovg/", "Threadlink": "http://reddit.com/r/WritingPrompts/comments/76jj54/eu_write_the_story_of_a_secondary_or_tertiary", "Parent_id": "t3_76jj54", "Reddit_id": "doezovg", "Subreddit_id": "t5_2s3nb", "Commenter": "LyriumEidolon", "length": "9553", "content_scrubbed": "The train to Hogwarts was... looking quite empty. As Gran waved me off, I couldn't help but feel... wrong. Not only was Snape now Headmaster, but these Blood Trials... it was a nightmare. I remember Gran and I queuing up at the Ministry[.] newly-formed Purity Registration Office to be given official Blood Status, and I remember how... ugh... Ra- Rabastan Lestrange... looked through the Wizard Birth Registers and repeatedly claimed that there were no such people as Frank and Alice Longbottom. Eventually, after much bickering, Healer Miriam Strout from St Mungo[.] was summoned to re-read the register and give testimony. As Healer Strout managed the ward that, that treated Mum and Dad, she was not only able to testify to their existence and their own status as Pure-blood, but she had the authority as a St Mungo[.] healer to override the decisions of Ministry personnel when it came to matters of Healing and Magical Birth, so Lestrange couldn't argue back when she indicated their presence on the registers. The last words I heard as I finally received my Blood Status of 'Pure-Blood' was \"Blood Traitors don't count as pure in my book!\"\n\nI wanted nothing more than to run at him and make him take his words back! Gran clasped my shoulder as I reached for my wand, and steered me away.\n\nNow, here I was, on the train, and it looked really empty. In my mind I knew that, with the witch hunt for Harry, and by extension Ron and Hermione, I was unlikely to see them in a compartment, but it still felt lonely without them. Luna and I managed to meet up,  and we were joined by Ginny afterwards.\n\n\"Any news of Harry?\" asked Luna.\n\n\"None,\" replied Ginny. \"The Prophet[.] still maintaining him as Wanted\".\n\n\"They are only proving Dad[.] exposes right. Hermione?\"\n\n\"I don't know. She mentioned a family holiday, but she[.] been strangely quiet.\"\n\n\"If luck favors her, she may even get to see a Crumple-Horned Snorkack. And Ron?\"\n\n\"He[.] not looking too good. He came down with a seriously bad case of spattergroit over the holiday, so he[.] in no fit state to return to school.\"\n\n\"Yeah, looks like Gryffindor[.] gonna be really suffering this year\" a voice sounded from the entrance to our compartment; Pansy Parkinson, and she had Crabbe and Goyle with her. \"No Prefects, no Quidditch Captain. And I'd say, no chance of beating us this year!\"\n\n\"Get out,\" I spat, my hand now grasping my wand in my robes.\n\n\"Haha, just try it, you fat little crybaby!\"\n\nI finally drew my wand, pointing it straight at Pansy, and I was not the only one to have done so; Ginny and Luna were also standing up with their wands drawn, as were Crabbe and Goyle.\n\n\"Sure, go ahead. Just remember, attacking a Prefect is a highly punishable offense, and it won't look well for Gryffindor or Ravenclaw for their students to score a detention right at the start of term!\"\n\n\"We're also Prefects, and we can see you're out of line,\" more voices echoed down the train corridor. \"You're outnumbered. Get back to your own compartment.\"\n\n\"Consider yourselves lucky,\" Pansy hissed, whereupon she, Crabbe and Goyle vanished. Four new people had entered the compartment; Seamus Finnigan, Parvarti Patil and her sister, Padma, and Anthony Goldstein, the latter two being Ravenclaw[.] prefects.\n\nThe train shortly stopped, and soon men in black robes burst into our compartment. I had a guess as to why they were here, and I told them \"Hey, losers, he isn't here!\"\n\n...\n\nLater that evening, when I sat down at the Gryffindor table, I noticed that ours, Hufflepuff and Ravenclaw had several empty spaces, even with the possible influx of new first-years. I saw Snape at the table, and I could feel something rise in me. Fear, but combined with a great loathing for the man. I will never forget what he did to me in Potions, or the fact that he murdered Professor Dumbledore. It doesn't matter what anyone else says: that man is NOT my headmaster!\n\nThe Hall[.] doors burst open, and Professor McGonagall came walking through with the new first-years, though the crowd looked considerably smaller. Once again, the Sorting Hat sorted people into their Houses, but once that was over, Snape began speaking.\n\n\"Welcome to Hogwarts, all of you who have been deemed worthy of the privilege of coming to this ancient vault of knowledge. There are several announcements and orders of business to address, but I am keenly aware that the amount of sugar from the train[.] foods has worn off and left the majority of you unable to pay close attention. Therefore, the feast shall begin, and I suggest you eat enough proper nutrition that you have the energy to take in this information as if you were studying for your end of year exams.\"\n\nThe plates filled with food, and although I ate, I still couldn't stand Snape. I could even hear murmurs from the other tables about his address, and it sounded like they weren't happy.\n\nOnce the feast ended and the food vanished, Snape resumed his speech. \"Now that you have hopefully consumed enough food to regain the energy required to listen, I will begin. Firstly, Defense Against the Dark Arts as a subject is no more; you will instead learn about the Dark Arts themselves, as the Ministry of Magic has decreed that the old Defense subject did not give enough attention as to comprehend the Arts that students were supposed to combat. The honor of teaching this class falls to one of our two new Professors, Amycus Carrow.\"\n\nThere was applause from the Hall, although when I looked closer, it was predominantly coming from the Slytherin table. Nobody else, to my relief, had welcomed this disgusting new development.\n\n\"Secondly, by decree of the Ministry, it is important for our students to know exactly how the Muggles are threatening the pure wizard population. To this end, Muggle Studies is now a compulsory subject for all years. Given the recent resignation of Professor Burbage, her place will now be taken by the second new staff appointment of Alecto Carrow.\"\n\nAgain, only the Slytherins applauded this.\n\n\"Thirdly, this year shall see the reinstatement of Educational Decree Number Twenty-Four. All student clubs and organizations must be approved by either me or Professors Alecto or Amycus Carrow before they can re-form. Anyone found to be part of an organisation that has not been approved by us will be subject to expulsion and questioning regarding their group activities and membership. Additionally, if an approved group conducts illegal activity, that group[.] approval will be revoked and the group dissolved with immediate effect.\n\n\"Fourthly, Professors Amycus and Alecto Carrow will henceforth be in charge of all disciplinary action regarding students. Anyone caught breaking school rules is to be immediately taken by a staff member to either of the Carrow Professors for disciplinary action.\n\n\"Finally, the Ministry of Magic has decreed that nobody, student or staff, is allowed to speak the name of the Dark Lord. Breaking this law is grounds for immediate arrest and interrogation over suspected illicit activity.\"\n\n\"Your lessons start as of tomorrow. Dismissed.\"\n\n...\n\nProfessor McGonagall had personally led the students back to Gryffindor Tower, as there were no prefects for the house at present, and once she had given the first-years the information they needed, I immediately went up to my dormitory. Yet, later, only Seamus Finnigan arrived, soon followed by McGonagall herself.\n\n\"Professor...\" I began.\n\n\"Longbottom, Finnigan,\" she interrupted. \"Are you two alright?\"\n\n\"That[.] an odd question, Professor,\" Seamus replied. \"We got here fine. I heard Ron came down with spattergroit, but...\"\n\n\"We have lost lots of students to the new Blood Status policy. And as you know if you read the Daily Prophet, Potter is wanted by the Ministry.\"\n\n\"Professor...\" I again mumbled. Something wasn't right, \"Where... where is Dean?\"\n\n\"I don't know, Longbottom. Thomas didn't register for Blood Status, and the one family member he has left isn't a witch, so... Anyway, losing so many students this way is unconscionable, so to honor those unfortunates unable to attend, I will not be filling affected dormitory rooms with new students.\"\n\n...\n\nAs the year went on, things got even worse. One Dark Arts lesson, I saw clearly that a first-year Gryffindor, couldn't have been taller than Dennis Creevy when he first arrived, was chained up by his wrists on the wall, and he was clearly scared, sweaty and close to tears. Pansy Parkinson was standing in front of him, her wand aiming directly at him, and she declared \"Crucio\". He was writhing and screaming in pain, tears spraying from his head, but what was most revolting of all was Pansy herself: she had a massive grin on her face, as if she enjoyed it. His screams became even louder, and I couldn't stand to see him suffer, so I stood up to stop her, only to be thrown back by Amycus Carrow. From what I could see, the other Gryffindors followed suit in trying to stop the torment, and the other Slytherins shielded Pansy as she continued her vile torture of the chained-up first year, seemingly for hours. The only thing that caused her to stop was the fact that the bell rang for the next lesson, and Pansy gained twenty points for Slytherin. I cannot stand this; I know first-hand the effects of that curse, and I wouldn't be surprised if this poor boy was terrified of women in future because of that bitch Parkinson. No, enough! I cannot let this go on! I know I'm not the only one; Ginny and Luna, Seamus and Parvarti, everyone was in agreement:\n\nIt[.] time to reconstitute Dumbledore[.] Army."}