{"doc_id": "374", "name": "2017_10_humanities_student_major_1341_gradschool", "namespace": "we1sv2.0", "metapath": "", "pub": "GradSchool", "title": "2017-10-humanities-student-major_1341_GradSchool.txt", "pub_date": "2017-10-14T00:00:00Z", "Sentiment": "0.062", "Subjectivity": "0.404", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "407", "Permalink": "http://reddit.com/r/GradSchool/comments/76etn2/humanities_phd_work_load_career_anyone_have_any/dodh1lh/", "Threadlink": "http://reddit.com/r/GradSchool/comments/76etn2/humanities_phd_work_load_career_anyone_have_any", "Parent_id": "t3_76etn2", "Reddit_id": "dodh1lh", "Subreddit_id": "t5_2r4r8", "Commenter": "Arkellian_Pilot", "length": "2268", "content_scrubbed": "Second-year MA in Classics, so while not a PhD and not in Syriac lit., in some respects I am not very far off.\n\nIn my undergrad I worked 18-25 hours a week outside of a full-time courseload that included Latin and Greek, which was hectic but doable. \n\nWhen I started my MA last year, I was doing three courses each semester (a Latin, a Greek, a seminar which included more language work as well as paper, presentation, and extra translation). I was absolutely crushed by the work load, and I see no way that anyone could both work part-time and succeed in the program.\n\nThis year I only have to do two courses a semester, but I'm chipping away at my thesis as well. Still, whether it[.] the reduced course load or greater experience and preparation on my part, I'm finding it a lot easier than last year. I went back to working eight-hours a week, and if I didn't value my socialising and rest time so much, I could probably add one more eight-hour shift to that rather easily.\n\nOne thing to note is that I did a ton of spare preparation in languages before starting the MA which really paid off, as I now spend maybe half the time on translation work that most of my peers do (which made last year even more gruesome for everyone else).\n\nI imagine that once you get past coursework and into comps and research that working at least part-time would be simple. \n\nFull-time seems like a different story. I am a bit skeptical that anyone could do the work and training necessary to do well in a rigorous Syriac-lit-based PhD program and also be spending 38 hours a week outside the program on something else. Even if I am humble and grant that it can be done, I certainly don't think it will bode well for your work-life balance. The final consideration is how demanding the program itself is: if other students are successfully completing the program while working full-time, then I begin to wonder whether or not the program is the real deal, so to speak. Perhaps the requirements are lighter than other programs elsewhere, and that is what allows for success. Just fine, perhaps, if only want the letters after your name, but it may not result in the best training.\n\nI don't see anyone reason you couldn't successfully complete a part-time PhD while working full-time. "}