{"doc_id": "1229", "name": "2017_04_humanities_student_major_2837_ryerson", "namespace": "we1sv2.0", "metapath": "", "pub": "ryerson", "title": "2017-04-humanities-student-major_2837_ryerson.txt", "pub_date": "2017-04-25T00:00:00Z", "Sentiment": "0.013", "Subjectivity": "0.446", "Score": "12", "Upvotes": "0", "Downvotes": "0", "Wordcount": "576", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67ckow", "Reddit_id": "dgq7sb7", "Subreddit_id": "t5_2qm3w", "Commenter": "TwoSwarmsOfBees", "length": "3339", "content_scrubbed": "I personally transfered away from UofT to attend Ryerson. \n\nThe main reason was that UofT did not have a program nearly as great as Ryerson[.] in my particular case. UofT had something similar but it was extremely thereotical whereas Ryerson was much more practical and career oriented. The difference being my course is a weird mixture of geography and computer science, and UofT wanted to teach that solely through textbooks. \n\nBeyond that, admittedly, I felt as if the UofT atmosphere was pretty toxic. A lot of people seemed to think workforces were made up entirely of UofT graduates and that if you didn't go there, you were bound for unemployment / low income and were therefore below them. An attitude I still see on this subreddit when people post asking of they should attend UofT or not.\n\nThe secret however is that you're not at a disadvantage if you don't attend UofT in the job hunt. For the most part, your future employer won't care. It[.] more how you initially present yourself to them and then how you perform afterwards. Knowing people helps of course, but if you cannot manage the initial two aspects, it[.] not going to help overly much. \n\nPeople seemed to base their entire identities around the fact they got accepted into UofT, when honestly, undergraduate is more-so what you make of it than the school since there isn't much difference where you go (with obvious exceptions: don't go to school that barely has a computer science program if that[.] what you want to do). \n\nHowever, a lot of the professors were pretty friendly. As they are at Ryerson. Although I have found that professors and TAs at Ryerson are a lot more accessible and willing to work with you one-on-one, but I wouldn't attribute that to the schools. Could have just been bad luck in my case. \n\nThe school itself though felt more like a business than a school, and it honestly seemed like they really didn't care about their undergraduate students. If they got paid, nothing else mattered. \n\nI had friends at the UTM campus tell me about the atrocious food they served (such as uncooked chicken) and after a colossal shitload of complaints UofT decided to extend the contract of the catering company, because it saved money. But that is secondhand information, so take it with a grain of salt.\n\nFrom my experience at UofT it did seem like most people felt as if they were fighting to just pass courses, or that the school was actively against them with exams that were tailored to knock down the average, so as to appear 'difficult' and therefore prestigious.\n\nOccasionally I overhear Ryerson students, who haven't been to other schools, complain about stuff they believe is inherently a Ryerson issue and does not exist elsewhere. Let me clear that up now: UofT also has some terrible professors that should have only ever been researchers and not professors, UofT also has some absolutely terrible lecture halls, UofT also has courses that make you question why they exist in the first place, and above all, not everyone at UofT is a serious student. \n\nI guess above all, what hurts UofT the most in comparison to Ryerson and other schools, is the school culture. But ultimately undergraduate is pretty much the same across the board (again, aside from obvious exceptions: don't go to a school known for its humanities if you want to do math). "}