{"doc_id": "1241", "name": "2017_04_humanities_student_major_3019_pussypass", "namespace": "we1sv2.0", "metapath": "", "pub": "PussyPass", "title": "2017-04-humanities-student-major_3019_PussyPass.txt", "pub_date": "2017-04-26T00:00:00Z", "Sentiment": "0.071", "Subjectivity": "0.373", "Score": "8", "Upvotes": "0", "Downvotes": "0", "Wordcount": "436", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_67sapu", "Reddit_id": "dgswc6i", "Subreddit_id": "t5_2whjo", "Commenter": "AIexiad", "length": "2530", "content_scrubbed": "They're radically overrepresented in virtually everything we see as bad or negative. Remember - Jews are only 2% of society. They're a high IQ group, so you would expect a degree of overrepresentation at the top but not *nearly* as much as is actually observed. They're ~50% of billionaires and ~25% of most Ivy League schools. If you look at \"bulge bracket\" investment banks they're CEO or CFO of virtually all of them. The same is true for partners at top law firms. Every time you read an anti-white article in a newspaper or see something culturally degenerate being pushed look at who is doing it. The pattern will quickly become obvious.\n\n\nThey have systematically torn down every single value and virtue that white Western society held dear through their influence in entertainment, media, and academia. Or, in the words of Joe Biden:\n\nThe Jewish people have contributed greatly to America. No group has had such an outsized influence per capita as all of you standing before you, and all of those who went before me and all of those who went before you ...You make up 11 percent of the seats in the U_S Congress. You make up one-third of all Nobel laureates ...I think you, as usual, underestimate the impact of Jewish heritage. I really mean that. I think you vastly underestimate the impact you've had on the development of this nation. \n\n\"The embrace of immigration\" is part of that, as is the involvement of Jews in social justice movements. \"You can't talk about the civil rights movement in this country without talking about Jewish freedom riders and Jack Greenberg,\" he said, telling a story about seeing a group of Jewish activists at a segregated movie theater in Delaware. \"You can't talk about the women[.] movement without talking about Betty Friedan\" ...\n\n\"I believe what affects the movements in America, what affects our attitudes in America are as much the culture and the arts as anything else,\" he said. That[.] why he spoke out on gay marriage \"apparently a little ahead of time.\" \"It wasn't anything we legislatively did. It was 'Will and Grace,' it was the social media. Literally. That[.] what changed peoples' attitudes. That[.] why I was so certain that the vast majority of people would embrace and rapidly embrace\" gay marriage, Biden said. \"Think behind of all that, I bet you 85 percent of those changes, whether it[.] in Hollywood or social media are a consequence of Jewish leaders in the industry. The influence is immense, the influence is immense. And, I might add, it is all to the good.\""}