{"doc_id": "1096", "name": "2017_04_humanities_student_major_1732_latestagecapitalism", "namespace": "we1sv2.0", "metapath": "", "pub": "LateStageCapitalism", "title": "2017-04-humanities-student-major_1732_LateStageCapitalism.txt", "pub_date": "2017-04-15T00:00:00Z", "Sentiment": "0.01", "Subjectivity": "0.404", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "438", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dgarzt9", "Reddit_id": "dgasllv", "Subreddit_id": "t5_39qgx", "Commenter": "Antabaka", "length": "2565", "content_scrubbed": "First off, keep in mind that communism, like capitalism, can only exist in a world with automation. You may have seen the falgsc meme (FULLY AUTOMATED LUXURY GAY SPACE COMMUNISM) - the FULLY AUTOMATED part alludes to this.\n\nIn our current world, we are fighting tooth-and-nail to keep jobs such as transportation and retail alive, despite the fact that we as a society easily have the means to eliminate these jobs, because under capitalism it is more important that people have jobs, even ones that are outdated and a waste of time, than it is to free up people[.] time.\n\nSecondly, the concept that people[.] primary incentive to work hard is the possibility of a wage-increase is, by and large, a fairy tail. The vast majority of workers are in no position to receive much of a wage-increase at all, regardless of the work they put in. Those that are, are almost always doing something highly skilled and are likely less alienated from their work in the first place, meaning they are more likely to put in effort than not.\n\nAnd as an important caveat to this, even highly skilled jobs are becoming more and more automated with time. Eventually, jobs will only be the arts, and eventually even that can be automated.\n\nAs for the idea that people would coast through life - this is another lie we tell our selves. The vast, vast majority of people aren't lazy. Our hardest workers are people working two or three jobs and raising their family, yet still needing public assistance. This idea that people on public assistance are lazy is completely unfounded.\n\nBut these people don't work hard because of some false notion that they can make themselves rich. They work hard because they have to to survive. Perhaps they would work less hard if they did not need to - which is a good thing. We need to put people before slightly improved productivity.\n\nHave you ever gone a few weeks without work? If you have, you would know that it[.] impossible to be unproductive. It[.] how humans are wired, a core, basic instinct that takes work to break. We work. It[.] who we are.\n\nLastly, communism and socialism does not mean people can get away without working. From each according to their means, to each according to their needs.\n\nIf you would like to learn a bit more, I recently wrote up a comment that goes into detail about what socialism and communism is, examples in history, and what we tend to believe will inevitably happen that will result in socialism. You can see that post [here](https://www. reddit. com/r/LateStageCapitalism/comments/650jk3/93/dg7gl6n/?context=1)."}