{"doc_id": "917", "name": "2017_04_humanities_student_major_31_todayilearned", "namespace": "we1sv2.0", "metapath": "", "pub": "todayilearned", "title": "2017-04-humanities-student-major_31_todayilearned.txt", "pub_date": "2017-04-01T00:00:00Z", "Sentiment": "0.126", "Subjectivity": "0.344", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "268", "Permalink": "None", "Threadlink": "None", "Parent_id": "t1_dfornvt", "Reddit_id": "dfost32", "Subreddit_id": "t5_2qqjc", "Commenter": "AraoftheSky", "length": "1492", "content_scrubbed": "I can't speak for everyone, but I have 3 siblings older than me. Of those 3, only 1 attended all 12 years of school. My brother attended school until 10th grade, my eldest sister attended all 12 grades, and my other sister also only stayed till 10th grade. I went to school until 4th grade and it was quickly evident that it didn't fit for me.\n\nFor my siblings my mother followed the regular homeschooling courses, but for me she did \"unschooling\" for the most part. She taught me basic history, and basic math, but my interests mostly lied in the arts, and in languages. As such we devoted most of my studies to those areas. \n\nShe bought me the Rosetta Stone programs for the main languages I was interested in, and since they were so expensive, she made it explicitly clear that I had to finish the programs. Thanks to that I can now confidently speak English, Japanese, Korean, and some Spannish/French(just the basics of what she personally knew).\n\nI know how to knit, crochet, paint, sculpt, wood carving, leather working. I'm pretty damn good with photoshop, and most video editing software, as well as sound engineering. I know a lot about filming, and photography.\n\nI may not know the exact dates that the Louisiana Purchase happened, or have trouble with trigonometry, but I feel like since many of the things my friends in school were forced to learn in school have never been of use to them, and all of what I learned has been of use to me it[.] a fairly even trade.\n\nEdit: spelling"}