{"doc_id": "412", "name": "2017_10_humanities_student_major_1709_teachers", "namespace": "we1sv2.0", "metapath": "", "pub": "Teachers", "title": "2017-10-humanities-student-major_1709_Teachers.txt", "pub_date": "2017-10-18T00:00:00Z", "Sentiment": "0.091", "Subjectivity": "0.288", "Score": "4", "Upvotes": "0", "Downvotes": "0", "Wordcount": "1314", "Permalink": "http://reddit.com/r/Teachers/comments/7797mp/principal_money_matters_race_matters_grit_talk/dokotid/", "Threadlink": "http://reddit.com/r/Teachers/comments/7797mp/principal_money_matters_race_matters_grit_talk", "Parent_id": "t1_dokjt7t", "Reddit_id": "dokotid", "Subreddit_id": "t5_2qqcs", "Commenter": "HereWee", "length": "7492", "content_scrubbed": "Here ya go:\n\nThe title of veteran educator Linda Nathan[.] new book is long — \"When Grit Isn't Enough: A High School Principal Examines How Poverty and Inequality Thwart the College-For-All Promise\" — but it goes a long way to explaining what she is writing about. Nathan challenges five key assumptions that have driven modern school reform and explains why they are ultimately empty promises.\n\nEach is tackled in a chapter: \"Money Doesn't Have to Be an Obstacle,\" \"Race Doesn't Matter,\" \"Just Work Harder,\" \"Everyone Can Go to College,\" and \"If You Believe, Your Dreams Will Come True.\" Drawing from interviews with many students, she explains why these notions have helped fueled inequity in the U_S public education system, and she uses her own experiences as an educator to show why she believes that the arts should be central to children[.] education.\n\nThe title refers to the \"grit\" movement in education, an emphasis on teaching and even measuring students' perseverance and passion, which became part of the movement in education toward social-emotional learning. In this edited Q&A I did with Nathan about her book, she explains why she first embraced the movement and then came to reject it.\n\n[Why teaching kids to have 'grit' isn't always a good thing]\n\nNathan, who worked in Boston[.] public schools for 38 years, is the first executive director of the nonprofit Center for Artistry and Scholarship, which fosters arts-immersed schools, and she oversees programs, including the Creative Learning Schools Project as well as the Perrone-Sizer Institute for Creative Leadership in partnership with the University of Massachusetts, Boston. She also works closely with the leadership of Conservatory Lab Charter School to support its development as a national model of project-based learning and arts immersed education.\n\nShe previously was the founding head of the Boston Arts Academy, the city[.] only public high school for the arts, as well as co-principal of Fenway High School for 14 years. She taught before in Boston and Puerto Rico.\n\n[The problem with teaching 'grit' to poor kids? They already have it. Here[.] what they really need.]\n\n \nQ. Why did you write this book?\n\nA. I'm angry. I'm angry at what[.] happened to so many of my kids. I've been in public education for 40 years and the lack of understanding in this country about what it really takes to break through the barriers astounds me. Call it systemic racism. Call it a disregard for first-generation kids, black and brown and poor kids. Call it a misguided belief that \"grit\" will get you through.\n\nI  started interviewing my amazing kids and learning from them about their journeys. And then the book started to evolve. I started to hear the beliefs/assumptions that frame the book and I wanted to understand their almost mythological power in our country. Of course I want policymakers, folks in higher ed and folks in preK-12, to read the book and get shaken and commit to change.\n\nI am still working with public schools, and I run a leadership institute now as well. We have to do better. Our very democracy depends on it.\n\nI believe deeply that we can actually teach anti-racism. And we must. Testing has gotten in the way of so much of what we need to do to make our schools better. Too many consider student voice/agency \"soft\" but actually that is the way our students will engage in school. That[.] the way their school muscles will get exercised. I am so dismayed at what many of our schools have become. (And of course I have a million examples of great schools and great leaders — but the norm is uninspiring.)\n\nI want us to stop putting the college flags on the doors (pet peeve I know) as if all our kids will go to college. What about putting the flags of the first company or store we worked for? Our kids need excellent career and technical education. I wrote this book to say that loudly and clearly. We can create excellent career and tech ed programs. I was doing so in the '80s. We can do it again.\n\nMoney matters. Race matters. Grit talk makes me angry. We have to stop making everything about the individual.\n\n Q. Tell me a little about your school and the challenges you face as an educator and administrator.\n\nA. The school that I drew the interviews from was Boston Arts Academy (BAA). I was the founding headmaster in 1998 (Boston[.] first and only visual and performing arts public high school) and served as HM until 2013. I was the co-principal of Fenway High School for 14 years before that (I also talk about that school in one of the chapters). And I was a teacher in Boston and San Juan, Puerto Rico, before that. All told, in Boston public schools for 38 years!\n\nOne of the promises of BAA was that it would serve as an antidote to the racist reputation of the city from its years of court-ordered busing. As an audition-based arts high school, we would draw from all neighborhoods and all socioeconomic classes and all racial, ethnic and linguistic groups. And we did and do. (I am currently a trustee of this public school and I am so proud of it!) So few urban schools are integrated across race and class, but BAA actually is! That in and of itself is wonderful! My first book, \"The Hardest Questions Aren't on the Test,\" is a description of the school and how we established shared values, an overarching framework that we called \"habits\" of the graduate and also many of the challenges I faced during my 14 years there.\n\nThe challenges I faced as an educator — during all my years — are many of the ones I write about now: a deep belief in the smartness, if you will, of my students, and the brilliance and hard_work of my teachers within a now-narrow accountability system that cares more about ranking and sorting kids and schools and not actually thinking about how one teaches young people who may come with limited English skills or from communities that have been besieged by drugs and violence and lack of economic opportunities.\n\nWe can't \"no excuse\" our way out of the way we have ravaged our education budgets or our cities, and the way education has become synonymous with test scores.\n\nSo the biggest challenges for me have always been how to create schools where what matters is that students are deeply engaged in what I call \"making and doing\" — something that the arts teach us how to do — the actual creation of knowledge and material. I am interested in schools that respond to the actual challenges that young people come in the door with and not just what some curriculum guide says kids must know. I actually trust most teachers. And I believe that the arts should be central to all kids' learning. That[.] been the biggest challenge; the arts are now an aside in almost all schools.\n\nI'm now associated with Conservatory Lab Charter School — an elementary school where kids do music EVERY day for an hour. It[.] wonderful, wonderful to see. But we will never be measured on the kids' musical abilities, only their math and English scores.\n\nSo I return to my biggest challenge: trying to get the world to see that we need a large vision for public education. Yes, we want all kids to read etc. . . . but we have allowed this testing craze to create some of the narrowest curriculum I've seen in decades.\n\nOther challenges I have faced: having kids that are undocumented and cannot go to college. That is the worst. Or even kids who do have \"paper\" but cannot go because the money just isn't there. Those stories just don't get told and I have tried to.\n"}