{"doc_id": "1187", "name": "2017_04_humanities_student_major_2497_askfeminists", "namespace": "we1sv2.0", "metapath": "", "pub": "AskFeminists", "title": "2017-04-humanities-student-major_2497_AskFeminists.txt", "pub_date": "2017-04-22T00:00:00Z", "Sentiment": "0.103", "Subjectivity": "0.378", "Score": "11", "Upvotes": "0", "Downvotes": "0", "Wordcount": "812", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_66vugb", "Reddit_id": "dgm00d4", "Subreddit_id": "t5_2sode", "Commenter": "queerbees", "length": "4985", "content_scrubbed": "On the most basic level, I value \"gender balance,\" becuase I think it is a good thing. That is, \"gender balance\" is the value I want to uphold. As to why this is my value, that is more complicated, and definitely delves into complicated sentiments and moral logic that I don't think I could quite articulate fully here. However, I can give some dimensions to those sentiments and morals here.\n\nIn my own work as a historian, it is remarkable the way gender has been wrapped around certain issues like labor, science, knowledge, etc. It is typically remarked upon by historians that a major characteristic of \"advancing\" civilization is the degrees of hierarchy, specialization, division of labor, etc etc etc that can be seen in society. And these \"degrees of difference\" seem to me to be somewhat connected to different degrees of interest in society. Craftspersons are interested in the arts of their trade, managers are interested in the efficiency of labor, state officials are interested in the resources of the state, etc etc etc. Levels of difference in turn regularly determine who[.] interests get served, represented, rewarded, valued, etc etc etc. Of course, this is all very abstract, and detailed examination of this things at any time and place will result in a richer more complicated picture than any generalized analysis of categories can furnish.\n\nBut however the complicated picture gets, there are gross features in the historial record that can deeply bother our sense of justice and shared humanity. Even though we know that women throughout human history have been participants in the creation and propagation of knowledge, the records of who \"discovered,\" \"invented,\" \"crafted,\" etc etc etc is extraordinarily one-sided. Just this week I have been investigating the history of the U_S Commission on Fish and Fisheries, and as I trawl through the nineteenth century records, the names of state officials, of scientists, and of namable figures is *nearly all* men (the one women I've found mentioned so far as the wife of a MA merchant who was involved in donating funds for equipment).\n\nNow, some might say that the reason for this gross imbalance is this is simply the result of sexism in history: that the record shows no women is because there are no women... *Except that isn't true.* You see, in flipping through the figures of the operation of a 1870s fish hatchery, [you find women hard at work](http://i. imgur. com/e8LbgjX. png). I came upon this image, as it was referenced in a letter to German fisheries operations about how to manage and work hatching boxes. From the official state literature available, the German fisheries did not quite understand how their American peers were working the apparatuses of their hatcheries. And the American Fish Commissioner Spencer F Baird could not answer their questions, so forwarded their requests to his assistant, who in turn had to make reference to this image and examine the local conditions of this work. Now, this all might seem trivial and long winded, but the point is that *how* the work of this technical and scientific practice was being done was not something that was readily explainable by the people charged with representing and managing the work. But more importantly, the backbone of the hole new enterprise of fisheries was in no small amount the physical and mental labor of women who worked the hatching-boxes^1. \n\nAll that being said, reflecting on the history of science (which to some is the history of modernity), it is quite clear that there are significant gendered elements in the organization of reputation, labor, incentive, and power. But these elements are not just about *exclusion*, they are also about organizing the hierarchies themselves. That, for example, sorting eggs or [classifying stars](https://en. wikipedia. org/wiki/Harvard_Computers) is the *work* that gets science done. But the structure of *charge* and *leadership*, the valuation of the \"head\" over the \"hands\" (and the binary therein), that is both impressed on gendered bodies, and is inferred from gendered work. Impressed in that it is part of our culture that attributes to men superior capacities than women, and that it is inferred in that those things that men choose to do are valued more than those things that women do.\n\nIn this context, \"gender balance\" is both a metrological problem and a sociological problem. Thus the problems if unequal appointment in jobs, education, rewards, etc are problems of skewed values and \"social conditioning\"---that is, they are problem with the social construction of gender.\n\n----\n\n1. These women[.] jobs, as described in the literature, was to examine the boxes of eggs and remove roe that were dead or unfertilized. This had to be done or the \"bad eggs\" would foul the whole box, and could kill thousands or millions of of potential fry. Considering it, these women need not only detailed attention, but an understanding of fish biology and hatchery technology."}