{"doc_id": "999", "name": "2017_04_humanities_student_major_716_sociology", "namespace": "we1sv2.0", "metapath": "", "pub": "sociology", "title": "2017-04-humanities-student-major_716_sociology.txt", "pub_date": "2017-04-07T00:00:00Z", "Sentiment": "0.068", "Subjectivity": "0.335", "Score": "5", "Upvotes": "0", "Downvotes": "0", "Wordcount": "449", "Permalink": "None", "Threadlink": "None", "Parent_id": "t3_64205r", "Reddit_id": "dfyu511", "Subreddit_id": "t5_2qhbo", "Commenter": "prettylittlearrow", "length": "2967", "content_scrubbed": "I'm not sure what kind of discussion you're trying to promote. Yes, there are often severe socioeconomic differences amongst students in elite schools. The New_York Times posted an interactive [article](https://www. nytimes. com/interactive/2017/01/18/upshot/some-colleges-have-more-students-from-the-top-1-percent-than-the-bottom-60. html?mc=aud_dev&mcid=fb-nytimes&mccr=EDUMarchDOMSale&mcdt=2017-03&subid=EDUMarchDOMSale&ad-keywords=EDUMarchDOM&_r=0) about this just a few months ago. I personally experience it myself, and I go to what the NYT considers a \"selective\" public university with a large number of students from the top 1%. My roommates are these people; they all have trust funds that fully covered 4 years of out of state 30k+ tuition, sorority dues, rent and utilities, grocery money, and allowances for \"fun\" money on top of that. They go on vacation every break, regularly go to Chicago (which is 4 hours away) for the weekend just for fun, and have cases of water delivered to our off campus apartment rather than just driving less than a mile to the grocery store. Does it bother me? Sometimes. I get annoyed when they waste perfectly good food, leave the kitchen a mess because they've always had housekeepers, and bemoan their lives because such and such was a bitch. They, and other students like them at my school, are generally unaware of the struggle average, middle-class students go through and probably don't care because it will never affect them. At the same time my roommates respect that sometimes my portion of the utilities might be a little late because I work to pay my bills, or that I need quiet at certain hours because I have to study in order to keep my GPA up for a scholarship. I won't deny I laugh with my (middle class) friends at the ridiculousness at their attitudes, but it ultimately has no effect on my life and I don't let it keep me up at night. \n\nPeople attend elite, highly ranked schools for similar reasons-- they generally have superior resources, networking opportunities, and instructors that students want to give themselves the best chance at grad school or a career path. Is it isolating that a majority of my peers are from upper-middle class to upper class backgrounds and will probably never struggle with money? Sometimes, yes. Do I think college is [no longer the \"great equalizer\"](https://www. insidehighered. com/news/2017/02/17/study-suggests-college-isnt-great-equalizer-many-believe) it might have been? Possibly. I wouldn't say the socioeconomic gap is a \"new\" thing; the gap is just larger now because many average middle-class families can't afford to send their children to elite liberal_arts or Ivy League schools. \n\nI'm not saying that this isn't an \"issue\", because it some respects it is. I'm just confused, along with the other responders in the two other subs you've posted this discussion in, on what you're hoping for from a discussion. \n\nEDIT: Grammar is hard."}