{"doc_id": "524", "name": "2017_10_humanities_student_major_2890_drunkenpeasants", "namespace": "we1sv2.0", "metapath": "", "pub": "drunkenpeasants", "title": "2017-10-humanities-student-major_2890_drunkenpeasants.txt", "pub_date": "2017-10-30T00:00:00Z", "Sentiment": "0.18", "Subjectivity": "0.314", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "518", "Permalink": "http://reddit.com/r/drunkenpeasants/comments/79c3vj/the_funny_thing_is_that_this_person_is_a_legit/dp32ymc/", "Threadlink": "http://reddit.com/r/drunkenpeasants/comments/79c3vj/the_funny_thing_is_that_this_person_is_a_legit", "Parent_id": "t1_dp31y5m", "Reddit_id": "dp32ymc", "Subreddit_id": "t5_33f45", "Commenter": "VoltairesBong", "length": "2893", "content_scrubbed": "Oh, so you're one of those kinds of people.\n\n\nDamn fucking straight, MAGA!\n\n\nHave you even been to these classes?\n\nI'm a 21 year old factory worker who has worked industrial labor his whole (short) adult life. No, I've never been to a social justice oriented class. I've barley done any college at all and don't plan to for quite a while. However, given my age group I have plenty of people in my social circle who are in college pursuing useless degrees like English and Writing as well as highly intelligent people I know doing things like biology, chemistry, and engineering. Yes, I know very well what kids in public colleges, even here in the heartland state of Nebraska, are being brainwashed with and I know it[.] pretty much only the humanities departments.\n\nDon't know about your country, but in mine many office jobs do require a uni degree. \n\n\nIt depends on the job, \"office job\" isn't exactly a very specific term. A call center worker is an \"office job\" and you only need a high school diploma or GED to get that sort of work. Hell, felons can get jobs at call centers. And there[.] plenty of good paying office jobs that only need a two year degree, like paralegals or IT professionals. Sure, an English major or other social_studies major *can* help you get some sort of office work in the states, especially in the government, but the supply of those majors has greatly reduced their value and most of the solid middle class jobs in America are best achieved through trade schools. A social_studies major *can* help you get an office job whereas a trade school or two year degree *will* get you a well paying job. Hence why so many of our grads are working in starbucks or as managers at walmart. Yes, this is the reality in America. Our kids are falsely told that there[.] an infinite supply of office jobs for english_major when the reality is that most high paying and middle class jobs in the US require a specialized education like Computer Science where you study to work in a very specific field.\n\n\nEdit: Honestly, what the US needs to do is adopt the German system of college where your education is paid for and provided for by the state but you're only put into programs where people with your GPA and intelligence level actually succeed and you have to take up education for fields that are actually in demand in the economy. I know so many people who are not too bright and could never pass or afford something like computer science but would make great welders or plumbers, both of which are in demand well paying fields in the US. And I know many more wonderfully intelligent people burning away their money and their precious time on degrees that'll never get them a decent job who would make great IT, medical, or engineering professionals. What America needs is a renewed sense of nationalism that strives for what[.] best for the whole nation and it[.] interests."}