{"doc_id": "330", "name": "2017_10_humanities_student_major_966_askaliberal", "namespace": "we1sv2.0", "metapath": "", "pub": "AskALiberal", "title": "2017-10-humanities-student-major_966_AskALiberal.txt", "pub_date": "2017-10-10T00:00:00Z", "Sentiment": "0.136", "Subjectivity": "0.334", "Score": "3", "Upvotes": "0", "Downvotes": "0", "Wordcount": "708", "Permalink": "http://reddit.com/r/AskALiberal/comments/75iqsx/why_do_you_call_nazis_unamerican/do6r98s/", "Threadlink": "http://reddit.com/r/AskALiberal/comments/75iqsx/why_do_you_call_nazis_unamerican", "Parent_id": "t1_do6mm77", "Reddit_id": "do6r98s", "Subreddit_id": "t5_2ukxe", "Commenter": "ButGravityAlwaysWins", "length": "4057", "content_scrubbed": "I'll take that as a no as to actually spending 10 minutes figuring it out.\n\nMy short take will have a Indian American virus since I know that community the best.\n\nFirst you need to look our immigration system and realize how incredibly difficult it is to immigrate legally to the U_S. In order to get to the US one needs to have a unique skill that the U_S is allowing specialty visas for or admission to a college. In either case you need a high degree of persistence and resilience to navigate the system. For the first large wave of Indians that means they had either already obtained a medical degree in India or had an advanced degree that allowed them to get into an engineering or finance program. So we've already selected for people who have a higher potential income As well as the skills needed to succeed in an increasingly knowledge based economy.\n\nNext you have to look at the cultural differences in how the profession of education is viewed. In the US, for all of the talk about how important our children are and how important education is, compensation for teachers shows the truth. We don't pay them well, we joke about how they don't deserve more money since they don't work past 3:30 and have summers off and parents treat them like employees at best and servants at worse.\n\nContrast that to India, where teachers are given the respect due to a grandparent, doctor or priest. I can still remember overhearing my parents from my bedroom where I was sitting grounded as my mother cried about being a failure of a mother because India came home saying I had talked back to her teacher. Education is simply more valued in Asian cultures than it is in the broader US culture.\n\nThen you need to look at what type of education is valued in Asian communities. Again using India as an example, after the British Raj ended, Neru and the Congress Party funded IIT. There was a massive focus on getting a high number of medical, engineering and computer students educated. Many of these students, along with the students from less prestigious but still highly regarded Indian educational institutions were the source of the immigrant wave to the US. It[.] hardly surprising that these parents after immigrating to the U_S would guide their children into similar fields, which are again where the wealth is being generated in our increasingly knowledge based economy.\n\nWhat is not valued are what we call soft skills or liberal_arts. Asian children are expected to play an instrument, participating arts, and play a sport. But they are not expected to excel in any of these with the exception of music. Asian parents do not focus on a child[.] athletic performance but rather enforce in their children that a sport is something you need for your college resume and nothing more. And the truth is that in our broader that is the correct if you are looking for economic gain. The number of people whose financial well-being is affected by how well they threw a football in high school is pretty limited.\n\nThen there is the cultural focus on the family. Asian parents instill in their children a culture of respect (too often bordering on obedience) for elders. These children learn early that the way you make mommy happy is by bringing home good grades.\n\nPerhaps most important is that Asians have a much greater belief that hard_work and determination are more important than innate gifts. American culture generally does a good job talking about how people should pull themselves up by their bootstraps and hard_work and determination will let you achieve the American dream, but they don't really believe it. We regularly see people giving credit to God for their success. White parents spend a lot of time telling their kids how smart they are and how gifted they are, Asian parents spend a lot of time telling their kids they should work harder.\n\nAnd none of this is determined solely by them being Asian. Any culture can replicate the same results. Jews do and so do wealthy whites. There[.] nothing genetic about it."}